PM covers a broad spectrum of issues relevant to all sections of Australia's geographically and culturally diverse community. MARK COLVIN: It's taken about two-and-a-half years, but it seems the Japanese government is finally losing patience with the operator of the Fukushima nuclear plant. The reason: its haphazard approach to stabilising the complex. Last week it was unexplained steam rising from the shattered remains of the building housing the melted reactor number three. This week it's TEPCO's admission that radioactive water from the plant has probably been leaking into the Pacific for the last three months. A senior government official has now denounced the company's handling of the situation as deplorable. Mark Willacy reports from Tokyo. MARK WILLACY: It follows a depressingly familiar pattern. At first TEPCO denies there's a problem at the crippled Fukushima plant. Then it becomes obvious to everyone that there is a problem, so the company then acknowledges the problem and makes it public. And finally one of its hapless officials is sent out to apologise to the cameras, like this: MASAYUKI ONO translated : We sincerely apologise for causing concern to so many people, particularly those who live in Fukushima. MARK WILLACY: That was TEPCO's Masayuki Ono after the company admitted for the first time that in line with the fears of Japan's nuclear regulator, contaminated water was indeed leaking from the nuclear plant into the Pacific. In fact, TEPCO now believes it's been pouring into the sea for three months or so. It follows an unexplained spike in the level of radioactive caesium in parts of the plant, by a worrying 100 times. Also worrying and unknown is just how much contaminated groundwater is leeching into the Pacific. Akira Kawano is one of the reactor chiefs at the plant. AKIRA KAWANO translated : We should have learned more from the mistakes that we've made. So far we're not seeing such a big impact on the ocean. We'll have to analyse more to understand the scale of the leakage. MARK WILLACY: And TEPCO also has some more analysing to do. This afternoon, steam has again been spied wafting out of the shattered remains of the reactor number three building at Fukushima. It did that last week as well, with the best explanation that TEPCO could offer up being a theory that it could've been caused by rainwater dripping onto the reactor containment vessel. The ABC has checked the weather up at Fukushima today. It's a sultry 30 degrees, and mostly sunny. It would appear that the Japanese government is finally starting to tire of TEPCO's excuses, with senior vice industry minister Kazuyoshi Akaba today describing the situation at the nuclear plant as deplorable. KAZUYOSHI AKABA translated : TEPCO's actions seem too slow and don't live up to our expectations. MARK WILLACY: And neither do TEPCO's actions live up to the expectations of the wider Japanese public, with an opinion poll last week finding that the vast majority think the disaster at Fukushima is far from over. This is Mark Willacy in Tokyo for PM. A liberated Iraq will be an inspiration to other Arab nations, and bring peace and security to the Middle East: George W. Bush, 2003