The royal baby name is here: George Alexander Louis. That makes the new baby's name, including his title, HRH Prince George of Cambridge. George was the expected choice, George was the obvious choice, Nameberry's Pamela Redmond Satran tells HuffPost Parents, explaining, There have been many more king Georges in recent centuries than any other name, so I think they went for tradition on that one -- but broke with tradition in terms of giving him three names instead of four. And I think Alexander and Louis in the middle place, versus honoring [George's] father, grandfather, or great-grandfather, is a departure. A Greek name meaning ?farmer,? George was the name used as king by Queen Elizabeth?s father, called King George VI but whose given name was Albert. George VII is expected to be the name used by Prince Charles should he ascend the throne. In addition, Saint George is the patron saint of England, known for his legendary defeat of a dragon. Alexander has Greek origins, too, and Louis -- which is among Prince William's middle names -- could be a nod to Louis Mountbatten, a mentor to Prince Charles, Nameberry adds. Speculation over the royal couple's choice of name has run wild in the time since the Duchess of Cambridge's pregnancy was announced, with Brits betting on front-runners with and without strong historical precedents. According to Nameberry, favorites earlier this summer included George, Philip and Arthur for boys, and Alexandra, Charlotte and Elizabeth for girls. There were some more outrageous options, too, like Chesterfield and Chardonnay. On Wednesday, George was in the lead at betting agency Ladbrokes, followed by James, Alexander, Arthur, Louis, Henry and Philip. Jokesters placing bets on Psy and North faced equal odds of 5,000 to 1. Irish betting agency Paddy Power had a similar lineup, with George, James, Alexander, Louis, Arthur, Philip and Henry in the lead. Unlikely choices including Rumpelstiltskin, Joffrey, Charming and Kong brought up the rear with odds of 500 to 1. A spokeswoman for Ladbrokes told Sky News before the baby was born that its birth marked the biggest and most exciting novelty betting event in history. According to the AP, tens of thousands of bets were placed with Ladbrokes following the news that the Duchess had gone into labor. For those too shy to gamble, The Washington Post offered a straightforward royal baby name generator. And betting wasn't the full extent of the craziness: one survey even said some U.K. moms were waiting to choose their baby names until after the royal baby arrived. The most popular boys' names in Britain in 2011, the most recent year for which statistics are available, were Harry, Oliver and Jack. See the top 20 names for both genders here. In the U.S., 2012's most popular boys' names were Jacob, Mason and Ethan. For more, click here.