Three distinguished, regal names, one tiny baby prince. His Royal Highness has a lot of history to live up to, as evidenced even in his just-released trio of given names! When naming a royal baby, a whole lineage of royal family ancestry comes into play. And when that little prince has a major chance of ending up on the throne one day, that name better reference a lot of powerful kings. Kate Middleton and Prince William came up with the perfect blend of traditional and modern ? and we?have a breakdown of the little Prince?s hefty name! Royals have several names in their official title, meaning that one day if they inherit the throne, they can choose one of their given names as their ruling title. His Royal Highness Prince George of Cambridge?s full name was revealed on July 24, and all of his names are equally powerful! George: The name George definitely gives off a flair of sophistication, but it didn?t start out that way! Historically meaning ?farmer? or ?earthworker,? this name has become a powerful part of the United Kingdom?s history.?George is the known name of the line of Kings of Great Britain and Ireland, started by King George I of Great Britain. St. George is also the patron saint of England. On a sentimental note, Queen Elizabeth II?s father was George VI? the baby?s name is a direct reference to his own great-great grandfather. The Queen was 26 years old when her father died, and since she was heartbroken about his early passing, it is a touching tribute to see the next generation George. When Prince George inherits the throne, he may choose to become King George VII ? or King George VIII if his grandfather Prince Charles full name Charles Philip Arthur George selects George as his name when he takes over. George is currently the 12th most popular boy?s name in Britain ? this spot is only expected to rise locally and internationally, considering the popularity of this royal baby. Alexander: This powerful and wildly popular name means ?man?s defender? and ?warrior.? Historically, Alexander was the name of the?King of Macedon who was famously known as Alexander the Great. Louis:?Louis is a middle name that Prince George shares with his father! Prince William?s full name is William Arthur?Philip Louis. This popular moniker was?the name of 18 kings of France and numerous saints. Like Alexander, Louis brings reference to valiant battle, meaning ?famous warrior.? What do YOU think of the royal baby?s name,?HollyMoms? Do you like the name George Alexander Louis?