Royal baby named George Alexander Louis, palace officials say - Washington Times Skip to content , ? / High: ? / Low: ? Dow: / NASDAQ: / S&P 500: Store Book Travel Subscribe Classifieds Weekly Ads SearchSearch Keyword: Connect with us: Toggle navigation Home News Politics National World Security Business & Economy D.C. Local Faith & Family Inside Politics Inside the Beltway Inside the Ring Technology Entertainment Inside China Accountability Special Reports Communities Delay's Getting it right Issues, Insights & Istook Phillip's Tea Time Christine O'Donnell Unplugged Rusty Humphries Rebellion Ortel's On the Money Deace's Midwestern Conservative Jeffrey Shapiro's Law & Disorder Obituaries JUST THE HEADLINES Opinion Opinion Main Commentary Editorials Letters David Keene Pruden on Politics Ben Carson Monica Crowley Tammy Bruce Cal Thomas Water Cooler Books Cartoons Communities Delay's Getting it right Issues, Insights & Istook Phillip's Tea Time Christine O'Donnell Unplugged Rusty Humphries Rebellion Ortel's On the Money Deace's Midwestern Conservative Jeffrey Shapiro's Law & Disorder Ernest Istook Tom DeLay Rusty Humphries Christine O'Donnell Sports Sports Main Football Baseball Basketball NCAA Olympics Tennis Golf Hockey Soccer Horse Racing NASCAR & Racing Redskins 2014 Media Media Main Radio Photo Galleries Video TellDC Ask Congress Play Sudoku Crossword Puzzle Market Book a Trip Buy a Home Weekly Ads Find a Doctor Store Classifieds TWT Rewards Advertise With Us Suriname Special Report U.S. & Russia Relations Social Media Connect with us: Widgets , ? / High: ? / Low: ? Dow: / NASDAQ: / S&P 500: Store Book Travel Subscribe Classifieds Weekly Ads SearchSearch Keyword: Preferences Happening Now Read Now ALL NEW Rusty Humphries Rebellion Radio Home News World The little prince has a name: George Alexander Louis By Jim Lawless - 	 		Associated Press - 										 											 											Wednesday, July 24, 2013 										 		 			 LONDON AP ? His Royal Highness has a name. Britain?s new prince has been named George Alexander Louis, royal officials said Wednesday, ending speculation over what moniker Prince William and his wife, Kate, would pick for their first child. Kensington Palace said the royals are ?delighted to announce? their son?s name, adding that the 2-day-old baby and third-in-line to the throne will be known as ?His Royal Highness Prince George of Cambridge.? PHOTOS: Royal baby revealed: Prince William and Kate introduce their prince Six previous British kings have been named George, and the name was a favorite of British bookmakers in the run-up to Wednesday?s announcement. For now, the baby is expected to stay out of the spotlight after making his first ?public appearance? in the arms of his parents outside of London?s St. Mary?s Hospital on Tuesday. After leaving the hospital, the couple introduced their son Wednesday to great-grandmother Queen Elizabeth II, who was keen to see the baby before she starts her annual summer vacation in Scotland later this week. Then the young family headed to see Kate?s parents in their village near London. Now that Kate and William have chosen a name, they are expected to soon choose a photographer for the baby?s first official portrait. Copyright ? 2015 The Washington Times, LLC. Click here for reprint permission. ??Comment s ????Print? You Might Also Like 10 Best Sniper Rifles Shares Quiz: US Citizenship Test Part II ? could you pass the hard part? Shares Quiz: US Citizenship Test - Could You Pass? Shares Separated at birth: Athlete-celebrity look-alikes Shares Christians in Hollywood Shares More from this Story Britain?s Prince William and Kate, Duchess of Cambridge hold the Prince of ... more > Related Photos Royal baby revealed: Prince William and Kate introduce their prince 10 Photos Photo Galleries Bang for your buck: Best handguns under $500 12 Photos Income for the 1% in the 10 wealthiest states 10 Photos 2015 World Press Photo winners 17 Photos Best handguns ever made 15 Photos Magazines can't agree on the sexiest woman alive; you be the judge 12 Photos Double Take: Celebrity look-alikes 20 Photos Best combat rifles of all time 16 Photos 10 greatest country music songs 10 Photos Secret's out: Victoria's angels on the runway 20 Photos Hollywood's hottest gunslingers 19 Photos Dogs of War: K-9s in combat 19 Photos LeBron James' 'I can't breathe' T-shirt the latest display of politics on the playing field 12 Photos Question of the Day Should Congress make English the official language of the U.S.? Question of the Day? Absolutely ? No need ? It's unfair ? No one speaks proper English anyway ? View results Ask Congress Comments blog comments powered by Disqus Sign Up For Breaking News Alerts Breaking News AlertsEnter your email address: TWT Video Picks Most Popular George W. Bush says he avoids criticizing Obama out of respect for presidency U.S. plans large-scale operation to take Mosul from Islamic State Parties, golfing, 'casino nights' part of Energy Dept.'s $21M conference budget: report FRANK GAFFNEY: Who's lying about Islamic supremacism? U.N. Security Council OKs resolution against Yemen rebels PAUL MILLER: Blaming Jews won't save Europe from Islamic terror ICE's risk assessment on illegal immigrants 'not effective,' IG report finds Inside the Ring: China tests nuclear missile for submarine launch ERNEST ISTOOK: Media scoffed, but FBI confirms ISIS has its soldiers in America Iran flexes muscle in Indian Ocean, sends flotilla of warships across equator Search Yellow Pages Popular Searches Our Voices Wesley Pruden Obama?s blind indifference to Islamic terror Monica Crowley Obama, Orwell and Alinsky take on the jihad Frank J. Gaffney Jr. Who?s lying about Islamic supremacism? Deborah Simmons Oscar, ?Selma? and ?Scandal? Ernest Istook Media scoffed, but FBI confirms ISIS has its soldiers in America Story TOpics Kate More News Accountability Sheriffs spent violent offender tracking funds on shirts, dinners with spouses Parties, golfing, ?casino nights? part of Energy Dept.?s $21M conference budget: report HUD gives free housing to 201,000 unqualified tenants, audit finds Security U.S. plans large-scale offensive to take Mosul, Iraq, from Islamic State militants Navy SEAL who killed Osama bin Laden foresees U.S. ground troops in Islamic State fight Edward Snowden leak: NSA helped British steal cell phone codes D.C. Local Maureen McDonnell, former Virginia first lady, faces sentencing for corruption Barry Freundel, D.C. rabbi, pleads guilty to taping nude women at ritual bath Oscar, ?Selma? and ?Scandal? World Edward Snowden leak: NSA helped British steal cell phone codes Ukraine says rebel attacks continue despite cease-fire Zhou Yongkang cronies executed for ?gangster crimes? Business & Economy Wary consumers not dumping fuel-efficient vehicles Germany rejects Greek olive branch on eve of bailout talks Emirates rejects Delta apology after CEO suggests 9/11 terror link Faith & Family Men not working PORN: Benefits of technology exacerbate a societal problem FOCUS ON THE FAMILY: If God is fair, just and loving, why is there so much suffering? Health Contaminated medical tool suspected in ?superbug? outbreak Vermont the 3rd state to offer relief for Obamacare penalty payers Gay rights video mocks FDA blood proposal Entertainment Bill Cosby ?appreciative? Eddie Murphy declined to play him in ?SNL 40? skit ?Two and a Half Men? wraps a dozen years of comedy Thursday Actress Allison Williams defends dad Brian Williams Travel Emirates rejects Delta apology after CEO suggests 9/11 terror link Get away to South Tahoe - with friends N.Y. tourism website urges visitors to go to Florida instead Technology Mark Cuban, billionaire investor, says net neutrality will ?f? everything up? Edward Snowden leak: NSA helped British steal cell phone codes Apple gives green light to marijuana app, Massroots Inside Policy Energy and Environment Tea party, Dems join forces to put Obama's Asia trade deal in jeopardy Banking & Finance Bernie Sanders: 'I would have been stronger than President Obama' on big banks Health Care Reform Obamacare pushers silent about court case that could make coverage too costly Second Amendment and Gun Control John Cornyn: My bill treats gun carry permits like driver's licenses ? nationwide OK Immigration Reform DHS creates path to citizenship for Dreamers: report Homeland & Cybersecurity Obama to sign executive order on cybersecurity Aerospace & Defense Bashar Assad claims Syria is in the loop on U.S.-led strikes on Islamic State Taxes & Budget U.S. sends China millions in foreign aid despite $1.3 trillion debt Law Enforcement & Intelligence Police are scapegoats when wider race problems exist, FBI director says Transportation & Infrastructure Millions in HUD money went to lobbying, not housing Newsletters ?Daily ?Weekly ?Ben Carson ?Pruden on Politics ?Guardian Terms of Use / Privacy Policy Find us on Facebook The Washington Times Sports Opinion Andy Parks Photos Find us on Twitter The Washington Times Politics Opinion Nation World D.C. Local Culture Sports Books Andy Parks Photos Home News Politics National World Security Business & Economy D.C. Local Faith & Family Inside Politics Inside the Beltway Inside the Ring Technology Entertainment Inside China Accountability Special Reports Communities Obituaries JUST THE HEADLINES Opinion Opinion Main Commentary Editorials Letters David Keene Pruden on Politics Ben Carson Monica Crowley Tammy Bruce Cal Thomas Water Cooler Books Cartoons Communities Ernest Istook Tom DeLay Rusty Humphries Christine O'Donnell Specials Sports Sports Main Football Baseball Basketball NCAA Olympics Tennis Golf Hockey Soccer Horse Racing NASCAR & Racing Redskins 2014 Media Media Main Radio Photo Galleries Video TellDC Ask Congress Play Sudoku Crossword Puzzle Market Book a Trip Buy a Home Weekly Ads Find a Doctor Store Classifieds TWT Rewards Advertise With Us Suriname Special Report U.S. & Russia Relations Subscribe Classifieds E-edition Customer Service Careers Terms Privacy Marketing RSS Advertise About Contact All site contents ? Copyright 2015?The Washington Times, LLC | 3600 New York Avenue NE | Washington, DC 20002 | 202-636-3000