The new royal baby, at last, has a name: George Alexander Louis. 	Kensington Palace revealed Wednesday that the third-in-line to the throne will be known as His Royal Highness Prince George of Cambridge. 	The last British royal named George was the child?s great-great-grandfather King George VI, who was Queen Elizabeth?s father. 	That George was born Prince Albert, but chose to rule under the name of King George VI when he ascended the throne following the abdication crisis of his brother Edward VIII, to signify the continuity of the monarchy. 	St. George, a Christian martyr from the 4th century, is also the patron saint of England. 	Alexandra is the Queen?s middle name, and may have inspired the name Alexander.? It?s also the name of three Scottish kings. 	Royal historian Carolyn Harris told CTV News Channel that at a time when Scotland is considering devolution, the name may have been chosen to reinforce the monarchy?s relationship to Scotland. 	Louis -- to be pronounced ?Lou-ee,? not ?Lewis? -- is one of Prince William?s middle names, as well as one of the middle names of the baby?s grandfather, Prince Charles. Both were named after Louis Mountbatten, Prince Charles? great uncle, the last British viceroy of India, who was assassinated by the IRA in 1979. 	The child?s name was just one of many bets gamblers could place related to the pending arrival of the latest royal. Online betting house William Hill had George as the 5/2 favourite on Monday, with James second, at 5/1 odds. 	 George was the second most popular name before we knew whether the baby would be a boy or girl, so now it moves into pole position and is the red hot favourite to be the name of the new Prince, William Hill spokesperson Joe Crilly said Monday, after the child was born. 	Prince William and his wife, Kate, welcomed their firstborn son to the world on Monday afternoon and presented him to the waiting public on Tuesday, on the steps of St. Mary?s Hospital in London. 	After leaving the hospital, the couple brought their newborn to Kensington Palace to introduce him to his uncle, Prince Harry, and to his great-grandmother, Queen Elizabeth II. 	Then they headed to see Kate's parents at their country estate in the village of Bucklebury, near London. Palace officials say the family is now spending private and quiet time for them to get to know their son. 	Next on the agenda for the new parents will be to select a photographer to take their son?s first official portrait. 	Some have wondered why it took the royal family two full days to release the child?s name, especially since the family had nine months to prepare for the birth. But in the context of the British royal family, the decision came relatively quickly. 	The Palace took one week to reveal Prince William?s name and close to a month to reveal that of Prince Charles.