On Monday, Prince William and Duchess Kate welcomed the latest royal heir into the world, and on Wednesday, they released the young prince's name ? George Alexander Louis. According to the palace statement, the baby will be known as His Royal Highness Prince George of Cambridge. George, long considered the most likely name for the new heir to the throne, was the name of Queen Elizabeth II?s father, King George VI, who died in 1952. ?She loved him very much,? British Historian Dr. Andrew Roberts told TODAY.com. ?This is a very moving and touching reference to him.? George VI, who was portrayed by Colin Firth in an Oscar-winning performance in the film The King's Speech, saw Britain through World War II. His father, King George V, was England's monarch during World War I. King George III was a wartime ruler as well, reigning during the Revolutionary War. But Roberts advised that the new prince's name ?is not a reference to the King George that lost the Americas.? What's old is new George is an old-fashioned name, but older names are making a comeback in the U.K. ?This name is a combination of old and new,? said NBC News royal expert Camilla Tominey. ?It?s really quite trendy.? Alexander, one of the new prince's middle names, is not a royal name, and Roberts suggests that the prince?s parents could use it as the family?s name for him, perhaps calling him Alex at home. Louis, the infant prince's other middle name, is also one of the middle names of his father, Prince William. It is a reference to Prince Charles? favorite great-uncle, Lord Louis Mountbatten, a British naval officer who was assassinated by the Irish Republican Army in 1979. Mountbatten was Prince Philip?s uncle, and the unofficial surname of the royal family is Mountbatten-Windsor. But will little George Alexander Louis have a last name, like we mere mortals? Interestingly, most of the royal family does not use a last name, though in 1917 King George V did adopt the surname Windsor for his family. In the Royal Air Force, Prince William?s title is Flight Lt. Wales, as he is the son of the Prince of Wales. He was enrolled at St. Andrews University in Scotland as William Wales. Per tradition, the royals typically have three to four first names, sometimes as many as seven or eight, to honor previous monarchs or other relatives. The reigning Queen Elizabeth II?s full name is Elizabeth Alexandra Mary. She was named for her mother, Her Majesty Queen Elizabeth the Queen Mother, her great-grandmother, and her grandmother. So Prince William and Kate have bucked tradition by choosing just three names for their son. ?This is a very modernistic thing they?ve done, not to use more middle names,? said Roberts. ?This is the shortest potential future king?s name since the invention of multiple middle names.? ?Kate and William are once again proving they want to do things their way,? said Tominey. But, she added, though the Duke and Duchess of Cambridge were likely given more discretion than their predecessors in choosing a name, it was likely run past the queen before it was official. ?She?ll be delighted with that choice,? said Tominey. Playing politics Choosing all those names can be a political minefield, according to Roberts. ?This is not something William and Kate decided by themselves,? said Roberts. ?This is a deeply political decision.? In 1930, the Duke and Duchess of York wanted to name their second daughter Princess Ann Margaret, but changed their plan after learning that King George V disliked the name Ann. They opted for Princess Margaret Rose instead. Queen Victoria reportedly insisted that one of her grandchildren be named Albert, as a first or middle name, after her husband, Prince Albert. Naming the royal heir after previous monarchs gives a nod to history and reminds the populace of the age and tradition of the monarchy. But as Roberts points out, not all names have positive connotations. ?There has yet to be another King John because he was one of the worst Kings of England,? Roberts noted. King John, who ruled from 1199 to 1215, was a controversial monarch, best known for signing the Magna Carta, which was seen at the time as an act of acquiescence to the nobility. He is also remembered for raising taxes to fight an expensive and unsuccessful war with France. Also worth noting is that the heir to the throne can rule by a different name should they choose. Edward VIII, for example, was known to his friends and family as David, one of his many middle names. Guessing game Newborn George Alexander Louis was born Monday at 4:24 local London time and weighed in at a healthy 8 pounds 6 ounces. Following the official announcement of the birth, the next phase of waiting began as royal watchers and commentators began speculating on a name for the prince. When the royal couple left the hospital on Tuesday evening, Prince William promised the wait wouldn?t last much longer. ?We?re still working on a name,? he said while cradling his new son in his arms and talking to the throng of anxious reporters. ?So we?ll have that as soon as we can.? The royal family has a precedent of keeping the public guessing. Following Prince William?s birth on June 21, 1982, Prince Charles and Princess Diana kept the world in anticipation for another week before announcing the name of their son ? William Arthur Philip Louis. Prince Harry?s name, Henry Charles Albert David, however, was announced right away. It took an entire month after Prince Charles? birth before his name was announced. The name-guessing game reached a feverish pitch on Monday with the online British betting site Ladbrokes offering 2 to 1 odds for their most likely pick for a boy, George. James was next at 4 to 1 odds. At William Hill?s online betting site, George was odds on favorite again with 9 to 4 payday, with James again at 4 to 1. Spencer, Princess Diana?s maiden name, was a long shot with a 25 to 1 payout. ?No one expected that to happen,? said Roberts. Bets on the baby?s name, sex and birth date reportedly set a record for the non-sports market, with over $1.9 million riding on the royal baby's arrival. Now that the date, gender and name have been revealed, there is still time to wager on who will be the prince?s godparents. Pippa Middleton and Prince Harry are the clear favorites, but long-shot guesses include Prime Minister David Cameron and Victoria Beckham.