24 JULY 2013 Prince William and Kate Middleton have named their son George Alexander Louis. The Duke and Duchess of Cambridge are delighted to announce that they have named their son George Alexander Louis, read a statement from Kensington Palace. When the Duke and Duchess presented their newborn?royal baby to the world on Tuesday evening, the baby's proud father said they were still working on a name. The couple announced their decision just hours after the newborn's great-grandmother the Queen had visited the new family at Kensington Palace. Historically, the monarch would have had to approve the name of any royal baby and although that is no longer the case, William and Kate were expected to reveal the baby's name to her before announcing it publicly. It was widely expected that the couple would not stray from tradition in their choice of name for their newborn baby boy. The little Prince's first name is intrinsically linked to the British royal family and has countless echoes throughout their history. King George V founded the House of Windsor, of which the baby is the newest member, in 1917. When the Duke and Duchess's son eventually ascends the throne, he will be King George VII. The last George to wear the crown was the Queen's much-loved father, George VI. His first name was officially Albert and he was known as Bertie. He chose to use his fourth name ? George ? as monarch in honour of his father George V and to give an impression of stability after the scandalous abdication of his brother Edward VIII. Alexander is likely to be a tribute to one of the Queen whose full name is Elizabeth Alexandra Mary. Royal commentators have also noted that it was one of Kate's favourite names. The infant Prince shares the name Louis with his father, whose full name is William Arthur Philip Louis. It is also likely that the name was given in honour of the Duke of Edinburgh's uncle, Lord Louis Mountbatten. Lord Mountbatten and William's father the Prince of Wales were close friends. The last British Viceroy of India before independence in 1947, he was assassinated by the IRA in August 1979. The announcement of the baby's name came relatively quickly compared to previous royal babies. Prince Charles and Diana, Princess of Wales waited until seven days after William's birth to reveal his name in 1982. It was a month before the name of newborn Prince Charles was announced by the Queen and Prince Philip in 1948.