MOSCOW ? The fugitive document-leaker Edward Snowden surfaced, even if behind closed doors, at Sheremetyevo International Airport on Friday afternoon, and in announcing to a group of visitors that he plans to seek asylum in Russia, he ensured that a problem neither Moscow nor Washington wants is not about to go away. Snowden had hoped to go to Latin America, but as that prospect has come to appear more difficult, he is facing the more immediate challenge of getting out of the airport after nearly three weeks there. He told his guests that he sees Russian asylum as a short-term solution, in hopes that he can later make his way to Venezuela, Nicaragua or Bolivia, which have offered him asylum. Russia has been ambivalent at best about his presence here, as an unwelcome complication in already strained relations with the United States. But by late evening, Russian authorities seemed to be making the best of a difficult situation, as a line of officials sought out the media and voiced their support for asylum. If asylum is granted, the Obama administration would be forced to decide how to react without ruining relations with Moscow entirely. Snowden told his guests, they reported afterward, that he likes Sheremetyevo Airport well enough but that he can?t stay cooped up forever. Russian officials said it may take them two or three more weeks to decide. The Interfax news agency quoted Russian migration service head Konstantin Romodanovsky as saying no asylum request had been received as of Saturday. Snowden has been out of public sight since he arrived here from Hong Kong on June 23, a step ahead of American efforts to have him sent back to the United States for revealing classified information about data collection programs run by the National Security Agency. But Thursday night he sent e-mail invitations to a group of defense lawyers, pro-Kremlin politicians and human rights advocates to meet him the next day at the airport. There he read a statement critical of the United States and told them of his hopes for Russian asylum. And in a comment that seemed to raise more questions than answers, he repeated claims that as an NSA contractor, he ?had the capability without any warrant to search for, seize and read your communications. Anyone?s communications at any time.? The White House said in a statement Friday that President Obama and Russian President Vladimir Putin spoke by phone about Snowden?s status and ?a range of security and bilateral issues.? Until now, Russia has been eager not to prolong Snowden?s stay, though it has been unwilling to return him to the United States. Moscow?s relations with Washington are complicated enough, politicians here have said, without a professed whistleblower and fugitive from prosecution standing between them. ?I do not want a human fate to hinge on the relations between two countries,? said Vladimir Lukin, Russia?s human rights commissioner and a participant in the meeting, ?but at the same time it would be undesirable if relations between two countries hinged on one man?s will.? The Kremlin insisted again that if he is to stay, Snowden must agree ?to fully stop activities causing damage to our American partners and Russian-American relations,? in the words of Dmitri Peskov, Putin?s spokesman. Snowden told his visitors that he has no problem meeting that condition, said Tatyana Lokshina of Human Rights Watch, because he believes he has not caused any harm to the United States with his revelations. It?s not clear the Kremlin would be in line with those semantics. ?As far as we know, he has considered and continues to consider himself a human rights champion and a defender of the rule of law and democracy and that he did not plan to abandon these activities,? Peskov said at a briefing. ?He is a patriot of his country,? said Vyacheslav Nikonov, a member of parliament from the ruling United Russia party and the grandson of Vyacheslav Molotov, who was the Soviet foreign minister under Joseph Stalin. Nikonov said he thinks Snowden will have to remain at the airport while his request ? which has yet to be filed ? is considered. The meeting Friday was repeatedly interrupted by flight announcements, he said, and Snowden joked, ?I?m used to that by now.? ?Not a whistleblower? Lokshina reported that Snowden feels safe at the airport, but it has become clear he ?couldn?t stay indefinitely.? On her way to the meeting, she got a phone call from a U.S. diplomat who, she said, asked her to relay to Snowden that the United States does not consider him a whistleblower ? a category that has a fairly precise legal definition. State Department spokeswoman Jen Psaki denied that human rights representatives had been asked to convey a message to Snowden. ?At no point did .?.?. any official from the U.S. government ask anyone to convey a message to Mr. Snowden,? she said. The State Department expressed ?disappointment? that Russia allowed human rights activists into the airport transit zone ?despite the government?s declaration of Russia?s neutrality.? ?Our concern here is that he?s been provided with this opportunity to speak in a propaganda platform .?.?. that Russia has played a role in facilitating this, that others have helped elevate it,? Psaki said. Snowden, she said, is ?not a whistleblower. He?s not a human rights activist. He?s wanted on a series of serious criminal charges brought in the Eastern District of Virginia in the United States.? In the statement he read from at the meeting, Snowden attacked the ?historically disproportionate aggression? of the United States in trying to prevent his access to asylum in Venezuela, Bolivia or Nicaragua, according to a transcript provided by WikiLeaks, the anti-secrecy organization that is helping him. ?I believe,? he said, after talking about his revelations, ?in the principle declared at Nuremberg in 1945: ?Individuals have international duties which transcend the national obligations of obedience. Therefore individual citizens have the duty to violate domestic laws to prevent crimes against peace and humanity from occurring.??? Snowden said he was formally accepting ?all offers of support or asylum I have been extended and all others that may be offered in the future.? He cited, for example, Venezuela?s offer of asylum, but he said that ?some governments? in Western Europe and North America were interfering with his ?right to enjoy that asylum,? making it impossible for him to travel. Several Latin American leaders have accused the United States of pressuring European countries to keep Snowden from reaching the region, including an incident in which Bolivian President Evo Morales?s plane was apparently prevented from crossing the airspace of some European nations on suspicion that Snowden was hiding aboard. The scene at the airport Snowden?s visitors gathered at 4:30 p.m. in the arrivals hall of the airport?s Terminal F, a dingy, aging relic of the Soviet era. They were mobbed by television camera crews, starved of a glimpse of Snowden for the past 19 days. Then airport officials led them on a long march past tourists just in from Thailand, right by a restaurant called Franklin?s Roll & Burger displaying a large American flag, up one escalator and down another, until they reached the gleaming Terminal E. Down to the ground floor, into a back area nearly empty except for a woman placidly embroidering, then along a long blank pale green wall, to a door marked ?Staff Only.? The airport had set up a meeting room that allowed the visitors not to cross passport control, from their side, or Snowden from his. A hot, jostling mob of journalists waited while the meeting took place. Then they pounced when the visitors re-emerged. will.englund@washpost.com Kathy Lally and Natasha Abbakumova in Moscow and Karen DeYoung in Washington contributed to this report.