17.45 Damien McElroy, the Telegraph's Foreign Affairs Correspondent, looks at Edward Snowden's options now. Edward Snowden has one overriding objective to ensure that he never faces a US court on charges betraying his homeland. However his route to safety appears blocked by US determination to intercept his flight. Legal experts in support of Mr Snowden believe he has a strong case under international law to claim asylum as he engaged in a form of protected speech, exposing unlawful behaviour by his government. By claiming that he only wants a provisional form of asylum in Russia, Mr Snowden is attempting to preserve his preferred option of moving to South American. But in theory refugee status should be recognised and granted by the first country that the applictant reaches. However the political dividing lines that have been drawn up around Snowden should allow him to establish and maintain other claims on offer. 16.20 Snowden, apparently wants to be called Ed, not Edward. Here is his statement, through WikiLeaks: Hello. My name is Ed Snowden. A little over one month ago, I had family, a home in paradise, and I lived in great comfort. I also had the capability without any warrant to search for, seize, and read your communications. Anyone?s communications at any time. That is the power to change people?s fates. It is also a serious violation of the law. The 4th and 5th Amendments to the Constitution of my country, Article 12 of the Universal Declaration of Human Rights, and numerous statutes and treaties forbid such systems of massive, pervasive surveillance. While the US Constitution marks these programs as illegal, my government argues that secret court rulings, which the world is not permitted to see, somehow legitimize an illegal affair. These rulings simply corrupt the most basic notion of justice ? that it must be seen to be done. The immoral cannot be made moral through the use of secret law. I believe in the principle declared at Nuremberg in 1945: Individuals have international duties which transcend the national obligations of obedience. Therefore individual citizens have the duty to violate domestic laws to prevent crimes against peace and humanity from occurring. Accordingly, I did what I believed right and began a campaign to correct this wrongdoing. I did not seek to enrich myself. I did not seek to sell US secrets. I did not partner with any foreign government to guarantee my safety. Instead, I took what I knew to the public, so what affects all of us can be discussed by all of us in the light of day, and I asked the world for justice. 16.05 There's another picture of Snowden, which may or may not help illustrate the hair point: 16.00 While most Snowden watchers around the world try to get their heads around the latest twist in the whistleblower's plight, Iiya Mouzykantskii helpfully gives a hair update: Twitter: Ilya Mouzykantskii - Nikonov - #snowden was cheerful, concisely answered questions, excellent haircut 15.54 State Duma speaker Sergei Naryshkin's statement: I consider Edward Snowden a human rights defender, who advocates for the rights of millions of people in the world. The United States, which is demanding his handover, uses such measures as the death penalty and the risk is great that this punishment awaits Edward Snowden. We do not have the right to let it happen. So I believe that Russia should give Snowden political asylum, or temporary asylum. 15.46 Speaker of Russia's parliament reportedly states that Moscow should grant asylum to Snowden because he could face the death penalty in the US. 15.31 Snowden has reportedly said he cannot go to Latin America right now. The detaining of Evo Morales's plane proved the danger, according to Russia Today. Also, he says living conditions were fine at the airport. He felt safe there, but he could not stay there forever. Twitter: RT - Edward #Snowden says living conditions fine at #Sheremetyevo airport, he feels safe there, but he can't stay forever http://t.co/0OM93L5Yg3 15.30 Separately, Janet Napolitano, the US Homeland Security Secretary, is to resign from her position to become president of the University of California system. 15.25 The Wall Street Journal has done a poll on Snowden. 55 per cent of Americans regard him as a whistleblower, 34 per cent see him as a traitor Twitter: Wall Street Journal - Poll: 55% of Americans describe Edward Snowden as a whistleblower, while 34% see him as a traitor. http://t.co/kvdUyCaaGd #NSA 15.24 As this press conference goes on behind closed doors, Glen Greenwald, the Guardian journalist behind who originally brought Snowden's leaks to light, has pointed us in the direction of Daniel Ellsberg in the Washington Post. Ellsberg says that Snowden is right not to return to the US. Ellsberg was charged in 1971 under the Espionage Act for copying the Pentagon Papers. The trial was eventually dismissed in 1973. I hope Snowden?s revelations will spark a movement to rescue our democracy, but he could not be part of that movement had he stayed here. There is zero chance that he would be allowed out on bail if he returned now and close to no chance that, had he not left the country, he would have been granted bail. Instead, he would be in a prison cell like Bradley Manning, incommunicado. He would almost certainly be confined in total isolation, even longer than the more than eight months Manning suffered during his three years of imprisonment before his trial began recently. 15.12 Jake Nelson points out what every picture editor of every news organisation must be thinking: Twitter: Jake Nelson - Best thing about this #Snowden briefing in #Sheremetyevo: we finally have a new stock image of him for use in every news story. NEW: OLD: 15.06 This coming via the AFP news agency, but Snowden has apparently vowed at the meeting not to harm the US. 15.01 On that very note, Mr Putin's spokesman has reiterated that Snowden must refrain from harming the United States if he wanted asylum. Mr. Snowden could hypothetically stay in Russia if he: first, completely stops the activities harming our American partners and US-Russian relations and second, if he asks for this himself. 14.55 It's worth a reminder that Snowden had applied for Russian asylum before, only to cancel it after Dmitry Peskov, Vladimir Putin's spokesman said he would have to stop harming US interests if he wanted to stay. He abandoned his intention and his request to receive the chance of staying in Russia. Hypothetically, Snowden could have stayed but on one condition ? that he gave up his intention to carry out, one way or another, anti-American activity inflicting harm on the United States. 14.52 Tanya Lokshina has told the Interfax news agency that Snowden told participants he wants to stay here [Russia] . Public chamber state advisory body member Olga Kostina has also said he would request asylum in Russia. 14.41 Snowden's clothing getting much scrutiny on Twitter: Twitter: Simon Jeffery - Edward Snowden not wearing same shirt as before. New shirt has button down collar 14.40 Snowden to seek temporary asylum in Russia but plans to go to Latin America eventually, Reuters quotes Wikileaks as saying. 14.31 Snowden says... Twitter: Ellen Barry - From @TanyaLokshina @hrw : I am only in a position to accept Russia's offer because of my inability to travel. #Snowden 14.20 The New York Times Moscow correspondent Ellen Barry tweets that Snowden is applying for political asylum in Russia: Twitter: Ellen Barry - Big news is that #Snowden is applying for political asylum in Russia, despte Putin's condition that he stop publishing. from @TanyaLokshina 14.15 First picture of Snowden looking relaxed at the press conference, with Sarah Harrison of WikiLeaks on his right: 14.11 We have started a new Twitter hashtag: #foundsnowden: Twitter: Chris Irvine - Snowden turns up after all at Moscow airport #foundsnowden http://t.co/yRsPZaDhdC 14.09 Snowden is at the meeting... 14.04 Looks like the Snowden meeting has begun. Update from Tom: The man with the G9 sign went through Terminal E. In amazing scenes he was followed by dozens of excited journalists. He went through a door in Terminal E with staff only written on it. The people invited to the meeting followed him through and now we are shut outside. Waiting. 13.45 More from Tom Parfitt inside the airport on the suitably mysterious arrival of a suited man waving a sign indicating the meeting is to start: A man has appeared in the arrivals hall holding a sign above his head with 'G9' written on it. This is apparently a signal to the invitees to the meeting that it will begin. Everyone - journalists and those invited to the meeting - are now following the man in the suit along the concourse as we make our way to terminal E and D. In the email invite to the meeting, the lawyers and rights activists were apparently told that a man with a G9 sign would lead them to the meeting. 13.36 Tom Parfitt, our Moscow correspondent, who is in the middle of the media crowd at Moscow's Sheremetyevo international airport, has called in this update: There's a huge scrum of reporters here - I would estimate at least 200 in the arrivals hall of terminal F. Several of the invitees to the Snowden meeting have already arrived. Genri Reznik, one of Russia's most famous human rights lawyers who recently defended the media tycoon Alexander Lebedev, thought that it was possible that Snowden may ask for political asylum in Russia and that this would be a logical thing to do. Vyacheslav Nikonov, a senior pro-Kremlin MP said that he believed that Russia's offer of asylum to Snowden still stood on conditions imposed by President Putin that he should stop harming our US partners . Journalists crowd inside the terminal F of Moscow's Sheremetyevo airport 13.25 Peter Wilson from Foreign Policy briefs Snowden on what he needs to know about living in Venezuela, where petrol costs 1p a gallon but you may have problems buying a new car: We're in the 15th year of a revolution that late President Hugo Ch?vez began in 1999. Yes, extreme poverty has been reduced as his supporters claim, but that has been accomplished at a cost. The economy is gutted. The government has expropriated dozens of private companies whose production always seems to fall after their seizure. Today, while walking in my neighbourhood, I saw long lines of people stretching out of a government-owned supermarket. They were waiting to buy cooking oil, sugar, chicken - simple staple goods. Food shortages are common. Pack a comfortable pair of shoes if you want to buy coffee, meat, flour, cornmeal, or pasta. 13.08 The New York Times has a good piece on the diplomatic lengths the Obama administration has gone to, to press Latin American countries to reject Snowden: Vice President Joseph R. Biden Jr. took the unusual step of telephoning President Rafael Correa of Ecuador to urge him not to give asylum to Mr. Snowden. Senior State Department officials have also pushed Venezuela, one of the three countries offering to shelter him, with both sides keenly aware that hopes for better ties and an exchange of ambassadors after years of tension could be on the line. 12.52 Wikileaks has tweeted their solidarity for Snowden. Julian Assange, holed up in Ecuador's London embassy, along with Richard Stallman, the software freedom activist and founder of the GNU project. Twitter: WikiLeaks - Photo: Richard Stallman left Edward Snowden center Julian Assange right YES WE CAN last night http://t.co/ZZKiVjunIU 12.45 Possible Snowden sighting. Twitter: Phil Tonks - Great.Edward Snowden is holed up in our mess room toilet and declared it The People's Republic of Stourbridge Jcn .Break ruined. 12.36 Simon Shuster of Time magazine says that while the official story is Snowden is in Sheremetyevo airport, few experts believe that to be true. He says: The accepted wisdom, unofficially acknowledged by most Western and Russian sources, is that Snowden was taken soon after his arrival ? if not immediately ? to a secure location run by some arm of the Russian government. So [KGB colonel Oleg] Gordievsky believes Snowden would have gotten roughly the same treatment that the KGB spy got back in 1985. ?They would have fed him something to loosen his tongue,? Gordievsky says by phone from the U.K., where he has been living in exile for nearly three decades. ?Many different kinds of drugs are available, as I experienced for myself.? Having been called back to Moscow, Gordievsky says his KGB comrades drugged him with a substance that ?turned out his lights? and made him ?start talking in a very animated way.? Although the drug wiped out most of his memory of the incident, the parts he did recollect horrified him the following morning, when he woke up feeling ill. ?I realized that I had completely compromised myself,? he says. 12.05 Tom Parfitt has a few people you can follow on Twitter for the latest on Snowden. They all appear to be Moscow correspondents who will spend their day at the airport. Twitter: Tom Parfitt - Peope to follow on Edward Snowden at Sheremetyevo: @LidKelly @alessaprentice @KiritRadia_ABC @TanyaLokshina @obk @shaunwalker7 @ASLuhn 12.00 One of our readers has turned citizen sleuth for us and checked whether he was hiding nearby. Twitter: Jonathan P Ede - Just checked and Edward #Snowden is not hiding in the toilets at work. #FindSnowden 11.55 Tom Parfitt says reporters are starting to arrive at Sheremetyevo ahead of Snowden's planned meeting with human rights activists and Russian officials, scheduled for 2pm British time. For many of us it's a familiar scene after past stake-outs and midnight skulkings in terminals D, E and F looking for the American whistleblower. Nobody has seen Snowden here in the flesh despite him reportedly being in the airport's transit and departure zone since June 23rd, when he flew in from Hong Kong in the wake of his revelations about controversial US surveillance programmes. There's a sense of excitement that Snowden may finally break cover mixed with suspicion that this may yet prove to be another wiild goose chase. Colleagues are discussing where to station themselves in order to see the fugitive leaker. It's thought that the officials coming to see him will be met in the arrivals area of Terminal F and then escorted through to the transit zone. For ordinary mortals like us the only way into the transit zone is to buy a ticket on a flight - and it's a rigmarole to extract yourself afterwards because you need to get the exit stamp in your passport annulled; something the increasing jaded immigration officials here are not in a hurry with. I had a chat on the phone with Tanya Lokshina of Human Rights Watch, one of Snowden's invitees. She was initially sceptical of the note she received but finally decided to attend, just in case. She's on her way here. There's been some analysis of the email puportedly sent by Snowden to his invitees: it seems an odd mix of British and American English, with a couple of phrases that look like awkward translations from Russian. Perhaps that reflects a collaboration between Snowden, his British companion, Sarah Harrison of WikiLeaks, and the Russian officials who have helped keep the whistleblower hidden in a private area of the transit zone for the past three weeks. It will be interesting to see how much is done on the Russian side to facilitate this meeting. President Vladimir Putin earlier insisted that Snowden is not high on his agenda, saying the leaker must decide his own fate. But if the Kremlin - which is likely overseeing all of this - helps him advance a claim for asylum via today's meeting then that will go down badly in Washington. I've seen no heightened security yet in a brief patrol along the concourse of Terminal F, but I'm now heading out for another look... 11.50 Aviation experts have advised if Snowden makes a run for it, he fly commercial. Commercial carriers have the freedom to use airspace of other countries, known as the First Freedom of the air, the centrepiece of a complex but well-established system that keeps global air transportation running smoothly, according to Reuters. Simon Phippard, of British-based law firm Bird & Bird, told the news agency: One of the principles of the Chicago Convention system is that commercial carriers have the right of overflight, or the right to do things like stop for fuel, without seeking permission from the country over which they are flying. 11.44 Snowden is on the run because he exposed the surveillance programmes of the America's National Security Agency. The fallout is still being felt. Last night, the tech giant Microsoft was forced to defend itself against renewed claims it have intelligence agencies widespread access to its data systems, including assisting the National Security Agency to read encrypted messages on Outlook.com Peter Foster, our US editor wrote: An internal intelligence community newsletter provided by the whistleblower Edward Snowden and published by the Guardian purportedly revealed ?deep and ongoing? co-operation between Microsoft and the NSA and other agencies, the paper claimed. Among the claims noted in the newsletter, which was marked ?Top Secret?, was that Microsoft had collaborated closely with the NSA and FBI to provide access to its Outlook.com messaging system and its Skydrive cloud storage system. However Microsoft defended itself against the suggestion that it had given blanket back-door access to the security agencies, saying in a statement to The Guardian that it provided customer data to government ?only in response to legal processes?. The newsletters cited by The Guardian do not appear to contradict that statement, but do show Microsoft co-operating extensively with agencies to enable them to gather material if and when a warrant was produced. In one entry it was noted that the FBI Data Intercept Technology Unit DITU team is ?working with Microsoft to understand an additional feature in Outlook.com which allows users to create email aliases?, while another from April this year said the FBI and Microsoft had worked together on a different issue for ?many months?. 11.25 A Telegraph reader, @GeneralBoles must have voted that Snowden is in the US in our poll. He's come across this. 11.20 Tom Parfitt has arrived at Sheremetyevo. He's checking the restaurants to see if Snowden is having some lunch. Snowden's diet in the last three weeks must have disintegrated if all he's had to eat is airport fare. Twitter: Tom Parfitt - Arrived at Sheremetyevo. No sign of Snowden in TFI Friday's. Does he get grilled salmon w/ Jack Daniels sauce delivered to his hideout? 11.03 Telegraph reader Veritas has taken umbridge with our description of him as a whistleblower, calling him a traitor instead. He is NOT a whistleblower. He is a thief and a traitor. The Russians should demonstrate they deserve to be part of the civilised world and hand over Snowden to the USA so he can face justice. 11.00 The US has told China it was upset they did not hand over Snowden after he fled to Hong Kong, say the decision undermined relations. According to William Burns, deputy secretary of state, one of the main US officials in the talks, Barack Obama and his Chinese counterpart had agreed at their summit last month in California to cooperate over problems. That is why we were very disappointed with how the authorities in Beijing and Hong Kong handled the Snowden case, which undermined our effort to build the trust needed to manage difficult issues. We have made clear that China's handling of this case was not consistent with the spirit of Sunnylands or with the type of relationship - the new model - that we both seek to build. 10.51 A Russian official of Amnesty International says he plans to meet with Snowden. It appears unclear however if Human Rights Watch will head to this press conference at the airport. Reporters surround a crew member of Aeroflot's Moscow-Havana flight as they ask about former spy agency contractor Snowden's whereabouts, at Havana's Jose Marti International Airport. 10.36 Twitter user Spencer Saffer gives us a possible clue on Snowden's whereabouts. Twitter: Spencer Saffer - @Telegraph last seen here.#wheressnowden http://t.co/eyetKLx9Va 10.29 Alex Spillius, the Telegraph's Diplomatic Correspondent, says that the chances of Edward Snowden reaching any of the countries that have offered him asylum, are pretty difficult. To fly a Gulfstream 550, one of the few planes that could make the distance, would cost between ?150,000 to ?200,000 alone. Assuming his travel documents from Venezuela are in order, Snowden could head north into the Barents Sea and then take a sharp turn southwest to the east or west of Iceland. It would then head all the way down across the Atlantic Ocean, carefully avoiding Canadian airspace near Newfoundland, and on to the Venezuelan capital. In the final stages the young American?s pilot would have to pick his way gingerly between Caribbean islands such as Grenada and Trinidad, never forgetting that under international rules national airspace extends 12 nautical miles offshore and that the US could force his plane to land based on extradition treaties with friendly countries. Remember that the US compelled the president of Bolivia?s plane to make an unscheduled stop in Vienna when it suspected Snowden was on board. 10.19 George Takei, he of Star Trek fame, may be on to something. Twitter: George Takei - Overheard: Perhaps Snowden should go where US law enforcement will never reach--Wall Street 10.13 Tom Parfitt, our Moscow correspondent, who, like Snowden has effectively made Sheremetyevo airport a second home, has been forwarded a message that Edward Snowden sent human rights groups. He says it looks suspiciously like it has not been written by a native speaker and may be a hoax. The email claims that Snowden will hold a press conference at 5pm Moscow time that's 2pm London . I'll let you be the judge. I have been extremely fortunate to enjoy and accept many offers of support and asylum from brave countries around the world. These nations have my gratitude, and I hope to travel to each of them to extend my personal thanks to their people and leaders. By refusing to compromise their principles in the face of intimidation, they have earned the respect of the world. Unfortunately, in recent weeks we have witnessed an unlawful campaign by officials in the US Government to deny my right to seek and enjoy this asylum under Article 14 of the Universal Declaration of Human Rights. The scale of threatening behavior is without precedent: never before in history have states conspired to force to the ground a sovereign President's plane to effect a search for a political refugee. This dangerous escalation represents a threat not just to the dignity of Latin America or my own personal security, but to the basic right shared by every living person to live free from persecution. I invite the Human Rights organizations and other respected individuals addressed to join me on 12 July at 5:00PM at Sheremetyevo Airport in Moscow for a brief statement and discussion regarding the next steps forward in my situation. Your cooperation and support will be greatly appreciated in this matter. Sincerely, Edward Joseph Snowden 10.05 We've got to the stage now where every flight from Moscow to Havana is being watched. Last night, there was a flurry of excitement after an Aeroflot plane was taking a more southerly route across the Atlantic - possibly to avoid US airspace. In the end... nothing. 10.00 BST, 13.00 Moscow, 17.00 Beijing 05.00 Caracas and Washington DC Good morning, and welcome to our latest coverage of Edward Snowden. We will attempt to keep tabs on the world's most famous fugitive and his whereabouts. But we need your help. So please send us all suggestions. Edward Snowden is believed to be still in Sheremetyevo airport in Moscow