Human Rights Watch has issued a picture of the US fugitive after he met with rights activists in the Moscow airport where he is based today. The 30-year-old is believed to be holed up at a Moscow airport looking for a country that will give him safe haven. Enda Kenny has told the D?il that the fugitive former NSA employee has written to the Irish embassy in Moscow but this is not sufficient for an asylum application to be considered. THE ISSUE OF Ireland?s blasphemy law is back in the spotlight in the wake of the Paris terror attacks. Junior Minister Aodh?n ??R?ord?in announced back in October that a referendum to remove the offence from the Constitution would go ahead ? and speaking last week, he said it was his expectation that the vote would be held later this year. Read: More on the blasphemy law in Ireland >? However, speaking at the weekend, senior ministers played down the issue, with?Justice Minister Frances Fitzgerald saying no date had been set. What do you think? The poorest country in the western hemisphere was brought to its knees in 2010, but now it has other threats to deal with amid the efforts to rebuild. We have woken up to the fact that, just because our parents or grandparents voted for a certain party, that maybe ? just maybe ? that party isn?t what we should be voting for. Last winter I got sick and I couldn?t shake it off without a trip to the doctors. In hindsight, it?s very obvious why ? I wasn?t really taking great care of myself. As my little girl inevitably becomes more and more aware of the world around her, an awareness of her own shape and size is only just around the corner. Reverse culture shock is the part of living abroad that you?re not warned about. The poorest country in the western hemisphere was brought to its knees in 2010, but now it has other threats to deal with amid the efforts to rebuild. We have woken up to the fact that, just because our parents or grandparents voted for a certain party, that maybe ? just maybe ? that party isn?t what we should be voting for. Last winter I got sick and I couldn?t shake it off without a trip to the doctors. In hindsight, it?s very obvious why ? I wasn?t really taking great care of myself. ?Ink should flow, not blood?: Up to 1.6 million people attend ?unity? rally in Paris TheJournal.ie is a full participating member of the Press Council of Ireland and supports the Office of the Press Ombudsman. This scheme in addition to defending the freedom of the press, offers readers a quick, fair and free method of dealing with complaints that they may have in relation to articles that appear on our pages. To contact the Office of the Press Ombudsman Lo-Call 1890 208 080 or go to www.pressombudsman.ie or www.presscouncil.ie Please note that TheJournal.ie uses cookies to improve your experience and to provide services and advertising. For more information on cookies please refer to our cookies policy. News images provided by Press Association and Photocall Ireland unless otherwise stated. Irish sport images provided by Inpho Photography unless otherwise stated. Wire service provided by Associated Press. Journal Media does not control and is not responsible for user created content, posts, comments, submissions or preferences. Users are reminded that they are fully responsible for their own created content and their own posts, comments and submissions and fully and effectively warrant and indemnify Journal Media in relation to such content and their ability to make such content, posts, comments and submissions available. Journal Media does not control and is not responsible for the content of external websites.