Russia kept former US spy agency contractor Edward Snowden at arm's length on Saturday, saying it had not been in touch with the fugitive American, and had not yet received a formal request for political asylum. Remarks by Foreign Minister, Sergei Lavrov signalled Russia is weighing its options after Snowden, who is stranded at a Moscow airport, broke three weeks of silence and asked for refuge in Russia until he can secure safe passage to Latin America. Washington urged Moscow to return Snowden to the US, where he is wanted on espionage charges after revealing details of secret surveillance programmes. Snowden's leaks about US spy methods, including eavesdropping on global email traffic, have upset Washington's friends and foes alike. Stuck at Sheremetyevo airport with his passport revoked, he has become an irritant in relations between the US and Russia. We are not in contact with Snowden, Russian news agencies quoted Lavrov as saying in Kyrgyzstan, where he attended a foreign ministers' meeting. He said he had learned of Snowden's meeting with Russian human rights activists and public figures at the airport on Friday from the media, just like everyone else. Snowden, who had previously kept out of sight since arriving in the airport's transit zone on June 23, told the activists that he would submit his asylum request the same day. Lavrov said that under Russian law, asylum seekers must first make an official appeal to the Federal Migration Service but its director, Konstantin Romodanovsky said on Saturday the agency had not yet received such a request from Snowden. Snowden, who worked at a National Security Agency NSA facility in Hawaii, revealed that the NSA has access to vast amounts of data such as emails and chat rooms from companies including Facebook and Google, under a government programme called Prism. He fled to Hong Kong and then flew to Moscow, where he and Russian officials say he has remained in the airport transit zone. He has no visa to enter Russia. Snowden is useful as a propaganda tool for Putin, who accuses the U.S. government of preaching to the world about rights and freedoms it does not uphold at home. But his presence on Russia's doorstep is a double-edged sword. Putin has invited Obama for a bilateral summit in Moscow in September, and asylum for Snowden could jeopardise that, even though both countries have signalled they want to improve ties that have been strained in Putin's third presidential term. And while pro-Kremlin politicians have been avidly casting Snowden, 30, as a rights defender, former KGB officer Putin said last month that the surveillance methods he revealed were largely justified if applied lawfully. Putin has said twice that Snowden should choose a final destination and go there, and on July 2 he said Russia could only take Snowden in if he stopped activities aimed at harming our American partners . Putin's spokesman said on Friday that the condition, which prompted Snowden to withdraw an earlier asylum request, still stood. Snowden has asked some 20 countries for asylum and received offers from Venezuela, Nicaragua and Bolivia, but he said on Friday that Western states had made it impossible for me to travel to Latin America and enjoy the asylum granted there . The US has urged nations not to give him passage and a plane carrying Bolivian President Evo Morales home from Russia last week was denied access to the airspace of several European countries on suspicion Snowden might be on board.