Articles about Political Asylum - Los Angeles Times Advertisement 		 			 YOU ARE HERE: LAT Home ? Collections ? Political Asylum IN THE NEWS Political Asylum MORE STORIES ABOUT: Youth Court Rulings Los Angeles Prisoner Releases United States |?More FEATURED ARTICLES WORLD World Briefing / Yemen January 21, 2009 | Times Wire Reports Former Somalia President Abdullahi Yusuf arrived in Sana, Yemen, on a private jet and sought political asylum, officials said. The 75-year-old former warlord resigned in December after a series of public quarrels with his prime minister. An aide said it was possible that Yusuf could return to Somalia or move to a third country, such as the United Arab Emirates or Saudi Arabia. ARTICLES BY DATE WORLD Ambassador Michael McFaul looks back at stint in Russia February 24, 2014 | By Carol J. Williams MOSCOW - Stanford political science professor Michael McFaul's two-year stint as U.S. ambassador to Russia coincided with a diplomatic chill seemingly worthy of the Cold War era. U.S. Agency for International Development advisors were expelled. American democracy-building emissaries were demonized as foreign agents. American adoptions of Russian orphans were banned in a game of political point-scoring. National Security Agency leaker Edward Snowden was granted political asylum, and bitter disputes over how to stem the bloodshed in Syria and restore civic peace in Ukraine put the U.S. and Russia on opposite sides of an increasingly strident ideological battle front. Advertisement 		 			 WORLD Ecuador grants political asylum to Julian Assange August 16, 2012 | By Henry Chu, Los Angeles Times LONDON - Britain doesn't want him. Ecuador does. Therein lies a very large rub. A tense diplomatic faceoff grew uglier Thursday after Ecuador announced it was granting political asylum to Julian Assange, the founder of the whistle-blowing WikiLeaks website who has been holed up for the last two months in its embassy in an upscale London neighborhood. Officials in Quito say Assange faces political persecution for releasing confidential documents embarrassing to the U.S. and other governments, and demanded that he be given safe passage out of Britain. CALIFORNIA | LOCAL U.S. seeing a surge in Central American asylum seekers December 15, 2013 | By Cindy Chang and Kate Linthicum He was 10 when the gangsters flung rocks through the windows, and 12 when they beat him black and blue. At 15, a gang member shot at him while he was shopping at a grocery store - and killed his cousin instead. At 17, he left Honduras for the United States. He applied for political asylum, telling a judge that if he returned home, the gang that had slain his father would kill him, too. Now 20, working as a gardener and living with his mother and siblings in Los Angeles, the man is one of a growing number of Central Americans asking for asylum. WORLD 29 Cubans granted political asylum August 19, 2007 | From Times Wire Reports The government has granted political asylum to 29 Cubans held at the U.S. military prison at Guantanamo Bay, Cuba, the news agency MTI reported. U.S. forces have been holding 44 Cubans caught at sea and have been looking for countries willing to take them. Seventeen of them ended a three-week hunger strike after learning of Hungary's decision, MTI said. Hungary's Foreign Ministry reportedly said that the U.S. NEWS Ex-Leader of Ecuador Gets Political Asylum April 29, 1997 | From Times Wire Reports Ecuador's deposed president, Abdala Bucaram, was granted political asylum in Panama, the Foreign Ministry said. The measure, effective last Thursday, covered Bucaram's wife, their four children and Bucaram's brother, Santiago, who was expelled from Ecuador's National Chamber of Representatives. Bucaram was deposed by the legislature Feb. 6 and traveled to Panama a few days later. Ecuador's Supreme Court has issued a warrant for Bucaram's arrest. NEWS Suriname Expels 5 Who Asked Political Asylum July 21, 1987 | From Reuters Five people who arrived in Suriname by plane seeking political asylum from the French Caribbean island of Guadeloupe were expelled after being interrogated by authorities here, an official said Monday. The five, whom authorities did not identify, landed in a private Cessna aircraft at Suriname's Zanderij airport, 28 miles south of Paramaribo. They were detained and after being interrogated were ordered to leave the country, Foreign Minister Henricus Heidweiller said. WORLD U.S. family seeks political asylum September 22, 2007 | From Times Wire Reports An American family with three small children has applied for political asylum in Finland, immigration officials said. The five came from Germany on Tuesday, said Minna Serradj of the Directorate of Immigration. It's very unusual for a U.S. citizen to apply for asylum, Serradj said, declining to give details, in line with a policy to protect asylum-seekers. Serradj declined to comment on local media speculation that the parents possibly were seeking to escape serving in the U.S. NEWS PICO-UNION : Political Asylum Plan Raises Concerns October 10, 1993 | SANDRA HERNANDEZ A proposal to reform political asylum laws may do little to alleviate the backlog of cases and has raised concerns that the appeals process will be curtailed, according to local immigrant-rights organizations. The legislation, proposed by Rep. Xavier Becerra D-Los Angeles , calls for tough but fair changes, including speeding up the application process for political asylum and transferring jurisdiction over claims from the Immigration and Naturalization Service to the Department of Justice. NEWS INS Plans $130 Fee for Political Asylum Applications February 17, 1994 | RONALD J. OSTROW, TIMES STAFF WRITER Inundated with applications from political asylum seekers, the Immigration and Naturalization Service intends to impose an unprecedented $130 fee on applicants and to delay their eligibility for work permits. An INS official said Wednesday that the money from the fee would allow the agency to double the 150 agents assigned to processing the claims, which are flowing into INS offices at the rate of 10,000 a month. WORLD As Bo Xilai's trial ends, he accuses witness of love triangle August 25, 2013 | By Barbara Demick BEIJING - The sensational trial of purged Chinese politician Bo Xilai wound to a dramatic end Monday with Bo accusing the government's chief witness of being in love with his wife, and prosecutors demanding a stiff sentence to punish him for withdrawing his confessions. Bo Xilai not only denied a lot of proven evidence, but recanted his own handwritten testimony and statement, an unidentified prosecutor was quoted as saying in a transcript of the trial's closing arguments. ?He doesn't meet the standards for a reduced sentence, so should be punished severely in accordance with the law. ? The 64-year-old Bo, once a contender for the Chinese leadership, embarrassed prosecutors by upstaging them at what was supposed to be a well-scripted two-day show trial. OPINION What next for Edward Snowden? August 1, 2013 | By The Times editorial board Russia's decision Thursday to grant political asylum to Edward J. Snowden for a year frustrates - at least for the foreseeable future - the Obama administration's attempt to return the former National Security Agency contractor to the U.S. to stand trial. Those who regard Snowden as a heroic whistle-blower hope that the administration will now abandon its attempt to prosecute him, but that is neither likely nor desirable. We believe the administration is right to try to bring Snowden to justice, even as we acknowledge that the service he performed in exposing the breathtaking scope of U.S. electronic surveillance may entitle him to leniency. WORLD Snowden won't face torture or execution, Holder tells Russia July 26, 2013 | By Marina Villeneuve and Carol J. Williams WASHINGTON - In an effort to break the international standoff over fugitive Edward Snowden, the Obama administration has assured Russian authorities that the American on the lam after revealing top-secret U.S. intelligence operations won't face the death penalty or torture if he returns to the United States. Atty. Gen. Eric H. Holder Jr. wrote to his Russian counterpart to say that Snowden's claim to need political asylum in Russia for fear of abuse or execution if returned to the United States was entirely without merit, the Justice Department disclosed Friday. WORLD Edward Snowden applies for temporary asylum in Russia July 16, 2013 | By Sergei L. Loiko MOSCOW -- Former National Security Agency contractor Edward Snowden officially applied for temporary asylum in Russia on Tuesday, his attorney and the Wikileaks organization announced. The application is for temporary refuge, not permanent political asylum, according to human rights activists familiar with his case. ?It is a compromise step as Russia doesn't want to utterly spoil its relations with the United States as tense as they are,? said Olga?Kostina, head of the rights organization Soprotivleniye. WORLD Putin hoping Edward Snowden leaves Russia as soon as possible July 15, 2013 | By Sergei L. Loiko MOSCOW -- Edward Snowden's on-again, off-again relationship with the Russian government appeared to take a nosedive again Monday, when President Vladimir Putin said he hoped the American fugitive would leave the country as soon as he has the chance. Elaborating on past comments about the former National Security Agency contractor, who has leaked sensitive data about American surveillance methods, Putin suggested that it wouldn't be worth the diplomatic fallout for his country to offer Snowden asylum. WORLD Russian foreign minister: Snowden hasn't yet applied for asylum July 13, 2013 | By Sergei L. Loiko MOSCOW --As of Saturday, Edward Snowden had not yet formally applied for political asylum in Russia, Foreign Minister Sergei Lavrov said. ?We are not in contact with Edward Snowden,? Lavrov said in televised remarks during a visit to Kyrgyzstan, a post-Soviet Central Asian republic. ?Russian legislation provides for a certain procedure the first step in which is an official application to the Federal Migration Service.? On Friday, Snowden, the former contractor for the U.S. National Security Agency who revealed Washington's secret efforts to track international communications, summoned Russian human rights activists and lawyers to Sheremetyevo International Airport here to render him assistance in gaining asylum in Russia. NEWS INS Sued on Handling of Political Asylum Requests January 31, 1989 | MYRNA OLIVER, Times Staff Writer The Immigration and Naturalization Service was sued Monday by Latino applicants for political asylum who claim their interviews are too brief, too public and conducted only in English, which they cannot understand. Vibiana Andrade, attorney for the National Center for Immigrants' Rights, estimated that up to 30,000 people may benefit from the class-action civil suit filed in U.S. District Court in Los Angeles. CALIFORNIA | LOCAL Chinese Woman's Political Asylum Case Delayed Again August 19, 1989 | ELIZABETH LU, Times Staff Writer After a Chinese woman's political asylum hearing was again postponed because a crucial State Department letter failed to arrive, her attorney on Friday warned that more delays could hurt her client as witnesses on her behalf leave town and become unavailable. Meanwhile, the Immigration and Naturalization Service refused to release Chen Yiwei on bond pending a hearing, citing what officials describe as inconsistencies between her travel documents and statements she made to authorities. 1 | 2 | 3 | 4 | 5 | Next WORLD Snowden adds six countries to his search for asylum July 5, 2013 | By Carol J. Williams NSA leaker Edward Snowden has sent out appeals for asylum to six more countries, WikiLeaks reported Friday, in a sign of the marooned fugitive's mounting desperation in the face of international indifference to his plight. Snowden remains trapped in a diplomatic no-man's land at Moscow's Sheremetyevo airport, lacking documents that would allow him to enter Russia or travel to a country willing to damage relations with Washington to give him refuge. The 30-year-old former contract worker for the National Security Agency has been on the run for more than a month since telling journalists about massive U.S. efforts to track telephone conversations and Internet traffic around the world. CALIFORNIA | LOCAL Edward Snowden desperately seeking asylum: Habla espa?ol, Edward? July 3, 2013 | By Robin Abcarian I used to be intrigued by Edward Snowden, the NSA leaker who did the country a favor by revealing proof of the government's intrusive domestic spying program. Now, I am starting to feel a little sorry for the guy, a fugitive who has become a kind of worldwide reject, as his quest for political asylum has begun to look like the geopolitical equivalent of ?Let's Make a Deal.? He's asked 21 countries so far to accept him. So far, no one has said ?Come on down!? In a statement posted on the WikiLeaks site this week, Snowden angrily denounced the U.S. for annulling his passport. 1 | 2 | 3 | 4 | 5 | Next Copyright 2015 Los Angeles Times Terms of Service | Privacy Policy