They took to the streets, to radio call-in shows, to social media to vent their frustration. George Zimmerman not guilty? It can't be, they said. Only white life is protected in America, one protester in Washington shouted Sunday, a day after a Florida jury found the Hispanic former neighborhood watch volunteer not guilty in the 2012 death of African-American teenager Trayvon Martin. But, as with all things surrounding the divisive case, not everyone shared the view that Martin was the victim, that the verdict was wrong. While few, if any, Zimmerman supporters held rallies celebrating the verdict, on the George Zimmerman is Innocent Facebook page, fans were hawking T-shirts and stickers hailing Zimmerman and posting messages of encouragement. Thank God the jury got it right and found George not guilty, Facebook user Pete Habel posted Monday on the page. The six-woman jury -- five of whom are white and one who appeared to experts covering the trial for CNN's sister network, HLN, to be black or Hispanic -- deliberated for about 16 1/2 hours over two days before reaching their verdict late Saturday. Most of the protests began a night later, on Sunday, and were largely peaceful. Analysis: The race factor On Monday night, Atlanta police said more than 2,000 demonstrators gathered in front of CNN Center in Atlanta to voice their opposition to the verdict. Earlier Monday, pastors held a prayer service in Sanford, Florida, where the trial was held, while in Washington, outside the Justice Department, a handful of protesters from the National Black Church Initiative called for federal civil rights charges against Zimmerman. We want the Justice Department to assure that other African-American males will not be killed because they ran into a white American who was afraid of their presence, the Rev. Anthony Evans, the group's president, told reporters. At the Florida service, police Chief Cecil Smith praised the response of residents to the verdict. Everyone is watching what we do, he said. And we have been the most peaceful people around the world. Protesters were also expected to gather at noon in Cleveland with bags of Skittles -- the candy that Martin had just purchased when he was killed, CNN affiliate WEWS reported. On Sunday, protesters in Washington chanted No justice, no peace and Trayvon was murdered as they marched, freelance photographer Michael Kandel told CNN's iReport. In New York, demonstrators marched across Manhattan and filled Times Square. This is what democracy looks like, they chanted. And in Florida, just steps away from the courthouse where a jury acquitted Zimmerman, demonstrators vowed that their fight wasn't over. Nationwide protest to demand justice, protesters chanted. In Los Angeles, a demonstration against the verdict grew tense late Sunday and early Monday. Some protesters hurled flashlight batteries, rocks and chunks of concrete toward police, Los Angeles police spokesman Andrew Smith said. Police responded by shooting bean bags at protesters. Police arrested seven people, according to Officer Norma Eisenman. Five were arrested for failure to disperse, one for battery on a police officer and one on marijuana possession, she said. The Rev. Jesse Jackson called for protests to continue, but to remain peaceful. There will be protests, but they must be carried out with dignity and discipline, he told CNN's New Day. What will happen if there, in fact, are riots, it gives sympathy to Zimmerman, and discredits Trayvon. Trayvon deserves sympathy. Zimmerman and his school of thought does not. Catch up on the trial, verdict Prosecutors react In an interview to be aired Monday on HLN After Dark, State Attorney Angela Corey called Zimmerman a murderer, despite defense claims that Zimmerman had to react after Martin attacked him. We never said Trayvon didn't do something to George Zimmerman, Corey told HLN's Vinnie Politan. What we said is you can't take a concealed weapon and encourage or incite a fistfight -- which is what he did by stalking a teenager who didn't know who he was -- and then whip your gun out and shoot, she said. Assistant State Attorney Bernie de la Rionda, who handled much of the case, said prosecutors couldn't overcome what he called inconsistent witnesses in the effort to prove their belief that Zimmerman was the aggressor. He chased down Trayvon Martin, he wanted to make sure Travyon Martin did not get away, de la Rionda told Politan. Now, at what point he pulled out the gun? We could speculate as to what happened. My theory is that he pulled it out early. He was going to make sure he didn't get away. He wanted to be a cop. Racial undertones Many of the protests, including those in New York and Los Angeles, drew demonstrators from a wide variety of races. But many expressed the same belief: that Martin's death was spurred by racial profiling and that Zimmerman's acquittal was unjust. Protesters demanded that the government investigate further, Kandel said. They believe that this is a civil rights issue that must become the topic of a national conversation in the coming days, he said. They did not believe justice had been served. In addition to calls from the street for an investigation, some 350,000 people have signed a MoveOn.org petition started by the NAACP calling for civil rights charges against Zimmerman. Two petitions to the White House seeking such charges had more than 18,000 signatures between them. The U.S. Justice Department has had an open investigation on the case for months, and on Sunday the agency said it was assessing whether criminal civil rights charges are warranted. Supporters of such an investigation believe Zimmerman violated Martin's civil rights by racially profiling and killing him. The attorney for Martin's family, Benjamin Crump, said Zimmerman racially profiled Martin because he superficially resembled African-American youths who had been arrested for recent burglaries in his neighborhood. That's profiling, Crump said on CNN's New Day. And there's a big question whether that's allowed, and so I think the Justice Department should look at that. President Barack Obama -- who called the incident a national tragedy over the weekend -- sparked significant discussion about the racial elements of the case last year, saying that If I had a son, he would look like Trayvon. But White House spokesman Jay Carney said Monday that the president won't get involved in the Justice Department's decision. That is not something the president involves himself in, Carney said. He has no opinion to express about the disposition about how the Justice Department will look at this. In remarks prepared for delivery Monday at the Delta Sigma Theta National Convention's Social Action Luncheon, Attorney General Eric Holder did not say whether the department would bring charges, but promised to act in a manner that is consistent with the facts and the law. We are resolved, as you are, to combat violence involving or directed at young people, to prevent future tragedies and to deal with the underlying attitudes, mistaken beliefs and stereotypes that serve as the basis for these too common incidents, he said. And we will never stop working to ensure that -- in every case, in every circumstance, and in every community -- justice must be done. The other side Zimmerman's parents, Robert and Gladys Zimmerman, spoke to ABC News. In excerpts of an interview that aired Monday, they defended their son and said they are sorry for what happened. Asked whether his son is a racist, Robert Zimmerman said: Absolutely not. He's never been taught to be a racist. He added that if he were his son, he would stay in hiding for a long time. We've had an enormous amount of death threats, Robert Zimmerman said. Gladys Zimmerman said she would pray for Martin and for those now demanding vengeance after the verdict. In response to what she would say to the teenager's parents, she said: We are deeply sorry for this tragedy. Other Zimmerman supporters -- speaking mostly through social media channels -- argued that the jury's verdict was correct. If Zimmerman was black, would people act the way they they're acting now? The facts found him innocent, the 'people' are the racist ones, Facebook user Ben Biller posted on the George Zimmerman is Innocent page. On Twitter, user ElDonJuanDiaz posted: George Zimmerman is a national hero. To you liberals and black people who believe everyone is racist keep crying. Why this verdict? Zimmerman's friend and former next-door neighbor, Jorge Rodriguez, said he always expected an acquittal. This is so far from being racial, it's not even funny, he told CNN's Chris Cuomo on New Day. Just because he has a white last name and an African-American was dead, automatically everybody assumes racial. This is far from being race. This is just a bad situation that happened. Tony Johnson, who is black, said he was disturbed by the outbursts from people who didn't know the facts of the case, yet were still screaming about an injustice. I'm actually glad the verdict was not guilty, he told CNN's iReport. Only based on the evidence that was presented in court, it screams self-defense. This wasn't about race, Johnson continued. It was about a man's rights to defend himself. It's not a crime to follow anybody; therefore, the fact that they got into an altercation and George Zimmerman was forced to use deadly force, it's not a crime. Our Constitution states that. Mark O'Mara, Zimmerman's defense attorney, said he was surprised by some of the protest. I'm a bit surprised that there is outrage because we had hoped that everybody would look at this case as being a very fair trial where both parties were represented well, he said. Pushing for peace Obama called for peace Sunday and acknowledged the Zimmerman case has stirred strong emotions. I now ask every American to respect the call for calm reflection from two parents who lost their young son. And as we do, we should ask ourselves if we're doing all we can to widen the circle of compassion and understanding in our own communities, he said. We should ask ourselves if we're doing all we can to stem the tide of gun violence that claims too many lives across this country on a daily basis, Obama said. One critic of the verdict, Terri Weems, said the trial was a referendum on race that confirmed what she said Martin supporters knew all along. That's our society, she said as she headed into church in Washington on Sunday. We expected not to be given justice. We haven't been dealt justice all this time. ... It's very disheartening. NAACP President Benjamin Jealous said on CNN's State of the Union on Sunday that the largely peaceful nature of the protests is a positive sign. I think we should, frankly, right now be celebrating the fact that we've seen a generation of young people respond by using our system, raising their voices, but not using their fists, he said. Zimmerman could still be held responsible for Martin's death