Eastern & Central Europe ???????? gr.voanews.com ?????????? mk.voanews.com Srpski glasamerike.net Eurasia ??????? amerikiskhma.com East & Southeast Asia Burmese burmese.voanews.com ?? voacantonese.com ?? voachinese.com Bahasa Indonesia voaindonesia.com ????? khmer.voanews.com Khmer voacambodia.com ??? voakorea.com ??? lao.voanews.com ??? voathai.com ??????? voatibetan.com Tibetan voatibetanenglish.com South Asia ????? voabangla.com ??? darivoa.com ???? pashtovoa.com ?? ?? ?? ???? ????? voadeewaradio.com ???? urduvoa.com Africa Afaan Oromoo voaafaanoromoo.com ???? amharic.voanews.com Fran?ais lavoixdelamerique.com Hausa voahausa.com Kinyarwanda radiyoyacuvoa.com Kirundi radiyoyacuvoa.com Ndebele voandebele.com Portugu?s voaportugues.com Shona voashona.com Soomaaliga voasomali.com Kiswahili voaswahili.com ???? tigrigna.voanews.com Zimbabwe voazimbabwe.com Lets stick with the facts. Two men went into that street, one is alive, and the one not there does not have sufficient facts left behind. Even though Zimmerman went down that road, there is not sufficient evidence to say what he did broke the law. There is doubt about Trayvon, and there is doubt about Zimmerman. So we err on the side of life and freedom. Tough but true. All the great lawyers are saying this case should never have gone to trial. The death of a child is a travesty for a family, but there were choices made by Trayvon that he is living with. Lets not forget that Zimmerman will pay for his actions, if they were not fair equitable and right. You cannot run away from yourself. Personally I have no clue what happened in that street, but even after the trial, the court does not know definitively either. Please stay away from the race issues, that is not what this is about. The death of a child is the death of a child, don't steer away from the facts. The transcripts show that Zimmerman speculated about Trayvon's race when the was at a distance ...I think he's black and shortly thereafter confirmed his suspicion, while ending a later comment ...and he's black. These repeated references to Trayvon's race while assessing his possible criminal motivations is clearly, undeniably proof that race was INDEED a factor in Zimmerman's judgment! Also, photos of the back of Zimmerman's head showed dried trickles of blood and the absence of pressure bandages; this proves that the bleeding was superficial capillaries , that no blood vessels of any import were damaged or pressure WOULD have been necessary to stem the bleeding and much larger patches of blood would be present on Zimmerman's scalp and hair, as well as his neck area - not the small, dried trickles that WERE evident . This minor trauma could be expected for someone with short hair receiving even light contact on as abrasive concrete surface, but there is no indication here - or other evidence submitted - to show that Zimmerman sustained serious trauma to the back of the head.It appears that Trayvon, exercising HIS right of self-defense, was defending himself too well for his opponent, an adult who vastly out-weighed him but took the coward's way out - bringing a gun to a fist-fight with a child, and using it.