As more than a hundred people gathered in the shade by the federal courthouse to protest the verdict in the George Zimmerman murder trial, the Rev. Jamal-Harrison Bryant traced a line between the shooting in Florida and the violence that has claimed the lives of scores of black men in Baltimore this year. It would be hypocritical for us to come on this corner and cheer and shout and wave signs for Trayvon Martin and remain silent for the 120 black babies in Baltimore who have been killed with no rally, Bryant told the crowd. If in fact we really value life, it cannot just be a life in Sanford, Florida; it got to be lives on North Avenue. ... Every life has got to be of some value. The rally Saturday in Baltimore was among dozens held in cities around the country in a bid to keep up pressure on U.S. Department of Justice, which is weighing federal charges in the shooting death of Martin. Among the demonstrations, Martin's mother, Sybrina Fulton, protested in New York, while his father, Tracy Martin, was in Miami. A Florida jury found Zimmerman, a neighborhood watchman, not guilty of murder and manslaughter in a verdict delivered last weekend. The Justice Department confirmed Monday that its civil rights unit, whose outgoing head is former Maryland labor secretary Thomas E. Perez, and the FBI have an active investigation. Bryant had been involved in the case since before it attracted widespread attention, pushing prosecutors in Florida to bring charges and appearing on stage with Fulton and Tracy Martin when they were filed last year. He described Fulton as really emotionally spent after the verdict, but wants to move forward and build something positive in the wake of her son's death. But those who addressed the crowd in Baltimore over the sound of a police helicopter flying above also said the issue was greater than any single case and came down to how black men are treated in society. Asked about the similarities between the Martin case and the violence in Baltimore where an overwhelming number of both victims and perpetrators are African-American, Bryant returned to that theme. It speaks to in a large way the lowering of black life by people who are outside of the race and regrettably and embarrassingly even for people who are within the race, Bryant said in an interview. And pointing to theorizing about how Zimmerman's case might have been handled differently were he black or where Martin white, Bryant asked another question. The issue I'm raising is what would our response have be if George Zimmerman was black and Trayvon was black? We cannot just raise outrage ? when the crime is perpetrated by someone outside of the race. The rally began slowly around noon, but the crowd swelled as community leaders including union head Glenard S. Middleton, state's attorney candidate Marilyn Mosby and youth activist Farajii Muhammad spoke. The march was led by the youngest members of the crowd, including Jayleon Robinson, 14, and his friend Kiandre Murphy, 14. Robinson said Martin's death was a reminder that people of his generation watch our backs to make sure they are treated fairly by the law. Otherwise that's like saying people can kill us and they can get away with it, he said.