Updated 10:30 a.m. ET LOS ANGELES Protesters ran through Los Angeles streets Monday night, breaking windows, attacking people on sidewalks and at one point raiding a Wal-Mart store, while others blocked a major freeway in the San Francisco Bay Area in the third night of demonstrations in California over George Zimmerman's acquittal in Florida in the shooting death of Trayvon Martin. Thirteen people were arrested after multiple acts of vandalism and several assaults in Los Angeles' Crenshaw District, Mayor Eric Garcetti and Police Chief Charlie Beck said at a news conference. Garcetti and Beck didn't elaborate on the assaults or any injuries, but at least one man could be seen in the street with a head wound. More than 300 officers were called to the scene and were at first slow to directly engage protesters in an attempt to allow a peaceful end to the demonstration, Beck said. But the chief said police would take a much stricter posture in coming nights. This will not be allowed to continue, Beck said. Several hundred mostly peaceful protesters gathered Monday night at Leimert Park southwest of downtown LA, many of them chanting, praying and singing. But a smaller group of between 100 and 150 people splintered off and began blocking traffic on nearby Crenshaw Boulevard, some of them jumping on cars and breaking windows at liquor stores and fast food outlets. Several protesters ran into a Wal-Mart store, where they knocked down displays before store security chased them out, and police began guarding the door. Erika Williams was shopping with her mother when the protesters burst in and security briefly locked down the store. We thought we were going to be stuck in there, Williams said. We saw the merchandise all thrown around. They had pulled the rack down, and there was merchandise all over the floor. TV news helicopters showed some people kicking and punching others along the street, including two people sitting on a bus bench. Police declared the gathering an unlawful assembly about three hours after it began, and most of the crowd left the street. Garcetti, who returned early from an East Coast trip because of the demonstrations, praised the overwhelming majority who protested peacefully. We are a better city than what we have seen tonight in the hands of a few people, the mayor said. It was the third day of protests in L.A. since the verdict was announced, points out CBS L.A. station KCBS-TV. At least one person was injured and police made nine arrests in Oakland in related protests. Newspapers report that a waiter guarding windows at a restaurant was hit in the face with a hammer late Monday night, and protesters threw fireworks at police in riot gear. Police deployed flash-bang grenades. Police spokeswoman Johnna Watson says the arrests were for crimes including assault with a deadly weapon and vandalism. The Oakland Tribune reports that the waiter's co-workers were helping him ice his head as they waited for an ambulance. Witnesses told the newspaper that a protester was also injured after being struck by a police projectile. Police did not immediately respond to a request to confirm or deny that report. Also in Oakland, dozens of demonstrators briefly blocked all lanes of Interstate 880 at the tail end of rush hour, stopping traffic in both directions for several minutes before lanes were cleared by authorities. Several protesters laid their bicycles on the ground in front of stopped cars. You've got to go. You will go to jail, one police officer shouted at demonstrators who were blocking traffic, the Oakland Tribune reported. However, police decided not to make arrests as the marchers, chanting Justice for Trayvon Martin, were directed back to surface streets. Later, another group tried to march up the onramp to Interstate 580 before being turned away by Oakland police and California Highway Patrol officers. The freeway protesters had broken off from a larger group organized via social media that gathered at Oakland City Hall about an hour earlier. Over the weekend, demonstrators in Oakland and Los Angeles blocked traffic and clashed with police in protests over a Florida jury's acquittal of neighborhood watch volunteer Zimmerman in the shooting death of the unarmed black teenager. Police shot beanbag rounds and arrested six people -- including one on suspicion of assaulting an officer -- while breaking up relatively small demonstrations before dawn. No injuries were reported to either demonstrators or officers. Most demonstrations around the state were peaceful. Democratic Sen. Barbara Boxer sent a letter Monday to U.S. Attorney General Eric Holder supporting the Justice Department decision to review the case to determine whether Martin's civil rights were violated. I respect the fact that the jury has spoken ... but I don't think this should be the last word, Boxer wrote in the letter. Peaceful demonstrations were held in other cities across the nation Monday, including Atlanta, Houston and Charleston, S.C.