NEW YORK ? With chants and prayers, sermons and signs, outrage over a jury?s decision to clear George Zimmerman in the shooting of an unarmed black teenager poured from street protests and church pulpits Sunday amid calls for federal civil rights charges to be filed in the case. Demonstrations large and small broke out across the country ? ranging from a few dozen to several hundred ? in support of the family of Trayvon Martin as protesters decried the not-guilty verdict as a miscarriage of justice. The NAACP and protesters called for federal civil rights charges against Zimmerman, who was acquitted Saturday in Martin?s February 2012 shooting death, which unleashed a national debate over racial profiling, self-defense and equal justice. Meanwhile, President Barack Obama and religious and civil rights leaders urged calm in hopes of ensuring peaceful demonstrations in the wake of a case that became an emotional flash point. In New York City, hundreds of protesters marched into Times Square on Sunday night, zigzagging through Manhattan?s streets to avoid police lines. Sign-carrying marchers thronged the busy intersection, chanting ?Justice for! Trayvon Martin!? as they made their way from Union Square. In San Francisco and Los Angeles ? where an earlier protest was dispersed with beanbag rounds ? police closed streets as protesters marched to condemn Zimmerman?s acquittal. Only sadness Rand Powdrill, 41, of San Leandro said he came to the San Francisco march with about 400 others to ?protest the execution of an innocent black teenager.? ?If our voices can?t be heard, then this is just going to keep going on,? he said. At Manhattan?s Middle Collegiate Church, many congregants wore hooded sweatshirts ? the same thing Martin was wearing the night he was shot. Hoodie-clad Jessica Nacinovich said she could only feel disappointment and sadness over the verdict. ?I?m sure jurors did what they felt was right in accordance with the law but maybe the law is wrong, maybe society is wrong; there?s a lot that needs fixing,? she said. At a youth service in Sanford, Fla., where the trial was held, teens wearing shirts displaying Martin?s picture wiped away tears during a sermon at the St. Paul Missionary Baptist Church. About 200 people turned out for a rally and march in downtown Chicago, saying the verdict was symbolic of lingering racism in the United States. Maya Miller, 73, said the case reminded her of the 1955 slaying of Emmitt Till, a 14-year-old from Chicago who was killed by a group of white men while visiting Mississippi. Till?s killing galvanized the civil rights movement. ?Fifty-eight years and nothing?s changed,? Miller said. Dallas group In Dallas, about 200 people gathered Sunday evening outside City Hall to decry the verdict. The protesters took turns airing their grievances on a megaphone before marching around the grounds and reciting chants. Community activist Olinka Green, 44, said she wanted to protest partly because she took Martin?s death and the jury?s decision personally. ?It?s a deep hurt ? a hurt only a mother could feel,? she said. In Miami, more than 200 people gathered for a vigil. ?You can?t justify murder,? read one poster. Another read: ?Don?t worry about more riots. Worry about more Zimmermans.? Carol Reitner, 76, of Miami said she heard about the vigil through an announcement at her church. ?I was really devastated. It?s really hard to believe that someone can take the life of someone else and walk out of court free,? she said. In Philadelphia, about 700 protesters marched from LOVE Park to the Liberty Bell, alternating between chanting Trayvon Martin?s name and ?No justice, no peace.? ?We hope this will begin a movement to end discrimination against young black men,? said Johnathan Cooper, one of the protest?s organizers. ?And also to empower black people and get them involved in the system.? Civil rights leaders, including the Revs. Jesse Jackson and Al Sharpton, urged peace in the wake of the verdict. Jackson said the legal system ?failed justice,? but violence isn?t the answer. But not all the protesters heeded those calls in the protests the broke out immediately after the verdict. In Oakland, Calif., angry demonstrators broke windows, burned U.S. flags and started street fires. Some marchers also vandalized a police squad car and spray-painted anti-police graffiti on roads and Alameda County?s Davidson courthouse. In Los Angeles, police said a crowd of about 100 protesters surrounded an officer and had to be dispersed by officers firing beanbag rounds. Verena Dobnik, The Associated Press, Tristan Hallman, staff writer