Nationwide protests ignited in US following the acquittal of George Zimmerman, who shot and killed Trayvon Martin, 17, out of apparent self-defense. Demonstrators have been burning flags, smashing windows and police cars. Follow RT's LIVE UPDATES on Zimmerman verdict fallout.? People are expressing themselves on the streets from Los Angeles to New York following the ?not guilty? decision handed down in the court case, which has gripped the nation for the past three weeks. Crowds of several hundred people assembled on the streets in reaction to the Zimmerman verdict have been reported across the United States, including in San Francisco, Washington, DC, New York and Chicago. Los Angeles police even issued a citywide tactical alert after about 200 protesters gathered in Leimert Park, LA Times cited police authorities as saying. US President Barack Obama has urged Americans to respect the verdict of the jury which cleared George Zimmerman of the murder of Trayvon Martin. ?I know this case has elicited strong passions. And in the wake of the verdict, I know those passions may be running even higher. But we are a nation of laws, and a jury has spoken,? the president said in a statement. Meanwhile, protesters in Oakland, CA had smashed windows and there have also been reports of small fires burning around the city, as well as police vehicle damaged. In Chicago, protesters marched with signs and shouted: ?Who killed Treyvon Martin? The whole damn system?? One user of social media noted the ?diversity? of the individuals on the streets, which may be a key element if any sort of large-scale violence - prompted by the belief that Zimmerman was exonerated on the basis of race considerations - is to be avoided. ? Zimmerman was charged with murder about two months after the killing by a special prosecutor appointed by the state.The case carries a lot of racial tensions since police initially refused to charge Zimmerman, who is white and Hispanic. Martin was a black teen, aged 17. About 100 demonstrators gathered outside the Sanford, Florida courthouse since the jury began their deliberations on Friday, shouting slogans, waving placards and entering heated debate with one another about the case.?? Further protests are planned across the country for Sunday. We're going to raise our voices against the root causes of this kind of tragedy, Rev. Jacqueline Lewis of Middle Collegiate Church in New York told her congregation. The six-person jury - comprised of five white women and one black woman ? spared Zimmerman, 29, from second-degree murder or manslaughter charges in the death of the black teen. Zimmerman said he shot Trayvon, 17, in self-defense after being attacked. State prosecutors, however, claim Zimmerman 'race-profiled,' trailed and murdered the teen on the night of Feb. 26, 2012.