CAIRO -- The armed forces ousted Egypt's first democratically elected president Wednesday after just a year in power, installing a temporary civilian government, suspending the constitution and calling for new elections. Islamist President Mohammed Morsi denounced it as a full coup by the military. After the televised announcement by the army chief, millions of anti-Morsi protesters in cities around the country erupted in delirious scenes of joy, with shouts of God is great and Long live Egypt. Fireworks burst over crowds dancing and waving flags in Cairo's Tahrir Square, epicenter of the 2011 uprising that ousted autocrat Hosni Mubarak. Now it was one of multiple centers of a stunning four-day anti-Morsi revolt that brought out the biggest anti-government rallies Egypt has seen, topping even those of 2011. But the move potentially throws the country into further confrontation. Moments after the army statement, a statement on the Egyptian president's office's Twitter account quoted Morsi as saying the military's measures represent a full coup categorically rejected by all the free men of our nation. Morsi has insisted his legitimacy as an elected president must not be violated or Egypt could be thrown in to violence. Some of his Islamist backers, tens of thousands of whom took to the streets in recent days, have vowed to fight to the end. Down with the rule of the military, some of them chanted after the army announcement, reviving a chant used by leftist revolutionaries during the nearly 17 months of direct military rule that followed Mubarak's removal. The army has insisted it is not carrying out a coup, but acting on the will of the people to clear the way for a new leadership. In his speech, army chief Gen. Abdel-Fattah el-Sissi said the chief justice of the Supreme Constitutional Court would step in as interim president until new elections are held. He would be sworn in judges of his court, el-Sissi said. A government of technocrats would be formed with full powers to run the country. El-Sissi spoke while flanked by the country's top Muslim and Christian clerics as well as pro-reform leader Mohammed ElBaradei and two representatives of the youth opposition movement behind the wave of protests. He promised not to exclude anyone or any movement from further steps. But he did not define the length of the transition period or when presidential elections would be held. He also did not mention any role for the military. The constitution, drafted by Morsi's Islamist allies, was temporarily suspended, and a panel of experts and representatives of all political movements will consider amendments. He did not say whether a referendum would be held to ratify the changes, as customary. Seeking to avert a destabilizing backlash, he warned that the armed forces, police will deal decisively with violence. After the 9:20 p.m., the Brotherhood's TV station went blank Shortly before the 9: 20 p.m. announcement, the army deployed troops, commandos and armored vehicles in cities around the country. In Cairo, they stationed on bridges over the Nile River and at major intersections. They also surrounded rallies being held by Morsi's supporters -- an apparent move to contain them. Travel bans were imposed on Morsi and top figures from his Muslim Brotherhood including its chief Mohammed Badie and his powerful deputy Khairat el-Shater. At least 39 people have been killed in clashes since Sunday, when the mass protests against Morsi began -- hiking fears that greater violence could erupt when the final move was made against him. Street battles in the Nile Delta city of Kafr el-Sheikh on Wednesday left at least 200 people injured. The army's move is the second time in Egypt's 2 1/2 years of turmoil that it has forced out the country's leader. It pushed out Mubarak and took power itself. This time, however, its removal of an elected figure could be more explosive. Elected with 51.7 percent of the vote in last year's presidential election, Morsi took office vowing to move beyond his roots in the Muslim Brotherhood. But his presidency threw the country into deep polarization. Those who took to the streets this week say he lost his electoral legitimacy because he tried to give the Brotherhood and Islamist allies a monopoly on power, pushed through a constitution largely written by his allies and mismanaged the country's multiple crises. Now we want a president who would really be the president of all Egyptians and will work for the country, Said Shahin, a 19-year-old protester in Tahrir, said, falling to the ground to pray as soon as el-Sissi spoke. Mahmoud Badr, spokesman for Tamarod, or Rebel -- the youth movement behind the rallies -- praised the crowds in the streets saying, they succeded in putting your revolution back on track. Let's start a new page, a new page based on participation, he wrote on his Twitter account. Our hand is extended to all Morsi and his allies say the opposition never accepted their appeals for dialogue -- seen by opponents as empty gestures -- and that Mubarak loyalists throughout the government sabotaged their attempts to bring change. The military had issued an ultimatum on Monday giving Morsi 48 hours to find some solution with its opponents. Any deal, however, was a near impossibility, making it inevitable the military would move. Earlier in the day, el-Sissi met with ElBaradei, Egypt's top Muslim cleric -- Al-Azhar Sheik Ahmed el-Tayeb -- and Coptic Pope Tawadros II, as well as youth representatives and some members of the ultraconservative Salafi movements. The consultations apparently aimed to bring as wide a consensus as possible behind the army's moves. But the Brotherhood boycotted the session, its political arm the Freedom and Justice Party said. In a last-minute statement before the deadline, Morsi again rejected the military's intervention, saying abiding by his electoral legitimacy was the only way to prevent violence. He criticized the military for taking only one side. One mistake that cannot be accepted, and I say this as president of all Egyptians, is to take sides, he said in the statement issued by his office. Justice dictates that the voice of the masses from all squares should be heard, he said, repeating his offer to hold dialogue with his opponents. For the sake of Egypt and for historical accuracy, let's call what is happening by its real name: Military coup, Morsi's top foreign policy adviser Essam al-Haddad wrote on his Facebook page.