?The United States is monitoring the very fluid situation in Egypt, and we believe that ultimately the future of Egypt can only be determined by the Egyptian people,? Obama said in a statement. ?Nevertheless, we are deeply concerned by the decision of the Egyptian Armed Forces to remove President Morsy and suspend the Egyptian constitution. ?I now call on the Egyptian military to move quickly and responsibly to return full authority back to a democratically elected civilian government as soon as possible through an inclusive and transparent process, and to avoid any arbitrary arrests of President Morsy and his supporters. Given today?s developments, I have also directed the relevant departments and agencies to review the implications under U.S. law for our assistance to the Government of Egypt.? The U.S. gives Egypt about $1.5 billion in annual aid, of which $1.3 billion is in the form of military assistance. Much of the aid is required by the 1979 peace treaty with Israel but U.S. law bars funding for countries that are ruled by the military. The Egyptian army says it hasn't conducted a coup but rather is helping midwife a civilian transition with the support of the political opposition and Muslim and Coptic leaders. The army met with opposition leader Mohamed ElBaradei for emergency consultations Wednesday morning as the deadline to its ultimatum approached. The top Republican on the Senate Foreign Relations Committee, Sen. Bob Corker R-Tenn. , vowed to work with the administration to tweak U.S. foreign aid laws so the administration can continue to exercise influence with the Arab world's most powerful military force. ?In determining the future of U.S. assistance, the administration should look at the regional picture with our vital national security interests in mind. ?Our long-standing cooperation with Egypt, which is essential for stability in the region, should remain a priority. ?If necessary, I believe Congress would stand ready to work with the administration to address any restrictions that stand in the way.?? But Sen. Patrick Leahy D-Vt. , chairman of the Senate budget panel with jurisdiction over foreign aid, said U.S. law mandates military aid be cut off. ?Egypt's military leaders say they have no intent or desire to govern, and I hope they make good on their promise,? he said. ?In the meantime, our law is clear: U.S. aid is cut off when a democratically elected government is deposed by military coup or decree. ?As we work on the new budget, my committee also will review future aid to the Egyptian government as we wait for a clearer picture. As the world's oldest democracy, this is a time to reaffirm our commitment to the principle that transfers of power should be by the ballot, not by force of arms.? Egypt Revolution II - Live updates: Morsi ousted; head of constitutional court to take over Egypt presidency. Protesters at the presidential palace reacted with jubilation to the news that Mohamed Morsi has been forced from power Live updates: Morsi ousted; head of constitutional court to take over Egypt presidency. Military statement suspends constitution, puts in place new caretaker government; Egyptian army deploy around Cairo, Alexandria. Islamic TV channels off air, police arrest crews. US declines to criticize Egypt's military following Morsi ouster Egypt military deploys across country 23:30 That's it from the live updates today. Some sporadic violence is being reported in Egyptian governorates, with four people confirmed dead, but in Cairo things are still peaceful. The mood in Tahrir Square and at Ittihadiya presidential palace is jubilant - although the campaigns against sexual harassment are warning on Twitter that sexual assaults are taking place in Tahrir. 23:25 More clashes being reported outside Cairo. There is violence in Kafr El-Sheikh in the Nile Delta, which has led to 118 injured so far, Ahram Arabic reported two hours ago. Clashes between opposition and Morsi supporters started at 7pm. Forty-three Morsi supporters taking part in the clashes were arrested for illegal possession of weapons. Despite the clashes, cheering crowds flooded the streets of Kafr El-Sheikh immediately after El-Sisi?s statement. 23:20 The clashes in Marsa Matrouh seem to have worsened. The city, on the western part of Egypt?s Mediterranean coast, is known to be an Islamist stronghold. Health ministry officials confirmed that 4 people have died in the violence and 13 are injured. According to an Ahram correspondent based in the city, Morsi supporters attacked the governorate headquarters after El-Sisi's statement, leading to clashes. 23:10 Ahram Online's Bassem Abou El-Abbas is at the Rabaa Al-Adawiya pro-Morsi sit-in in Cairo. He says the mood is angry but not violent; the area is surrounded by troops who are not allowing anyone to enter or leave the sit-in. Eyewitnesses told El-Abbas that after the military's announcement, three cars' windows were smashed, but that seems to be the extent of the violence. He says that the army which is surrounding the protest is not allowing anyone to enter or leave the sit-in. 23:00 A celebratory statement has been released by revolutionary group the April 6 Youth Movement which hails the role of the military. The statement said that ousting Morsi is a continuation of the January 25 revolution. The youth group called on everyone to ?recognise the importance of cooperation for the sake of the country and to avoid the mistakes of the past such as monopolising decision making.? It also called on people to maintain peacefulness and avoid any bloodshed or incitement. The group also highlighted the importance of the role of the armed forces in keeping Egypt united and hailed it for not involving itself in political life. 22:50 We're getting reports of some violence in governorates outside Egypt. MENA reports that there are clashes between pro-Morsi groups and army forces in the governorate of Marsa Matrouh on the north coast. 22:40 Bashar Al-Assad, president of Syria, has said that events in Egypt are the fall of what is called political Islam, reports Reuters. Morsi and the Muslim Brotherhood had been vocal?opponents?of the Syrian president, calling for foreign intervention against him. 22:35 Head of the High Constitutional Court Adly Mansour will take the oath of office on Thursday, becoming Egypt's new president. 22:30 The 'Rebel' campaign, the anti-Morsi signature drive that called for the nationwide protests that led to his ouster, invited the youth of the Muslim Brotherhood in a Facebook statement, to rejoin to the lines of the people and not to be driven by calls for violence or terrorism. 22:15 Live footage shows thousands of Morsi's supporters gathered in front of Cairo University to protest the army's announcement. Yasser Soliman, a supporter of Morsi, said the military's announcement is an implicit call for civil war. 22:10 Nader Bakkar, spokesperson of the Salafist Nour Party, says on his official Twitter account that his party has taken part in setting the new transition roadmap which removed Morsi from the presidency. Leading Freedom and Justice Party member Islam Abdel-Fattah responded to Bakkar?s statement calling the Salafist Party traitors. The Nour Party, formerly allies of Morsi and the Brotherhood, have distanced themselves in recent months. 22:00 The interior ministry has released a statement upholding the army's announcement. The statement says that the army's roadmap fulfills the people?s will and their interests and stressed that the police stand by the armed forces in efforts to achieve the country?s security and stability. There has clearly been a lot of coordination between the military and the police over recent days, as shown in supportive statements like these. 21:55 The Islamist-run television channels that were taken off air were apparently also evacuated by police, reports Ahram Arabic. Police forces went to the Media Production City in Cairo's 6 October satellite city, where the offices and studios of these channels are located, and evacuated them. The police also arrested some of the staff working for these channels. 21:52 Mohamed Morsi has announced on the official Facebook page of the presidency that the announcement made by the armed forces is a coup and that he rejects it. He said that as president and head of the armed forces he calls on all civil and military citizens to abide by constitution and law and not respond to the coup. 21:50 The official website of the Muslim Brotherhood, Ikhwan Online, writes that the military?s announcement is a conspiracy against legitimacy, a military coup that wastes popular will and brings Egypt back to despotism. The statement continued: Religious scholars condemn the coup and affirm the necessity of upholding the elected president. Symbols of the defunct regime are coming back to the scene at the expense of the blood of the martyrs of the 25 January. The website also reported that armed forces, deployed a few hours ago around Rabaa Al-Adawiya Mosque, are personally searching everyone getting into the pro-Morsi sit-in and preventing people from chanting in support of Morsi except after they?re inside the square. 21:34 The head of Egypt's High Constitutional Court, the most senior Egyptian court, is Adly Mansour. He was promoted to the position in June. 21:32 Attendees at the press conference where El-Sisi gave his speech included a number of top military and police officials who sat in two rows on either side of the podium; the Coptic Orthodox patriarch Tawadros II; the grand imam of Al-Azhar, Ahmed El-Tayyeb; ElBaradei; a representative of Nour Party; Mohamed Abdel-Aziz, one of the anti-Morsi Rebel campaign's founders;?and a senior judicial figure. 21:30?Liberal politician Mohamed ElBaradei spoke at the army-held press conference. He says the roadmap drawn up by the military will guarantee the fulfillment of Egyptians' main demand ? early presidential elections. 21:28?The grand sheikh of Al-Azhar said that he supported the call for early presidential elections based on an Islamic precept that the better of two evils is a religious duty,. Accordingly, those gathered decided to hold early presidential elections, their fairness guaranteed by the judiciary, the armed forces and the police. 21:25 The Brotherhood's FJP just tweeted history will tell that the first decision of the military coup, in which the advocates of democracy participated, is putting off air all opposition channels, a reference to the Brotherhood's channel and other Islamist owned channels being blacked out after El-Sisi's announcement. 21:22 At the press conference where El-Sisi spoke a few moments ago, Grand Imam of Al-Azhar, Ahmed El-Tayyeb, is speaking, followed by Coptic Orthodox Patriarch Tawadros II.? 21:20 It looks like several other Islamist-run channels including Hafez and Al-Nas are off air. 21:18 The Morsi supporters in their thousands at Rabaa Al-Adawiya are defiant. 21:15 El-Sisi's speech specified that the constitution will be suspended temporarily; the head of the High Constitutional Court will take over the presidency and have power until early presidential elections, that will be followed by parliamentary elections - dates as yet unspecified - and there will be a national technocratic cabinet formed. ?A parliamentary elections law will be reviewed by the HCC to stage parliamentary elections; there will be?a committee formed to amend controversial articles in the temporarily suspended constitution; there will be a media code of ethics to?guarantee the media?s professionality; and a committee for national reconciliation will be formed. 21:12 It looks like Misr 25, the Egyptian Brotherhood-run television channel, is off air. 21:10 The speech is over. There are massive celebrations going on at anti-Morsi rallies in Tahrir Square and Ittihadiya presidential palace in Cairo. 21:06 El-Sisi continues: We met with the Egyptian president on 30 June, 2013, during which we rejected any threat to the Egyptian people. However, the president's address did not live up to the expectations of the Egyptian people. So we called for a meeting involving different parties, without excluding anyone. 21:04 Some initial quotes from the speech by the head of Egypt's military: 21:02 Here we go. Chief of Egyptian armed forces, Abdel-Fattah El-Sisi, is speaking live on Egyptian television.? 20:55 Another statement by an opposition group, clearly anticipating an announcement that meets their demands. The 30 June Coordinating Committee, a coalition of anti-Morsi groups, releases a statement refusing any foreign pressures exerted on the armed forces to pull it away from the popular movement and portray its stance as a coup. It also rejects attempts by the Muslim Brotherhood and its allies to abort the ?popular revolution? which went to the streets in the millions. The statement declared its rejection of what it describes as the US standing by the Muslim Brotherhood for its own interests. The current unprecedented popular movement is a continuation of the January 25 revolution, the statement asserted, and ?will achieve its goals of justice and dignity by the struggle of its people?. ?We call on national forces to remain united in its path in the face of any attempt to divide? the statement read. 20:50?A presidential source tells Ahram Arabic that President Mohamed Morsi was informed by the army at 7pm that he is no longer president. 20:45 The Watan Party, a Salafist grouping which is part of the pro-Morsi National Alliance for Supporting Legitimacy, seem to be sticking with the president. The Brotherhood?s news site, Ikhwan Online, reports that head of the Watan Party and Morsi aide Emad Abdel-Ghafour has said that the people ?will not allow any coup against the legitimacy of the president.? 20:40?The moderate Islamist grouping the Strong Egypt Party, led by former Muslim Brotherhood figure Abdel-Moneim Abu-Fotouh, said on its official Twitter page that it rejects any attempts by the army to interfere in managing the political process and that it also rejects the exclusion of any political faction from public life. 20:35?Several rights organisations in Egypt have released a statement on Wednesday declaring their respect for the 30 June uprising and urging that the law must be the basis for resolving the current political situation. The statement criticised the Muslim Brotherhood for undermining rights and liberties, and said that the organisation?s speech had ?inflamed political and ideological polarisation, stigmatised opponents of their political project as 'infidels' and made them the targets for violence.? The statement also criticised the violence used against the Brotherhood over recent days, including the attacks on their supporters and offices, but said that these violent acts would not have been committed if the Brotherhood and their allies had not attempted to ?suppress their political opponents? and maintained ?an utter lack of accountability for acts of violence, torture, and murder committed by Muslim Brotherhood supporters.? The statement also called on security forces, including the military, to protect demonstrators and ?act decisively? with any person attacking demonstrations regardless of political affiliation. Finally, the groups demanded that any new political roadmap should guarantee civil liberties, and should lead to constitutional amendments. The statement?s signatories include the Cairo Institute for Human Rights Studies, the Arabic Network for Human Rights Information, the Egyptian Organisation for Human Rights, the Hisham Mubarak Law Center, and a number of others. 20:30?Maha Abou Bakr, a senior member of the anti-Morsi ?Rebel? campaign, tells Ahram Arabic that the group has suggested Mohamed Ghoneim, a founding member of the Egyptian Social Democratic Party, to head the national coalition government that they expect to be formed following Morsi?s ouster. Bakr further added that the movement has nominated leftist politician Hossam Eissa to be one of two deputy prime ministers, suggesting that the second deputy be a member of the Islamist current. 20:20?Egypt?s military spokesman Ahmed Ali has said on his official Facebook page that the meeting between the army?s commander-in-chief Abdel-Fattah El-Sisi and the religious and national groups has ended. A statement revealing meeting?s outcome will be coming within the hour. 20:15?Fireworks are lighting up the sky in the streets near to Ittihadiya presidential palace, reports Ahram Online?s Bel Trew. ?People are singing and dancing, and some are holding posters of military figures chanting ?the heroes are here,? ? adds Trew. 20:10?Mohamed El-Beltagy, deputy head of the Freedom and Justice Party, gave an angry statement to Al Jazeera English from the pro-Morsi rally Rabaa Al-Adawiya Square. El-Beltagy condemned the military?s statement and rejected the army?s interference in the political crisis. 19:50 More on the US: AFP reports that US Defense Secretary Chuck Hagel spoke to Egyptian defence minister and head of the armed forces, Abdel-Fattah El-Sisi, yesterday. AFP says that: The US State Department press conference is still ongoing. Spokesperson?Jen Psaki says that the US is on the side of the Egyptian people and that Morsi should call for an end to violence. 19:40 At a press conference, a US State Department spokesperson says that the United States is very concerned about the situation in Egypt. The situation in Egypt remains fluid, and the United States cannot confirm whether a military coup is underway, department spokesperson Jen Psaki told reporters. We do ... remain very concerned about what we're seeing on the ground, Psaki said. 19:30 The military are not just deploying in Cairo; Ahram Arabic reports 20?armoured vehicles and solider carriers have been deployed in the vicinity of a local mosque in Suez where Morsi's supporters are rallying. A number of military helicopters are hovering over the city and the Suez Canal In Sinai, Egyptian security forces have been on high alert along the borders since the morning, according to Ahram Arabic. Security measures have also been tightened up near the tunnels into Gaza and around security installations in the deserted peninsula. 19:24 Ninety-three Egyptian?diplomats, some based in the ministry of foreign affairs headquarters in Cairo and some based abroad, have declared a strike, reports state agency MENA. The diplomats object to the ?failure of the president to meet the people?s demands.? The minister of foreign affairs resigned yesterday. 19:20?The pro-Morsi coalition, the National Alliance to Support Legitimacy, will hold a press conference on the latest developments tonight at 10pm in Al-Rabaa Al-Adawiya, according to the Muslim Brotherhood?s Twitter account @Ikhwanweb. 19:10 The official spokesman of the armed forces, Colonel Ahmed Ali, vehemently denies that the troops currently deployed in Cairo have attacked pro-Morsi protesters, who are camping out at Rabaa Al-Adawiya Mosque in Cairo's Nasr City district. He said that some people had claimed that the army had attacked the rally in phonecalls to CNN. 19:00?At least ten people have been injured in clashes between supporters and opponents to President Morsi in Al-Shohada Square in the Nile delta governorate of Kafr El-Sheikh, reports Ahram Arabic. The injuries were reportedly caused by bird shot and bladed weapons. The injured have been transferred to local hospitals. 18:55?Military sources have told Ahram Arabic that a large number of military armoured vehicles are now deployed in the vicinity of the Ittihadiya presidential palace, the nearby Rabaa Al-Adawiya Mosque, and the iconic Tahrir Square, where rallies are being staged. The interior ministry?s Central Security Forces are also stepping up their presence around Tahrir Square and at key state institutions. 18:50 Lots of reports of army deployments around Cairo now. Alastair Beach of UK daily the Independent is tweeting pictures of troops being deployed close to Cairo University in Giza, the site of yesterday's clashes, including along the Nile Bridge connecting Giza and Cairo. There are also now reportedly troops deployed in Tahrir Square and at the Rabaa Al-Adawiya pro-Morsi rally. 18:45?Military sources have told Ahram Online that the meeting being held between the leaders of the armed forces and political, religious and national groups is over and a statement will be released shortly. 18:40?Around a hundred Turkish protesters have gathered in Istanbul to voice their support for Egyptian President Mohamed Morsi, reported state-owned news agency MENA. The protest was reportedly led by the ?zg?r-Der, a Turkish rights group. 18:35?Protests in the Nile Delta are still going strong, with hundreds of thousands rallying in iconic Thawra Square in the city of Mansoura in Daqahliya, Ahram Arabic reports. The people already brought down the regime, protesters chanted. Mansoura will turn you back into a banned group, went another in reference to the fact that the Muslim Brotherhood was forced to operate underground under former president Hosni Mubarak. 18:15 Egyptian security forces have imposed a travel ban on President Morsi, Muslim Brotherhood chief Mohammed Badie and his deputy Khairat Al-Shater over their involvement in prison escapes in 2011, security officials have told AFP news agency. 18:10 In anticipation of the military's statement, anti-Morsi protesters are crowding Tahrir Square and Ittihadiya presidential palace. Both spaces look full. Protesters across the town continue to blockade a number of state institutions, in the fourth consecutive day of their civil disobedience campaign. 18:30?An article on Ahram Arabic website quotes an anonymous source saying that the armed forces have extended their deadline in an effort to reach consensus and prevent further violence. The source explained that military leaders offered to postpone their statement for a few hours in order to cooperate on containing bloodshed and to guarantee the president's safety. The source denied that Morsi had been arrested or placed on house arrest, contrary to circulating rumours, stating that the Republican Guard is still protecting the president at the Republican Guard headquarters. According to the source, head of the military Abdel-Fattah El-Sisi told President Morsi: treachery is not part of the doctrine of the armed forces.? Apart from its judicial and financial dimensions, concluding these negotiations and paying compensation to the victims would have political consequences, which would speed up the normalization of bilateral relations with the exchange of ambassadors. When Israel apologized to Turkey on March 22, thanks to U.S. President Barack Obama?s personal engagement, many believed the process would be completed in less than four months and both countries would re-increase the level of diplomatic representation to the level of ambassador before July. But this did not happen, and both parties are trying hard to keep the issue on a low profile due to its sensitivity and potential reflections in their domestic political affairs. There are also a number of indications pushing those who are closely following this process to think that the so-called normalization will not be in sight in the near future either. This is especially the case following the Gezi Park protests, with senior government officials indirectly or directly accusing Israel and the Israel lobby of orchestrating the massive weeks-long rallies. From the many examples, this column will refer to two recent high-level statements to depict how the Turkish government links numerous internal developments to Israeli policies towards Turkey. Deputy Prime Minister Be?ir Atalay recently blamed foreign powers and the Jewish diaspora for triggering the unrest in Turkey, saying: ?There are some circles that are jealous of Turkey?s growth. They are all uniting, on one side the Jewish diaspora. You saw the foreign media?s attitude during the Gezi Park incidents.? It?s not to our knowledge why Atalay preferred to use definition of ?the Jewish diaspora? instead of ?Israeli lobby or Jewish lobby,? but obviously he gave the strongest evidence of anti-Semitism being nourished among the ruling party elites. His office issued a statement on Tuesday saying the deputy prime minister was misunderstood and that he did not mean that Jewish diaspora was behind the Gezi Park protests. Another most important statement came from the National Intelligence Organization M?T , which expressed its views and disturbances regarding accusations targeting its chief Hakan Fidan through an interview with a Turkish newspaper over the weekend:??This was the first time that a state [M?T officials later confirmed to Habert?rk that this state was Israel] reacted against the intelligence management of another state, officially declaring that it was against the appointment of Hakan Fidan as the head of the M?T,? the intelligence organization said. It said that in the wake of this statement from Israel, the M?T had become the target of consecutive unfair publications and attacks from inside Turkey. The leaking of secret talks with the PKK in Oslo, the Uludere incident in which 34 civilians were killed mistaken for terrorists, the downing of a Turkish jet by Syria, and terrorists attacks in?Reyhanl?, Gaziantep and elsewhere were all listed by the M?T as prominent examples of this smear campaign against Fidan. This represented perhaps the first time the M?T gave an interview to a newspaper, and again it was the first time that it cited a very deep disagreement with another country in the most public way. The interview is in fact a part of the ongoing internal power struggle in Turkey, but its inclusion of Israel in this equation was very remarkable.