The nuclear power plant at Fukushima has been leaking contaminated water into the ocean for the two years since the accident that saw three of the plants six reactors suffer a meltdown, according to the head of the Nuclear Regulation Authority in Japan... Tokyo Electric Power Tepco , the power plants operator, has constantly denied that any of that water has been leaking into the Ocean, but in the last few days it has switched its position and finally admitted that it can?t actually say for sure that the water is not leaking into the sea. Tepco has also admitted that the amounts of radioactive cesium, tritium, and strontium detected in groundwater around the plant has been growing, making the job of sealing the leaks even more urgent. Cesium and Strontium are especially dangerous to humans. Coming to a beach near you, if you live on the West Coast of our half of the world.? But of course, the power plant owners have spent two years denying that any radiation is leaking into the water.? And if the history of the nuclear industry is any guide, they will continue to lie their asses off, until people forget about the whole thing, and governments i.e. us pick up the tab.? The nuclear industry has been a curse since the day that it was created in the misguided minds of scientists who wanted desperately to believe that they hadn't spent their lives doing nothing but inventing the worst weapon in world history.? It's long past time to put an end to it.? All we would have to do is to make sure that people who operate nuclear power plants know that they will have to pay for all of the costs of their operation, and these cursed facilities will disappear overnight. Yoshida disobeyed and it was afterwards ascertained that he probably saved Japan from a fission chain reaction - which is a truckload worse news than a fuel meltdown, which is bad enough ? and what would likely have happened if it all had been left to corporate management. That same corporate management that - AS WE ALL KNOW - does EVERYTHING better than any government... Because greed is clearly the best motive for everything and regard for one?s fellow citizens?. Well that?s just dumb. Yoshida could have done more however? in 2011 a government-organized report yep that pesky ?government? thing again... an expert panel said there was a danger that a 10 meter plus tsunami could hit the plant, but Yoshida thought the danger unlikely. They have never solved the problem of what do we do with the waste. Nuclear energy waste is piling up in many states, no where to go, no one wants it. It will remain dangerous for thousands of years. Sweden figured out what to do with it, stop making it, Germany plans to do the same over the 20 years. The US though still believes the pollution bath we live in is not harmful, just ask industry, see, it's fine. The Great Lakes contain 95% of the fresh water in North America. It's enough water to cover the entire continent to the depth of five feet. The Great Lakes region is host to nearly 40 nuclear power reactors, several in the decommissioning stage, 9 of them situated around Lake Michigan An Advocate?s Field Guide to Protecting Lake Michigan, Alliance for the Great Lakes . Many of the reactors are nearing the end of their original licenses, but instead of being decommissioned, they are being re-licensed to run for several more decades. Nuclear power plants were originally licensed to operate for 40 years, but there has been a nationwide movement by government regulators and the nuclear power industry to extend the licenses well beyond that time period, even though the reactors are beginning to show signs of aging, raising considerable concerns about safety. 39 of the nation?s 103 nuclear reactors have already received 20-year extensions, while 12 others are in the process, including the Palisades Nuclear Power Plant in Covert Township, Michigan. The Nuclear Regulatory Commission has approved all applications to date. Last year, an extended license for the Cook Nuclear Power Plant in Bridgman, Michigan was approved. A pending 20-year re-licensing application for the Palisades Nuclear Power Plant is also expected to be approved this year. Where?s the public outcry? High-level radioactive wastes from the operation of Palisades since it began operation in 1971 are currently being stored in 29 massive concrete storage casks on the Lake Michigan shoreline. The plant will generate approximately 290 more tons of high-level radioactive wastes in 20 additional years with no national repository likely to be established to receive the wastes. The plan for transporting the wastes generated during the first license will involve barging up to 125 or more giant rail-sized containers of the wastes from Palisades to the Port of Muskegon, up along the Lake Michigan shoreline. Where?s the public outcry? Extended and new nuclear power generation is now being promoted as a ?clean? alternative to the use of fossil fuels. Nuclear reactors, including Palisades, are not clean, nor are they ?green.? They emit harmful radioactivity into the environment on a daily basis and generate long-lasting radioactive wastes. Further, nuclear power relies heavily on the use of fossil fuels in the mining, milling, processing, transportation, management, and storage of its fuel and waste products. Where?s the public outcry? A number of grassroots organizations have long been dedicated to monitoring and calling for attention to the nuclear power issue in the Great Lakes, but unfortunately, overall, it remains a low priority. Is it because the issue is poorly understood by the public, as well as the environmental community? Is it because the problem and potential solutions are too complex and too long-term? Is it because the issue is not perceived as urgent? Or is it because there is a lack of financial support for the environmental community to address the issue? Where?s the public outcry? Anonymous, I am assuming you are not the usual anonymous who posts here, because everything you say makes sense. I grew up on the shore of Lake Erie, and am aware of the delicate nature of the lakes' ecology, having seen the damage done to the lakes in the sixties and seventies from industrial pollution. Of course, this nuclear issue has the potential to make all of that look like nothing, but in a country that cannot muster the courage to pass the most basic gun control measures when threatened by business, I don't hold out much hope of a solution to this problem before we have a huge tragedy somewhere in the country. No, I am not that other person who calls himself Anonymous though certainly I'd be interested in reading anything he/she might have to say about your post if he/she could stay on topic. I have to admit that except for the first paragraph, that post was not my own writing. I copied and pasted it because it said much of what I had wanted to say, but said it much better than I could have.