Tokyo Electric Power Co., or Tepco, operator of the crippled Fukushima Daiichi nuclear power plant, said on Thursday that the company is investigating a sudden emission of steam from one of the destroyed buildings housing a damaged nuclear reactor. The steam rising from the No. 3 building was noticed at about 8:20 a.m. local time 7:20 p.m. EDT by repair crews who were removing contaminated debris from the facility. All work to remove debris in and around Unit 3 was stopped, a spokesperson for Tepco told The Daily Telegraph. We have confirmed that radiation levels around the pressure chamber have not changed, and at 9:20 a.m. we were able to confirm that the reactor has not reached criticality. The facility was hit in March 2011 by one of the worst nuclear disasters since the Chernobyl accident in 1986, after a giant tsunami triggered by an earthquake ravaged the nuclear plant, and damaged its back-up generators and cooling system, leading to a meltdown of its reactors. Tepco said it is investigating the cause of the steam outburst and added that rainwater probably seeped into the building and evaporated, releasing plumes of steam. ???? We think it's possible that rain made its way through the reactor building and, having fallen on the primary containment vessel, which is hot, evaporated [and created] steam, Tepco spokeswoman Maymi Yoshida said, according to Reuters. The primary containment vessel, made of strengthened steel, provides a critical line of defense against radiation leakage from a nuclear reactor. But this latest incident underscores the concerns and challenges involved in decommissioning the critically damaged nuclear power plant, not least of which is how to dispose of the water used to cool its melting reactors. Tepco has poured thousands of gallons of water over the reactors since the 2011 incident, and disposing of the spent water with radioactive content has become a huge challenge for the company. Last week, Japan?s nuclear regulatory authorities had said that radioactive water from the nuclear plant may be leaking into the Pacific Ocean after its experts found high levels of cesium in samples taken from coastal sea water and the pit water near the facility. The company had admitted in April that close to 120 tons of radioactive water may have leaked into the surrounding ground from a storage tank at the nuclear plant, and in May Tepco's own investigation found high levels of the water-soluble element strontium in samples taken off the coast near the plant.