Slow Saturday Special: Quincy Nurses Bring Knell to His Knees Months after scathing inspection, Quincy Medical Center?s president is out by Jessica Bartlett?| ?Globe Correspondent,?July 20, 2013 Quincy Medical Center?s president, Daniel Knell, has stepped down following questions about his leadership of the hospital, which is owned by the for-profit Steward Health Care System. The resignation, which took effect Thursday, comes after a tense one-day strike by the hospital?s nurses in April, as well as harsh findings from a state inspection in May that led to a temporary closure of the psychiatric ward for seniors. ?Several incidents have ignited public debate concerning the leadership of our hospital,? Knell wrote in a letter to employees. ?After discussing these events with [Steward?s] chairman and charting the most appropriate path for the future we decided that it would be in the best interest of Quincy Medical Center for me to step down as president.?? Translation: resign or we fire you. Donna Rubinate, the current chief operating officer of Good Samaritan Medical Center in Brockton, will replace Knell on an interim basis. ?Donna is a highly experienced and accomplished nurse executive. I am leaving you in very capable hands,? Knell wrote in his letter. Knell took the top job at the hospital in November 2011, after Steward acquired it in the midst of bankruptcy proceedings. Formerly chief restructuring officer for Steward, Knell has also been chief executive of Springhill Regional Medical Center and Bartow Regional Medical Center in central Florida. Sandra McGunigle, Quincy Medical Center?s director of public relations and marketing, did not offer any further information on the process to replace Knell, or whether he might return to an administrative role at Steward. Knell said he was ?honored to serve as the president? of Quincy Medical Center, and that its employees had ?accomplished much.? But his term was marked by turmoil. In April, contract negotiations between management and nurses came to a head as the nurses participated in a one-day strike in front of the hospital?s grounds. They cited concerns about the quality of patient care, saying reduced staffing levels were making it difficult to provide adequate services. Hospital officials denied patients were receiving substandard care, but their case was undermined by a surprise state inspection on May 23. State officials said they found that patients on the psychiatric ward for seniors were often ignored by hospital staff. Several were left in hospital beds without covers, according to an inspection report. One woman was covered in feces, while another was cowering and frightened, state Department of Mental Health officials said. Those problems ? along with dirty floors, damaged furniture, patient common areas misused as storage, and missing privacy curtains in patient rooms ? put a temporary halt to admissions in that part of the hospital. At the time of the inspection findings, state officials pointed to how the hospital was being run as a concern. On Friday, Julie Kaviar, a spokeswoman for the Office of Health and Human Services, which oversees the mental health department, said the agency had no comment on Knell?s resignation. Knell responded to the state report in a June letter, saying the unit had been cleaned and furniture replaced. Several staff members were fired and training was scheduled for those remaining. --more-- Look at what he is kneeling in: Psychiatric patients neglected in Quincy by Chelsea Conaboy?| ?Globe Staff,?June 28, 2013 State inspectors found filthy conditions and patients left unattended on Quincy Medical Center?s psychiatric ward for seniors, prompting regulators to temporarily prohibit admissions to the unit last month while the hospital fired at least two managers. Welcome to the future of Obamacare, although it is looking like his plan will be much, much worse. Inspectors made a surprise visit May 23, responding to concerns about the geriatric unit at the hospital, owned by Steward Health Care. Patients were largely ignored by nurses and other staff members and left in bed without covers and wearing only hospital gowns, inspectors found. Some complained of mean or disrespectful staff members. In one room, a woman in bed was covered in feces and said no one had answered her calls for help. She told inspectors that one nurse was unkind and that another staff member ?told her she needed to take care of herself.? ?The patient in the bed next to her was almost cowering and very frightened,? said the report by the state Department of Mental Health. ?The odor coming from this room could not have been missed by anyone in the hallway, yet no one was responding to the patient.? The facility overall was squalid, with dirty floors, damaged furniture, and missing privacy curtains in patient rooms, inspectors found.