Everything we do carries some element of risk. This much should be obvious. The recent horrific disaster at Lac-M?gantic underscores the fact that many aspects of our energy system such as having a rail line run through the middle of a populated area implies some level of risk. That risk is amplified when energy dense substances like fossil fuels are transported on that rail line. Mainly, I think, because this disaster involved fossil fuels it has gained the attention of the climate concerned community, who quickly pointed out that the risks posed by the transport of fuel is just one more reason as if we needed any more reasons to dump fossil fuels. And while I understand this motivation, I think it somewhat misses the mark. While the local risks of our energy infrastructure should be top of mind to those living close by be it near a power plant, a rail line or pipeline , the local risks really pale in comparison to the global risks of unmitigated climate change caused by our energy system. The reason to bring this up, is not to dismiss the local risks, but to ensure that we don?t become so risk averse that we become paralyzed and cannot make the difficult energy transition required to avoid catastrophic climate change. Often times renewable energy sources like solar and wind are portrayed as free from local risk, and there is an element of truth to this. But an energy system based on intermittent power sources needs to store energy for when the sun doesn?t shine and the wind doesn?t blow. There are many mechanisms to do this, such as pumping water to an uphill reservoir, storing thermal energy often times using molten salts , giant spinning flywheels, and of course batteries. All of these techniques essentially take the diluted energy from the sun and wind and concentrate it so we can use it later. None of these technologies are risk free. I wouldn?t want to be close to a giant shipping container sized battery if it went into thermal runaway, though it the risk of this happening is extremely small. After all this can even happen with the battery in your cellphone which we tend to carry near very sensitive parts of our bodies yet how many people do we know with exploding phones Ultimately concentrating energy comes with risk; the more we concentrate the energy the greater this risk. Living or working near a giant battery, would have some level of risk associated with it, but it is likely be a very small level of risk. But then the risk of a massive disaster like the one at Lac-M?gantic was also very small. I cannot stress enough, that we do need to understand the local risks of our energy infrastructure; it plays or rather should play a role in how our energy infrastructure is developed, and there are many important questions of how to compensate people for the burden of risk they are forced to carry incidentally this question played a large role in the debate over the Enbridge pipeline here in BC . These issues are incredibly important yet difficult to deal with as the horrific events in Lac-M?gantic demonstrate. However I am concerned that these discussions quickly become intolerant of these local risks. If this sentiment becomes widespread what will be the backlash when a battery the size of a shipping container goes into thermal runaway taking with it nearby homes and businesses? Will batteries also be subjected to the same intolerance of local risks despite the obvious reduction of the global risk of climate change? Perhaps the clearest example of this is nuclear power. By any objective measure nuclear power is very safe, however, it is not 100% safe, therefore living next to nuclear reactor carries with it some risk. There is a minuscule chance that the reactor will meltdown or that it will leak radioactive materials. Yet this negligible local risk is what dominates the discussions around nuclear power. This happens even as we know that the status quo of our current energy infrastructure is full local risks. Coal is fraught with local risk including a myriad of health issues, the Lac-M?gantic and Kalamazoo River disasters demonstrates that moving oil is also risky. Yet the opposition to nuclear power despite that its safety record compared with fossil fuels is excellent has played a large role in preventing the expansion of its role in our energy infrastructure. WIll all attempts to move away from our current fossil fuel dependent energy system face the same hurdles? If so, this aversion to risk will become a huge boon for the status quo. If the discussion of risk focuses on the local risks rather than the larger global risks, I am concerned that we may become paralyzed and make the difficult transition away from fossil fuels even more difficult than it already is. Local risks need to inform our energy policies, but lets not forget that it is the global risks that are the largest. So while we continue to discuss the what happened at Lac-M?gantic and talk about local risks, lets remember that as large and horrific as the local risks might seem they represent less risk that the global risk of unmitigated climate change. Up to a point. Fossil fuels travel one way, are burned, and the ash is then stowed in the ash bin. I have long been a fan of power transfer by sending an oxide with a high chemical binding energy per unit volume -- Al2O3 is the highest, within reason -- to a nuclear or solar power station, there pulling the oxygen off, and returning the other element. A joule's worth of aluminum, and a joule-to-be-supplied's worth of alumina, are significantly heavier than a joule's worth of gasoline, but the alumina need be packed only to a little more than half its single-crystal density to fit in the same space as the gasoline. The metal fits in just 42 percent of the space, bringing me to my point: its oxidation energy density is much higher than any hydrocarbon's, but a shipment of fuel aluminum that crashed would suffer very little oxidation as a result, and the energy this oxidation released would do no harm at all. I agree with your wider point - and I'd say it was valid beyond risk analysis too, with opponents of fracking, for example, often as guilty of focusing on relatively minor local factors as anti-wind campaigners are. However, I'm not convinced that it's true, or at least sufficient, to say that by any objective measure nuclear is very safe. I'm genuinely undecided on nuclear, and becoming more so all the time, but there are two reasons in particular why I would question that claim. Firstly measures of risk tend to focus on death or physical harm, but is account taken of the impacts of displacement? Nuclear accidents have the potential to make large areas of land uninhabitable for generations and the impacts of this can be significant, though perhaps difficult to measure objectively. A sense of place is a fundamental element of human experience and this is threatened more by nuclear than any other power source, with the possible exception of large-scale hydro. More significant perhaps is the legacy of nuclear power for future generations, particularly if the worst case scenarios of anthropogenic climate change play out, where society will be vulnerable and incohesive and possibly less able to cope with the technical challenge of maintaining or decomissioning elderly nuclear power stations or dealing with the build up of waste. Of course this argument goes far more for fossil fuels and if the choice were simply between continued use of fossil fuels or a wholesale switch to nuclear then I have absolutely no doubt that the latter would be the preferable option. As far as I can tell, the emotional consequences of a generation of fear about nuclear and the persistence of old style thinking is that we continue to maintain very dangerous nuclear facilities and are not building much of the new relatively safe ones. This is of course backwards, but I don't know how you can get us, the entire culture, out of this stalemate. In addition, just as with big solar, obstructivists are skilled manipulators with little respect for the truth who are are all too ready to exploit environmental memes to prevent competition with their massive profits.