I have talked recently about Japan restarting their nuclear facilities, and as much as that troubles me....Through scientific researching and my own soul searching I have concluded nuclear power is better than the other options available, nuclear emits no greenhouse gas emissions...Homes and businesses do need electrical power to operate, the move to producing this electrical power by burning the world`s supply of earth-trapped gas is foolish, we don`t understand the processes involved, we can`t risk ground water supplies, ground waters that migrate and never stop moving.. I do know cement, cement casings fail, all cement casings fail, look at any concrete built structure and you will see cracks, seepage of fluids, deep well cement casing are both thin and have no re-bar reinforcing, without a shadow of a doubt every deep well casing will fail over time, thus releasing fugitives gas into the atmosphere and chemicals into water supplies and that includes methane gases into the atmosphere.. By shifting electrical generation worldwide to natural gas is literally locking the world into a one way path that depends on fossil fuels, transportation is a little more tricky to convert entirely to electric, that will take a little longer, however.. At first glance natural gas appears much cleaner than coal but when one adds up all the activity, pipelines, drill holes, liquefication and transportation, add in all the fugitive emissions and it appears that one is no better than the other....My biggest concern is pumping millions of tonnes of chemical cocktails into the ground... LNG in British Columbia, if we have 10 LNG plants operating, after temporary construction jobs 10 LNG plants will employee a mere 2500 people with about 2500 spinoff jobs...5000 permanent jobs all toll, and yet to keep that many LNG plants operating 1000`s of new leaking wells will have to be drilled every couple of years, endless amounts of chemicals injected into the ground and billions of gallons of water put in the ground, yes Rich Colman talks about brown water being used for this process, but that is but a tiny portion of the water used, billions of gallons siphoned from rivers and lakes, and who believes pumping brown-water underground can be a good thing, not quite clean water with added chemicals pumped at pressure into the ground to blow up natural formations..Yikes. There are 7 billion people on earth, about 2 billion are mobile, there is talk about bringing India and China and other third world countries to middle-class status, meaning a car, vacations, trips, cruises and flights... Is this the last great battle mankind will see, energy companies flailing away in one last gasp to take it all, to fully tie the world to their unsustainable wares, to have bankers, investors and the public spend $30 trillion dollars on a ground gas society knowing full-well the futility of that folly with an environmental cost so heavy, is this their revenge, a scorched earth plan to wreak as much havoc and destroy watersheds around the world?....And when the gas bubble bursts, when water supplies are tainted, when nuclear and renewables are the last option, with the public broke, sickly and desperate..When drinking water being derived from ocean desalination plants is the new normal, will Exxon and Shell come to our rescue then?... ?I don`t think so but maybe, just maybe by then the sleeping giant within us all will awake to hang the lawyers, lawmakers, energy company executives and a corrupted media by their balls. Those leery of nuclear power need to read this, the new generation of nuclear power, Thorium reactors. And like I said in earlier posts, Japan as an export market for BC LNG has ended before it even began. As Fukushima continues to release poison radio-isotopes into the Pacific I don't know how anyone can seriously think nuclear is even worth consideration. Frankly, I am surprised you would even suggest that it is the way forward considering you know how those in charge always take short cuts for the almighty dollar. You can be sure that safeguards designed into nuclear plants will be the bare minimum which is exactly why the Fukushima disaster is a disaster. Ten months it took for Tepco to even admit three core meltdown and you would trust these guys to build more? Cheap electricity all right when you don't have exemplary safety standards and back up contingencies. Three core meltdowns fizzing away as I write, spewing more and more toxins with half lives numbering in the tens of thousands of years. Fuel pool #4 teetering 50ft above the ground awaiting another major earthquake that could cause it to topple and drain, resulting in a nuclear fuel fire that would cause the entire Northern Hemisphere to become uninhabitable for humans because of radioactive particles thrown into the atmosphere. We are on the brink of a inconceivable poisoning event and we don't even recognize it. Oh yeah nuclear is the way to go. Another Fukushima can happen anywhere at anytime and all it takes is for the water intakes at any of the nuclear plants to become inoperable for a couple days via an earthquake or terrorist activity and bingo more core meltdowns. It's actually quite sad that the Oyster Creek facility didn't have the water raised another 6 inches during Katrina who can spell Fukushima 2, this time in a heavy populated North American jurisdiction because obviously Fukushima hasn't woke anybody up. Last week in Japan new safety regulations for nuclear reactors went into effect, as the government tries to ensure that the nation will never again be rocked by nuclear catastrophe. These regulations provide a path for nuclear power plants to resume operations, and five power companies promptly submitted applications for the restart of 12 reactors, with more applications expected in the coming months. It was a tsunami that took out the plant, not shortcuts.. There will be new generation thorium reactors, they create no nuclear waste..Read this and be prepared to open your eyes.. Yes I know Grant that Tepco said the Tsunami knocked out the back up generators at Fuku but other experts disagree and say that the earthquake itself knocked out the backup generators, though this is all semantics, no matter the cause it was under-engineered. Thorium is not quite as poisonous measured by whose life time? as uranium, quote: People tend to think that when plutonium the most toxic substance known to man is tossed into a nuclear reactor is gets used up and disappears somewhere, where in actual fact it hasn't been used up or gone anywhere...it's still there. The reason they change fuel rods in a reactor is because the casings holding the pellets have become brittle and are actually disintegrating. The whole mess is so radioactive at this point that the pellets can't be recycled and this is why the dry cask it and drop it into a hole this guy you quote who talks about recycling plutonium is out to lunch . So you perhaps think it is a good thing that they can use plutonium in with the Thorium... but it does NOT reduce the amount of plutonium in existence and I would surmise that the waste from the thorium reactor will be just as voluminous and hazardous as any uranium reactor. Nuclear reactors do not produce cheaper electricity for the simple fact it costs 1 Billion dollars to decommission them. It will be just another case of taxpayers paying to clean up the mess just like any old mine or industrial site. If we want to solve the energy problems what we need to do is stop breeding like rats. This planet or rather us humans can not sustain our current population as it is. Continuing on our current path is simply a recipe for extinction