According to US legislators and journalists, the surveillance whistleblower Edward Snowden actively aided America's enemies. They are just missing one essential element for the meme to take flight: evidence. An op-ed by Representative Mike Pompeo Republican, Kansas proclaiming Snowden, who provided disclosed widespread surveillance on phone records and internet communications by the National Security Agency, not a whistleblower is indicative of the emerging narrative. Writing in the Wichita Eagle on 30 June Pompeo, a member of the House intelligence committee, wrote that Snowden has provided intelligence to America's adversaries . Pompeo correctly notes in his op-ed that facts are important . Yet when asked for the evidence justifying the claim that Snowden gave intelligence to American adversaries, his spokesman, JP Freire, cited Snowden's leak of NSA documents. Those documents, however, were provided to the Guardian and the Washington Post, not al-Qaeda or North Korea. It's true that information published in the press can be read by anyone, including people who mean America harm. But to conflate that with actively handing information to foreign adversaries is to foreclose on the crucial distinction between a whistleblower and a spy, and makes journalists the handmaidens of enemies of the state. Yet powerful legislators are eager to make that conflation about Snowden. The Twitter account of Representative Mike Rogers Republican, Michigan , the chairman of the House intelligence committee, on 18 June placed Snowden and accused WikiLeaks source Bradley Manning in the same company as Aldrich Ames and Robert Hanssen, two infamous CIA and FBI double-agents. The tweet appears to have been deleted. When I asked about the conflation, Rogers' Twitter account responded: All 4 gave critical national security information to our enemies. Each did it in different ways but the result was the same. Never to be outdone, Peter King, a New York Republican and former chair of the House homeland security committee, proclaimed Snowden a defector on 10 June. Days later, Snowden left Hong Kong to seek asylum in an undetermined country ? a curious move for a defector to make. Once elected and appointed leaders casually conflate leaking and espionage, it is a matter of time before journalists take the cue. For insight into the fear and isolation that NSA leaker Edward Snowden is living through , CNN turned to Christopher Boyce ? who sold US secrets to the USSR before becoming a bank robber. There are understandable suspicions that Snowden may have aided foreign intelligence services in order to aid in his escape from American criminal justice. While some have speculated that the Russian or Chinese intelligence services might have snuck a look at the highly sensitive intelligence material Snowden is carrying, that material is heavily encrypted. For what it's worth, in a Guardian webchat I asked Snowden directly if he would trade access to his documents for asylum. He said he would not. Perhaps Snowden lied. Perhaps he might change his mind. But all of that is far off in the realm of speculation. As things stand now, there is no evidence Snowden has aided any US adversary or intelligence service, wittingly or not. Even the Obama administration has stopped short of terming Snowden a spy, even in the course of attacking his character. Yes, he was indicted under the Espionage Act, but the actual charges against him are theft of government property, unauthorized communication of national defense information, and willful communication of classified intelligence information to an unauthorized person. In an email meant to discredit Snowden in the press, an anonymous senior administration official told reporters on 24 June that Snowden's ostensible idealism is belied by the protectors he has potentially chosen: China, Russia, Cuba, Venezuela and Ecuador . That's something to remember the next time Washington wants to talk about its commitment to human rights while cooperating with, say, China and Russia. When asked directly if there was any evidence that Snowden had cooperated with any intelligence service or American adversary, the administration and Congress declined to provide any. The office of the director of national intelligence, James Clapper, declined to comment for this story. The Justice Department and the House intelligence committee didn't even respond to inquiries. By all means, consider Snowden a hero, a traitor or a complex individual with a mixture of motives and interests. Lots of opinions about Snowden are valid. He is a necessarily polarizing figure. The information he revealed speaks to some of the most basic questions about the boundaries between the citizen and the state, as well as persistent and real anxieties about terrorism. What isn't valid is the blithe assertion, absent evidence, that the former NSA contractor actively collaborated with America's enemies. Snowden made classified information about widespread surveillance available to the American public. That's a curious definition of an enemy for US legislators to adopt. What is one to make of NSA whistleblower Edward Snowden's reluctant appeal for temporary asylum in Russia, an appeal that Russia yesterday insisted had still not been received? It's easy to admire Snowden for what he has revealed about the vast extent of US and UK spying. It is easy, too, to sympathise with the predicament he has found himself in after making his revelations and wishing, understandably, to avoid decades in prison. Indeed, contrary to what some have argued, there is no rule that states whistleblowers should voluntarily surrender to the prospect of a long jail sentence. The consequence is that Snowden has found himself stripped of his passport by the US government that seeks him and has been subjected to a harshly applied international flight ban as Washington has sought to block his travel to a friendly South American country. In these circumstances, his desire for temporary refuge in Moscow ? where he is trapped in any case ? makes perfect sense. Yet there is a but . You can hold all of these ideas as true, yet still feel deeply uncomfortable about the manner of Snowden's request for asylum, not least his praise for Russia. Perhaps it was no more than being naive, but to list Putin's Russia, as Snowden did, among his little list of countries for being the first to stand against human rights violations suggests a dangerous moral relativism. Far from being a champion, Russia's record on human rights violations is a grim one. Snowden's meeting with human rights groups in Moscow's Sheremetyevo airport was preceded by another piece of human rights news ? the posthumous conviction of whisteblower Sergei Magnitsky, who was tortured in a Russian prison and denied medical attention that might have saved his life. Amnesty, whose representative was at the Snowden meeting, had earlier announced the latest murder of a journalist in Russia, Akhmednabi Akhmednabiev, who was killed by an unknown gunman in the North Caucasus region after his name appeared on a death list. There have been other recent reminders of what happens to those who criticise the Kremlin and Putin. Two members of the punk band Pussy Riot remain in jail. Indeed, yesterday ? almost unremarked ? it was reported that Maria Alyokhina, one of the two imprisoned musicians, was being transferred from the labour camp in the Perm region, where she has been serving two years for hooliganism for performing a song, to another prison in central Russia. A new trial opened last month into those accused of murdering the journalist Anna Politkovskaya in 2006, though few expect those behind her murder ever to face justice. A cursory glance of Amnesty's list of recent alerts on Russia from the past two months makes very ugly reading, revealing the continuing assault on gay rights inside the country, the use of torture to extract confessions and the pursuit through the courts of non-governmental associations. If that is too abstract, consider the treatment of Tanya Lokshina, the Human Rights Watch researcher, one?of those invited to meet Snowden on Friday and who tweeted the whistleblower's picture. Last year, the then pregnant Lokshina, who has been a prominent human rights campaigner for more than a decade, received a series of text messages threatening both her and her unborn child. Commenting on the affair, Human Rights Watch's executive director, Ken Roth, said: The climate for human rights advocacy in Russia is as bad as we've seen in 20 years. Russia's international partners should make clear that the surest route to pariah status is to reinstate the bleak human rights environment of the Soviet era. Or take the case of Alexei Navalny, the anti-corruption campaigner who this week will learn whether he is to be jailed for his activities. Why all this matters is simple. Snowden has built his argument on the moral imperative for leaking the NSA document trove increasingly in terms of human rights, not least relating to privacy. He has justified his actions by invoking one of the Nuremberg principles ? that it is the duty of an individual to break the law of his own state if international law is being broken ? and?the Universal Declaration of Human Rights. While that is a compelling argument, what is less convincing is his suggestion that Russia is in the forefront of the fight by the powerless against the powerful . Instead, in providing a public relations coup for Putin, Snowden has provided cover for a gross and serial human rights-violating state. Even then, it is not hard to imagine the circumstances how this came about. To sympathise again: exhausted, confused, perhaps, even under pressure, Snowden must feel he has been left by Washington with nowhere else to turn. But that cannot change the fact that the comments he made on Friday ? uttered naively or under duress ? still have consequences. That is because Snowden's well-developed and credible defence for leaking the NSA documents has been that, as a citizen and as a moral being, he could not tolerate the abuses he witnessed and was compelled to break the law ? a powerful appeal to natural justice. In appealing to the universality of human rights values, while appearing to apply his criticism of human rights abuse selectively, that justification, sadly, now rests on shaky ground. Edward Snowden has highly sensitive documents on how the National Security Agency is structured and operates that could harm the U.S. government, but has insisted that they not be made public, a journalist close to the NSA leaker said. 'I think it would be harmful to the U.S. government, as they perceive their own interests, if the details of those programs were revealed,' he said. He has previously said the documents have been encrypted to help ensure their safekeeping. Snowden emerged from weeks of hiding in a Moscow airport Friday, and said he was willing to meet President Vladimir Putin's condition that he stop leaking U.S. secrets if it means Russia would give him asylum until he can move on to Latin America. 'I haven't sensed an iota of remorse or regret or anxiety over the situation that he's in,' said Greenwald, who has lived in Brazil for the past eight years. 'He's of course tense and focused on his security and his short-term well-being to the best extent that he can, but he's very resigned to the fact that things might go terribly wrong and he's at peace with that.' He said the U.S. has shown it's 'willing to take even the most extreme steps if they think doing so is necessary to neutralize a national security threat,' Greenwald said. 'He's aware of all those things, he's concerned about them but he's not going to be in any way paralyzed or constrained in what he thinks he can do as a result of that.' Asked about a so-called dead man's pact, which Greenwald has said would allow several people to access Snowden's trove of documents were anything to happen to him, Greenwald replied that 'media descriptions of it have been overly simplistic. 'It's not just a matter of, if he dies, things get released, it's more nuanced than that,' he said. 'It's really just a way to protect himself against extremely rogue behavior on the part of the United States, by which I mean violent actions toward him, designed to end his life, and it's just a way to ensure that nobody feels incentivized to do that.' He declined to provide any more details about the pact or how it would work. Greenwald said he himself has beefed up his own security, particularly since a laptop went missing from his Rio home. Upcoming stories would likely include details on 'other domestic spying programs that have yet to be revealed,' but which are similar in scope to those he has been reporting on. He did not provide further details on the nature of those programs. Edward Snowden was born in North Carolina on June 21, 1983, and grew up in Elizabeth City. His mother works for the federal court in Baltimore the family moved to Ellicott City, Maryland, when Snowden was young as chief deputy clerk for administration and information technology. Snowden's father, a former Coast Guard officer, lives in Pennsylvania. Snowden dropped out of high school and studied computers at Anne Arundel Community College in Arnold, Maryland from 1999 to 2001, and again from 2004 to 2005 , later earning a GED. Between his stints at community college, Snowden spent four months May to September 2004 in the Army Reserves in special-forces training. According to Army sources, he did not complete any training, and Snowden has said that he was discharged after he broke his legs in an accident. While working at the NSA's Oahu office, Snowden began noticing government programs involving the NSA spying on American citizens via phone calls and internet use. Before long, leaving his very comfortable life and $200,000 salary behind, in May 2013, Snowden began copying top-secret NSA documents while at work, building a dossier on practices that he found invasive and disturbing. The documents contained vast and damning information on the NSA's domestic surveillance practices, including spying on millions of American citizens under the umbrella of programs such as PRISM. After he had compiled a large store of documents, Snowden told his NSA supervisor that he needed a leave of absence to undergo treatment for epilepsy, a condition recently diagnosed. He also told his girlfriend that he'd be leaving Hawaii for a few weeks, remaining vague about why. On May 20, 2013, Snowden took a flight to Hong Kong, China, where he remained during the early stages of the fallout. This fallout began the following month, on June 5, when the United Kingdom's Guardian newspaper released secret documents obtained from Snowden about an American intelligence body Foreign Intelligence Surveillance Court demanding that Verizon release information on a daily basis culled from its American customers' activities. I'm willing to sacrifice [my former life] because I can't in good conscience allow the U.S. government to destroy privacy, internet freedom and basic liberties for people around the world with this massive surveillance machine they're secretly building, Snowden said after the fact, in a series of interviews given in his Hong Kong hotel room. The U.S. government saw a different side of the issue, and on June 14, 2013, federal prosecutors charged Snowden with theft of government property, unauthorized communication of national defense information, and willful communication of classified intelligence with an unauthorized person. The last two charges fall under the Espionage Act. Before President Barack Obama took office, the act had only been used for prosecutorial purposes three times since 1917; Since President Obama took office, it had been invoked seven times as of June 2013. Snowden remained in hiding for nearly one month, first asking Ecuador for asylum and then fleeing Hong Kong for Russia, whose government has denied the U.S. request to extradite him. By late June 2013, more than 100,000 people had signed an online petition asking Obama to pardon Snowden. The following month, Snowden made headlines again when it was announced that he had been offered asylum in Venezuela, Nicaragua and Bolivia. Around the same time, it was reported that Snowden was stuck in transit in Moscow after the U.S. annulled his passport, and that he had not yet made a decision on where, of the countries offering him asylum, he would be relocating.