Edward Snowden told to 'man up' and fly home by John Kerry 9 May NSA whistleblower Edward Snowden should man up and return to the United States, Secretary of State John Kerry has said. In an interview with CBS, Kerry said Snowden is welcome to fly back to the US to make his case at any time. If Mr Snowden wants to come back to the United States today, we'll have him on a flight today, said Kerry. We'd be delighted for him to come back. And he should come back, and that's what a patriot would do. The Secretary of State was responding to an interview that Snowden gave to NBC, in which he blamed the State Department for his current exile in Russia. I had a flight booked to Cuba and onwards to Latin America and I was stopped because the United States government decided to revoke my passport and trap me in the Moscow Airport, Snowden said. So when people ask 'Why are you in Russia?' I say, 'Please ask the State Department.' Snowden, who was charged with three felonies in a federal court in Virginia last year, is likely to face arrest if he returns to the US. The former contractor, who leaked some of the National Security Agency's most guarded secrets, described himself as a patriot and said he was not just a low-level hacker as portrayed by the US government. I was trained as a spy, in sort of the traditional sense of the word, in that I lived and worked undercover overseas ? pretending to work in a job that I'm not ? and even being assigned a name that was not mine, he said. However, former CIA officer Lindsay Moran told the Wall Street Journal that she found the claim that he used aliases dubious and suggested he was inflating his position . She voiced support for his actions but said he was now unfortunately giving ammunition to his detractors and his critics . She added: To me, this reads as the sort of typical spy wannabe claims. Snowden was working as a technician for Booz Allen, a government contractor for the NSA, when he fled the US in May 2013. Over the course of the year he has fed a mass of secret NSA documents to news outlets such as The Guardian and the Washington Post. Edward Snowden nominated for the Nobel Peace Prize 29 January TO THE American government and the NSA he is Public Enemy number one, but the world's most famous whistleblower has been nominated for the Nobel Peace Prize. Edward Snowden has been put forward for the prestigious accolade by two prominent Norwegian politicians, reports?Bloomberg.? The news agency? obtained a copy of the nomination letter in which Norwegian parliamentarians Snorre Valen and Baard Vegar Solhjell a former government minister state: The public debate and changes in policy that have followed in the wake of Snowden's whistleblowing have contributed to a more stable and peaceful world order. But that's not how the Obama Administration sees it after the 30-year-old Snowden leaked classified documents about the National Security Agency spying programmes. Fleeing first to Hong Kong and then to Russia ? where he's been granted temporary asylum ? Snowden is wanted in his homeland on charges of theft and espionage. Attorney General Eric Holder said recently that prosecutors would be prepared to negotiate?with him were he to return to the USA, but that seems unlikely given that Snowden told a?German television programme at the weekend that [US] government officials have said they would love to put a bullet in my head or poison me when I come out of the supermarket, and then watch as I die in the shower . To Valen and Solhjell, members of the Socialist Left Party in the Norwegian parliament, Snowden is an international hero who deserves to be recognised by the world. There's no doubt that the actions of Edward Snowden may have damaged the security interests of several nations in the short term, they said in their nomination letter. However, his actions have led to the reintroduction of trust and transparency as a leading principle in global security policies . Though Snowden is unlikely to scoop the Prize when the winner is announced in October ? unless the Nobel Committee wishes to antagonise America ? the fact he's been nominated will embarrass President Obama, himself a controversial recipient of the award in 2009. Bloomberg says that the Committee accepts nominations from members of national assemblies, governments, international courts, professors and previous laureates, and standard protocol dictates that nominees remain secret for 50 years. In choosing to disclose their nomination of Snowden, the pair of Norwegian politicians have cocked a snook at the world's greatest superpower. France, Mexico demand answers over new Snowden spy claims 21 October? FRANCE and Mexico have angrily demanded explanations from Washington over fresh spying claims based on documents leaked by Edward Snowden. France has summoned the US ambassador to its foreign office in Paris after Le Monde reported that the National Security Agency NSA had recorded more than 70 million phone calls made in the country. The paper says the documents suggest that the NSA targeted not only people suspected of being involved in terrorism but also high-profile individuals from the world of business or politics . Meanwhile, Mexico also wants answers after the German newspaper Der Spiegel revealed that the NSA systematically eavesdropped on the Mexican government. The paper said the agency hacked the public e-mail account of former Mexican President Felipe Calderon, which was also used by Cabinet members. According to Le Monde, the NSA taped 70.3 million phone calls in France over a 30-day period between 10 December and 8 January this year. An NSA graph obtained by the newspaper shows an average of 3 million data intercepts a day. France's interior minister Manuel Valls described the revelations as shocking . Le Monde says the NSA operation was codenamed US-985D. It worked by automatically recording calls from certain French phone numbers and picking up text messages sent in the country that contained certain key words. Mexico said it is seeking an urgent explanation of the latest revelations. A statement issued by its foreign ministry stated: The Mexican government reiterates its categorical condemnation of the violation of privacy of institutional communications and Mexican citizens. This practice is unacceptable, illegitimate and contrary to Mexican law and international law. The US was already under pressure to explain its international intelligence gathering after revelations in July that the NSA targeted the embassies of US allies including France, Japan and Turkey. A document provided by Snowden describes 38 diplomatic missions and embassies as targets for extensive spying which include bugging electronic communications. Snowden leak: why is Britain 'acting like the USSR'? THREE months after The Guardian broke the story of NSA whistleblower Edward Snowden the same paper has lambasted the British establishment for its lack of concern over the scoop. Snowden, a former National Security Agency employee, has been granted temporary asylum in Russia. He fled there after revealing details of mass surveillance programmes undertaken by the US and UK governments. But while his revelations generated headlines around the world and had a huge diplomatic fall-out, there has been little in the way of reaction from the authorities in Britain. Snowden, the most significant whistleblower of modern times, briefly amused London when he turned scarlet pimpernel in the summer, writes Simon Jenkins in The Guardian. But the British establishment cannot get excited. It hates whistleblowers, regarding them as not proper chaps. Even the storm over the arrest of David Miranda, the partner of the journalist who broke the story, at Heathrow airport blew over after a few days, notes Jenkins. And while American lawmakers were shocked to discover that the state was looking at its citizens' phone records and other data, there appears to have been little concern in Westminster. Nothing better illustrates the gulf that sometimes opens between British and American concepts of democracy, he says. Indeed Jenkins compares the government's reaction to that of the USSR. While Washington has been tearing itself apart, dismissive remarks by William Hague in the Commons and Lady Warsi in the Lords could have passed muster in Andropov's supreme soviet, he laments. However, information commissioner Christopher Graham has begun an investigation into the impact of Snowden's disclosures about mass internet surveillance, notes The Guardian. It comes amid fresh calls from the European Commission for a single EU-wide privacy law to tackle intrusive surveillance and restore public trust in the digital economy . In the US, opinions about Snowden remain divided. A poll by American research organisation Reason suggests that 35 per cent of Americans believe Snowden was a patriot for leaking details of the NSA surveillance probes, but 39 per cent brand him a traitor . PM ordered top aide to warn Guardian over Snowden case 21/08/13 DAVID CAMERON played a central role in trying to limit revelations published in The Guardian about UK and US intelligence operations,?The Independent says. The paper has confirmed that the Prime Minister ordered Cabinet Secretary Sir Jeremy Heywood to warn The Guardian it faced serious consequences if it ran stories based on documents leaked by Edward Snowden. The Guardian's editor, Alan Rusbridger, has said previously he was contacted by a senior Whitehall figure over the matter, but declined to name him. The?Daily Mail says Cameron also explicitly authorised the destruction at The Guardian offices of computers believed to hold classified documents provided by Snowden. The call to destroy the computers was sanctioned by Deputy PM Nick Clegg and Foreign Secretary William Hague, the paper says. Preferring to destroy one copy of the documents rather than hand them back ? and knowing that The Guardian had access to other copies of the classified information held overseas ? Rusbridger complied. The computers were pulverised at The Guardian's offices by an IT expert and a senior editor using an angle grinder. Here is a roundup of other developments: David Miranda forced to give up passwords: The 28-year-old Brazilian partner of Guardian columnist Glenn Greenwald has revealed he was forced to divulge passwords to his email and social media accounts during his detention at Heathrow. He says he was threatened with prison if he did not comply. Disclosing his passwords made him feel as if he were naked in front of a crowd , Miranda told the BBC. Lawyers contradict police and Home Office account of Miranda's detention: In a statement, Scotland Yard described Miranda's nine-hour detention at Heathrow airport as legally and procedurally sound and insisted he was not denied access to a lawyer. That claim was flatly contradicted by Gwendolen Morgan, a lawyer representing the Brazilian in his case against the Home Office. It is incorrect that Mr Miranda was offered legal representation, she told The Independent. Efforts to get a lawyer into the room at the airport where Miranda was being questioned were persistently blocked and were only successful in the final hour of his detention. Theresa May also knew about David Miranda's detention: The Home Secretary has revealed she was briefed in advance of the police operation to detain and question Miranda. May insisted she does not decide who the police do or do not stop, but defended the Brazilian's detention. I think one of the primary duties of government is to protect the public and I think it's absolutely right that if the police believe that someone is in the possession of highly sensitive, stolen information that could help terrorists, could risk lives ... that the police are able to act, and that's what the law enables them to do, May told Sky News. Snowden leak: NSA secretly paid ?100m to UK spy agency? Edward Snowden: 'I am famously paranoid' 13/08/2013 WHISTLEBLOWER Edward Snowden has revealed he is ?famously paranoid??in one of the few interviews he has given since fleeing America. The former NSA contractor has made his revelations about the US government's pervasive surveillance techniques via documentary-maker Laura Poitras and The Guardian?s Glenn Greenwald. But in a rare interview, with investigative journalist Peter Maass, published in the?New York Times?today, Snowden admits he did not expect the journalists to take him seriously at first. ?I know journalists are busy and had assumed being taken seriously would be a challenge, especially given the paucity of detail I could initially offer,? he says. In fact, Greenwald initially ignored Snowden's messages, finding the encryption software the whistleblower asked him to download ?annoying and complicated?. Snowden says he was surprised that there were people in news organisations who did not know that ?any unencrypted message sent over the internet is being delivered to every intelligence service in the world?. He turned instead to Poitras, who was working on a documentary about surveillance. She followed his instructions to create a secure system for them to communicate and within six months she and Greenwald were on a plane to Hong Kong to collect thousands of classified surveillance documents. When they met, 30-year-old Snowden says he had the impression the journalists were ?annoyed? that he was younger than they might have expected. But he says as soon as they were behind closed doors both parties were reassured by an ?obsessive attention to precaution and bona fides?. Snowden adds that he was ?particularly impressed by Greenwald's ability to operate without sleep for days at a time?. Asked when he realised he could trust Poitras, Snowden replies: ?We came to a point in the verification and vetting process where I discovered Laura was more suspicious of me than I was of her, and I?m famously paranoid.? This is underlined by the way Maass carried out his interview. Few journalists have access to Snowden, who has only recently secured temporary asylum in Russia. Maass had to hold an encrypted question-and-answer session with Snowden via Poitras. Unusually for someone so paranoid, Snowden has been allowing Poitras to film him as part of her documentary, something he admits most spies would ?allergically avoid?. He explains: ?The weight of the situation actually made it easier to focus on what was in the public interest rather than our own. I think we all knew there was no going back once she turned that camera on, and the ultimate outcome would be decided by the world.? Snowden leak: NSA secretly paid ?100m to UK spy agency? THE United States paid ?100m to UK spy agency GCHQ over the last three years in return for access to its intelligence-gathering programmes, according to documents leaked by whistleblower Edward Snowden. The papers, seen by?The Guardian, suggest the US expected a return on its investment and that GCHQ has had to work hard to meet its demands. GCHQ must pull its weight and be seen to pull its weight, said one strategy briefing by the British agency. The top-secret payments, made by the National Security Agency NSA , the US equivalent of GCHQ, are the latest revelations to emerge from the cache leaked by Snowden, the former NSA contractor who was yesterday given temporary asylum in Russia. Snowden said the two organisations have been developing techniques that allow the mass harvesting of internet traffic. The revelation will raise fears about the hold Washington has over the UK's biggest and most important intelligence agency , says The Guardian. It also emerged that GCHQ wants the ability to exploit any phone, anywhere, any time and that the amount of personal data made available to the agency from internet and mobile traffic increased by 7,000 per cent in the last five years. Documents from 2010 show GCHQ said one of its key selling points was that it is less regulated than the NSA. Some GCHQ staff had raised concerns over the morality and ethics of their operational work, according to the documents. But the papers also revealed that the UK's biggest fear is that US perceptions of the ? partnership diminish, leading to loss of access, and/or reduction in investment ? to the UK . In response to the claims, a Cabinet Office spokesman said: In a 60-year alliance it is entirely unsurprising that there are joint projects in which resources and expertise are pooled, but the benefits flow in both directions. Snowden? row: Guardian hits back after John le Carr? dig 01/08/2013 THE GUARDIAN has fought back against criticism from spy novelist John le Carr? that it was failing in its duty of care to whistleblower Edward Snowden. The newspaper has insisted it was Snowden's decision to leak details about the US National Security Agency's mass snooping into phone records and internet communications, and later to reveal his identity. It comes as Snowden was given refugee status in Russia today, allowing him to leave the Moscow airport where he had been staying since 23 June. In an interview for Radio 3's Proms Plus season, le Carr? said it was extraordinary that The Guardian did not take Snowden on as an informant, as one would normally, and look after his welfare later . Le Carr?, author of Tinker Tailor Soldier Spy, conceded he did not know whether the newspaper had discussed Snowden's future welfare with him. But he added: If I were running a newspaper, and someone came to me and said 'I want to give you the crown jewels on American eavesdropping, espionage and so on', I would ask what happens when you've blown the whistle, what's going to become of you, I don't want to see you hanging from a gallows. His comments prompted a vigorous response from The Guardian, which today ran another front-page spread based on documents provided by Snowden. A spokesman for the newspaper told the Evening Standard: We of course have a duty of care to all of our sources. However, as Edward Snowden himself has made clear, he chose to give this information to The Guardian ? that was his decision, as was his decision subsequently to reveal his identity. Our team spent many hours discussing with Snowden the implications of his decision to identify himself, which he was determined to do. Snowden, who has been charged under the US Espionage Act, was given temporary asylum in Russia today, allowing him to live in the country for a year, according a lawyer representing him in Moscow. The row comes as another whistleblower, Bradley Manning, faces a potential 136-year prison sentence after disclosing around 700,000 classified files to WikiLeaks in 2010.? Edward Snowden: Whistleblower given papers to enter Russia 24/07/13 EDWARD SNOWDEN has been granted permission to leave Moscow airport and enter Russia, according to a report by a state news agency. The NSA whistleblower has been trapped in the airport's transit area for weeks after the US cancelled his passport. Now the Russian agency Interfax is reporting that he is about to be given the necessary documents to enter Russia where he will apply for temporary asylum, says the website RT. The American is currently getting ready to leave, said Interfax, citing a source familiar with the situation. He will be given new clothes. Lawyer Anatoly Kucherena will bring the papers he needs to leave the transit zone of the airport. Snowden has been living in the transit zone of Sheremetyevo Airport since the day he arrived from Hong Kong on 23 June. Last week he applied for temporary asylum in Russia. Although the former CIA technical worker will be free to travel within Russia it could take authorities up to three months to either grant or reject a request for temporary asylum. If he is given temporary asylum he would be allowed to stay in Russia for a year before his status was reviewed. If the request is rejected by the Immigration Service, Snowden may appeal the decision in court. Putin: 'trapped' Snowden is an an unwanted Christmas gift 16/07/13 FUGITIVE American whistleblower Edward Snowden is trapped in Russia according to President Vladimir Putin, who has likened him to an unwanted Christmas present. Talking to students on a visit to the Gulf of Finland - where he was photographed descending to the bottom of the Baltic Sea in a bathyscaphe - Putin said that the US had effectively blocked Snowden from leaving Russia. He arrived on our territory without an invitation, said Putin, according to The Independent. He didn't fly to us; he flew in transit to other countries. But... our American partners, in fact, blocked him from flying further. They themselves scared all other countries; no one wants to take him, and in this way they themselves, in fact, blocked him on our territory. According to German website Deutsche Welle, Putin said Snowden had been foisted on his country. Such a present to us. Merry Christmas, he remarked. Snowden has been holed up in Moscow's Sheremetyevo airport since arriving from Hong Kong on 23 June. He is unable to leave the transit zone without asylum documents, a valid passport or a Russian visa - he reportedly has none of these, says the BBC. Although he has been offered asylum in Latin America by Nicaragua, Venezuela and Bolivia, the BBC says it is unlikely he will be able to get there. That?s because European countries are likely to close their airspace to any plane suspected of carrying the fugitive, just as they did earlier this month when a jet carrying the Bolivian president was forced to land in Austria amid fears Snowden was aboard. When asked what would happen to Snowden, Putin replied: How should I know? It's his life. Snowden has asked for temporary asylum in Russia so he can leave the airport, but Putin insists he will only be allowed to stay if he stops leaking secrets about US surveillance schemes. The case is an increasingly awkward problem for Putin as Moscow and Washington try to improve relations and he prepares for a summit with President Barack Obama in Moscow in early September, says Reuters. Edward Snowden breaks cover in Moscow as he plots escape 12/07/2013 FUGITIVE American whistleblower Edward Snowden has broken cover for the first time since he landed in Moscow on 23 June and has reportedly asked for asylum in Russia. The news came as he held a meeting with a group of human rights activists and lawyers at Moscow?s Sheremetyevo airport today. Tanya Lokshina of Human Rights Watch HRW said that although Snowden still hoped to make his way to one of the Latin American countries that has offered him refuge, he was looking to stay in Russia in the meantime. She told the?New York Times: The only way for him to have safety guarantees for [a] temporary stay in Russia is apparently to get an asylum in Russia... So he is asking for one. Lokshina added that the meeting with organisations including HRW, Amnesty International and other groups was to ask for their assistance in getting guarantees of safe passage to Latin America and safety guarantees to stay in Russia until he can travel to Latin America . Snowden has applied for asylum in Russia before, but later withdrew his request. There was no immediate indication from the Kremlin whether it would grant Mr Snowden's [new] request, said the Times. Russian officials have suggested they would like him to leave Russia... [and] the United States revoked his passport, complicating his effort for further travel and leaving him in geopolitical limbo, it reported. The?Daily Telegraph?said Snowden met around a dozen Russian rights activists, lawyers and other figures in a closed-door meeting . Snowden had not been seen in public since arriving in Moscow from Hong Kong following his leaking of NSA secrets to The Guardian and the Washington Post and has yet to officially enter the country. However, pictures of the former NSA employee were posted on social networking sites as above by people at the meeting, finally putting an end to rumours that he was not actually in Russia at all. How long he stays in the country remains to be seen. Russia had indicated that they would only grant Mr Snowden asylum if he stop publishing US intelligence secrets. It is unclear if he has now accepted this demand, says the Telegraph. Edward Snowden: Will Russia extract favour for giving him up?? WITH Edward Snowden seemingly vanished, all the world's media could do this morning is speculate where the world's most notorious fugitive might be. According to American broadcaster?CBS, the White House believes the former National Security Agency contractor is still in Russia after failing to board a flight to Havana yesterday. Claiming that the US government has been pressuring the Russians to extradite Snowden before he seeks asylum elsewhere, CBS says: It's possible that Russian President Vladimir Putin may want to extract a price for turning over Snowden. That could involve some kind of trade or diplomatic favour. The pressure referred to by CBS took the form of statements issued by US officials throughout Monday. Secretary of State John Kerry urged Moscow to do the right thing and hand Snowden over. President Barack Obama told reporters: We're following all the appropriate legal channels and working with various other countries to make sure that the rule of law is observed. But according to?The Independent, President Putin is in no mood to co-operate with Washington after the recent passage of the Magnitsky Act, which bans certain Russian officials from entry to the US . Revoking the act might be one of the favours Putin will demand of the US in return for giving up Snowden. One man who does apparently know Snowden's whereabouts is Julian Assange. In a conference call with?reporters?from the Ecuadorian embassy in London, the Wikileaks founder confirmed that the organisation had paid Snowden's expenses since he left Hong Kong on Sunday. He added: We are aware of where Edward Snowden is. He is in a safe place and his spirits are high. Due to the bellicose threats coming from the US administration we cannot go into further detail at this time. Assange also said that Snowden had not been questioned by the Chinese authorities before leaving Hong Kong. The?Washington Post?says that the Obama administration is reluctant to be seen as too critical of the Chinese role in allowing Snowden to flee Hong Kong and says the furore comes at a sensitive time for the US president. Only three weeks ago Obama confronted Chinese president Xi Jinping over China's widespread theft of intellectual property from US companies . The Chinese media has lost little time in retaliating.?The Guardian?reports how the overseas edition of the People's Daily, the official newspaper of the Chinese Communist Party, congratulates Snowden for tearing off Washington's sanctimonious mask . The paper goes on to say that far from being a model of human rights, the US is an eavesdropper on personal privacy and a manipulator of the centralised power over the international internet . But amid all the diplomatic tension and media name-calling, one man does seem to have enjoyed being caught in the Snowden storm. The Guardian reports that when Aeroflot flight SU150 arrived in Havana after its 12-hour flight from Moscow, a scrum of reporters was waiting for the aircraft's captain as he emerged from customs. No Snowden, no, he replied when asked about the fugitive. Then he pulled out his own camera and began taking photos of the photographers. Edward Snowden on the move as US fumes: five key questions THE world's most famous whistleblower flew out of Hong Kong on Sunday morning.?The Guardian?reports that former government contractor Edward Snowden boarded an aircraft for Moscow in a move that? appeared to bewilder the White House . Bewilderment turned later to frustration and anger for the Americans as it became clear Snowden had the sympathy, and apparent connivance, of many foreign powers in his bid to avoid extradition to the US Where is he now??The 30-year-old Snowden landed in Moscow on Sunday afternoon aboard? Aeroflot flight SU213 and, claims the?Daily Mail, last night he slept in a hotel at the city's Sheremetyevo airport . A Russian government official has declared that Snowden is? safe from the authorities as long as he remains in the transit lounge at the airport. Asked about the presence of the American whistleblower on Russian soil, Dmitry Peskov,? a spokesman for Russian president Vladimir Putin, said: I know nothing. Why is WikiLeaks involved??Snowden was accompanied on his flight from Hong Kong to Russia by British activist Sarah Harrison, the ex-girlfriend of WikiLeaks founder Julian Assange, who is holed up in the Ecuadoran Embassy in London fighting extradition charges to Sweden. The WikiLeaks legal team and I are interested in preserving Mr. Snowden's rights and protecting him as a person, said Baltasar Garz?n, legal director of WikiLeaks and Assange's lawyer. What is being done to Mr. Snowden and to Mr. Julian Assange ? for making or facilitating disclosures in the public interest ? is an assault against the people. Where is Snowden headed??The American was met in Moscow by officials from Ecuador including its ambassador to Moscow Patricio Chavez. The?Washington Post?claims it spoke on the phone to Kristinn Hrafnsson, an Icelandic investigative journalist and WikiLeaks spokesman,? who confirmed Moscow was not a final destination. Though Hrafnsson refused to reveal where that might be, the media is unanimous in declaring that Ecuador is where Snowden hopes to find sanctuary. The?Daily Telegraph?quotes the country's foreign minister, Ricardo Patino, saying a request has been made for asylum. It [the request] has to do with freedom of expression and the security of citizens around the world? we will make a decision on this, we are analysing this with a lot of responsibility. What is the US reaction??Fury. The Guardian says the latest development has whipped up a diplomatic storm with the Americans particularly angry with President Putin. The bottom line is very simple: allies are supposed to treat each other in decent ways, fumed Democratic senator Chuck Schumer. Putin always seems almost eager to put a finger in the eye of the United States, whether it is Syria, Iran and now of course with Snowden?and I think it will have serious consequences for the United States-Russia relationship. The US is also angry that Hong Kong didn't prevent Snowden boarding the flight to Moscow despite their formal request for his detainment. The US is disappointed and disagrees with the determination by Hong Kong authorities not to honour the request for the arrest of the fugitive, said a government official. What role, if any, has China played??Hong Kong said they were unable to arrest Snowden because the warrant filed by the US did not fully comply with the legal requirements under Hong Kong law . How much pressure was brought to bear by the Chinese government is unclear but the Chinese authorities were said to be furious after the South China Morning Post alleged on Saturday that the NSA had hacked into Chinese phone companies . China's official Xinhua news agency said the revelations demonstrate that the United States, which has long been trying to play innocent as a victim of cyber attacks, has turned out to be the biggest villain in our age . But according to Republican congresswoman Ileana Ros-Lehtinen, the only villain is China and their alleged connivance calls into question what kind of relationship we ever have had with China?we pretend that everything is hunky-dory when it is not. Beijing angered by Edward Snowden's NSA hacking claim EDWARD SNOWDEN'S claim that the US has been hacking computers in Hong Kong and mainland China since 2009 is certain to put a strain on US-Sino relations, sources say. While Hong Kong braces for what may prove to be a protracted legal battle over US efforts to extradite the 29-year-old American whistleblower, Chinese media are digesting his latest claims. In a front-page interview with the?South China Morning Post?- his first since checking out of the Mira hotel above on Monday - Snowden said the National Security Agency had hundreds of cyberespionage targets in mainland China and Hong Kong. We hack network backbones ? like huge internet routers, basically ? that give us access to the communications of hundreds of thousands of computers without having to hack every single one, he told the paper. Chinese state media have been quick to point out that Snowden's allegations follow months of accusations by Washington about China's alleged cyber attacks on US military and commercial targets. Li Haidong, a researcher of American studies at China Foreign Affairs University, told?China Daily: It turns out that the biggest threat to the pursuit of individual freedom and privacy in the US is the unbridled power of the [US] government. That sentiment was amplified on Chinese social media where users accused the US of hypocrisy. US authorities moved quickly to say there were no legitimate parallels between the NSA's surveillance program and China's alleged hacking of military and commercial secrets. There is a difference between going after economic data and the issues of surveillance that the president has addressed which are about trying to stop people doing us harm, a spokeswoman for the State Department told?The Guardian. ? A US intelligence employee contacted by the?New York Times?agreed that the two situations were apples and oranges . I can tell you with absolute certainty the US government does not pass on technological secrets obtained through ? espionage to US firms, both as a matter of principle and because there is no fair way to do it, the anonymous source said. I recall some senior bureaucrat proposing this some two decades ago ? and he got nowhere . Such comments are unlikely to quell the rising sense of outrage in China. In a front-page article the China Daily says the massive US global surveillance program revealed by Snowden is certain to stain Washington's overseas image and test developing Sino-US ties. Is Edward Snowden a hero or a villain? Two perspectives EDWARD SNOWDEN'S decision to turn his back on his $200,000-a-year-job to expose what he believes is expansive government overreach in the use of the Prism surveillance program, has drawn wildly different responses. To some, Snowden is a geek hero cut from the same cloth as WikiLeaks founder Julian Assange. To others, he's guilty of treason and should be extradited to the US to face trial. Here are two very different perspectives on Snowden's?sensational revelations?? first from the man who leaked the Pentagon Papers in 1971, revealing how the American public had been misled about Vietnam, the second from a retired FBI profiler... Daniel Ellsberg writing in The Guardian:? In my estimation, there has not been in American history a more important leak than Edward Snowden's release of NSA material ? and that definitely includes the Pentagon Papers 40 years ago. Snowden's whistleblowing gives us the possibility to roll back a key part of what has amounted to an 'executive coup' against the US constitution. Since 9/11, there has been, at first secretly but increasingly openly, a revocation of the bill of rights for which this country fought over 200 years ago. In particular, the fourth and fifth amendments of the US constitution, which safeguard citizens from unwarranted intrusion by the government into their private lives, have been virtually suspended. The government claims it has a court warrant under Fisa [an Act permitting the intelligence community to collect communications involving non-US citizens believed to be located abroad] ? but that unconstitutionally sweeping warrant is from a secret court, shielded from effective oversight, almost totally deferential to executive requests. As Russell Tice, a former National Security Agency analyst, put it: 'It is a kangaroo court with a rubber stamp'. Clint van Zandt writing for the Daily Beast:? For someone to believe he could make decisions on world events and [that] he can shape the world and [that] he alone ? not the federal judges, or the attorney general, or the Supreme Court ? should be the only one to determine what should be a national secret... That's a level of arrogance only he can explain. FBI and CIA agents have given up secret information to the Soviets ? sometimes for money and sometimes because they were underpaid and underappreciated and this was their way of saying, 'Look how smart I am.' Was there a level of narcissism [in what Snowden did]? Did he feel his supervisors demeaned him? Did he feel he was underpaid? All these questions will have to be answered. Edward Snowden: will Russia offer whistleblower asylum?? AS US Republicans accuse Edward Snowden of treason for leaking NSA secrets, and demand that he is brought to justice, there are reports that Russia could offer him asylum. Meanwhile, he has disappeared from the Hong Kong hotel where he was staying when he asked The Guardian to reveal his name on Sunday. These are the latest developments: Gone to ground: The 29-year-old checked out of the Mira Hotel in Hong Kong hotel on Monday hours before a media pack descended on the island desperate to track him down , says The Guardian. A reporter from the Washington Post visited the hotel in the Tsim Sha Tsui quarter of the city, just across the harbour from the main island. The receptionist confirmed that a guest named Edward Snowden had been staying there but gave no other information. Next move: The whistleblower's future is anyone's guess , says the Guardian. The Post says that in an email to the paper on 24 May Snowden said Iceland was an asylum option because it has strong internet and press freedoms . Now The Times says Snowden could turn to Russia in his quest for asylum. Kremlin spokesman Dmitry Peskov told the Kommersant paper: If we receive such a request, we will consider it. Hong Kong risk: The Post carries an interview with Regina Ip, a legislator and chair of the Pro-Beijing New People's Party, who warns: Hong Kong is definitely not a safe harbour for him. This is because of a 16-year-old treaty that guarantees extraditions between the United States and Hong Kong except under rare circumstances . Should the US charge Snowden with breaking espionage laws, Hong Kong is likely to transfer him to US custody . Calls for justice: US Republicans are calling for the book to be thrown at Snowden. Peter King, a member of the House Intelligence Committee, says the government must prosecute him to the fullest extent of the law and begin extradition proceedings at the earliest date , while Sen Lindsey Graham of South Carolina tweeted: I hope we follow Mr. Snowden to the ends of the earth to bring him to justice. Former UN Ambassador John Bolton said: This man is a liar. He took an oath to keep the secrets that were shared with him so he could do his job? I say that is the worst form of treason. Family in spotlight: Snowden may have gone to ground but his family and girlfriend have found themselves caught in the full glare of the media spotlight. ABC News says that his father, Lonnie, 52, a former US coast guard officer living in Pennsylvania, is still digesting the news but was concerned for his son . The broadcaster said that Snowden Snr received a visit on Monday from two men who identified themselves as FBI agents . The girl he left behind: Snowden left his girlfriend behind in Hawaii when he flew to Hong Kong on May 20. She has been identified as 28-year-old Lindsay Mills. The Times calls her a former ballet dancer who is reported to be a member of an Hawaiian troupe of acrobats . The Daily Mail says she is an extrovert who enjoys walking around naked whenever she can, spends her Sunday evenings in circus classes and surrounds herself with bohemian eccentrics . Lifting several photographs from Mills's blog ? including one of her clad only in black stockings and pink panties ? the Mail quotes a line from her latest entry dated Monday: As I type this on my tear-streaked keyboard I'm reflecting on all the faces that have graced my path. The ones I laughed with. The ones I've held. The one I've grown to love the most. And the ones I never got to bid adieu. But sometimes life doesn't afford proper goodbyes. Sex symbol: Snowden might be public enemy number one in the US, and he might have broken the heart of his girlfriend, but he's also the new sex symbol of cyberspace. Edward Snowden is Geek Hot! is the general consensus on Twitter, with one woman declaring he can blow my whistle any time he wants.???