Trayvon Martin Riots in Oakland likely instigated by professional provocateurs And, predictably, the incidents are used to arouse public sentiment in favor for more money and military equipment for the police, and, ironically, public support for the police means less sympathy for those suffering Human Rights abuse. From 2013-07-17 San Francisco Chronicle online [sfchronicle.com]: Many of the those who engaged in acts of rebellion against their local branch of fascism came from a highly visible circle waving the Red &amp; Black flag, which usually represents the Anarco-Communist networks, although not a single of these networks have produced a public statement explaining the political reasoning of their acts of rebellion, a surprising denial of publicity for their message.? 2013-07-14 Protesters set fires and tag Oakland businesses ? 07-14 00:25 PDT OAKLAND -- Protesters marched through the streets of San Francisco and Oakland on Saturday evening, upset at the acquittal of George Zimmerman in the shooting of Trayvon Martin in Florida. In San Francisco, demonstrators marched through the Mission District after gathering at the 24th Street Mission BART Station. Hundreds marched down Valencia Street, chanting Justice for Trayvon Martin. The crowd dispersed peacefully, and officers will maintain a presence in the Mission District for the time being, said San Francisco police Officer Gordon Shyy, a department spokesman. Another protest was scheduled for 4 p.m. Sunday at Powell and Market streets. Across the bay in Oakland, however, about 125 protesters gathered at Frank Ogawa Plaza outside City Hall before marching through downtown, starting small fires and smashing windows at the Wells Fargo Bank at 12th Street and Broadway and at several locations, including the Dogwood Bar, the Oakland Tribune and the Sears store. A BART police car parked outside the 12th Street BART Station had its windows smashed, and protesters spray-painted F- the police and Kill Pigs on the side of the vehicle. About 11:30 p.m., Oakland police formed a skirmish line near their headquarters at 7th Street and Broadway and came face-to-face with protesters. Argus, the police helicopter, was monitoring the crowd from above. The crowd later moved away from the intersection and headed east on 14th Street, stopping at a McDonald's restaurant shortly after midnight to burn several flags and to spray-paint Kill Zimmerman and FTP, an anti-police epithet, on the side of Alameda County's Rene C. Davidson Courthouse. Burning a flag outside McDonald is not hazardous to your health, and enables the message to be pushed forward! THIS IS NOT AMERICA, This is Liberated Oakland! Photo: Anda Chu from Bay Area News Group, Posted at 2013-07-15 Protests in S.F., Oakland over Zimmerman verdict , San Francisco Chronicle [link] Burning trashcans is hazardous because of the extreme concentration of flammable items. Photo: Anda Chu from Bay Area News Group, Posted at 2013-07-15 Protests in S.F., Oakland over Zimmerman verdict , San Francisco Chronicle [link] Photo: Anda Chu from Bay Area News Group, Posted at 2013-07-15 Protests in S.F., Oakland over Zimmerman verdict , San Francisco Chronicle [link] Photo: Jane Tyska from Bay Area News Group, Posted at 2013-07-15 Protests in S.F., Oakland over Zimmerman verdict , San Francisco Chronicle [link] Police stand guard against their enemy, the People protesting against their practice of extra-judicial murder, illegal search &amp; seizure, unwarranted kidnappings and extortions. Photo: Ian C. Bates, Posted at 2013-07-15 Protests in S.F., Oakland over Zimmerman verdict , San Francisco Chronicle [link] Photo: Anda Chu from Bay Area News Group, Posted at 2013-07-15 Protests in S.F., Oakland over Zimmerman verdict , San Francisco Chronicle [link] 2013-07-13 Acts of Violence Mar Oakland Zimmerman Protest by Breitbart News [www.breitbart.com/Big-Government/2013/07/13/Violent-Protest-Breaks-Out-Oakland-Trayvon]: A few acts of violence broke out at protests in Oakland over the George Zimmerman acquittal in the Trayvon Martin trial, with ralliers smashing windows and marching down the street carrying a poster reading: ?F--- THE POLICE? and ?VENGEANCE.? They also smashed the windows on a police car and spray painted a Wells Fargo: 2013-07-13 Twitpic from @deboraktvu [pic.twitter.com/0WPUsKGEvX]: In California, Oakland riots have been reported after the Trayvon Martin verdict was handed down earlier this evening in a Florida courtroom. While several false alarms sounded earlier on Twitter, Oakland riots reports on Twitter appear to be the first confirmed instance of civil unrest following the late-night decision in Seminole County. Twitter user @HarryElephante tweets that the reported Oakland riots are not in fact riots, and just small outbreaks of vandalism during a protest, saying: There is no ?rioting? in #Oakland. There is a small march. A couple of people broke the windows of a car. That isn?t a riot. #Zimmerman User ?@lexxluthaa adds: ?Protests are nothing but peaceful, don?t believe the hype #Oakland? Another user reports that Oakland unrest reports are not protestors from Trayvon Martin rallies, saying white ?college kids? have been the ones rioting in small numbers: The people tearing up stuff in downtown oakland just now are not brown. ? Juicy J Crillz @jcrillz July 14, 2013 Minimal vandalism spotted so far. Some graffiti and the window at Dogwood. Heading farther down Telegraph soon. ? Juicy J Crillz @jcrillz July 14, 2013 Another user makes the same claim, that Trayvon Martin protesters are not to blame for Oakland riots reports: @RADIOTALK101 Hardly any. So far, in Oakland anyway, it looks like white kids starting trouble just for the hell of it? ? Jami @Jami_USA July 14, 2013 A livestream from Oakland does not appear to show riots, and footage streaming currently shows little street activity in the location filmed. Users on Twitter are sharing purported images out of Oakland, with some indicating property may have been damaged. It is not clear whether the damage shown is related to Trayvon Martin protests, however. 2013-07-16 Youth Radio Continues Coverage After Vandalism : Last night, amidst protests of the verdict in the Trayvon Martin shooting case, two wall-sized windows of Youth Radio's downtown Oakland headquarters were smashed, along with the windows of a few other businesses in the area. Youth Radio journalists are continuing to cover the verdict and its repercussions, producing stories for local and national outlets. And our educators are gearing up for our summer classes, which start today. Moving forward, young people will continue to engage, inform, and challenge us, through their journalism, their learning, and their teaching. Throughout this time, the support from Youth Radio's local community and national network has been tremendous. We are inspired by our community's ability to come together in the service of the young people we serve-young people like Trayvon. Our building is a place where youth come to learn, grow and make their voices heard. Thank you for helping us to uphold that safe space. Young people record their reaction to the vandalism. Watch the video here. Photo: Youth Radio. 2013-07-24 Evidence Mounts Agent Provocateurs Used by Brazilian Police Demonstrators say police infiltrator threw the molotov cocktail used to justify severe police violence by Sarah Lazare from Common Dreams [http://www.commondreams.org/headline/2013/07/24-4]: Military police released a video shortly after the police crackdown, allegedly showing that the repression was a direct response to protesters' violence [http://www.youtube.com/watch?v=TIZmQHEK4L8]. Yet, the video was mysteriously removed when photo and video evidence emerged suggesting that the person pictured throwing the Molotov cocktail, and his associate, were police officers. One clip, recorded by a witness, shows, the two men were briefly stopped by a uniformed officer who seemed to take them for protesters before one of them pulled out some form of identification and said, ?It?s the police, dude.? the Lede reports. The footage can be seen here: While the Lede says there is little doubt that video evidence shows at least two infiltrators, it claims there is insufficient evidence to prove that the Molotov cocktail was thrown by one of them. However, Brazilian activists compiled evidence they say shows that the Molotov thrower was an agent provocateur, including an annotated video by a Brazilian blogger [http://www.youtube.com/watch?v=7kkgK9eY7Lo]. Police appeared to target journalists and videographers who were recording Monday's events, bludgeoning the head of an AFP photographer [http://www.news24.com/World/News/AFP-lensman-hit-by-police-during-Rio-demo-20130723] and arresting at least two journalists with the Midia Ninja media collective [http://www.facebook.com/midiaNINJA]. In an online statement, one of the Midia Ninja journalists who was arrested said that protesters rallied outside of the police station to support those on the inside, and the outpouring of solidarity left him with the confidence that tomorrow will be greater. Demonstrators were protesting the $53 million allocated towards funding the Pope's visit at a time when public services are being gutted and unemployment and poverty plaguing the country. Mass mobilizations throughout Brazil?touched off by a March bus fare hike that swelled anger about diversion of public resources towards mass spectacles, like soccer matches and Pope visits, rather than vital services?have been met with severe police violence, and images of gas attacks on unarmed protesters have gone viral [https://www.commondreams.org/headline/2013/06/19-2].