Two groups rallied in Houston Sunday night -- one in support of Trayvon Martin; the other in support of George Zimmerman. Tensions were high in River Oaks as the two rallies converged on the area. Both had passionate views about the Zimmerman's trial, and neither was afraid to share them. As promised, Houston police kept two angry groups separated on the streets leading into River Oaks. The New Black Panther Party marched peacefully with hundreds of supporters showing their outrage over Zimmerman's acquittal in the shooting death of 17-year-old Trayvon Martin in Florida. The Justice for Trayvon rally started at 4pm, taking off from Wiley Park, and was part of a nationwide movement organized by Rev. Al Sharpton's National Action Network. I just feel like justice wasn't served, Whitney McKenzie said. Rallies and vigils have been outside federal buildings nationwide, including two in Houston and one in Galveston on Saturday. Protesters said they want the Justice Department to pursue a case against Zimmerman. I keep hearing that we are one America, but the system does not treat you like one America, Cougartino said. So until the system treats us as one America all of us are in jeopardy in my opinion. Across the street, about 80 people attended a response to the march. Organizers called it the G. Zimmerman River Oaks Stand Your Ground Event. They began their march at Lamar High School at 3pm with more observers showing up than participants. I think most of the people here are in favor of the verdict and support the Zimmerman family, Zimmerman supporter Carl Haggard said. In this group, there were a variety of viewpoints being expressed. Several protesters told us they were there to support stand-your-ground laws, which Attorney General Eric Holder said should be examined. I don't support all of those signs, but there are some of us that are out here to support the laws that are on the books, Wayne Helbert said. The rally was also, according to participants, against the New Black Panther Party's statements following the Zimmerman verdict in the shooting death of Martin and against what they called race baiting and racism in America. We're here to unify to show that it's a multicultural United States, that nobody should be judged by the color of their skin, that everybody bleeds the same blood so we should all be considered equal, Stacey Lawson said. When the two sides passed one another, hate speech filled the air. Obscenities were shouted and observers saw a clash of tempers. There was no violence, but anger and intolerance spilled out onto the streets in what was supposed to be a peaceful protest. The Houston Police Department had officers on scene in the River Oaks neighborhood -- in cars and vans, on bicycles, on foot and on horseback -- to monitor both groups closely. Considering the number of people who marched, police considered the event a success with no injuries reported. Take ABC13 with you! Download our free apps for iPhone, iPad and Android devices