CAIRO AP - July 7, 2013 -- 				Feuding erupted within Egypt's new leadership on Sunday as secular and liberal factions wrangled with ultraconservative Islamists who rejected their choice for prime minister, stalling the formation of a new government after the military's ouster of President Mohammed Morsi. At the same time, the shows of strength over the removal of Egypt's first freely elected president were far from ending, with tens of thousands in the streets Sunday from each side. The military deployed troops at key locations in Cairo and other cities amid fears of renewed violence. 	 The Muslim Brotherhood pushed ahead with its campaign of protests aimed at forcing Morsi's reinstatement, bringing out large crowds in new rallies. Its officials vowed the group would not be terrorized by arrests of their leaders and the shutdown of their media outlets. 	 The Brotherhood's opponents, in turn, called out large rallies in Tahrir Square and other squares in Cairo and several cities to defend against an Islamist counter-push. Military warplanes swooped over the crowd filling Tahrir, drawing a heart shape and an Egyptian flag in the sky with colored smoke. 	 Two days ago, clashes between the rival camps left at least 36 dead and more than 1,000 injured nationwide. 	 Senior Brotherhood members Saad Emara said there was no possibility for any negotiations with the new leadership after all betrayed us, and following the military's clampdown on the group. 	 We are not regressing to a Mubarak era but to ... a totalitarian regime, he told The Associated Press. Anything other than protest is suicide. 	 Morsi and five top Brotherhood figures are currently in detention, and around 200 others have arrest warrants out against them. The group's TV station and three other pro-Morsi Islamist stations were put off the air. Among those detained is Badie's deputy Khairat el-Shater, seen as the most powerful figure in the group and its main decision-maker. 	 The wrestling over the prime minister spot underlined the divisions with the collection of factions that backed the military when it pushed Morsi out of office on Wednesday and installed a senior judge, Adly Mansour, as an interim president. 	 At center stage of the feuding is the ultraconservative Salafi al-Nour Party, the sole main Islamist faction that sided with the mainly secular groups that led the charge against Morsi. On Saturday, the party blocked the appointment of reform leader Mohammed ElBaradei, a favorite of liberal, leftist and secular groups, as prime minister. 	 Another member of the coalition, Tamarod, the main organization behind the massive protests last week calling for Morsi ouster, said ElBaradei was still its candidate for the post. It railed against al-Nour on Sunday, accusing it of blackmail and arm-twisting. 	 Showing the outside pressures on al-Nour, Emara of the Brotherhood said al-Nour has lost credibility and trust after they sided with the takeover - a sign the Brotherhood hopes to draw the party's Salafi supporters behind it in the streets alongside other Islamists. 	 The prime minister is to be the real power in whatever interim government emerges, since the president's post will be largely symbolic. The prime minister will also likely have strong influence on the process of writing a new constitution. 	 That's a major concern of al-Nour, which pushed hard for the Islamic character of the charter pushed through under Morsi's administration, which was suspended after his ouster. 	 Mohammed Aboul-Ghar, the leader of the liberal Egyptian Socialist Democratic Party, said al-Nour initially agreed to ElBaradei taking the post, but then shifted its position for unknown reasons. He said talks are still ongoing through mediators. 	 Abdullah Badran, a leading al-Nour lawmaker, said there was a misunderstanding and that it hadn't accepted ElBaradei. The party has asked for 48 hours to propose alternatives, he said, adding that it will finalize its position but will not back ElBaradei. 	 This sensitive period requires an independent who can win consensus not cause more divisions and polarization, he told The Associated Press. We don't want prejudices because it would only lead to more divisions. 	 He said that objections to ElBaradei are rooted in his lack of popularity not only among Islamists but among a large sector of Egyptians. 	 ElBaradei, a 71-year-old Nobel Peace laureate for his time as head of the U.N. nuclear watchdog, is an inspiring figure among the leftists, secular and revolutionary youth groups behind the 2011 uprising that toppled autocrat Hosni Mubarak. Word on Saturday that he would be appointed prime minister sparked cheers among many of their ranks, believing he can push a strong reform agenda. 	 But he is deeply distrusted as too secular among many Islamists and seen by much of the public as elite. 	 Walid el-Masry, of Tamarod, said al-Nour is using the ElBaradei issue to press liberals on the constitution, worried about changes to the Islamist-drafted charter. 	 They are afraid about the articles that concern the state's Islamic identity, he said, adding that the liberals assured Salafis that they won't touch these articles. 	 Al-Nour was once an ally of Morsi but broke with him over the course of his year in office, saying his Brotherhood was trying to monopolize power, even over other Islamists. When the June 30 wave of anti-Morsi protests began, the party called on its followers to stay neutral. But it supported the military's intervention to remove the president, joining in talks with army chief Gen. Abdel-Fattah el-Sissi. 	 Meanwhile, the Brotherhood and their opponents sought to show their power in the streets. The Islamists have denounced the removal of Morsi as an army coup against democracy. Their opponents have aruged the president had squandered his electoral mandate and that the Brotherhood was putting Egypt on an undemocratic path. 	 Tamarod, Arabic for Rebel, called on its supporters to turn out to defend popular legitimacy and confirm the victory achieved in the June 30 wave. By Sunday evening, large crowds filled Tahrir Square and the streets outside the Ittihadiya presidential palace. 	 Pro-Morsi rallies turned out in several places around the city, centered outside the Rabaah al-Adawiya Mosque where they have been holding a sit-in for more than a week. 	 In a Facebook posting Sunday, the Brotherhood's supreme leader Mohammed Badie said the leaders of the unconstitutional coup continue flagrant violations against the Egyptian people. 	 A Brotherhood spokesman, Gehad el-Haddad, said the military is not giving any positive signals for the group to be willing to talk, pointing to the arrests of the leadership figures and shutdowns of media. 	 They are trying to terrorize us, he said. 	 Outside Rabaa al-Adawiya, Brotherhood supporters waved flags as young men wearing makeshift helmets jogged in place and did calisthenics, as part of security teams the group says are to defend its rallies from attack. 	 Do we not deserve democracy, aren't we worth anything? said an emotional Alaa el-Saim, a retired army engineer in a broad-brimmed hat to protect from the sun. He pointed to the shooting by troops on Friday of pro-Morsi protesters. It's the first time I've seen that, the army shoots at us with weapons they bought with the taxes I paid. 	 Khaled Galal, a young bearded man in a skull cap, called the army's actions the rape of legitimacy. 	 Muslims aren't allowed democracy, and when we pick up weapons to defend it we get called terrorists, he said. 	 AP correspondent Tony G. Gabriel contributed to this report