Millions gathered in Tahrir Square erupted in cheers Wednesday as Egypt?s military ousted the nation?s first democratically elected president after just a year in power, installing a temporary civilian government, suspending the newly minted constitution and calling for new elections. Mohammed Morsi said the measures ?represent a full coup categorically rejected by all the free men of our nation,? according to his Twitter account. Army chief Abdel-Fattah el-Sissi, in a televised address to the nation on Wednesday, said a government of technocrats will be appointed to run the country during a transition period he did not specify. https://twitter.com/EgyPresidency/status/352510972046483459 A Morsi aide, Ayman Ali, said the former leader was moved to an undisclosed location after the army?s announcement. He gave no details. Cheers erupted among millions of protesters nationwide who were demanding Morsi?s ouster. Fireworks lit the Cairo night sky. After the announcement, anti-Morsi protesters set off fireworks in Cairo?s Tahrir Square and called out ?God is great? and ?Long live Egypt.? Elsewhere in the city, Morsi supporters shouted ?No to military rule.? Egyptian military leaders assured the Obama administration Wednesday that they are not interested in long-term of the country, American officials said. The administration would be forced to suspend its $1.5 billion in annual military and economic assistance to Egypt ? which is deemed a critical U.S. national security priority ? if the ouster is determined to have been a coup d?etat. Under U.S. law, the unconstitutional ouster of a democratically elected government by a country?s armed forces would trigger an aid cutoff. However, such legal determinations can take time and the officials said they believed Egypt?s military was trying to take steps to keep such a finding from being reached. In conversations between senior Egyptian army officers and Defense Secretary Chuck Hagel and Gen. Martin Dempsey, chairman of the Joint Chiefs of Staff, senior Egyptian army officers pledged to put a civilian government in place quickly, if not immediately, after removing Morsi from power, the U.S. officials said. The officials spoke on condition of anonymity because they were not authorized to speak by name about the private conversations that occurred over the past week. Earlier, airport officials said a travel ban has been issued against Morsi and the leader of the Muslim Brotherhood. The officials said Wednesday that the travel ban on Morsi has to do with his escape from prison with more than 30 other Muslim Brotherhood during the 2011 uprising against autocrat Hosni Mubarak. Also banned from travel is Brotherhood leader Mohammed Badie, his deputy Khairat el-Shater. The opposition accuses them of calling all the shots during Morsi?s year in power. Giant cheering crowds of Morsi?s opponents had been gathered in Cairo?s Tahrir Square and other locations nationwide all day, waving flags furiously in expection that the military will act to remove the Islamist president after the deadline ends. Earlier Wednesday, Egypt?s military moved to tighten its control on key institutions Wednesday, putting officers in the newsroom of state TV, in preparation for an almost certain push to remove the country?s Islamist president when an afternoon ultimatum expires. For the second time in Egypt?s tumultuous 2 1/2 years of upheaval, the powerful army appears to be positioned to remove the country?s leader. But this time, it would be ousting a democratically elected president, the first in Egypt?s history ? making its move potentially explosive. Just before the deadline, Mohammed Morsi, inaugurated a year ago after the 2011 fall of his autocratic predecessor Hosni Mubarak, repeated his vows not to step down in the face of millions of protesters in the streets in the biggest anti-government rallies the country has seen. His Islamist supporters have vowed to resist what they call a coup against democracy, and have also taken to the streets by the tens of thousands. At least 39 people have been killed in clashes since Sunday, raising fears the crisis could further explode into violences The clock was ticking on the military?s deadline, expiring around 4 p.m. to 5 p.m. 1400-1500 GMT, 10 a.m.-11 a.m. EDT . In a last minute statement before the deadline, Morsi again rejected the military?s intervention, saying abiding by his electoral legitimacy was the only way to prevent violence. He criticized the military for ?taking only one side.? ?One mistake that cannot be accepted, and I say this as president of all Egyptians, is to take sides,? he said in the statement issued by his office. ?Justice dictates that the voice of the masses from all squares should be heard.? The free electing of a president had been one of the aspirations of the 2011 revolt that toppled Mubarak. Morsi?s opponents say they want to remove a president who has lost his election legitimacy by trying to monopolize power with Islamists ? and that if it takes his army intervention to bring in new leadership and put the country on a more democratic path, so be it. But at the main pro-Morsi protest in Cairo, a hard-line cleric Magdy Hussein read a statement to the crowds of thousands, saying that any move against Morsi would be considered ?a full coup.? ?Wake up el-Sissi, Morsi is my president,? the crowds chanted outside the Rabia al-Adawiya Moqsue. ?We will not bring back the military rule.? ?Will not happen, will not happen,? they shouted. The army has insisted it is not carrying out a coup, but acting on the will of the people to clear the way for a new leadership. But on Wednesday it clearly was positioning itself to maintain control during any unrest sparked by a move on Morsi. The military beefed up its presence inside the mammoth headquarters of state television on the banks of the Nile River in central Cairo. Crack troops were deployed in news-production areas. Officers from the army?s media department moved inside the newsroom and were monitoring output, though not yet interfering, staffers said, speaking on condition of anonymity because they were not authorized to talk about the arrangements. The state TV is run by the information minister, a Muslim Brotherhood member put in the post by Morsi, and its coverage had largely been in favor of the government. But already in the past two days, the coverage saw a marked shift, with more balanced reporting showing the anti-Morsi protests along with pro-Morsi ones. State radio has seen a similar shift. The authoritative, state-run Al-Ahram newspaper ? which also seemed to be following a military line ? reported that the military had placed several leaders of Morsi?s Muslim Brotherhood under surveillance and issued a foreign travel ban on the Islamist group?s top leaders. It said several top Brotherhood leaders have been put under house arrest, though there was no immediate confirmation of which figures it was referring to. It also said arms caches allegedly belonging to the Brotherhood have been located. Security officials at Cairo?s international airport said the travel ban covered among others the Brotherhood?s former leader Mahdi Akef and the group?s senior official Mohammed el-Beltagi and the leader of the Islamist Wasat party Abou Ela Madi and his deputy Essam Sultan. The officials said screening departing passengers has been tightened to ensure leaders of the Brotherhood and other Islamist groups don?t slip out with the help of sympathetic airport employees. They spoke on condition of anonymity because they were not authorized to speak to the media. ?We will steadfastly and peacefully reject this coup, adhering to our fair stand,? el-Beltagi wrote Wednesday on his official Facebook account. El-Sissi held a group meeting Wednesday with leading reform advocate Mohammed ElBaradei, Egypt?s top Muslim cleric ? Al-Azhar Sheik Ahmed el-Tayeb ? and Coptic Pope Tawadros II to discuss its political road map, a spokesman for the senior opposition National Democratic Front, Khaled Daoud, said on state TV. Also attending the meeting were a representative of the new youth movement behind this week?s protests and some members of the ultraconservative Salafi movements, a defense ministry official told The Associated Press. The official spoke on condition of anonymity because he was not authorized to speak to the media. Under a plan leaked to state media, the military would install a new interim leadership, the Islamist-backed constitution suspended and the Islamist-dominated parliament dissolved. Massive crowds of anti-Morsi protesters moved back into the main squares of Cairo and other major cities for a fourth straight day Wednesday morning. Cairo?s central Tahrir Square was a sea of furiously waving Egyptian flags as the throngs waited for an announcement by the military that the deed was done. The gathering followed a night of deadly clashes in Cairo and elsewhere in the country that left at least 23 people dead, the most in a single incident near the main Cairo University campus. At least 39 people have died since the protests began on Sunday. In a speech late Tuesday night, Morsi vowed not to step down and pledged to defend his legitimacy with his life in the face of the massive street protests. Morsi demanded that the powerful armed forces withdraw their ultimatum, saying he rejected all ?dictates? ? from home or abroad. The army said if no agreement was reached between Morsi and the opposition it would intervene to implement a political road map of its own. In his emotional, 46-minute address aired live to the nation late Tuesday, the Islamist leader accused loyalists of his ousted autocratic predecessor Hosni Mubarak of exploiting the wave of protests to topple his regime and thwart democracy. ?There is no substitute for legitimacy,? said Morsi, at times angrily raising his voice, thrusting his fist in the air and pounding the podium. He warned that electoral and constitutional legitimacy ?is the only guarantee against violence.? The Interior Ministry, in charge of the police, piled up the pressure on Morsi on Wednesday. It pledged in a statement to stand by and protect the protesters against violence. ?We are all the Egyptians, and at the face of the military, we are standing,? they screamed. As anti- and pro-Morsi supporters geared up for the fourth consecutive day of mass rallies Wednesday, it was clear that Egypt?s crisis had become a struggle over whether a popular uprising can overturn the verdict of the ballot box. Mahmoud Badr, spokesman for Tamarod, or Rebel ? the youth movement behind the latest wave of protests ? called on anti-Morsi protesters to demonstrate outside three presidential palaces as well as the Cairo headquarters of the Republican Guard, an army branch tasked with protecting the president, his family and presidential palaces. Morsi is thought to have been working at the Republican Guard headquarters since the start of the protests. Badr also called on the army to place Morsi under arrest for his alleged incitement to civil war. ?Today is the day of decisiveness,? Badr said at a news conference Wednesday.