The?political?crisis in Egypt has reached a critical moment?as a face-off is now underway between the nation's military leaders, President Mohammed Morsi, and their thousands of supporters in the streets. Morsi has defied an ultimatum ?to resolve the crisis or step down and the country is now nervously awaiting the response from their top generals. The army has previously declared an intention to intervene with their own road map for fixing the government, at the moment it appears they are attempting to do just that.? Both sides have vowed to sacrifice their own blood ? and the blood of others in the fight to come, but no one knows for sure what will happen next as the chaotic situation unfolds in the streets. 	We will continue to update you on the situation as it develops, but you can also read all our previous updates and see a live feed of Tahrir Square below. See more camera angles here. Times given are? Eastern Daylight Time?and/or? Cairo Eastern European Time,?which is about six hours ahead. 	THE LATEST 	7:42 p.m. E.T:?A Muslim Brotherhood spokesperson says that Morsi is under house arrest:? 	? Gehad El-Haddad @gelhaddad July 3, 2013 	There were rumors of this earlier in the day, but still no confirmation from the military.? 	7:29 p.m. E.T:?The AP has more information on the arrests of two Muslim Brotherhood leaders ? the reason cited for their arrest is reportedly a 2011 prison escape of many MB leaders in Cairo, including Morsi. The Muslim Brotherhood was a banned political party in the country during Mubarak's reign. The event came up this weekend when a court ruled that the Brotherhood, along with other Islamist groups, were behind the jail break. Here's more on the 2011 jail break, from a Guardian report at the time:? 		Armed gangs took advantage of the chaos in Cairo and other cities to free the prisoners, starting fires and engaging prison guards in gun battles, officials said. Several inmates were reportedly killed during the fighting and some were recaptured. 	7:05 p.m. ET:?Both Reuters and Al Jazeera English, citing the?Egyptian state newspaper Al-Ahram, are reporting that there are now 300 arrest warrants out for Muslim Brotherhood members.? 	6:55 p.m. ET:?President Obama has released a statement on today's events in Egypt. It does not use the word coup. While the statement uses relatively minor wording, it says that the U.S. is deeply? concerned by the decision of the Egyptian Armed Forces to remove President Morsy and urges the military to avoid any arbitrary arrests of President Morsy and his supporters. As for aid to the country, which the U.S. would have to cancel if the ouster of Morsi by the military is deemed a coup, the president said this: I have also directed the relevant departments and agencies to review the implications under U.S. law for our assistance to the Government of Egypt. 	The full statement is here: 		As I have said since the Egyptian Revolution, the United States supports a set of core principles, including opposition to violence, protection of universal human rights, and reform that meets the legitimate aspirations of the people.? The United States does not support particular individuals or political parties, but we are committed to the democratic process and respect for the rule of law.? Since the current unrest in Egypt began, we have called on all parties to work together to address the legitimate grievances of the Egyptian people, in accordance with the democratic process, and without recourse to violence or the use of force.? 		The United States is monitoring the very fluid situation in Egypt, and we believe that ultimately the future of Egypt can only be determined by the Egyptian people. Nevertheless, we are deeply concerned by the decision of the Egyptian Armed Forces to remove President Morsy and suspend the Egyptian constitution. I now call on the Egyptian military to move quickly and responsibly to return full authority back to a democratically elected civilian government as soon as possible through an inclusive and transparent process, and to avoid any arbitrary arrests of President Morsy and his supporters. Given today?s developments, I have also directed the relevant departments and agencies to review the implications under U.S. law for our assistance to the Government of Egypt.? 		The United States continues to believe firmly that the best foundation for lasting stability in Egypt is a democratic political order with participation from all sides and all political parties ?secular and religious, civilian and military. During this uncertain period, we expect the military to ensure that the rights of all Egyptian men and women are protected, including the right to peaceful assembly, due process, and free and fair trials in civilian courts.? Moreover, the goal of any political process should be a government that respects the rights of all people, majority and minority; that institutionalizes the checks and balances upon which democracy depends; and that places the interests of the people above party or faction. The voices of all those who have protested peacefully must be heard ? including those who welcomed today?s developments, and those who have supported President Morsy. In the interim, I urge all sides to avoid violence and come together to ensure the lasting restoration of Egypt?s democracy.? 		No transition to democracy comes without difficulty, but in the end it must stay true to the will of the people. An honest, capable and representative government is what ordinary Egyptians seek and what they deserve. The longstanding partnership between the United States and Egypt is based on shared interests and values, and we will continue to work with the Egyptian people to ensure that Egypt?s transition to democracy succeeds. ? 	6:46 p.m. ET:?More information on the Islamist arrests by the military:? 	? The Associated Press @AP July 3, 2013 	6:25 p.m. ET:?Al Jazeera English reported on air that there are reports of arrests of top Islamists associated with Morsi in the country by the military. ?The AFP confirmed that report, but there aren't any names yet.? 	6:00 p.m. ET:?There are reports of several television stations going off the air in the hours after Morsi was removed from office. ?Al Jazeera, referencing their free service in Egypt, posted the following message to their site:? 	Meanwhile, the U.S. has ordered a mandatory evacuation of their embassy in Egypt, and instructed non-emergency U.S. ?government personnel along with family members to leave the country, the AFP confirmed.? 	5:21 p.m. ET: We realize this an extremely tense, fast moving situation in Egypt, a State Department spokeswoman told reporters. We continue to believe the Egyptian people deserve a peaceful solution to the current political crisis. She did not specify whether the U.S. considers this a coup, which would mean the U.S. would have to pull its financial support from the country.? 	5:14 p.m. ET: There are reports of Muslim Brotherhood violence coming out of the northern parts of Egypt. The scene in Tahrir Square is still peaceful and euphoric, full of families dancing and smiling, according to the some dispatches. There are also reports of more sexual assaults.? 	PREVIOUS UPDATES 	8:00 a.m./2:00 p.m.:?Tens of thousands of citizens have gathered in the streets of Cairo and other cities, with protests?once again centered on Tahrir Square. Most are shouting for Morsi to leave, but he also many supporters who are gearing for battle and prepared to fight to defend him. At?least 16 people?were killed in fighting at Cairo University last night. ?There's obviously a lot of uncertainty at the moment, but here's a short timeline of what we do know?will?happen: 	Once those two sides speak again, then will know a lot more about what each side is planning. For the protesters will continue to gather ... and wait.? 	Blood stains the ground after opponents of Egypt's Islamist President Mohammed Morsi slaughter lambs as symbols of Morsi and Muslim Brotherhood leaders during a protest in Tahrir Square in Cairo, Egypt, Wednesday, July 3, 2013.?AP Photo/Amr Nabil 	8:24 a.m. ET:?Mohamed ElBaradei, a former presidential candidate and U.N. nuclear inspector ,? says that Morsi has lost his mind ?and has asked the army to step in to prevent more bloodshed. He is also allegedly meeting with the Egyptian defense minister to discuss the next steps.?ElBaradei is the leader of Egypt's main opposition party and has become an unofficial?representative?for the anti-government protesters.? 	8:40 a.m. ET:?The Presidency has?issued a statement?saying is better for the President to die standing like a tree while defending democracy rather than be blamed by history. 	8:45 a.m. ET:?A report from NBC News reporter Richard Engel, who is in Cairo. Several people have noted many military coups have begun with a takeover of state media. 	? Richard Engel @RichardEngel ?July 3, 2013 	8:53 a.m. ET:?If you're looking for Egypt updates on Twitter, some other reporters to follow, in addition to?Engel, include?Sara Hussein?of AFP,?Aleem Maqbool?of the BBC,?Jon Williams?of ABC,?Jenan Moussa?of Al-Aan TV, and?Hala Jaber?of Sunday Times UK 	9:18 a.m. ET:?Military sources?have denied?meeting with ElBaradei, but they also say that members of the Muslim Brotherhood's political party, FJR, were invited to meet with the army and refused. An MB ?spokesperson said we will stand in between the tanks and the president, should the military attempt to remove him. 	? ashraf khalil @ashrafkhalil ?July 3, 2013 	9:37 a.m. ET:?While you're waiting, check out?this amazing time-lapse video?of protesters taking over Tahrir Square last weekend. Via NBC News. 	Visit NBCNews.com for breaking news, world news, and news about the economy 	9:44 am. ET:?The dark side of these large crowds and the Egyptian revolution in general still remains the shockingly high incidence of sexual assault and rape taking place in Tahrir Square. Human Rights Watch?says there have been at least 91 mob attacks?on women in the last four days, with nearly all of the perpetrators?going unpunished.? 	Here's an interview with?Maria Sanchez Munoz, who created?Tahrir Bodyguard, a sort of volunteer police force who?roam the square and try to protect women who are under attack?or facing harrassment. Via Now This News. 	10:10 a.m. ET:?Even if the military doesn't launch a coup, Morsi government is in danger of collapsing on its own and many top ministers and other officials have resigned in solidarity with the protesters.? 	? H.A. Hellyer @hahellyer ?July 3, 2013 	10:20 a.m. ET:?As reminder, despite huge anti-government crowds, Morsi still has a lot of support from the Islamist community. This competing rally at?Raba El-Adwyia mosque square gives some sense of the crowds that are on his side.?Pro-Morsi gangs have also been? making a very public show of training ?for the fights to come. Photo via?REUTERS/Khaled Abdullah 	10:30 p.m./4:30 p.m.:?The deadline has now arrived. Here the scene in Tahrir Square from a little earlier today.? AP Photo/Amr Nabil 	10:45 p.m. ET:?Everyone one is now waiting for the military to release a statement. The leaders are reportedly still meeting. 	11:00 a.m. ET:?It appears that just as the deadline was passing, Morsi's office posted?a statement on Facebook?suggesting the?possibility?of?a power-sharing or coalition government.?The Los Angeles Times?reported earlier?that Morsi had until 5:00 p.m. local time to form such a government or face a coup, although we had not seen any other outlets spell out the demands that specifically. RT.com reports that the army is?discussing a similar coalition idea?with the Prime Minister, but it's not clear if they are insisting on Morsi's resignation. There's obviously a lot of confusion and conflicting reports at the moment that will hopefully be cleared up soon. 	? Rawya Rageh @RawyaRageh ?July 3, 2013 	11:22 a.m. ET:?A totally unconfirmed and also possibly unlikely? report has set off the crowds in Cairo, according to Richard Engel 	? Richard Engel @RichardEngel ?July 3, 2013 	11:28 p.m. ET:?Still very unconfirmed, but ABC News is reporting that Egyptian TV station?Al-hayat which is?not the state-owned channel ?is reporting that Morsi has been placed under house arrest. 	12:00 p.m. ET:?We're starting to get? a more complete translation ?of Morsi's original Facebook statement, which reads in part,? The?presidency envisions the formation of a consensus coalition government to oversee the next parliamentary election. It also calls for a committee to amend the national?constitution?and national reconciliation. However, he is still refusing to step down. 	Meanwhile, the reports of Morsi's arrest are still unconfirmed. But included in those reports were?claims?that Morsi and other top members of the Muslim Brotherhood?are being forbidden to travel. However,?Essam El-Erian of FJP party who was allegedly arrested at the airport denies that claim, which makes the earlier report suspect. 	? Bel Trew - ?? ??? @Beltrew ?July 3, 2013 	And on top of all of that,?Morsi's national security adviser?has told reporters? and a MB spokersperson?has tweeted that a military coup is underway. Even the players at the heart of this story can't agree on what's truly happening right now. Until we get an official statement from the military's leaders, it is tough to know exactly what they are attempting to do.? 	? Gehad El-Haddad @gelhaddad ?July 3, 2013 	12:15 p.m. ET: 	12:21 p.m. ET:?Some reporters had disputed the claims of a Muslim Brotherhood spokesperson's claim that tanks were moving through the streets, but we're now seeing images of some military?vehicles on the move.?Kareem Fahim of ?The New York Times? tweeted these pictures ?of military personal now being?confronted?by MB supporters. 	? Kareem Fahim @kfahim ?July 3, 2013 	? Kareem Fahim @kfahim ?July 3, 2013 	? Kareem Fahim @kfahim ?July 3, 2013 	? Kareem Fahim @kfahim ?July 3, 2013 	12:28 p.m. ET:?More Army movement. Looks like things are about to get very serious. 	? Haider Ghaleb @haiderghaleb ?July 3, 2013 	12:31 p.m. ET: The Associated Press is now also reporting that a travel ban has been placed on senior members of the Muslim Brotherhood and FJP, including Morsi, but airport officials say it is not related to today's events. 	1:00 p.m./7:00 p.m.:?A quick recap of what's happened so far today. The deadline for Morsi to respond to the ?army's ultimate has passed, with the president refusing to step down. Shortly before the deadline, the?presidential?office? released a statement ?suggesting that Morsi was? open to a power-sharing arrangement ?and eventually new elections, but the statement may have come too late to make a difference. It also urged the military? to not take sides ?in the government's dispute with the people. 	Shortly thereafter, the?Assistant to President of on Foreign Relation,?published another statement, in English, that said, Let?s call what is happening by its real name: Military coup, adding no military coup can succeed in the face of sizeable popular force without considerable bloodshed. ?Gehad El-Haddad,?a spokesperson for the Muslim Brotherhood Morsi's party ,?also called it a coup, and announced that tanks have started moving through the streets. 	At the same, there were reports that Morsi had been placed under house arrest and that he and several key members of the MB were forbidden from traveling out the country, those reports have since been denied, but Morsi's whereabouts are still unknown. 	Finally, military vehcicles have been moving through Cairo, along several key transit routes and toward the main pro-Morsi demonstrations at Cairo University. They have also been spotted in other cities. they have not yet moved to disperse the Morsi supporters or detail MB members, but as night begins to fall on the country, the situation could deteriorate quite quickly. There has still been no official statment from the army on their intentions or any actions they might have taken toward Morsi directly. 	? Sara Salem @saramsalem ?July 3, 2013 	1:35 p.m. ET:?Reuters reports that the army?has set up barbed wire?around the presidential palace to prevent his supporters from march there. And presumably to keep Morsi inside. 	? Ivan Watson @IvanCNN ?July 3, 2013 	2:03 p.m. ET:?Even though there has been no word from the army yet, many of the protesters in Tahrir Square are celebrating what they believe is the end of the Morsi reign. However, there's no sign that he's giving in yet, and there could be a long fight before its over. 	2:15 p.m. ET:?In a move that his positively dripping with hubris and irony,?Syria has urged Morsi to step down?if he realizes that the overwhelming majority of the Egyptian people reject his presence and want him out. Even though a two-year civil war and 100,000 Syrian hasn't Bashar al-Assad of the same thing. 	2:20 p.m. ET:?Reuters reports that opposition leader Mohamed ElBaradei, alongside a group of Egyptian clerics,?will present the new road map ?for the future government. Their endorsement would add?legitimacy?to what could otherwise be seen as authoritarian power grab by the military. 	2:46 p.m. ET:?For a little more background on why Egyptians are so upset with Mohammed Morsi, check out?these articles?about?the discontent, much of which is held over from the Mubarak Era. The short answer: A lousy economy, corruption, a lack of security, and too much influence from the religious leaders in the Muslim Brotherhood. Tough to fix in one year, but he hasn't made good on many of his promises. Apparently, one of the final straws was his attendance at a rally with hard-line Islamists?urging holy war against the Assad regime in Syria. Which also sort of explains why Syria is?throwing him under the bus?now. ? 	3:00 p.m. ET:?The?Al-Ahram newspaper reports?that Morsi has been told by the military a couple hours ago that he is no longer president of Egypt. The head of Egypt's military, Colonel General Abdul Fatah Al-Sisi,?is?delivering its statement?on live TV now. 	3:06 p.m. ET:?Sisi says they tried to negotiate with Morsi since November, but he refused. He also has announced that the constitution has been suspended. A technocratic government, run by the head of the supreme constitutional court will run the country until elections can be held. The people are ecstatic. Fireworks and shouts erupt in Tahrir Square. 	? Clarissa Ward @clarissaward ?July 3, 2013 	3:18 p.m. ET:?So just one year and three days after becoming the first democratically elected president of Egypt, Morsi has been overthrown by a military order. His supporters in the Muslim Brotherhood will likely not take this quietly, but we don't yet if they respond with violence or politics. Their own TV stations?have reportedly gone dark?for now. 	Also: The AP reports that Morsi has been?moved to an undisclosed location. 	3:34 p.m. ET:?Morsi's?official Twitter account?released this statement a few moments ago 	? Egyptian Presidency @EgyPresidency ?July 3, 2013 	Moris encouraged citizens to uphold the law & the Constitution not to accept the coup. The former President also urged people to adhere to peacefulness and avoid violence. 	3:54 p.m. ET: Celebrations are continuing in Tahrir Square with fireworks, whistles and an uncoordinated laser show. Gen. Abdul-Fattah el-Sisi?announced Morsi's ouster on state-TV, while the Islamist TV?channels were shut down,?perhaps by the?Minister of Interior. Sisi warned that any violence?would be dealt with? decisively in the wake of Morsi's removal.? 	? Sharif Kouddous @sharifkouddous ?July 3, 2013 	4:12 p.m. ET: For now, Egypt's new leader will be?High Constitutional Court head Adly Mansour, 68, who just took over that job a few days ago from?Maher El Beheiry, and Mansour?will be sworn in tomorrow: 	? Bel Trew - ?? ??? @Beltrew ?July 3, 2013 	There are also?multiple reports?of President Morsi giving a speech to Muslim Brotherhood supporters at?Raba'a Al Adawiya Square urging them to remain peaceful. He?also said? the revolution has been stolen from the people, echoing his comments on Twitter. Another Brotherhood leader threatened this coup would push the country into a spiral of violence. 	Meanwhile, the army is flying over Tahrir Square dropping flags to the cheering people below:? 	? Richard Engel @RichardEngel ?July 3, 2013 	5:00 p.m. ET: The?Associated Press reports the State Department?has ordered all non-essential embassy personel and employee families to leave Egypt because of the political turmoil. Otherwise, the U.S. government has yet to respond to the latest news.? 	As the celebration continues well into the evening, the top religious leaders have supported the army's road to a democracy. Top Islamic and Coptic Christian leaders all supported the army's decision,?according to Reuters, as did the top opposition leaders.