British archaeologists recently discovered more than 40 German U-boats sunk during World War I off the coast of England. Now they are in a race against time to learn the secrets hidden in their watery graves. On the old game show What's My Line? Briton Mark Dunkley might have been described with the following words: He does what many adventurers around the world can only dream of doing. Dunkley is an underwater archeologist who dives for lost treasures. His most recent discoveries were anything if not eerie. On the seafloor along the southern and eastern coasts of the UK, Dunkley and three other divers have found one of the largest graveyards in the world's oceans, with 41 German and three English submarines from World War I. Most of the submarines sank with their crews still on board, causing many sailors to die in horrific ways, either by drowning or suffocating in the cramped and airtight submarines. Several U-boats with the German Imperial Navy are still considered missing today. Lists provide precise details on which of the U-boats the German naval forces had lost by the time the war ended in November 1918. But it was completely unclear what had happened, for example, to UB 17, under the command of naval Lieutenant Albert Branscheid, with its crew of 21 men, or where the 27-member crew of UC 21, used as a minelayer and commanded by naval Lieutenant Werner von Zerboni di Sposetti, had perished. But now things have changed. Dunkley and his team of divers found UB 17 off England's east coast, near the county of Suffolk. UC 21 sank nearby. The fate of many other submarines, especially those that had suddenly disappeared in the last two years of the war, can now be considered known. All of the sunken U-boats are relatively close to the coast, at depths of no more than 15 meters about 50 feet . The diving archeologists will undoubtedly find the remains of sailors with the German Imperial Navy inside the wrecks. In the language of archeology, such finds are referred to as disaster samples. In any case, the divers will be searching for signs of the crewmembers that died inside the U-boats. We owe it to these people to tell their story, says Dunkley. He works for English Heritage, a public body that is part of the Department for Culture, Media and Sport. Its primary mission is to secure Britain's cultural heritage. The British could see it as a peculiar irony of history that these measures are now benefiting the heritage of their former enemy. Since the Germans attacked civilian targets in World War I, British propaganda derisively referred to the submarines as baby killers. Many have forgotten how successful the German U-boat fleet was for a time, says Dunkley -- an assessment that is by no means intended to glorify the German attacks. In fact, one of the goals of the most recent English Heritage project is to remind people that, although they might be more familiar with submarine warfare from World War II, the ships also caused considerable devastation in the previous world war. Indeed, it had practically vanished from popular memory that the Germans caused great losses to their main enemy, Great Britain, in World War I through targeted torpedo strikes against the royal merchant navy. At the beginning of the war, there were only 28 U-boats under the supreme command of Kaiser Wilhelm II, a tiny number compared to the Allied fleet.