oldephartte in training : 26 July - Blogs I'm Following oldephartte in training Archives for RSS Returns : History as Seen by Bloggers Friday, July 26, 2013 26 July - Blogs I'm Following Paul Craig Roberts Photo credit: Wikipedia 10:38am MDST Attended the @educationgadfly event on #optorcop yesterday. Nice people, here?s my rant Chalk Face, PhD?at?SCHOOLS MATTER @ THE CHALK FACE?-?1 minute ago Here?s a link to video of the event at the Fordham Institute on a debate about opting out of test-based accountability in education reform. I?ll have to watch the video to see if my question/comment was recorded. I?m still kicking myself because I feel like I botched it. I was a little nervous and my [?] Calvin Johnson 'Navajo Warriors Needed to Defend our Water' brendanorrell@gmail.com?at?CENSORED NEWS?-?15 minutes ago Navajo Nation gives away water to dirty coal, leaves Navajos in need By Calvin Johnson, Dine' Leupp, Navajo Nation Censored News Our Navajo Democratic Government is not so Democratic after all. Last week, Navajo Nation Council rescinded CAP-21-13 and approved Legislation No. 0177-13 which basically extends the terms of the Navajo Generating Station NGS Lease Effective from December 23 Dr. Paul Craig Roberts says, My prediction or expectation is by winter, the second downturn of the Great Recession will be in place. Unemployment will explode, more foreclosures are coming. It's going to be worse than the Great Depression. David L Griscom?at?Cherchez la Verite?-?30 minutes ago ------------------------------ U.S. a Lawless State - Paul Craig Roberts ------------------------------ 24 JULY, 2013 Original Here *By Greg Hunter?s USAWatchdog.com* Former Assistant Treasury Secretary Paul Craig Roberts says, *?The country is not being run by the President. It is being run by spy agencies and private interest groups, Wall Street and military security complex . . . They run the country. The President is a puppet, a figureh...?more ? EU Sanctions on Iran Continue Collapsing in Court Nima Shirazi?at?Wide Asleep in America?-?35 minutes ago European Court of Justice, Luxembourg Photo Credit: Gwenael Piaser / Flickr Over the past few months, strict economic and financial sanctions imposed upon Iran by the European Union have been increasingly challenged in EU courts. And time and again, the legality and legitimacy of the sanctions have been struck down by the General Court of the European Union, the international The Mainstreaming of BDS and an Open Letter to Mohsen Makhmalbaf Nima Shirazi?at?Wide Asleep in America?-?35 minutes ago In honor of the eight anniversary of the Palestinian civil society call for boycotts, divestment and sanctions BDS against Israel, the Palestinian BDS National Committee has produced an incredible interactive timeline?charting the success and growth of the movement.The timeline identifies over 200 landmark events and achievements for the BDS movement since April 2004.Just this month, it was Winnemem Wintu Chief opposes Shasta Dam raise plan brendanorrell@gmail.com?at?CENSORED NEWS?-?36 minutes ago 800_img_3194.jpg original image 5184x3456 Public shows overwhelming opposition to Shasta Dam raise plan? by Dan Bacher? Censored News ? ? Photo: Caleen Sisk, Chief of the Winnemem Wintu Tribe, asked several questions starting with, When will the 1941 Indian Land Acquisition Act, that took the tribal lands, be addressed? ?The officials refused to answer this question, since THE STORY BEGINS: Fake facts never die! bob somerby?at?the daily howler?-?37 minutes ago *FRIDAY, JULY 26, 2013* *Part 5?The history of Professor Cobb's fake fact:* The Zimmerman verdict was rendered on Saturday evening, July 13. Two nights later, America?s most discerning citizens gathered before their TV machines. They watched the PBS NewsHour, their country?s most erudite news program. Not for them the screeching and yelling found on those cable news channels! But uh-oh! Those discerning citizens were soon told this by one of their nation?s professors: WOODRUFF 7/15/13 : Well, to you, Jelani Cobb, on that point about whether race was clearly a part of this trial. ...?more ? My Trip To The Fukushima Nuclear Disaster Zone Part One noreply@blogger.com Mark Daniels ?at?Global Political Awakening?-?42 minutes ago [image: Related Posts Plugin for WordPress, Blogger...] image source Richard Wilcox, Ph.D. On July 20, 2013 Yoichi Shimatsu and I departed from Ueno station in Tokyo to visit the Fukushima nuclear disaster region and see what we could see. Interestingly, the train from Tokyo to Fukushima on this particular line is hard to find on the map, and the train line has apparently been removed! Could it be the powers-that-be do not want people exploring this area given it is now a forbidden zone of nuclearized zombies and headless taxi drivers? Our two-day trip was filled with activity, ...?more ? Former SEC attorney: government claims it will protect your data but ?it cannot honor that promise? noreply@blogger.com Mark Daniels ?at?Global Political Awakening?-?49 minutes ago [image: Related Posts Plugin for WordPress, Blogger...] Image credit: k0a1a.net/Flickr Madison Ruppert According to a former attorney for the Securities and Exchange Commission SEC , despite the government?s claims that it will protect your private data, it simply ?cannot honor that promise.? This is especially troubling given the growing presence of centralized systems in which massive amounts of private information is held, such as the Federal Services Data Hubauthorized by the Affordable Care Act, better known as Obamacare. The statement was made by Hester Peirce, who cur...?more ? RHex the ?Parkour robot? shows off its ability to handle various obstacles in the wild noreply@blogger.com Mark Daniels ?at?Global Political Awakening?-?53 minutes ago [image: Related Posts Plugin for WordPress, Blogger...] screenshot from University of Penn vid Madison Ruppert The University of Pennsylvania?s Kod*lab has developed an amazingly nimble hexapedal ?Parkour robot? dubbed RHex, shown successfully handling various obstacles in the latest video. RHex is ?biologically inspired,? according to the university, which is an increasingly common trend in robotics. Biologically inspired robots range from giant autonomous jellyfish to tiny flying robot insects to larger drones modeled after insects which are even capable of carrying out letha...?more ? Libertarians Funny noreply@blogger.com Mark Daniels ?at?Global Political Awakening?-?56 minutes ago [image: Related Posts Plugin for WordPress, Blogger...] Enter your email address to subscribe to our newsletter: Delivered by FeedBurner Be the Change! Share this using the tools below. Survey: only 15% of farmers would eat GMO food noreply@blogger.com Mark Daniels ?at?Global Political Awakening?-?59 minutes ago [image: Related Posts Plugin for WordPress, Blogger...] Jon Rappoport The British survey was funded by Barclays Bank and done in collaboration with Farmers Weekly. Only 15% of farmers polled said they would eat GMO food. Talk about a blanket rejection. It can?t get much clearer than that. Obviously, these backward farmers want to protect their own health. Who ever heard of such a thing! How dare they! They?re supposed to follow the party line. They?re supposed to say, ?Yum yum, give me some GM.? Well, funny things happen when people consider their own bodies. They tell you what ...?more ? Botwatch Paul Coker?at?News Spike?-?1 hour ago Spot the bots. Islamic Marxism : that's a good one! Weiner's Campaign Falls Limp The Mound of Sound?at?The Disaffected Lib?-?1 hour ago Face it, nobody wants a mayor they know won't be able to keep it in his pants. Anthony Weiner, your weiner has had its last hurrah. It's time for you and your namesake to simply go away. The New York mayoralty candidate, once the frontrunner and apparent sure thing, has fallen well behind in the polls thanks to revelations that he's been up to his old tricks, sexting strange women online. Weiner got caught up in this a few years back and it cost him his seat in Congress when he was forced to resign in disgrace. He staged a comeback when he entered the race to be the next mayor o...?more ? The Two Faux Democracies Threaten Life On Earth noreply@blogger.com Mark Daniels ?at?Global Political Awakening?-?1 hour ago [image: Related Posts Plugin for WordPress, Blogger...] Anthony Freda Art Paul Craig Roberts Amitai Etzioni has raised an important question: ?Who authorized preparations for war with China?? Etzioni says that the war plan is not the sort of contingency plan that might be on hand for an improbable event. Etzioni also reports that the Pentagon?s war plan was not ordered by, and has not been reviewed by, US civilian authorities. We are confronted with a neoconized US military out of control endangering Americans and the rest of the world. Etzioni is correct that this is a momento...?more ? Is the Internet Being Erased? noreply@blogger.com Mark Daniels ?at?Global Political Awakening?-?1 hour ago [image: Related Posts Plugin for WordPress, Blogger...] Kenny Valenzuela *Research links posted below...* FDA Flumist Insert Medimmune Flumist Insert Meningitis Vaccine Causes Seizures & Paralyzes 40 Kids Eugenics New Weapon: FluBlok Insect Based Vaccine Flu Shot Causing Brain Disorders & Paralysis Flu Vaccination Linked To Narcolepsy: Pandemrix Sneezing the New WMD Weaponized Mucus Device Vaccine Exemption Forms The Flu Shot Is the Internet Being Erased? Enter your email address to subscribe to our newsletter: Delivered by FeedBurner Be the Change! Share this using the t...?more ? Video: Pearl Means, Remembering Russell brendanorrell@gmail.com?at?CENSORED NEWS?-?1 hour ago CONVERSATION WITH LOURDES By Russell Means Freedom Pearl Means talks with Lourdes of how she and Russell met and Russell Means? latest book ?If You?ve Forgotten The Names Of The Clouds, You?ve Lost Your Way? Mrs. Means will have book signing at the following places: Friday, July 26th @ 8:00 p.m. Festival Hall at Argiro Student Union, Maharishi University, Fairfiield, Iowa Zio Steamroller: 26 Who Got Crushed! Northerntruthseeker?at?Northerntruthseeker?-?1 hour ago The Jewish control over our governments and the media is indeed supreme, and it does makes one wonder what ever happens to those who openly either criticize or oppose this control... For this article, I want to present the following very important piece that comes from the Tomato Bubble website, at www.tomatobubble.com. It is entitled: The Zio Steamroller: 26 Who Got Crushed! , and contains some important information about 26 people in just the last 40 years who had the guts to stand up against Jewish tyranny, and how the Jews went out of their way to destroy them! Here is tha...?more ? MICKELSON'S BRITISH OPEN TRIUMPH IS THE STUFF OF LEGENDS Allen L Roland, Ph.D?at?Allen L Roland's Weblog?-?1 hour ago *Last weekend I was glued to the TV early in the morning as I watched an historic event unfold on the unyielding links of Muirfield, Scotland. Phil Mickelson, in what he declared was the best round of his storied career, birdied four of the last six holes** **including the 18th** **and won the British Open** ~ **the only player under par while dismantling the era of Tiger Woods in the process: Allen L Roland * *Phil Mickelson climbed to the summit of the true golf legends last weekend ~ a place where Palmer, Nicklaus and Hogan dwell ~ and marked his spot with a brill...?more ? Apaches defend water and oppose Resolution Copper mine brendanorrell@gmail.com?at?CENSORED NEWS?-?1 hour ago Chairman Rambler urges community to halt Land Exchange efforts By Sandra Rambler San Carlos Apache Censored News SAN CARLOS, Ariz. ? On April 5, a letter was sent by Terry Rambler, Tribal Chairman of the San Carlos Apache Tribe, to tribal members as well as surrounding communities near the San Carlos Apache Tribe and Chil?Chil Ba?goteel, also known as Oak Flat. Chairman Rambler says, ?We No general constitutional right to bilingualism across all Provinces James C Morton?at?Morton's Musings?-?1 hour ago scolaire francophone de la Colombie?Britannique v. British Columbia - 2013 SCC 42 holds: [56] However, the *Charter* also reflects a recognition that Canada is a federation and that each province has a role to play in the protection and advancement of the country's official languages. This is evident from ss. 16 to 20, which require bilingualism in the federal government, in Parliament, in courts established by Parliament, and in the province of New Brunswick. The *Charter* does not require any province other than New Brunswick to provide for court proceedin...?more ? How Goldman Sachs Robbed You Of Five Billion Dollars noreply@blogger.com Mark Daniels ?at?Global Political Awakening?-?1 hour ago [image: Related Posts Plugin for WordPress, Blogger...] *Youtube* Subscribe to The Young Turks Channel Enter your email address to subscribe to our newsletter: Delivered by FeedBurner Be the Change! Share this using the tools below. Premier's Pan Harper's Make-Believe Canada Job Grant Scheme The Mound of Sound?at?The Disaffected Lib?-?1 hour ago If you've seen any of the seemingly endless TV ads paid for out of your pocket you would assume that the Harper regime has instituted something called the Canada Job Grant programme. We're told it's to fund job training for Canadians. There is no Canada Job Grant programme. Harper dishonestly ran ads about an initiative that doesn't and may never exist. He flooded the airways with those ads before he'd even negotiated essential deals with the nation's premiers who are supposed to be splitting the tab with the feds. Now it appears the premiers aren't real happy about what the...?more ? The Grizzly: First Fully 3D Printed Rifle Gets a Shot Off noreply@blogger.com Mark Daniels ?at?Global Political Awakening?-?1 hour ago [image: Related Posts Plugin for WordPress, Blogger...] Fully 3D Printed Rifle being readied for first test fire *Activist Post* *This is an update to the ongoing progress with 3D printed weapons. * The eyes of the world are on the innovation of 3D printing. Naturally, whenever a new technology is created that offers open source DIY opportunities to the average individual, it is going to make governments and their protected corporate interests very nervous. Such is the case with 3D weapons manufacturing. Defense Distributed has been offering sets of computer files for free throug...?more ? Friday Morning Linkage Jon Western?at?Duck of Minerva?-?1 hour ago Sissi?s call for massive pro-coup demonstrations in Cairo today is a risky move. Why did he do it? Steve Negus looks for answers. The logistics of cutting military aid to Egypt. It?s not easy. Cutting aid to the UN though? We?ll see. The House and Senate really are at odds over State and Foreign Operations Continue reading Friday Nerd Blogging: Poly-Superman Steve Saideman?at?Duck of Minerva?-?1 hour ago Of course, Brandon Routh really peaked in Scott Pilgrim as a Vegan-powered supervillain, but he is pretty good here as well: Where is Tom Welling when you need him? Untitled New Orleans Ladder?at?New Orleans Ladder?-?1 hour ago *Bob Marshall explains legal, political issues in lawsuit blaming oil & gas industry for coastal loss ~The Lens* Police Caught Planting Drugs In Small Business noreply@blogger.com Mark Daniels ?at?Global Political Awakening?-?1 hour ago [image: Related Posts Plugin for WordPress, Blogger...] *Youtube* Enter your email address to subscribe to our newsletter: Delivered by FeedBurner Be the Change! Share this using the tools below. 7 Ways to Rekindle the Quest for Truth Mark Daniels?at?Global Political Awakening?-?1 hour ago [image: Related Posts Plugin for WordPress, Blogger...] Gaye Levy In recent months I have found myself shrugging in disgust as I browse the web and read the latest headlines. I mumble the words I used to say in the old days, ?par for the course?. I say that as I find myself becoming complacent while reading the latest news of government excess, corporate shenanigans, sneaky banksters and Wall Street crooks. More often than not I feel as though I am sitting on a deck chair of the Titanic, slowing watching the ship go down. Pretty sad, I know. This is not just the alternative pres...?more ? Lake North Pole - Don't Forget Your Water Skis The Mound of Sound?at?The Disaffected Lib?-?2 hours ago Summer time is boating time. This year you might want to try something a bit different. How about a spin on Lake North Pole. Yeah, that's right. A lake now exists atop the North Pole. That's it in the picture, a photo provided by the North Pole Environmental Observatory. The good news is that there's still a layer of ice underneath the lake. The bad news is that this layer of ice is constantly thinning. The lake has been forming every summer since 2002. The really, really good news is that global warming is a hoax. Death Toll Rises in Syria: United Nations Mark Daniels?at?Global Political Awakening?-?2 hours ago [image: Related Posts Plugin for WordPress, Blogger...] Add caption Brandon Turbeville In yet one more example of the tragic nature of the Anglo-American destabilization campaign[1] against Syria, United Nations Secretary Ban Ki-moon has raised the official death toll in Syria to 100,000 from the previous number of 93,000 which was established last month.[2] Ki-moon called on both the Syrian government and the foreign-backed death squads[3] to halt the violence and has issued calls for a peace conference in Geneva ?as soon as possible.?[4] Ironically, Ki-moon made these statemen...?more ? Mohawk Nation News 'Idle Rich' brendanorrell@gmail.com?at?CENSORED NEWS?-?2 hours ago IDLE RICH Posted on?July 25, 2013 Mohawk Nation News www.mohawknationnews.com MNN. July 25, 2013.?The idle rich don?t get up and earn their keep. Why celebrate the birth of another idle rich [Prince George] who will live off the backs of their subjects in lavish luxury from ill-gotten gains? Since 1704 all Indigenous wealth has been deposited into our account. In 1867 the British Monarch Reuters' climate alarmism down by 50% since 2012 Lubo? Motl?at?The Reference Frame?-?2 hours ago Media Matters for America, a propaganda arm of the neo-Stalinist movement in the U.S., has complained that the number of articles published by Reuters that promote the unlimited climate hysteria has dropped by 48 percent in the recent 12 months. They take the data and interpretations from David Fogarty, an indisputable hardcore climate activist, who would be employed until recently as the climate change correspondent for Asia . Just try to appreciate how crazy such an arrangement was. A biased activist who makes Lysenko fair and balanced in comparison was hired by an agency for wh...?more ? 10 Ways to Commit Nutritional Anarchy Mark Daniels?at?Global Political Awakening?-?2 hours ago [image: Related Posts Plugin for WordPress, Blogger...] Daisy Luther Once upon a time, if we felt we needed to, we could go to the pharmacy or department store, select a bottle of vitamins, and feel pretty confident about the actual contents of the bottles. Nowadays, real vitamins are so hard to track down that they might as well be on the endangered species list. In fact, most of what is sold as ?vitamins? in the United States actually contains toxic ingredients and nutritional content that isn?t readily bio-available. And matters may soon get even worse, as the US government ...?more ? NASA Presents Two Scenarios for Global Warming of North America This Century. This Should Be an Eye Opener for Canadians. The Mound of Sound?at?The Disaffected Lib?-?2 hours ago Check out this animation. Notice that the heating our continent will experience is by far greatest in and from the north. sorry for the horrible embedded ad * Researchers at NASA's Goddard Space Flight Center teamed with scientists at the National Oceanic and Atmospheric Administration's National Climatic Data Center NCDC in Asheville, N.C., to create a new video, which compares two different climate change scenarios: One in which atmospheric carbon dioxide levels increase from today's level of 400 parts per million to 550 ppm, and a second in which carbon dioxide levels...?more ? ALEC Legislators & Their Fracking Corporate Benefactors 2old2care?at?Because I Can?-?2 hours ago Awhile ago ? I did a post that *included a video with the President of Nestle***stating: Access to water is not your right believing you have a right to water - is an extreme belief Water is a raw material and a foodstuff that should be privatized and commercialized. Access to water - is really a local issue and us folks at the local level really need a lot of help from the Feds to protect our land, our water and our health. Why the Feds? Most state legislatures WON'T protect our land, our water and our health bec...?more ? NASA Did This for Americans But It' The Mound of Sound?at?The Disaffected Lib?-?2 hours ago Top 5 Ways to Blow the Whistle Mark Daniels?at?Global Political Awakening?-?2 hours ago [image: Related Posts Plugin for WordPress, Blogger...] *Youtube* Government Accountability Project assembled a panel of former whistleblowers to discuss the embattled partnership between whistleblowers and journalist in the age of pervasive surveillance. Learn from the experience of past whistleblowers. Subscribe to RT America's Channel Enter your email address to subscribe to our newsletter: Delivered by FeedBurner Be the Change! Share this using the tools below. Sourcebook: Known Savile Associates and Alleged Connections Paul Coker?at?News Spike?-?2 hours ago An ongoing reference listing, arranged by organisation and affiliation. If you know of any not included below, please add to the comments section and I will incorporate them in regular updates. Primary sources cited where applicable. The Pontifical Equestrian Order of St. Gregory the Great Latin: Ordo Sancti Gregorii Magni, Italian: Ordine di San Gregorio Magno : Knight/Dame Grand Cross of the First Class Sir George Bowyer, 6th Baronet, Knight Grand Cross. Charles, Count of Limburg Stirum, Knight Grand Cross. Abd?n Cifuentes Knight Grand Cross of the First Class Jo?o Carlos Sald...?more ? Read Stuff, You Should Jonathan Bernstein?at?A plain blog about politics?-?3 hours ago Happy Birthday to Jeremy Piven, 48. I can't help but liking PCU; given all the Wesleyan people in Hollywood, as far as I know this is the only one actually about Wesleyan. And good stuff: 1. Dahlia Lithwick on Nina Pillard, Senate Republicans, and radical feminism. 2. Philip Klein, trying to convince conservatives that sounding like bigots is a bad idea. I think he's acting in good faith although he might want to work on a stronger description of Jim Crow . 3. Ross Douthat on the politics for Republicans of voter ID and other such laws. 4. Abby Rapoport on the North Carolina ...?more ? Just let me staple the vicar... , Everytime I think of it I piss myself and other misheard lyrics Not a sheep?at?Not a sheep?-?3 hours ago Peter Kay with plenty of misheard lyrics. If Steve Israel Wasn't Head Of The DCCC, Peter King's Votes Against Healthcare Would Doom His Reelection Chances... If, If, If... DownWithTyranny?at?DownWithTyranny!?-?3 hours ago Peter King, Steve Israel-- Princesses: Long Island Monday, Steve Benen, set out to define exactly what progressives mean when they say Republicans are sabotaging the Affordable Health Act. Their nihilism and class war are unlike anything since the Civil War. [I]t's easy to lose sight sometimes of just how sweeping the GOP efforts to impair the federal health care law really are, he writes. We've never seen anything like this-- it is literally without precedent-- and for millions of Americans, very little matters more. Benen comes up with several specifics: First, congressional R...?more ? A search condition imposed on sentence without notice or consent is improper James C Morton?at?Morton's Musings?-?3 hours ago R v Atadjuat, 2013 NUCA 06 holds a sentencing condition allowing a search of a convict's premises imposed by the Court without notice or consent is improper: [1] Following a guilty plea, the appellant received a global sentence of 6 months custody and 18 months probation for one count of assault, one count of assault with a weapon, and nine counts of failing to comply with release conditions. The latter relate to breaches of court orders as a result of the consumption of alcohol. [2] The appellant is a 40-year old Inuk with a grade 7 education. He began sniffing solvents at the age ...?more ? Moscow declares once again that Edward Snowden will not be extradited to the US - this statement comes while talks between both countries agencies are having talks regarding Mr Snowden Fred Walton?at?Catharsis Ours?-?3 hours ago http://rt.com/news/snowden-russia-extradite-us-634/ Russia won?t extradite Snowden to US ? Kremlin Published time: July 26, 2013 11:53 Edited time: July 26, 2013 12:36 Get short URL [image: A traffic sign is seen outside Sheremetyevo airport in Moscow Reuters / Maxim Shemetov ] A traffic sign is seen outside Sheremetyevo airport in Moscow Reuters / Maxim Shemetov Share on tumblr Trends NSA leaks Tags Intelligence, Politics, Putin, Russia,Scandal, Snowden, USA Moscow says security agency FSB is in talks with the FBI over Snowden. But whistleblower will not be extradited to the US, a ...?more ? Untitled New Orleans Ladder?at?New Orleans Ladder?-?4 hours ago *Lawsuit To Force Oil Industry Funding For Wetlands Repair Facing New Legal Challenges ~Eileen Fleming, WWNO* *Stephanie Grace: History shows industry got a free ride ~New Orleans Advocate* *Historic wetlands suit is compared to 1990s litigation against Big Tobacco ~Levees Not War* *Who Dats out before dawn for start of training camp* *Little Change to Dorian as it Heads West-Northwest ~Wunderblog* *Sheriff expects higher legal settlements; city would like better budget details ~Sarah Rahman, The Lends* *After months of debate, food truck rules relaxed ~Jaquetta White, New Orlean...?more ? Can I Tape My Employer If I Have Poor Memory? Donna Ballman?at?Screw You Guys, I'm Going Home?-?4 hours ago I got this question on an old but popular post, I Secretly Taped My Boss and Now I Want to Sue: I have been telling my supervisor for months that I have a memory problem. He knew that I was working with a neurologist. I recorded a meeting with him where I anticipated finding out what my new job duties would be. I live in MD and was terminated for making the recording, even through I told them why I did it. Thisguyneedshelp Hi Thisguyneedshelp. As I stated in my prior post, Maryland is an all-party consent state, meaning that your employer must consent before you are allowed to r...?more ? Egypt in focus on July 26 , 2013 - Military vs Muslim Brotherhood demonstrations likely to bring further violence to the forefront once again ! Fred Walton?at?Catharsis Ours?-?4 hours ago http://www.juancole.com/2013/07/military-announces-brotherhood.html Egypt: Military announces ?War on Terror,? Calls for Massive Demos Against Muslim Brotherhood Posted on 07/26/2013 by Juan Cole Here are two videos from AFP that help explain all those people milling in the street today in Egypt. Gen. Abdel Fattah al-Sisi, the Minister of Defense, called for big demonstrations on Friday so that that people can ?delegate? to the military the ability to wage a ?war on terror.? The use of that language came after a state security police building was bombed in Mansoura. I tweeted that w...?more ? War watch for July 26 , 2013 - Syria , Egypt , Afghanistan and Iraq in focus as foreign policy disarray and taxpayer waste accent endless death and nothing actually accomplished Fred Walton?at?Catharsis Ours?-?4 hours ago Syria....... http://news.antiwar.com/2013/07/25/us-vetting-in-syria-boils-down-to-a-handshake/ US ?Vetting? in Syria Boils Down to a HandshakeOfficials to Use Same Route for Arms as Medical Aid by Jason Ditz, July 25, 2013 Print This | Share This Significant questions among Congressmen about how the Obama Administration intends to ?vet? the Syrian rebel factions it plans to arm centered around a lack of specifics on the plan. Today?s report from the State Department is likely to just enhance those concerns. Officials say that they intend to essentially use the exact same loose pro...?more ? When nations go bankrupt , there may be two choices - citizens in countries like Spain / Cyprus / Greece / Ireland / Portugal can go along with austerity and having their assets stolen ..... or they can choice to decline the generous offer from the State..... When do we see the first set of citizens politely decline the generous offer ? Fred Walton?at?Catharsis Ours?-?4 hours ago http://globaleconomicanalysis.blogspot.com/2013/07/only-hope-for-italy-is-bankruptcy.html Thursday, July 25, 2013 10:44 AM Only Hope For Italy is Bankruptcy Via Mish-modified Google translation from *Libre Mercado* LM , Enrico Colombatto, Professor of Economics at the University of Turin says in an interview The only hope for Italy is the bankruptcy of the State Enrico Colombatto EC , Professor of Economics at the University of Turin and director of the Center of Economic Research in the Piedmontese town, offers a groundbreaking proposal: Do not pay the debt. It seems unt...?more ? Milton Friedman And Edward Snowden Owen Gray?at?Northern Reflections?-?4 hours ago Murray Dobbin writes that both men are connected, despite the years. Friedman was famous for coining the phrase Free To Choose. He sold right wing ideologues on the notion that the free market ensured absolute freedom. His acolytes believed, therefore, that free market capitalism was the cornerstone of democracy. Except Friedman wasn't really sold on democracy. Dobbin writes: At a conference on Freedom, Democracy and Economic Welfare in 1986, he challenged an audience member who had placed democracy at the pinnacle of human achievement -- not so, said Friedman. You can't say t...?more ? 23 fotograf?as en blanco y negro by Hengki Koentjoro Jos? Luis ?vila Herrera?at?FotoFrontera?-?4 hours ago *Ver m?s colecciones de im?genes*[image: Unirse a Banco de Im?genes en Facebook] [image: Seguir a Banco de Im?genes en Twitter] [image: Suscribirse a Banco de Im?genes por Rss] [image: Suscribirse a Banco de Im?genes por correo] Glad it's Friday!!! James C Morton?at?Morton's Musings?-?4 hours ago Somersby Cider take-off Apple Stores full version Not a sheep?at?Not a sheep?-?5 hours ago I'd not seen the full version of the new Somersby Coder advert until I found this Great spoofing... The EDL's leader Tommy Robinson speaking at a rally in Birmingham recently Not a sheep?at?Not a sheep?-?5 hours ago Tommy Robinson speaks pretty well and is clearly far more intelligent than the BBC portray him. His picking up of Nick Clegg's misinformation is well presented. Whatever your preconceptions of Tommy Robinson and the English Defence League, listen to this speech. Tommy Robinson says that he spent his time in prison learning about the Koran: he explains abrogation, something that the BBC seem incapable of discussing because it destroys their argument that Islam is a religion of peace. The passages about the Koran instructing Muslims not to take Christians and Jews and their frien...?more ? Samsung vs Apple in Iceland with Ninjas and a goat Not a sheep?at?Not a sheep?-?5 hours ago Samsung's latest advert for its Galaxy S4 smartphone makes much of it's support for the Icelandic language. You see an iPhone attempt to swipe a touchscreen and make a call on an actual apple.* *In case your Icelandic is poor, the text tells Icelandic viewers to use the phone that understands you. Now enters the Samsung Galaxy S4. The ad's main character, now converted from iPhone to Samsung Galaxy, decides to dance with some ninjas and a goat before taking a bite from an apple. All very odd. A Tale of Two Political Systems Greg Mankiw?at?Greg Mankiw's Blog?-?5 hours ago Here is a fascinating TED talk about the Chinese political culture. It takes about 20 minutes. *Addendum*: And here is a thoughtful commentary on the talk. Nahko & Medicine For The People Performing In BYRON BAY, Australia Stranger in a Strange Land?at?Stranger in a Strange Land?-?6 hours ago *Published on Jan 24, 2013 * http://www.spiritfestival.com.au/ WELCOMES Nahko Bear & Medicine for the People .... conscious music for the soul ... here's another snippet of their stunning performance at the Spirit Festival launch in Byron Bay, Jan 2013 with an amazing hoop dancer Shellie White Light Nahko & MFTP can best be described as Michael Franti meets Jack Johnson on an indian reservation .... members are ... Nahko Bear, Hope Medford & Chase O'Friel. See http://www.spiritfestival.com.au/Nahko for full details of the Nahko & Medicine For The People 2013 Australi...?more ? CENSORSHIP Anon?at?aangirfan?-?6 hours ago *Anonymous comments:* Aangirfan blog is blocked on 02's mobile phone network because they claim it contains 'adult content'. For me to gain access I have to provide 02 with my passport details to 'prove' I'm an adult. So this proves that the censorship tracking ID system, touted by Cameron has already been imposed on dissident websites. Paul Coker said... I believe it's currently only on pre-paid pay-as-you go tariffs, the presumption being that if you have signed a contract, you are a responsible adult of 18 with a credit file . ~~~ *Anonymous comments:* Camilla Parke...?more ? Greg Hunter, ?Weekly News Wrap-Up 7.26.13? noreply@blogger.com CoyotePrime ?at?Running 'Cause I Can't Fly?-?6 hours ago *?Weekly News Wrap-Up 7.26.13?* By Greg Hunter?s USAWatchdog.com ?The top story concerns the Middle East ratcheting up the possibilities of an intensified war in Syria. Top U.S. military officer General Martin Dempsey warned Congress about the ?unintended consequences? of employing some of the military options that are being talked about. Dempsey expressed concerns over arming al-Qaeda backed rebels and the fallout of weapons that could be used later against the U.S. and its allies. There is also talk by some senators, like John McCain, of direct U.S. involvement that includes tr...?more ? Bayes, Stereotyping, and Rare Events Phil Arena?at?Duck of Minerva?-?7 hours ago Sadly, many people do not realize that even if the majority of those who engage in behavior X belong to category Y, that does not mean that the majority of people in category Y engage in X. This point is often made, rightly, with respect to race and violent crime and religion and terror. But most Continue reading PRINCE GEORGE; REAL ROYALS Anon?at?aangirfan?-?9 hours ago *'Paddy Power', the bookies, sent these chaps to Buckingham Palace.* * * Prince George Alexander Louis is not the first royal George. There was George I, who allegedly had Count Philip Konigsmark killed and his body thrown in the river. *Britain's Royal Family* *George I* George I had many mistresses. George married his cousin, Sophia, who produced two legitimate children. *Sophia* George then imprisoned 29-year-old Sophia in Castle Ahlden in Celle. Sophia was imprisoned there until her death 30 years later. * English Monarchs and BritRoyals * *Caroline, wife of King Geo...?more ? An overview of the early subversion of America John Friend?at?John Friend's Blog?-?9 hours ago Shortly after the Constitutional Convention, when it was up to the states to ratify or reject the newly proposed United States Constitution, the Anti-Federalists were already warning the American people that, once approved and established, a consolidated federal government's * relentless expansion of arbitrary power was unstoppable, its tendency toward corruption was inevitable, and its appetite for despotism was unquenchable, * according to Joseph J. Ellis in his book *American Creation: Triumphs and Tragedies at the Founding of the Republic* pg. 116 . Looking back in hindsight, t...?more ? Print is Dead? Martyn Daniels?at?Brave New World?-?10 hours ago A very funny obituary to the passing of print from The Onion. http://www.theonion.com/articles/print-dead-at-1803,33244/ You See, Justin? It's Really Not That Hard. The Mound of Sound?at?The Disaffected Lib?-?10 hours ago Justin Trudeau has taken a policy stand, one calculated to trigger condemnation from the Harper regime. Pushing on an open door, Trudeau has come out in favour of not just decriminalization but outright legalizing of marijuana possession and use. Even Paul Martin wanted to get marijuana possession and use out of the criminal realm. If memory serves, Martin's proposal would have permitted adult Canadians to grow up to three plants to meet their personal needs. Then again, I've known people who could grow a pot plant almost the size of the White House Christmas tree. The majorit...?more ? Japanese Commuters Move A 70,000-Pound Train To Rescue A Trapped Woman Obi-Wan Kabuki?at?AMERICAN KABUKI?-?11 hours ago *Japanese Commuters Move A 70,000-Pound Train To Rescue A Trapped Woman* About 40 Japanese commuters joined forces with railway staff to move a 70,550-pound train after a woman fell into the 8-inch gap between it and the platform. They pushed the train so it was leaning back, allowing others to pull the woman free. The woman, in her mid-30s, had fallen to her waist and was not seriously injured, according to the AP. The train, stopped at Tokyo's Minami-Urawka station, was delayed by just eight minutes, the Guardian reported. Photographer Norihiro Shigeta from Japanese newspaper Yo...?more ? Suao-Hualien Ferry!!!!! Michael Turton?at?The View from Taiwan?-?11 hours ago *Chamber of Commerce, Lukang.* W00t!! W00t!! W00t!! Apparently a Suao-Hualien ferry is opening on a trial basis.... The Maritime and Port Bureau yesterday confirmed that the Natchan Rera ??? , a high-speed passenger ship owned by the Wagon Group, had completed trial operations between Suao ?? in Yilan County and Hualien in May. Several travel agencies have already booked the ship for package tours billed as a trip over the ?Blue Highway,? the bureau said. The Wagon Group said it would invite a group of distinguished guests for the ship?s pilot run on Aug. 7. Regular passengers ...?more ? Runaway Blogroll Jay Allbritton?at?Jay Allbritton?-?11 hours ago What was once one of the finest blogrolls in the history of blogs being rolled--mine--fell off the face of the internet on July 1, when Google went through with their promise to kill off Google Reader. Not only was it a great RSS feed reader, GR also had a variety of other features, such as the ability to embed blogrolls. I intend to rebuild it, but for the time being, it's a bit of a wasteland over there -->. Please bear with me. If you were wondering why such a product as great as Google Reader met it's demise, *Buzzfeed* blogger Matthew Lynley writes: The decision had little to d...?more ? Deep State-- Was The Overthrow Of President Morsi A Set-up? DownWithTyranny?at?DownWithTyranny!?-?12 hours ago No one knows if President Morsi is dead or alive. His family hasn't heard from him since he was arrested by the military in the coup. There have been rumors that he will be tried on various charges but he hasn't been charged with anything yet and the fascist dictatorship claims its holding him for his own protection -- if he's alive. As soon as I heard the Egyptian military was likely to take the side of the anti-Morsi protesters, I sensed a set-up. And sure enough, the day after the coup, the impossible long lines at Cairo gas stations that were driving people insane just disap...?more ? How It Really Is noreply@blogger.com CoyotePrime ?at?Running 'Cause I Can't Fly?-?14 hours ago Lamar W. Hankins : Callous Republicans Emulate Scrooge Regarding Helping the Needy thorne dreyer?at?The Rag Blog?-?14 hours ago Art from Sodahead. Republicans want a country Scrooge would have loved Republicans are unwilling to accept that our founders viewed the collective efforts of the people, through the government, to include providing for ?the general welfare.? By Lamar W. Hankins / The Rag Blog / July 26, 2013 It seems self-evident. A person who does not have enough to eat will experience hunger. Since the FRIDAY MORNING RAMBLE: Look what I found on the internet, dear Peter Cresswell?at?Not PC?-?14 hours ago And you wonder why councils are all in debt? *Candidate stunned at council paying skateboard ambassadors* ? NZ HERALD *Come On Council, What Does This Cost?* ? Stephen Berry, AFFORDABLE AUCKLAND Will central government step in to stop one of the biggest local government rorts of recent years? They will if they?re serious about making cities affordable again. But are they? *Why Development Contributions Are a Crappy Tax Rort* ? Policy Parrot, WHALE OIL *Bye Bye Excessive Development Contributions* ? Policy Parrot, WHALE OIL Every year the *NBR* publishes the Rich List. And eve...?more ? GUAM: LITTLE SAY IN THEIR FUTURE Bruce K. Gagnon?at?Organizing Notes?-?14 hours ago With Washington refocusing its forces to the Asia-Pacific region, the US Naval Base on the small island of Guam is preparing for the arrival of 5,000 more troops and their dependents. The goal is to turn Guam, an unincorporated territory of the US in the western Pacific Ocean, into a regional security hub by integrating the US Air Force and Navy. The move is seen as a bid to counter what are perceived by the US and its allies as challenges to the freedom and security of the region. However, many of the locals feel there are other ways their island can prosper, and that growth sho...?more ? TRADES COUNCIL MOTION Bruce K. Gagnon?at?Organizing Notes?-?14 hours ago This motion passed this morning: The Victorian Trades Hall Executive is concerned with the recently announced expansion of US military bases and stationing of US Marines in Darwin in Australia and Asia-Pacific. We are concerned that Australia's foreign policies, the armed forces and military infrastructure, are being deeply integrated into the US global military operations. We are concerned that Pine Gap [US NSA listening post in Australia and other joint US bases in Australia are being used in extensive electronic surveillance and gathering of information on people and other co...?more ? Norman Pagett : Cheap Food, Our Grand Illusion thorne dreyer?at?The Rag Blog?-?14 hours ago It takes oil, and lots of it, to move our food. Image from Center for a Liveable Future. Cheap food, our grand illusion We built an industrial civilization on cheap oil, but now we?ve burned it all. We only have the expensive stuff left but we continue to burn that, believing our system of cheap living can go on forever. By Norman Pagett / The Rag Blog / July 26, 2013 We are faced with a APPEARING IN HISTORIC TRADES HALL Bruce K. Gagnon?at?Organizing Notes?-?15 hours ago Last night Victoria and I spoke to more than 50 folks a very diverse group at the historic Trades Hall in Melbourne. The first Trades Hall was built in 1859 by workers as a rallying point for the labor movement, following the successful Eight Hour Day campaign of 1856. I was here 10 years ago when the Global Network held our annual space organizing conference in this magnificent building. Our talk was expertly facilitated by Richard Tanter from The Nautilus Institute for Security and Sustainability. He is an expert on the Australian military and the growing US military presence...?more ? Does the Fed have 9-11 blood on their hands ? Well , the former Fed Economist , fired for investigating tens of billions of cash shuffled around just prior to 9-11 and fired for his efforts to reveal the cause , says look a bit deeper here folks ! Is some organization trying to set up Domestic Terrorists with child pornography ? In light of prior incidents of child porn suddenly appearing on computers of folks who became pests to the P.T.B , has this dirty trick been pulled successfully before ? Why does the future home of DHS being a former Nut House seem - - so apropos ? these articles and more police state updates - July 25 , 2013 ! Fred Walton?at?Catharsis Ours?-?15 hours ago http://www.zerohedge.com/contributed/2013-07-25/fed-economist-fired-investigating-suspicious-9-11-cash-transfers-and-steve-ke Fed Economist Fired for Investigating Suspicious 9-11 Cash Transfers; and Steve Keen Exposes Financial Fallacies [image: EB's picture] Submitted by EB on 07/25/2013 07:23 -0400 - Afghanistan - Creditors - Federal Reserve - Iraq - None Would you be surprised to learn that tens of billions in cold, hard cash was shuffled around just prior to 9-11 by none other than the Fed itself? Probably not. Here's a graph, illustrating the change...?more ? Fukushima Continues to Spew Its Darkness noreply@blogger.com CoyotePrime ?at?Running 'Cause I Can't Fly?-?15 hours ago * Fukushima Continues to Spew Its Darkness * by Harvey Wasserman Radiation leaks, steam releases, disease and death continue to spew from Fukushima and a disaster which is far from over. Its most profound threat to the global ecology?a spent fuel fire?is still very much with us. The latest steam leak has raised fears around the planet. A worst-case scenario of an on-going out-of-control fission reaction was dismissed by the owners, Tokyo Electric, because they didn?t find xenon in the plume. The company says the steam likely came from rain water being vaporized by residual heat...?more ? Carlos Danger for mayor? Well, anybody but Antonio Estupido! KenInNY?at?DownWithTyranny!?-?15 hours ago *by Ken* When I looked this morning at Aaron Blake and Ruth Tam's The best Carlos Danger tweets on washingtonpost.com's The Fix blog, I swear there was one genuinely funny one in addition to Ana Navarro's too-true-to-be-funny one. Now I can't find the funny one, though Angrygeek's might qualify if it were reworded a little, maybe to: 'Carlos Danger'? Somewhere Michael Vick is saying, 'See? Ron Mexico wasn't so dumb after all.' Kind of obvious, but maybe closest to my gut reaction, is Blake Hounshell's conjuring of a write-in campaign for our man Danger. I mean, Carlos ...?more ? Rebuilding & Re-energizing the Automotive Indu$try in the NWO Geezer Power?at?GEEZERPOWER?-?15 hours ago Labor Panel -Committees of Correspondence for Democracy and SocialismThe Center for Labor Renewal San Francisco, CA - July 24, 2009 Panelists: David Bacon, Bill Fletcher, Jr., Maria Guillen, Frank Hammer Comments by Frank Hammer I'm going to address three themes today, and add a P.S. I'm going to give you a flavor of the autoworkers' movement as I've experienced it in the last six months; I will comment on the breathtaking events surrounding the GM bankruptcy; and I will elaborate on a proposal that has some promise for movement building. My P.S. will consist of a sug...?more ? Harvey Organ's Gold and Silver Report - July 25 , 2013 ... Data for the day , news and views touching on the precious metals ! Fred Walton?at?Catharsis Ours?-?16 hours ago http://harveyorgan.blogspot.com/2013/07/july-252013gold-and-silver-withstand.html Thursday, July 25, 2013 July 25.2013/Gold and silver withstand attack on options expiry day/Gold inventories hold constant/14th consecutive negative GOFO/ GLD declines another 2.41 tonnes/: Good evening Ladies and Gentlemen: Gold fell $9.10 to $1329.00 comex closing time . Silver was also up by 14 cents to $20. 15 comex closing time . Gold and silver rose despite options expiry today. There were many in the money gold calls at $1300.00. All of these players will receive a futures contract. ...?more ? Bail in watch - Detroit , Cyprus in focus..... Fred Walton?at?Catharsis Ours?-?16 hours ago http://www.zerohedge.com/news/2013-07-25/detroits-fallout-muni-illiquidity-and-full-faith-and-credit-failure Detroit's Fallout: Muni Illiquidity And Full-Faith-And-Credit Failure [image: Tyler Durden's picture] Submitted by Tyler Durden on 07/25/2013 18:56 -0400 - Bond - Creditors - Detroit - fixed - Pension Underfunding - ratings - recovery Municipal finance is in sharp focus after Detroit filed the largest municipal bankruptcy in history. Detroit?s filing is arguably an isolated case and its fiscal problems are not indicative of the broader municip...?more ? Sac Capital Advisers indicted in New York by a Federal Grand jury - forfeit of illegal profits from 1999 - 2010 to be sought ! Put a fork in SAC , it's a wrap . How long before their prime brokers pull out ? Employees pulling out ? And what happens to assets , especially stocks with their real gross exposure being 44 billion , when the winding up of SAC occurs ? What news will break Friday - how much rope will the banksters give politically incorrect and open GOP supporter Steve Cohen as in he is not A Corzine Dem bundler ? Fred Walton?at?Catharsis Ours?-?16 hours ago http://www.zerohedge.com/news/2013-07-25/so-it-begins-sac-indicted-federal-grand-jury-new-york So It Begins: SAC Indicted By Federal Grand Jury In New York - Full Indictment [image: Tyler Durden's picture] Submitted by Tyler Durden on 07/25/2013 09:32 -0400 - 72 Cummings Point Road - Cohen - New York Stock Exchange - Reuters - SAC - Steve Cohen Goodbye sweet blue-eyed prince. It's been bittersweet. Just out from Bloomberg and Reuters: - *SAC CAPITAL ADVISORS INDICTED BY FEDERAL GRAND JURY IN NEW YORK* - *COHEN'S HEDGE FUND, SUBORDINATES SUBJECT O...?more ? This is hilarious James C Morton?at?Morton's Musings?-?16 hours ago The *Sun Media editorialists *decide to call up the toll-free number featured in the government's much-reviled Economic Action Plan advertisements. Result? A polite receptionist referred us to the ministry of finance website Budget.gc.ca, explaining she didn't have a direct phone line for the EAP, nor was she aware of the Actionplan.gc.ca website, which we told her about. This is hardly surprising, considering a government poll found that basically nobody is paying attention to the ads except to hate them. So enough already, they say. This is essentially an example of the governm...?more ? A Snarky Letter for A Heartless Leader: My Response to TFA Chicago?s Josh Anderson Katie Osgood?at?SCHOOLS MATTER @ THE CHALK FACE?-?17 hours ago Dear Josh Anderson, Executive Director of Teach for America Chicago, After reading your piece entitled Q&A with Josh Anderson, TFA Chicago on the Teacher Layoffs, I felt the need to reach out to you. Perhaps you?ve never actually been inside a CPS school because you seem to not understand the very basic realities of this [?] What's That Behind Our Boat? A Cougar? The Mound of Sound?at?The Disaffected Lib?-?17 hours ago The local waters out here teem with life. That includes several species of whales, including newly returned populations of humpback; dolphins and porpoise; seals and sea lions; sharks and rays; all manner of fish and shelfish; and mammals such as deer, bears and wolves migrating from island to island. But a charter fishing operator out of Thasis on the west-side of Vancouver Island logged some video of a swimmer rarely seen - a cougar. Turns out cougar are great swimmers and also migrate to pursue prey. It looks like the one in this video had a mind to take a breather on the g...?more ? You'll Like This - Chris Hayes Lays Bare Bill O'Reilly's Racism The Mound of Sound?at?The Disaffected Lib?-?17 hours ago Chris Hayes makes the point that FOX is crack for fearful old white Republicans and O'Reilly is their dealer: North Slave Correctional Centre, Yellowknife James C Morton?at?Morton's Musings?-?17 hours ago Crepes and Homemade Biscoff Syrup Debra Hawkins?at?Housewife Eclectic?-?18 hours ago Ever since I was a little girl, crepes have been my ultimate comfort food. They remind me of home and always bring a smile to my face. Combine that with my favorite sweet treat, Biscoff spread and you have a match made in heaven. With just a few ingredients you can turn Biscoff spread into the best syrup you have ever put on a pancake. This recipe is easy to make, comes together quickly and stores wonderfully in the fridge so you can eat if for breakfast everyday. You will need: *Crepes* 4 eggs 2 C. Milk 1 tsp. Vanilla 1 stick butter, melted 2 C. flour *Biscoff Syrup...?more ? The Tip Of The Iceberg: The Coming Retirement Crisis noreply@blogger.com CoyotePrime ?at?Running 'Cause I Can't Fly?-?18 hours ago * The Tip Of The Iceberg: The Coming Retirement* * Crisis That Will Shake America To The Core * By Michael Snyder ?The pension nightmare that is at the heart of the horrific financial crisis in Detroit is just the tip of the iceberg of the coming retirement crisis that will shake America to the core. Right now, more than 10,000 Baby Boomers are hitting the age of 65 every single day, and this will continue to happen every single day until the year 2030. As a society, we have made trillions of dollars of financial promises to these Baby Boomers, and there is no way that we are...?more ? Bombs & Bitumen - a Lethal Cocktail The Mound of Sound?at?The Disaffected Lib?-?18 hours ago There's a stretch of territory straddling the Alberta-Saskatchewan border where Canadian and allied fighter jocks go to play. The strafe the place and they bomb it and even fire rockets into it. It's called the Cold Lake Air Weapons Range. Guess what else they do at CLAWR? When the air force boys aren't blasting the hell out of it, the fossil fuelers go in to mine bitumen. It all works out great for everyone - right until it doesn't, until now. Canadian Natural Resources Ltd. has a bitumen spill or four on its hands inside the CLAWR. Nobody really knows when the spill began...?more ? Black Metal...? Paul Coker?at?News Spike?-?18 hours ago Holy sh*t, they arrested Varg...? Again? For those not familiar.... Well, all you really need to know about Norwegian Black Metal band Burzum and the Norwegian Black Metal scene is that some of their songs are actually written and performed in the *Black Tongue of M?rdor.* *Which I shall not utter here.* They also went through a Burning-down-churches and murder phase. But that was in the 1990s. These people are hardcore *Wotanists* and *Christ haters* and I have no doubt the endorse Brevik's alleged political philosophy whatever that turns out to be , but I highly doubt they were...?more ? CS Lewis: Reluctant Prophet - Prof Alister McGrath speaks at St Paul's Forum - April 2013 Saman Mohammadi?at?The Excavator?-?18 hours ago Professor Alister McGrath is the author of, * C. S. Lewis - A Life: Eccentric Genius, Reluctant Prophet * 2013 . Video Title: CS Lewis: Reluctant Prophet - Prof Alister McGrath speaks at St Paul's Forum - April 2013. Source: StPaulsLondon. Date Published: April 11, 2013. Description: The Revd Prof Alister McGrath speaks on the life, faith and work of CS Lewis at St Paul's Cathedral. Part of the St Paul's Sunday Forum series of lectures with prominent Christian authors. UK Citizens Reject GM Food and Even Farmers Don't Want To Eat It Stranger in a Strange Land?at?Stranger in a Strange Land?-?18 hours ago Source of picture: http://southweb.org/lifewise/uk-government-bans-gmos-from-its-own-parliament-restaurants-while-telling-public-to-embrace-genetic-poisons/UK citizens reject GM food and even farmers don't want to eat it GM Watch, 19 July 2013 *TAKE ACTION UK:* Keep supermarkets GM-free! Quick easy action from Friends of the Earth: http://bit.ly/cUMl4t --- --- *UK Citizens Continue to Reject GMO food and Even Farmers Don't Want to Eat it* GM Education, 19 July 2013 http://www.gmeducation.org/home-page-top-story/p213449-uk-citizens-continue-to-reject-gmo-food-and-even-farmers-don...?more ? Republicans Remind Their Members That It's Fake Town Hall Time DownWithTyranny?at?DownWithTyranny!?-?19 hours ago Do you ever go to congressional town halls? I actually do. 3 summers ago I reported on one I went to in Alhambra, which turned into one of the first of the crazy Tea Party anti-healthcare set-ups. It was Adam Schiff's town hall and the local crackpot right was determined to disrupt it. They dominated the scene for a couple of hours before it started-- when no one was there but me and them. But once it started, they pretty much got swallowed up by actual constituents who had real questions. Most people who even noticed their theatrics just found them amusing, rude and silly. Hit th...?more ? Beware the Mouthy Minority noreply@blogger.com fern hill ?at?DAMMIT JANET!?-?19 hours ago This poll released today has USian fetus fetishists *stoked*. While a majority -- 55% -- still think that abortion should be legal in all or most cases, that number is shrinking, down from 60% in 1995. But what has the zygote zealots really revved is the answer to the time-limit question. As more and more states ban abortion past 20 weeks, the poll asks whether people support such a limit as opposed to the current 24 weeks. A majority -- 56% -- prefer the lower limit. OK. That is the Excited States where they are simply insane on the subject. In Canada 94% of us think abortion shou...?more ? Dumbing Down of Textbook Publishing? Martyn Daniels?at?Brave New World?-?19 hours ago The textbook market has always offered high reward and with it high risk. Many have tried to corner the market including the big technology giants, chains, publishing joint ventures and new start-ups, but it remains, like its students and their courses - diverse. Now Google has joined Amazon, Apple, Microsoft in its intent to go after what they all regard as ?low hanging fruit?, but what often turns out to be not Golden Delicious apples but high hanging and sour crab apples. Of course Google believe that its new Nexus 7 Tablet is 'perfect for students', and therefore intends to stu...?more ? Untitled New Orleans Ladder?at?New Orleans Ladder?-?19 hours ago *WWL?s Kristian Garic Dishes About Life, Radio Career & Why You Can Expect More From The 2013 Saints ~Jason Calbos, Nola Nation Rising* Pope's decree about to cause mass resignations? Obi-Wan Kabuki?at?AMERICAN KABUKI?-?19 hours ago * * * * *This is HUGE NEWS! MAKE IT VIRAL! -AK* *motu proprio:* * * *http://www.merriam-webster.com/dictionary/motu%20proprio* * * *http://www.merriam-webster.com/dictionary/proprio%20motu* * * *http://en.wikipedia.org/wiki/Motu_proprio* * * *FROM COMMENT SECTION OF NESARA [BLOG] REPOSTING: there are only 2 reasons that the Pope would do this. 1. he was told with force that he would do this or face arrest 2: he is a walk in . Whatever is the reason, it is for the people and the take down of the Cabal. * * * *Pope's decree about to cause mass resignations?* *Thursday, 25 July ...?more ? The Royal Changeling: 1688 and All That.... Paul Coker?at?News Spike?-?20 hours ago *Away with us he's going,* *The bright, but solemn eyed -* *He'll hear no more the lowing* *Of the calves on the warm hillside* *Or the kettle on the hob* *Sing peace into his breast,* *Or see the brown mice bob* *Round and round the oatmeal chest* * * *For he comes, the human child* *To the waters and the wild* *With a faery, hand in hand* *From a world more full of weeping than he can understand* I quote The Enemy at length : The Duke of York, an avowed Catholic, was twenty-five years older than his bride, scarred by smallpox and afflicted with a stutter. He had secretly conver...?more ? Did anyone actually listen to Obama newest pivot to the economy speech?... Adrienne?at?Adrienne's Corner?-?20 hours ago *I doubt it. * But it still cost us millions in taxpayer dollars to fly this fool to a college where students are no doubt racking up student loans whose aggregate amount is probably more than the national debt so one day they may be the best qualified burger flippers in the world. Someone anyone? please tell me why this Communist tool is flying all over the country blah, blahing about the economy. Government doesn't create jobs - except for starting some new agency and paying a bunch of bureaucrats with our tax dollars. How about those navigators who will be paid between $...?more ? ?The Deliberately Silenced, or the Preferably Unheard? | the becoming radical plthomasedd?at?SCHOOLS MATTER @ THE CHALK FACE?-?20 hours ago ?The Deliberately Silenced, or the Preferably Unheard? | the becoming radical. Tagged: trayvon martin Israel: An unlikely inspiration for those who love Freedom Rufus News From Atlantis?at?News From Atlantis.?-?20 hours ago As I sit down to write these words, I cannot but feel that they are words which will cause offence to just about everybody reading them. For those who see in the Jewish nation, the literal sons and daughters of Satan, any praise of these people is automatically seized upon as proof that the speaker/writer has 'sold out' to the enemy and become a Zionist agent. For those who believe the 'Chosen people' drivel, any condemnation of the actions of Organised Jewry is likewise automatically regarded as heresy; as doing the work of the devil. When one finds oneself in a position that one ...?more ? Pope's decree about to cause mass resignations? Breaking The Silence?at?Removing The Shackles?-?20 hours ago This message was just sent from a friend of ours to Heather, which she then forwarded to me. My Question: Who else is going to do a runner before September first? Shall we start taking bets? *Ben Bernanke announced that he is resigning the Federal Reserve effective September 1, 2013. One of the Federal Reserve Governors has resigned effective September 1, 2013. Janet Napolitano [Homeland Security] has resigned effective September 1, 2013. The Most Holy Francis issued an Apostolic Letter on July 11 and effective September 1, 2013 that effectively stripped away the immunity of all...?more ? The smiling face of cable TV?s female ex-prosecutors! bob somerby?at?the daily howler?-?20 hours ago *THURSDAY, JULY 25, 2013* *As goes Nancy Grace, so goes Sunny Hostin:* Sunny Hostin is very telegenic. On TV, she?s also exceptionally personable, charming, extremely pleasant. That?s what made her recent performances on CNN so puzzling. Hostin, a former federal prosecutor, served on Anderson Cooper?s legal panel during the Zimmerman trial. She was on the air every night. Hostin is exceptionally pleasant. She also felt that every bit of evidence, bar none, pointed directly to Zimmerman?s guilt. This made for a strange combination. Nancy Grace is the patron saint of cable TV?s fem...?more ? Islam and the New Atheists Phil?at?A Very Public Sociologist?-?21 hours ago I do like James Bloodworth and I think he's done a great job building up the profile of Left Foot Forward since taking up the reins. But his recent piece for *The Speccie*, It?s fine to be a ?new? atheist, so long as you don?t object to Islam reads like it was written in haste. As such it is unsophisticated and limited, the article fails to think through the object of his polemic. And it lacks the unpardonable N-word: nuance. The point he makes is a well-worn one. James argues that the so-called New Atheists of the Dawkins/Hitchens type are getting it in the neck for criticising Is...?more ? The lesson we gave in our home school, such as it was risa bear?at?A Way to Live?-?21 hours ago You know things you do not know you know, just as Plato told us through his mouthpiece, Socrates, who died, remember, dribbling hemlock for telling truths. So the risk is nothing new. Language, before all, and so far as I know, this is true of every language, is the same as math. If you pick up a pebble, it is only itself, first, and never a category unless there is an observer; that is you. You pick up another pebble. Once it has occurred to you there are two things, thing one, thing two, as Dr. Seuss told us, and they are alike enough to have some equivalency, you are doing arithme...?more ? GOP DC Circuit Strategy Emerging Jonathan Bernstein?at?A plain blog about politics?-?21 hours ago Yesterday the second of the three DC Circuit nominees, Nina Pillard, had her judiciary committee hearing; Todd Ruger reports. The takeaway seems to be that after a hearing for nominee Patricia Millett in which Republicans focused on their bogus court packing story, Pillard has emerged as the main target, with lots of hot-button issues in her writings for them to attack. So here's what's going to happen, apparently. For Millett and for U.S. District Judge Robert Wilkins, the third nominee, we'll get lots of harumphing about workload in the DC Circuit court, and hard-liners will o...?more ? Why Not Make Your Own Enemies List? The Mound of Sound?at?The Disaffected Lib?-?21 hours ago It began in Stephen Harper's boy band PMO. The call went out for Tory nobs to compile enemies lists to help ministerial newbies distinguish between their real enemies from all their other enemies - the majority of Canadians. They've even come up with a way to force organizations critical of them to self-generate enemies lists for them. I know, I know, it does sound like something befitting a tyrant. But, in the spirit of things, I invite you to come up with your own enemies list. Who do you think are Canada's five most important enemies, the individuals most harmful to our count...?more ? July 25th Anniversary, the UCC filings, and poking the grumpy bear with a big sharp stick Obi-Wan Kabuki?at?AMERICAN KABUKI?-?21 hours ago Thursday, 25 July 2013 *July 25th Anniversary, the UCC filings, and poking the grumpy bear with a big sharp stick* This was posted late last night my time by Sean in the RTS skype room With the anniversary of the return of our value on July 25, I've been doing a retrospective, chronological re-read of the UCC docs. Interesting shit in there. you might want to read them...again For instance did you know our value was deposited in our body? Secured party''s value being deposited in the body of every one of the one people created by the creator And this tidbit I missed before,...?more ? New Energy Blog - The Energy Work Room Obi-Wan Kabuki?at?AMERICAN KABUKI?-?22 hours ago *Here's a new energy blog... there is also a new skype room if you want to interact with The Energy Work Room community..., contact nickmckenny358 on Skype. -AK* *The Energy Work Room* http://theenergyworkroom.blogspot.com/2013/07/july-24-update-and-links.html *Wednesday, 24 July 2013* July 24 Update and Links July 24th 2013 So, for the last couple of days, I have been absolutely LOST in the overwhelming amount of info that has been collected. One of the names that keeps coming up in my reading is Don Smith. All of the stuff I have been reading about this man is VEERRY encour...?more ? Geography and Mobility Greg Mankiw?at?Greg Mankiw's Blog?-?22 hours ago A former student, M. Daniele Paserman, who is now a professor at Boston University, sends me the following email, which I thought was interesting enough to share with permission, of course : I bumped into your blog post on the Great Gatsby curve, and I was happy to see you raise the point about the arbitrariness of imposing geographic boundaries in measuring intergenerational mobility why should one lump Connecticut and Mississippi together? Claudia Olivetti and I raise a similar point in our recent paper on the evolution of intergenerational mobility in the US between the end o...?more ? July 25th Anniversary, the UCC filings, and poking the grumpy bear with a big sharp stick Breaking The Silence?at?Removing The Shackles?-?22 hours ago This was posted late last night my time by Sean in the RTS skype room With the anniversary of the return of our value on July 25, I've been doing a retrospective, chronological re-read of the UCC docs. Interesting shit in there. you might want to read them...again For instance did you know our value was deposited in our body? Secured party''s value being deposited in the body of every one of the one people created by the creator And this tidbit I missed before, seems like everyone else did too, from the Order of Termination doc 2012086802 filed Aug 15, 2012...that the $5B da...?more ? Balancing media access and informant privilege James C Morton?at?Morton's Musings?-?22 hours ago XY v. United States, 2013 ONCA 497 holds: [9] Since the privilege applies, the court's role is to accommodate the open court principle to as great an extent possible without risking a breach of the informer privilege : *Vancouver Sun*, at para. 55. I do not agree with the media's submission that the privilege only covers information that poses a 'real and substantial' risk, to be proven by evidence, of revealing an informer's identity. The privilege protects any information that might implicitly reveal or would in fact tend to reveal the informer's identity: *R. v. Leipert...?more ? Who is Huma Abedin?... Adrienne?at?Adrienne's Corner?-?22 hours ago *good question.* And one that Andrew McCarthy over at National Review Online does an admirable job of answering - and we thank him. *The Huma Unmentionables* Harvey Wasserman : Fukushima Continues to Spew its Darkness thorne dreyer?at?The Rag Blog?-?22 hours ago House in Fukushima. Image from ABC News. Still on the brink: Fukushima continues to spew its darkness A pool containing many tons of highly radioactive used fuel is suspended 100 feet in the air... Should an earthquake or other trauma knock the pool to the ground, there?s a high likelihood the fuel rods could catch fire. By Harvey Wasserman / The Rag Blog / July 25, 2013 Radiation leaks, Rotterdam, Netherlands Bans Monsanto?s RoundUp as Part of New Green Initiative Stranger in a Strange Land?at?Stranger in a Strange Land?-?23 hours ago Rotterdam Bans Monsanto?s RoundUp as Part of New Green Initiative Rotterdam, NL Just a short while ago, on June 27th, the Rotterdam city council voted to ban Monsanto?s controversial Roundup herbicide. The initiative was begun largely thanks to a citizen run petition campaign appropriately named, ?Non-toxic Sidewalks for Our Children?, along with a lot of support from the Green Party to get it passed. While glyphosate RoundUp?s ?active? ingredient has long been believed to be quite non-toxic, recent studies have shown that to be very much untrue. The herbicide, currently t...?more ? BBC News - Tomato excuse for prostitute in car in Dudley Not a sheep?at?Not a sheep?-?23 hours ago 'A man caught with a prostitute in his car told police she was there to show him where to buy tomatoes.' More here http://m.bbc.co.uk/news/uk-england-birmingham-23449261 Tomatoes is funny but funnier would be; turnips think Baldrick or cucumber. Obviously funniest of all would be PLUMS... Are The Beltway Democrats Serious About Raising The Minimum Wage This Time? DownWithTyranny?at?DownWithTyranny!?-?23 hours ago When the Democrats controlled the White House, the House and, briefly, the Senate, did they raise the minimum wage to the point where someone could call it a living wage? Not that I recall. But now that they know it's impossible to do because of an obstructionist Republican Congress-- and with the midterm election campaigns kicking off-- they're making a loud ruckus. If they wanted to do more than just create a campaign issue and deceive working families, they would crap the whip on Democrats who voted with the Republicans the last time a minimum wage vote came up Match 15? The m...?more ? A year and two ago this month, how far we have/not come? Chalk Face, PhD?at?SCHOOLS MATTER @ THE CHALK FACE?-?23 hours ago Posts from July 2012. This is What You Might Think When You?re Going Into #TFA Will #AFT Convention Draw a Line in the Sand? Why All the Khan-troversy? Talking with the Gates Foundation, or Seeking the Light and Buying the Hype Do those who like the #commoncore know the facts? We miss you Stephen Krashen. Come back to us! Posts from [?] Reality not fiction Not a sheep?at?Not a sheep?-?23 hours ago Do you remember the Tell Mama claims over Islamophobia, claims that were found to be lacking in veracity. The linked article is to the CST report for June. It shows a reduction in anti Semitic attacks in the UK but there are still far too many. What are the chances of the BBC reporting the reality of anti Semitism in the UK? Report here http://blog.thecst.org.uk/?s= Harry's Place ? 800,000 missing Jews: Guardian ?refugee? history includes glaring omission. Not a sheep?at?Not a sheep?-?23 hours ago The Guardian like it's broadcast partner the BBC is so anti Israel that facts are forgotten in the need to blacken Israel's name. The refugee story of Israel and the Palestinians in 1948 is just one example. More here http://hurryupharry.org/2013/07/25/800000-missing-jews-guardian-%E2%80%98refugee%E2%80%99-history-includes-glaring-omission/ CAMERA Snapshots: Where's the Coverage? Territory Occupied for Decades? Not by Israel Not a sheep?at?Not a sheep?-?23 hours ago Northern Cyprus... http://blog.camera.org/archives/2013/07/wheres_the_coverage_territory_1.html Kate Braun : Lammas is the Fire Festival thorne dreyer?at?The Rag Blog?-?1 day ago Honoring the First Harvest. Image from Asiya. Honor the harvest: Lammas is the Fire Festival By Kate Braun / The Rag Blog / July 24, 2013 ?Lord of the Harvest place your fire in me?? Lammas, a Fire Festival also called First Harvest, Harvest Home, and Lughnasadh, may be celebrated on Wednesday, July 31, 2013, Thursday, August 1, 2013, or Friday, August 2, 2013. If at all possible, Untitled New Orleans Ladder?at?New Orleans Ladder?-?1 day ago *John Barry: Industry legally obligated to help fix coast ~New Orleans Advocate* *Unsigned Editorial: Suit raises big questions regarding Open Meetings Laws ~New Orleans Advocate* *Lawsuit against oil and gas giants is a call to arms for Louisiana: Jarvis DeBerry* *BP Is Not Making It Right! ~Michelle Erenberg, GRN * Iraq Sees Continued Problems With Its Oil Export Facilities In June 2013 Joel Wing?at?MUSINGS ON IRAQ?-?1 day ago Iraq?s oil exports and profits were down for the third straight month in June 2013. Bad weather led to a small drop in the south. More importantly, the northern pipeline to Turkey was down due to repairs for almost the entire month. That points to a larger problem that the country?s oil facilities have reached their limit as seen over the last 16 months, and there can be no more growth in exports until new infrastructure is added. The petroleum industry faced several problems last month. Total exports dropped from 78.7 million barrels in April to 76.9 million in May to 69.8 milli...?more ? Expansive New Zealand surveillance bill expected to pass through Parliament Obi-Wan Kabuki?at?AMERICAN KABUKI?-?1 day ago * * *Expansive New Zealand surveillance bill expected to pass through Parliament* Published time: July 24, 2013 04:21 Get short URL AFP Photo / Jose JordanAFP Photo / Jose Jordan http://rt.com/news/new-zealand-surveillance-law-controversy-501/ New Zealand lawmakers say they now have enough votes to pass a controversial bill that will expand the government?s power, authorizing the interception of private communications in the name of national security. Peter Dunne, leader of New Zealand?s United Future party, changed his position on the legislation and announced his support Tuesday ...?more ? Revised: Kiri's Big Stand in Court -- This is What Standing Your Ground Looks Like Obi-Wan Kabuki?at?AMERICAN KABUKI?-?1 day ago Tuesday, 23 July 2013 *Revised: Kiri's Big Stand in Court -- This is What Standing Your Ground Looks Like* I haven't had a chance to talk to Kiri yet this morning- and most likely it will be my evening before I do I do NOT consent to Time Zones any more !! grrr . This is the update that Brian posted this morning my time, lol, last night his time . http://briankellysblog.blogspot.com/2013/07/kiris-big-stand-in-court-this-is-what.html Revised: Kiri's Big Stand in Court -- This is What Standing Your Ground Looks Like Kiri's Big Stand in Court... July 22, 2013 I added a few no...?more ? Poifect! noreply@blogger.com fern hill ?at?DAMMIT JANET!?-?1 day ago The latest so-called householder touting the CONtempt Party's supposed efforts to help Canadians with disabilities get jobs has a message in Braille on it. Yabbut, the message is printed, not embossed as it must be for blind peeps to read it. Isn't that the most perfect example of CON compassion and comprehension? All bullshit. No substance. No understanding. Cruz/McGovern Jonathan Bernstein?at?A plain blog about politics?-?1 day ago I'm very late at getting to this, but the great Steve M. took on my weekend column on Ted Cruz, and I did want to respond to part of it. Not the part where Steve argues that I'm wrong about the possibility of a Cruz move to the center in the event he was to win the nomination. I'll stand by what I said, but there's no way to know, and he may certainly be correct. We're in the realm of speculation in choosing between Cruz is what he is, and would only be more so after a successful nomination campaign compared with Cruz would be more able to move to the center than Romney/McCain ty...?more ? More Prisons, More Prisons, Must Build More Prisons The Mound of Sound?at?The Disaffected Lib?-?1 day ago Stephen Harper's faith-based crime wave took another hammering from the latest report showing that crime rates in Canada continue on their steady decline, reaching the lowest levels since the early 70s. That's faith based in that he chooses to follow his beliefs even while flatly ignoring four decades of statistical reality. But what about, oh I don't know, *MURDER?* Sorry, Steve, that's down too - to the lowest level since 1972. It would be nice if Steve could find a less expensive fetish than prison construction to indulge. Maybe he could take up cross-dressing or golf. ASSAD IS GOING TO WIN - 'MI6 LINKED' JOURNALIST Anon?at?aangirfan?-?1 day ago ** ***The West should prepare for Assad's victory in Syria*, writes Con Coughlin in the Telegraph. Con Coughlin has links to MI6. He writes in the Telegraph that the time has now come for Western leaders to get their collective heads around the idea that Assad is going to emerge victorious. He has been saying and writing for months that President Bashar al-Assad is winning in Syria. *Con Coughlin* Aangirfan wrote in May that the TIDE HAD TURNED IN SYRIA *According to Coughlin:* Hundreds of former Syrian rebels are laying down their arms and taking up the government's offer ...?more ? By George, we think she?s got it! bob somerby?at?the daily howler?-?1 day ago *THURSDAY, JULY 25, 2013* *The problem with Weiner?s wee-wee:* In this morning?s New York Times, Gail Collins just keeps discussing Anthony Weiner?s wee-wee. Last night, cable spilled with discussions of Weiner?s mental state and the motives of his wife. In today?s New York Times, those motives are limned by New York City women in this news report. Elsewhere on cable, piles of piffle are being peddled about the new Brit, Baby Boy George. You can say good-bye to those discussions of race and justice we were going to have! This morning, the New York Times prints six letters about Wei...?more ? Train crash in Northen Spain - 80 dead so far address-withheld@my.opera.com.invalid Dr. John v. Kampen ?at?-?1 day ago Link: http://youtu.be/gkQ71CI5s9w - click in picture to start this film! Link: http://youtu.be/X74Bwu6lYoQ - click in picture to start this film! Horrible train accident 24.7.13 about 20:43 local time in Northern-Spain near Santiago de Compostela, a well-known pilgrimage. It is the worst of its kind in years in Spain. Something must have gone terribly wrong, then the train succeeded in entering an *infamous sharp curve* with a speed restriction *without braking*, but 4 miles before the station. Instead of some 50 mph the modern AVE high speed train entered the curve with 110 mph, ...?more ? Israel accused of gassing Palestinian refugee camp Not a sheep?at?Not a sheep?-?1 day ago Evil, evil, evil. I await the wall to wall media coverage, the United Nations condemnation, the screaming protests outside the Israeli embassy & general opprobrium. Sorry, my mistake, it was Syria not Israel. Expect no media coverage, no United Nations interest & protests. Nothing to see, Jews can't be blamed. More here http://blogs.timesofisrael.com/israel-accused-of-gassing-palestinian-refugee-camp/ Titanium Sophia Love?at?AMERICAN KABUKI?-?1 day ago Listen to the words that resonate. Where you?ve focused until this moment continues to formulate your direction. Especially now, who and what you surround yourself with has everything to do with what you may label as a successful trip or a struggle. Consciousness asks of you everything; it is a rigorous task master. Look around and pay attention. You are not looking so much at mirrors just now, but partners. Those you hang with are the same ones you?ll be together with as you begin this next dance. Think about what this means. You?ve been given a chance, sans Karm...?more ? Terrance Nelson 'US military operating without oversight' brendanorrell@gmail.com?at?CENSORED NEWS?-?1 day ago By Terrance Nelson First Nation Roseau River Anishinabe Censored News http://www.bsnorrell.blogspot.com The US Military has been operating without oversight for some time. http://www.aljazeera.com/indepth/features/2013/03/2013315171951838638.html I was in Iraq in April 1998 with Broadcast quality camera and a TV crew at the invitation of the Saddam Hussein Government. The Mennonite Untitled New Orleans Ladder?at?New Orleans Ladder?-?1 day ago *Governorcist Bobby Jindal's own former Executive Counsel works for Highjackers! Faircloth's Alexandria law firm earns $1.1 million in no-bid work from state ~Town Talk* Thursday Morning Linkage Josh Busby?at?Duck of Minerva?-?1 day ago Here is your mid-morning linkage for this Thursday. Three strands this week: one on higher education and social science, another on conservation, and a third on global health. Oh, and CFR?s International Affairs Fellowship is taking applications. Higher Education and Social Science You all saw the story by the Harvard prof now tenured I might Continue reading The tide against the Conservatives will continue, because Harper isn't going to change a thing. Op Ed leftdog?at?Buckdog?-?1 day ago [image: Progressive Bloggers] *A great article by former Saskatchewan MLA & Cabinet Minister Pat Atkinson ....* Harper 'change' cabinet retains mean face *Prime Minister Stephen Harper tried to hit the reset button with his cabinet shuffle, but he'll have to do better.As Harper was busy answering reporters' questions about his change cabinet, the one question that seemed to get him stuck was what he was going to do to change. He ducked the question.* *The cabinet makeover was supposed to be a channel changer, but I'm not sure that it will stop Harper's political slide. While the...?more ? 63 isn't that old for a drummer Not a sheep?at?Not a sheep?-?1 day ago This video of the 'grandma drummer' 63-year-old Mary Hvizda has been doing the rounds, it's quite impressive But what about Charlie Watts? The Rolling Stones' drummer recently celebrated his 72nd birthday., here's some Charlie... We hunted the dildo into distinction Not a sheep?at?Not a sheep?-?1 day ago Was this CNN anchor thinking of something other than a large flightless bird? Clearing The Air - A Message From Zion Crime Factory Northerntruthseeker?at?Northerntruthseeker?-?1 day ago Several months back, I watched and listened with absolute disgust as several individuals in what is supposed to be this truth movement do their utmost to destroy another individual, Zander.. aka.. Zioncrimefactory.... It showed again how this push for the truth against Jewish Supremacists has indeed been fractured, and how even I have found that it is hard to trust others in this so called movement .... Just the other day, Zander finally decided to post an audio to help clear the air and explain his side in what happened in his battle against those who apparently wanted to des...?more ? Adam Giambrone & Justin Trudeau & The Mound of Sound thwap?at?thwap's schoolyard?-?1 day ago What benefit if you gain the whole world but lose your only soul? A bit melodramatic perhaps but What The Fuck. I mean, supposedly Adam Giambrone was an up and coming Toronto City Councilor of the progressive stripe. He ran for mayor and had to resign because he was exposed as having an affair. Personally, i don't care if politicians have sex in their offices. As long as they get the work they're paid to do done. I'm easy that way. I also don't have too much of a problem with people having affairs. Sometimes shit happens. People get attracted to other people. But the way Giambron...?more ? Untitled New Orleans Ladder?at?New Orleans Ladder?-?1 day ago *Gulf of Mexico natural gas well stops flowing gas and fire is subsiding* Israel & surrounding region Psyops, Propaganda, a nazi in Syria & more Penny?at?Penny for your thoughts?-?1 day ago Let?s look at some of the ?goings on? with Israel and the areas surrounding Israel Or the areas surrounding Israel, that Israel is affecting? Effecting? Infecting? Whichever, matters not to me. They all apply in some way. Going long, but, worth the time! *Israel* First a blast from the past. A woman discussed at this blog more then once. *previously-* link link link *Her psy-op narrative was created to appeal to the strident feminist. She is the feminist ?hero? archetype*. To hell with family.* **Those ties just hold a woman down*! *She is woman. **Hear her roar*! *ROAR!* *As was ...?more ? The State of the Union Mark Daniels?at?Global Political Awakening?-?1 day ago [image: Related Posts Plugin for WordPress, Blogger...] Dave Hodges The illusion of normalcy is almost in the rear view mirror with regard to our previous way of life in the United States. Even those who have the most virulent cases of normalcy bias, will soon be beyond their self-deluded ability to deny what has happened to our once great country. Congratulations to those that have awakened, see the hopelessness of our collective situation, and I want to extend my best wishes to the smart ones who are leaving our lawless country in record numbers. If you are thinking about leavi...?more ? A Tight Tax Leash Constrains Americans Mark Daniels?at?Global Political Awakening?-?1 day ago [image: Related Posts Plugin for WordPress, Blogger...] Nick Giambruno,* International Man* *Casey Research* Many readers are already well aware that the US government is essentially unique?and not in a good way?in how it treats its citizens living and working in foreign countries. No other country in the developed world imposes and effectively enforces as many burdens on its citizens abroad and those who would do business with them as does the US government. Whether it is filing and paying taxes to both a foreign government and the US government, the reporting of foreign financ...?more ? Education as the Great Equalizer: ?More Myth than Reality? plthomasedd?at?SCHOOLS MATTER @ THE CHALK FACE?-?1 day ago ?While education has been envisioned as the great equalizer, this promise has been more myth than reality,? conclude Coley and Baker in a new report, Poverty and Education: Finding the Way Forward ETS, July 2013 . This data-rich examination of the relationship between education and poverty, both in the US and how that compares internationally, is yet another [?] Federal government going after master encryption keys from Internet companies for easier spying Mark Daniels?at?Global Political Awakening?-?1 day ago [image: Related Posts Plugin for WordPress, Blogger...] Madison Ruppert According to a new report, the U.S. government is demanding the master encryption keys that are used by Internet companies to protect the private communications of countless users from government surveillance. A recent government report revealed that encryption actually thwarted attempted wiretaps for the first time on record, which makes it all the more understandable that the government would now be attempting to break through any and all methods of encryption. The demands for these master encryption keys h...?more ? Note: We?re changing the headline! bob somerby?at?the daily howler?-?1 day ago *THURSDAY, JULY 25, 2013* *On our current series:* We?re changing the headline on our current set of reports. When we started, we had expected to stress the way the press corps took dictation from attorney Benjamin Crump in the early reporting of the killing of Trayvon Martin. The press corps *did* take dictation from Crump, a point which can be seen in our reports, including today?s and tomorrow?s. But as this series proceeded, we realized the bad judgment of the New York Times in the early reporting was a much more compelling story. That first news report by the Times was astoun...?more ? Using fake names on Facebook, the Surveillance State, androids Mark Daniels?at?Global Political Awakening?-?1 day ago [image: Related Posts Plugin for WordPress, Blogger...] Anthony Freda Art Jon Rappoport File this one in the ever-burgeoning category of: how insane can legislators get? Congress is now debating an update to the 1986 Computer Fraud and Abuse Act. Turns out it?s already a misdemeanor to ?exceed authorized use? of a computer, but the DOJ wants to make it a felony. Of course, what does ?exceeds authorized use? mean? Well, it means, for instance, an employee sending emails to pals while he?s at the office?because his employer has a rule against that. In other words, the feds want t...?more ? Spanish train crash: quantifying the acceleration Lubo? Motl?at?The Reference Frame?-?1 day ago *A tragically motivated homework problem in mechanics* Chances are that you have already seen the dramatic video of the Wednesday Santiago de Compostela derailment. Warning: the following video is brutal. 78 people died and 145 extra ones were injured. In total, it's 223 people ? more than the number of passengers, 218 homework for you: why? . A mapallows one to determine that the crash occurred at the top middle point of this Google map. Using a piece of paper, I estimated the radius of this arc of circle to be \ R\sim 380\,{\rm m}\ or so. Now, we will need the formula for t...?more ? Medicinal Cannabis Used To Prevent Cancer Growth Mark Daniels?at?Global Political Awakening?-?1 day ago [image: Related Posts Plugin for WordPress, Blogger...] *Youtube* Mario Lap, President of DrugText Foundation, an international information facility on substance use, talks about his work and experiences with medicinal cannabis. Lap has worked with cannabis extract oil to treat himself and many others of cancer and various diseases. He tells us the success stories he has had and the measures they are taking to have medicinal cannabis legalized so people can have the affordable and effective treatment that they are in need of. Subscribe to WeAreChange's Channel WeAreChange.org ...?more ? When Will The Economy Collapse? Mark Daniels?at?Global Political Awakening?-?1 day ago [image: Related Posts Plugin for WordPress, Blogger...] *Youtube* Subscribe to StormCloudsGathering Channel StormCloudsGathering.com Enter your email address to subscribe to our newsletter: Delivered by FeedBurner Be the Change! Share this using the tools below. Untitled New Orleans Ladder?at?New Orleans Ladder?-?1 day ago *Budget manager, auditor for Sheriff?s Office admit to seven-figure mistakes ~Sarah Rahman, The Lens* *Jindal denounces lawsuit targeting oil and gas firms, misunderstands state law ~New Orleans Advocate* ...perhaps because.... *Science to be key factor in lawsuit against oil and gas companies for coastal loss ~Bob Marshall, The Lens* *Bizarre study by Corps Modeler proposes eliminating nearly 35 miles of levees in New Orleans area levee systems ~Physics.org * *Wounded writer speaks of surviving Mother?s Day shooting ~Lee Zurik, WVUE* *Landrieu?s food truck regs get mixed reaction f...?more ? THE STORY BEGINS: And the errors appear! bob somerby?at?the daily howler?-?1 day ago *THURSDAY, JULY 25, 2013* *Part 4?At the Times, just one correction:* As the story began to go national, the Associated Press displayed a bit of good journalistic judgment. On March 16, 2012, Trayvon Martin?s family was allowed to hear the recordings of the 911 calls to Sanford police on the night their son was killed. Later, the Sanford police released the recordings to the public. When this happened, the New York Times displayed some astounding bad judgment. Lawyers for the Martin family were saying, incorrectly, that two shots could be heard on the tapes. Based upon that erroneo...?more ? Forbes Reporter Gets His Car Hacked to Prove How Easy it Is Mark Daniels?at?Global Political Awakening?-?1 day ago [image: Related Posts Plugin for WordPress, Blogger...] *Youtube* Read the article here. Enter your email address to subscribe to our newsletter: Delivered by FeedBurner Be the Change! Share this using the tools below. In a Close Vote, Congress Shamefully Defeats Amendment That Sought to Curtail NSA Surveillance Mark Daniels?at?Global Political Awakening?-?1 day ago [image: Related Posts Plugin for WordPress, Blogger...] Mark M. Jaycox *EFF* The US House of Representatives came within a few votes of passing a novel amendment that attempted to strike out funding for the highly contentious NSA calling records surveillance program. Under this program, the NSA acquires the records of who you called, when you called, and how long you spoke?for all calls made within the United States, including international, long distance, and even local. The amendment was part of the Defense Appropriations Bill basically, the budget for the Department of Defense...?more ? Re-Default: Up To 46% Of Bailed Out Homeowners Can?t Pay Their Mortgage Again Mark Daniels?at?Global Political Awakening?-?1 day ago [image: Related Posts Plugin for WordPress, Blogger...] Mac Slavo The Treasury Department and managers of the Home Affordable Modification Program HAMP are scrambling to figure out why homeowners who used the government?s bailout mechanism to save their homes are re-defaulting on their payments. The program, originally designed to assist homeowners who were facing foreclosure following the 2007 sub-prime crisis, has reportedly saved 1.2 million people from losing their homes, but a report from the Special Inspector General who oversees the government?s Troubled Asset Relief Pr...?more ? Debt Levels Are Skyrocketing To Extremely Dangerous Levels ? How Long Can This Possibly Keep Going? Mark Daniels?at?Global Political Awakening?-?1 day ago [image: Related Posts Plugin for WordPress, Blogger...] Michael Snyder Never before has the world faced such a serious debt crisis. Yes, in the past there have certainly been nations that have gotten into trouble with debt, but we have never had a situation where virtually all of the major powers around the globe were all drowning in debt at the same time. And what makes this crisis even more unprecedented is that everyone on the planet is using fiat currency that is backed up by nothing. It is all just a bunch of paper and data points that people have faith in. Right now, con...?more ? Related articles U.S. a Lawless State-Paul Craig Roberts Will Navajo Council's Naabi Committee support reduction of federal regs? Hopi Tribe sues Navajos to gain access to sites Amazing street murals in Navajo Nation Navajo Nation brings mission to Texas church Proposal addresses pollution at Navajo coal plant Stolen Navajo Nation artifacts found Navajo whistleblowers expose corruption: Navajo water department, dirty coal industry Posted by opit at 10:40 am No comments: Post a Comment Newer Post Older Post Home Subscribe to: Post Comments Atom Compliment Posed as Problem Free Country Notes Colorful fall landscapes - Flickr Home Page opitslinkfest.blogspot.ca Opit's LinkFest! Chemtrails Exposed : Global Engineering PsyOps Climate of FUD Time to end the bias at the Met office The futility of climate models The missing link in the Climate Change Debate Debate ? I can't find any ! Criminalisation of Islam in British Media Elitocide : Bangladesh Was there an Islamic'Genocide' of Hindus ? And who were these 'Islamic' murderers ? Propaganda during the British Raj special note of Harjas Kaur's comment Opit's Notes - Old Sidebar Lists 1 2 3 4 5 6 7 8 9 10 11 Link Love First Nations' cancer rates linked to oilsands toxins in wild food tarsands Magnetic cleanup of oil spill The Green Fraud How I lost 800 quid through PayPal 'Renewables' : expensive and unstable...German experience Canadian ship sourced spill preparedness Primer on Bush Family anh Pages Law - and Failure to Convict Gay/Religion Belief,Wonder & Dogma Uranium Dust Climatism Undiscovered Outrage 'Meddling' The Great Game Online Media Environmental Challenges Broken Search - Corexit Water NSA was so secret its name was hidden BiPartisan Tyranny History of Education Clean Coal Air War Subscribe To Posts Comments Translate Blog Archive ?? 2015 32 ?? January 32 ?? 2014 1012 ?? December 62 ?? November 52 ?? October 70 ?? September 69 ?? August 60 ?? July 60 ?? June 76 ?? May 104 ?? April 105 ?? March 119 ?? February 104 ?? January 131 ?? 2013 1585 ?? December 118 ?? November 111 ?? October 123 ?? September 130 ?? August 138 ?? July 146 31 July - Blogs I'm Following II 31 July - The View 31 July - My Yahoo! 31 July - Blogs I'm Following 30 July - Netvibes V 30 July - Netvibes IV 30 July - Netvibes III 30 Netvibes II 30 July - Netvibes I 30 July - Blogs I'm Following II 30 July - Blogs I'm Following 30 July - Notes Washington Times - 27 July 29 July - Blogs I'm Following II 29 July - Noted Articles Stumble Upon 29 July - Blogs I'm Following 28 July - Blogs I'm Following II 28 July - iGoogle II 28 July - iGoogle 28 July - RSS SnapShot! III 28 July - RSS SnapShot! II 28 July - RSS SnapShot! I 28 July - Blogs I'm Following 27 July - Blogs I'm Following II 27 July - Blogs I'm Following 26 July - My Yahoo! 26 July - My Feedly! 26 July - Blogs I'm Following II 26 July - Breaking News 26 July - Netvibes V 26 July - Netvibes IV 26 July - Netvibes III 26 July - Netvibes II 26 July - Netvibes I 26 July - Blogs I'm Following 25 July - Blogs I'm Following II 25 July - Quick Notes 25 July - Blogs I'm Following 24 July - My Feedly! 24 July - My Yahoo! 24 July - Blogs I'm Following II 24 July - The View 24 July - Blogs I'm Following 23 July - Blogs I'm Following II 23 July - Blogs I'm Following 23 July - The View 23 July - How Tweet! 22 July - RSS SnapShot! III 22 July - RSS SnapShot! II 22 July - RSS SnapShot! I 22 July- Blogs I'm Following 21July - Blogs i'm Following II 21 July - My Feedly! 21 July - Blogs I'm Following 20 July - My Yahoo! 20 July - Blogs I'm Following II 20 July - Blogs I'm Following 19 July - Blogs I'm Following II 19 July - Blogs I'm Following 18 July - The View on Facebook 18 July - Blogs I'm Following II Redress - Feedly 18 July - Blogs I'm Following 18 July - RSS SnapShot! III 18 July - RSS SnapShot! II 18 July - RSS SnapShot! I 17 July - Blogs I'm Following II 17 July - The View 16 July - iGoogle I 17 July - Blogs I'm Following 16 July - My Yahoo! 16 July - Blogs I'm Following III 16 July - Blogs I'm Following II 16 July - Blogs I'm Following 15 July - Blogs I'm Following 14 July - Blogs I'm Following II 14 July - Blogs I'm Following 13 July - Blogs I'm Following II 13 July - The View 13 July - Blogs I'm Following 13 July - My Yahoo! 13 July - Netvibes 5 13 July - Netvibes 4 13 July - Netvibes 3 13 July - Netvibes 2 13 July - Netvibes 1 12 July - My Feedly! 12 July - Blogs I'm Following II 12 July - Blogs I'm Following 11 July - Blogs I'm Following II 11 July - Blogs I'm Following 10 July - Blogs I'm Following II 10 July - iGoogle II 10 July - iGoogle I 10 July - MyYahoo! 10 July - My Feedly! 10 July - Blogs I'm Following 10 July - News Notes 10 July - Big Think 10 July - RSS SnapShot! III 10 July - RSS SnapShot! II 10 July - RSS SnapShot! I FRESH the Movie 10 July - Jesse Ventura 9 July - Gasland II on Industry Influence on Gover... 9 July - Blogs I'm Following II 9 July - News Notes 9 July - MSM 9 July - Netvibes 5 9 July - Netvibes 4 9 July - Netvibes 3 9 July - Netvibes 2 9 July - Netvibes I 9 July - Blogs I'm Following 8 July - Blogs I'm Following 7 July - Blogs I'm Following II 7 July - Blogs I'm Following 6 July - Blogs I'm Following II 6 July - My Yahoo! 6 July - Blogs I'm Following 5 July - Blogs I'm Following II 5 July - My Feedly! 5 July - RSS SnapShot! III 5 July - RSS SnapShot! II 5 July - RSS SnapShot! I 5 July - Blogs I'm Following 4 July - Blogs I'm Following II 4 July - My Feedly! 4 July - Blogs I'm Following 3 July - My Yahoo! 3 July - Blogs I'm Following II 3 July - Breaking News 3 July - Netvibes 5 3 July - Netvibes 4 3 July - Blogs I'm Following 3 July - Netvibes 3 3 July - Netvibes 2 3 July - Netvibes I 3 July - News and MSM 2 July - Blogs I'm Following News Notes iGoogle II iGoogle I 1 July - Blogs I'm Following II 1 July - Blogs I'm Following ?? June 139 ?? May 154 ?? April 167 ?? March 151 ?? February 130 ?? January 78 ?? 2012 2 ?? June 2 ?? 2011 4 ?? December 1 ?? September 3 ?? 2010 17 ?? September 14 ?? April 3 ?? 2009 25 ?? December 7 ?? November 6 ?? October 10 ?? September 2 About Me opit I've been 'around' for a few years now, pursuing the shifting goal of a sharable home-made surfers resource site focused on ease of use and variety of mostly adult whoa : I didn't say prurient content. View my complete profile Followers Search This Blog Loading... Total Pageviews Pages Home