Author Salman Rushdie, who lived for years under a death threat after his 1988 book The Satanic Verses drew the wrath of Iranian religious leaders, said the right to free speech is absolute or else it isn&#39;t free. Following a speech at the University of Vermont in Burlington, Rushdie on Wednesday addressed the killings last week of 12 people at the Paris satirical magazine Charlie Hebdo . He said he was angered that, in the aftermath of the shootings, some from both the left and the right began to vilify the victims. LONDON AP ? His Royal Highness has a name. Britain's new prince has been named George Alexander Louis, royal officials said Wednesday, ending speculation over what moniker Prince William and his wife, Kate, would pick for their first child. Kensington Palace said royals are delighted to announce their son's name, adding that the 2-day-old baby and third-in-line to the throne will be known as His Royal Highness Prince George of Cambridge. Noble names are steeped in history, which explains why thousands of bets rolled in to British bookmakers for the name George, the name of six previous British kings. The moniker evokes the steadfastness of the queen's father, George VI, who rallied the nation during World War II. Meaning farmer or earth worker, George was the 12th most popular name for boys born in England and Wales in 2011. St. George, a 4th-century Christian martyr, is the patron saint of England. The name Louis could be a tribute to Lord Louis Mountbatten, the Duke of Edinburgh's uncle and the last British Viceroy of India before independence in 1947. William's father, Prince Charles, was close with Mountbatten, who was assassinated by the Irish Republican Army in 1979. The announcement from Prince William and Kate ? just two days after the baby's birth ? was quick, by royal standards. Queen Elizabeth II and the Duke of Edinburgh took a month before settling on the name Charles for the Prince of Wales. Princess Diana and Prince Charles took a week before settling on William's four names. For now, the littlest royal is expected to stay out of the spotlight after making his first public appearance in the arms of his parents outside of London's St. Mary's Hospital on Tuesday. After leaving the hospital, William and Kate introduced their son Wednesday to great-grandmother Queen Elizabeth II, who was keen to see the baby before she starts her annual summer vacation in Scotland later this week. Then the young family headed to see Kate's parents in their village near London. Now that Kate and William have chosen a name, they are expected to soon choose a photographer for the baby's first official portrait.