In this image provided by Human Rights Watch, NSA leaker Edward Snowden, center, attends a news conference at Moscow?s Sheremetyevo Airport with Sarah Harrison of WikiLeaks, left, Friday, July 12, 2013. Snowden wants to seek asylum in Russia, according to a Parliament member who was among about a dozen activists and officials to meet with him Friday in the Moscow airport where he?s been marooned for weeks. Duma member Vyacheslav Nikonov told reporters of Snowden?s intentions after the meeting behind closed doors in the transit zone of Moscow?s Sheremetyevo?airport. By Vladimir Isachenkov, Associated Press Published Tuesday, July 16, 2013 | 7:51 a.m. Updated Tuesday, July 16, 2013 | 10:06 a.m. MOSCOW AP ? National Security Agency leaker Edward Snowden on Tuesday submitted a request for temporary asylum in Russia, his lawyer said, claiming he faces persecution from the U.S. government and could face torture or death. WikiLeaks, the secret-spilling site that has been advising Snowden, and Russia's Federal Migration Service both confirmed the application request. The service is required by law to consider the application within three months, but could do it faster. Snowden, who revealed details of a U.S. intelligence program to monitor Internet activity, argued in his application that the reason he needs asylum is he faces persecution by the U.S. government and he fears for his life and safety, fears that he could be subjected to torture and capital punishment, lawyer Anatoly Kucherena said on Rossiya 24 television. Kucherena told The Associated Press that he met the former NSA systems analyst in the transit zone of Moscow's Sheremetyevo airport to give him legal advice and that Snowden made the request after the meeting. Snowden has been stuck there since he arrived on a flight from Hong Kong on June 23. He's had offers of asylum from Venezuela, Nicaragua and Bolivia, but because his U.S. passport has been revoked, the logistics of reaching whichever country he chooses are complicated. He said Friday at an airport meeting with Russian rights activists and public figures, including Kucherena, that he would seek at least temporary refuge in Russia until he could fly to one of the Latin American nations that have offered him asylum. The temporary asylum would allow Snowden to freely travel and work in Russia, Kucherena said. He chose to apply for temporary asylum and not political asylum because the latter takes longer to consider. Kucherena added that Snowden said he had no immediate plans to leave Russia. According to Russian law, temporary asylum is provided for a period of one year and could be extended each year. Snowden's stay in Russia has strained already chilly relations between Moscow and Washington. Granting him asylum would further aggravate tensions with the U.S. less than two months before Russia's President Vladimir Putin and President Barack Obama are to meet in Moscow and again at the G-20 summit in St. Petersburg. Putin on Monday described Snowden's arrival as an unwelcome present foisted on Russia by the U.S. He said that Snowden flew to Moscow intending only to transit to another country, but that the U.S. intimidated other countries into refusing to accept him, effectively blocking the fugitive from flying further. Snowden previously had sought Russian asylum, which Putin said would be granted only if he agreed not to leak more information. Snowden then withdrew the bid, the Kremlin said. During Friday's meeting in the transit zone, Snowden argued that he hadn't hurt U.S. interests in the past and has no intention of doing that. Putin did not say Monday if that would be sufficient grounds for asylum. Presidential spokesman Dmitry Peskov said Tuesday, according to the Interfax news agency, that while Snowden voiced his agreement with Putin's condition, he has made no confirmation of that in writing. Putin noted that Snowden apparently did not want to stay in Russia permanently. Asked where the former NSA systems analyst could go, Putin responded: How would I know? It's his life, his fate. Mikhail Fedotov, the head of Russia's presidential Human Rights Council, said Tuesday that Snowden should be granted temporary asylum until the U.N. refugee agency could ensure his transit to a country that has offered him permanent asylum. It was not clear what the likelihood of that was. Raphael Satter in London contributed to this?report.