Los Angeles ? Officials and activists in California are moving quickly to halt the spread of violence that accompanied protests after George Zimmerman was found not guilty in the death of Trayvon Martin, with both parties saying the violence undercuts any positive message the protests were meant to send. At least 13 people were arrested?overnight Monday in Los Angeles?after scuffles that included attacks on a local TV cameraman. Rocks were thrown, store windows were broken,?and traffic was blocked on major freeways in both Oakland and L.A. At a press conference at Dorsey High in L.A. Tuesday afternoon, activists and officials came together to send a message that the violence of a few will not be allowed to?interfere with the?rights of both the peaceful?protesters as well as innocent bystanders. 					Recommended: 	 																				 								 		 	 				 	 				 	 								In Pictures 			Florida vs. George Zimmerman: Case closed? 		 Police chief Charlie Beck said he preferred his officers make no arrests on Tuesday night, as reported by the local NBC affiliate. But he said they would not tolerate lawbreakers. You come here again tonight, you will go to jail, ?he said. ?Your actions will reduce the power of the message from this community, and that is wrong. That is a shameful act.? Even as Los Angeles announced a crackdown on illegal activity, activists enlisted volunteer ?peace monitors? to guard the further rallies and marches planned for Tuesday evening. Longtime local activist Najee Ali, executive director of Project Islamic H.O.P.E. in Los Angeles, who?organized the main Los Angeles rally minutes after the verdict was read on Saturday night, says veteran organizers have?learned important lessons over the?decades of landmark protests ? which they do not want to see undermined by a new generation of those willing to tolerate violence. ?Let?s put this in historical?context,? he says.??We have a long history of racial profiling in this state that led to the birth of the Black Panther party in the sixties and icons like Angela Davis.? The state is also home to?two of the?nation?s largest and most devastating race riots: the Watts riots in the ?60s, and the 1992 riots that followed the acquittal of four white L.A. policeman in the beating of Rodney King. The hard-earned lesson from these decades of social activism, says Mr. Ali,?is that peaceful protests with clear demands are the most likely to be productive. The outbreaks of violence can threaten the deeper goals of the protests, says Ali. Ali says he has reached out to younger activists, some of whom are involved in the violence.?Many of?them cut their?protest teeth in the local Occupy movement?? and have little focus behind hitting the streets, he says. ?These younger ones have no leadership or?plan,? he says, ?all they have is a bullhorn and a sign but no idea of what to do.? This lack of focus is one of the?hallmarks of the recent Occupy movement, which many now say is feeding the current protests across the country, says New York defense attorney and former federal prosecutor, Stuart Slotnick. ?When the movement launched in New York, it had specific goals,? he says, ?but very quickly?people came along holding up whatever issues they had on their mind,? including violence. Ali is concerned this willingness to tolerate illegal actions and a lack of focus could set back real progress on concrete goals of the current protests. These include?everything from a call to the Department of Justice to press further charges?against George Zimmerman, a?nationwide examination of ?stand your ground? laws and a reassessment?of the value placed on young African?American life, he points?out. Younger activists have a different perspective, agrees blogger?and African American activist Jasmyne?Cannick.??It?s true that?? Trayvon Martin?s family may have called for peaceful protest, but they have to understand that this is now something bigger than them,??she says. ?For a lot of people this is the straw that broke the camel?s back.? Given California?s?place in the annals of social protest, it is important that?the Golden State get it right. ?Where California goes, so goes the rest of the country,? says attorney Areva Martin, founder and managing partner of the L.A. lawfirm Martin?& Martin. ?We have a rich history of organizing and progressive social politics,? she says. ?It is no surprise that people are looking to California to see where this is all headed.?