WASHINGTON, D.C. -- Seattle demonstrators joined protesters across the nation as outrage over the acquittal in George Zimmerman's murder trial poured from street demonstrations and church pulpits Sunday. Protesters called for justice for the unarmed youth he killed and demanded federal civil rights charges against him. Several hundred people gathered in Westlake Park in downtown Seattle to rally the not guilty verdicit in the shooting death of 17-year-old Trayvon Martin. Holding signs, they peacefully march to South Lake Union and to the federal courthouse, some chanting We are all Trayvon, then returned back to Westlake. Protests were scheduled in Boston, Detroit, Baltimore, San Francisco and other cities over the Florida case, which unleashed a national debate over racial profiling, self-defense and equal justice. One protest in California hours after the verdict late Saturday ended with vandalism while police dispersed another crowd by firing beanbag rounds. In Washington, the Justice Department said it is looking into the case to determine whether federal prosecutors should file criminal civil rights charges now that Zimmerman has been acquitted in the state case. In a statement Sunday, the Justice Department said the criminal section of its civil rights division, the FBI and the U.S. Attorney's office for the Middle District of Florida are evaluating evidence. President Barack Obama called the death of Trayvon Martin a tragedy for the country and urged calm reflection, a message shared by religious and civil rights leaders hoping to ensure peaceful demonstrations in the wake of a case that became an emotional flash point. In Manhattan, congregants at Middle Collegiate Church were encouraged to wear hooded sweatshirts in the memory of Martin, the black teenager who was wearing a hoodie the night he was shot to death in February 2012. The Rev. Jacqueline Lewis, wearing a pink hoodie, urged peace and told her congregation that Martin Luther King Jr. would have wanted us to conduct ourselves on the highest plane of dignity. But we're going to raise our voices against the root causes of this kind of tragedy, she said, adding, We'll aim our fight for justice against the ease with which people can get firearms in this country. Congregant Jessica Nacinovich, wearing a hoodie, said she could only feel disappointment and sadness over the verdict. I just wanted to come and be here with everybody in solidarity and talk and pray and sing about where we go from here, she said. I'm sure jurors did what they felt was right in accordance with the law but maybe the law is wrong, maybe society is wrong; there's a lot that needs fixing. At a youth service in Sanford, Fla., where the trial was held, teens wearing shirts displaying Martin's picture wiped away tears during a sermon at the St. Paul Missionary Baptist Church. Hours after the verdict, demonstrators gathered on U Street in Washington, D.C., chanting, No justice, no peace. One protester carried a sign that read, Stop criminalizing black men. In Florida, about 200 demonstrators marched through downtown Tallahassee carrying signs that said Racism is Not Dead and Who's Next? In Chicago, black clergy members called for calm, with the Rev. Ira Acree of Greater St. John Bible Church saying the community should become a united voice for peace because it can't control the verdict but it can control our streets and communities. About 200 people turned out for a rally and march in downtown Chicago, saying the verdict was symbolic of lingering racism in the United States. Seventy-three-year-old Maya Miller said the case reminded her of the 1955 slaying of Emmitt Till, a 14-year-old from Chicago who was murdered by a group of white men while visiting Mississippi. Till's killing galvanized the civil rights movement. Miller said she felt as if nothing has changed in 58 years. The NAACP called for the opening of a civil rights case against Zimmerman in an online petition addressed to Attorney General Eric Holder. Civil rights leaders, including the Revs. Jesse Jackson and Al Sharpton, urged peace in the wake of the verdict. Jackson said the legal system failed justice, but violence isn't the answer. But not all the protesters heeded those calls. In Oakland, Calif., some angry demonstrators broke windows, burned U.S. flags and started street fires. Some marchers also vandalized a police squad car and used spray paint to scrawl anti-police graffiti on roads and Alameda County's Davidson courthouse. In Los Angeles, police said a crowd of about 100 protesters surrounded an officer and two people threw bottles when more police arrived. The officers used beanbag rounds to disperse the crowd. Most protests were peaceful, however. In Manhattan's Union Square, hundreds of people gathered to voice their passions over the verdict, hoisting placards with images of Martin. Some tempered their anger, saying they didn't contest the jury's decision based on the legal issues involved. But while the verdict may be legal, a system that doesn't take into account what happened is a broken legal system, said Jennifer Lue, 24, an Asian-American resident of Harlem. Everyone should feel about this, whether you're Asian-American or African-American, she said.