Here's a brief summary of where things stand:? ? General Abdel Fattah al-Sisi announced the change in government in a televised address joined by influential leaders of opposition parties and religious groups. Among those who spoke after Sisi were opposition leader Mohamed ElBaradei, the sheikh of Al-Azhar mosque and the Coptic pope. Leaders of the Islamist Nour party also joined the announcement. ? Sisi said the?head of Egypt's supreme constitutional court, Adly Mansour, 68, would take over the presidential palace, the constitution would be suspended and new presidential elections would be held. Mansour was to be sworn in Thursday. ? Morsi reacted defiantly to the Sisi announcement, which he called a full coup. ?He communicated via Facebook, a Youtube video that was unpublished and a prerecorded audio track broadcast to rallies supporting him. He had not been seen in public Wednesday. Morsi insisted he is Egypt's only legitimate president but warned against bloodshed. ? The Egyptian street reacted jubilantly. Scenes like this look unreal but are only slightly more spectacular than many scenes from recent days:? ? Scattered clashes were reported after Sisi's address, with at least four killed. That number could not be confirmed and there were dire concerns that violence would spread as the import of the army announcement sinks in. Reports from the scenes of Muslim Brotherhood and Freedom and Justice Party rallies conveyed a dour mood in Cairo, while active clashes were reported in both coastal cities and upper Egypt.? There are reports that Al-Jazeera Egypt has also been taken off the air. A video is circulating purporting to capture the moment the studio was shut down. Al-Jazeera English has broadcast a lower third saying Al-Jazeera's Egyptian TV channel raided by security forces and taken off the air. Morsi's overthrow is a hammer blow for Egyptian Islamists who spent the long decades of authoritarian rule under Mubarak and his predecessors building up the Brotherhood organisation and dreaming of the day when they could take power. The worry must be that this experience will reinforce their sense of victimhood ? that despite winning a free election they have been betrayed and prevented from exercising legitimate power. It clearly creates a dangerous precedent. Egypt's military leaders say they have no intent or desire to govern, and I hope they make good on their promise, Leahy said in a statement. In the meantime, our law is clear: U.S. aid is cut off when a democratically elected government is deposed by military coup or decree. ? In addition to?television stations being taken off the air after Sisi's address, there are reports of arrests of some media crews. Al-Masri al-youm reports that the owners of TV stations have been detained.? Abeer al-Saady a member of the Journalists? Syndicate said that she received a call from Ahmed Abdel Gawad, a Misr 25 reporter, at 9.45 pm, not long after the end of Sisi?s speech. ?He told me that he and five other employees of the channel were in a police truck and being taken to an unknown location,? Abdel-Gawad said. Zeyad Salem, a producer with the Baladna Bel Masry programme broadcast on the ONtv satellite channel said that police forces that have been stationed in the Media Production City in 6th of October that hosts the majority of Egyptian satellite channels stormed the studios of Misr 25 and other religious channels. Salem said that Misr 25 presenter Nour Eddin Abdel Hafez, popularly known as Khamees, had been arrested. Al-Jazeera and Al-Arabiya report four deaths and seven injuries in clashes in Marsa Matrouh on the northern coast. Clashes have also been reported?in Sidi Bishr in Alexandria and in Minya and Qena in upper Egypt, according to BBC Arabic.? The pro-Morsi rally at?Raba'a el Adaweya Mosque appears to be slowly breaking up, or shrinking, with no immediate reports of violence. Morsi supporters slowly stream out of sit-in in quiet anger to find people cheering alongside army, ?Democracy Now correspondent?Sharif Kouddous?reports. Whoever brings religion to use in politics or in favour of one group at the expense of another will fall anywhere in the world, Assad was quoted as telling the official Thawra newspaper, according to an official Facebook page. Without a television station to carry his message to the people, Morsi appears to be calling for defiance of the army through whatever channel he can. There has been a Facebook post and a briefly published YouTube video in which?Morsi was quoted as saying the army's moves represent a full coup categorically rejected by all the free men of our nation. Now Al-Jazeera reports an audio message from Morsi is being broadcast to supporters in Nasr City and in east Cairo. Morsi says I am the only legitimate president in Egypt, El-shayyal reports. [Former] president Morsi appears to be making good on his promise to fight for legitimacy. A statement attributed to Morsi has appeared on Facebook defying the army's claim to power. Additionally there are reports that a video of a new Morsi speech was posted briefly to the Egyptian Presidency account before being taken down.? The Coptic pope Tawadros has also spoken. We have all gathered under the Egyptian flag, he says, supporting the army's move. US state department spokeswoman Jen Psaki says in her daily briefing that the US is very concerned about conditions on the ground in Egypt and that Morsi must do more to be responsive to concerns of the Egyptian people. Democracy is not just about being elected through the ballot box, she says. It's also about allowing the voices in your country to be heard. Asked about animosity in the street directed at Ambassador Anne Patterson and the United States, Psaki says we have been clear in not taking sides, and specifically supporting the right of the opposition protests. Patterson's long meeting with Brotherhood leader Khairat al-Shater in his office before the massive June 30 rallies has fed perceptions of US support for the Morsi presidency. On the other hand the Pentagon announced today that secretary Hagel has been repeatedly in touch with General Sisi in the last week. Patrick Kingsley has just spoken to a presidential aide who said president Morsi is still in his office at the Republican Guard headquarters ? where a large opposition protest has gathered. Nothing physical has happened yet, the aide tells Patrick. No territory has been invaded. Armored personnel carriers moved in to separate opposing rallies at Cairo University, the scene of violence overnight in which at least 16 were killed and hundreds injured, BBC Middle East editor Jeremy Bowen reports. But then the carriers withdrew, leaving a light force of soldiers. Bowen's timeline makes clear that the army presence on the streets of the capital is growing. With the publication of Essam al-Haddad's statement, Morsi's team has made a carefully crafted case that notwithstanding the crowds of millions in the streets, its deposition amounts to a coup, and the destruction of a democratic experiment. As I write these lines I am fully aware that these may be the last lines I get to post on this page. For the sake of Egypt and for historical accuracy, let?s call what is happening by its real name: Military coup. That revolution restored a sense of hope and fired up Egyptians? dreams of a future in which they could claim for themselves the same dignity that is every human being?s birthright. Haddad goes on to warn that And the message will resonate throughout the Muslim World loud and clear: democracy is not for Muslims. ?Read the full statement here.? h/t @evanchill What surprised me was how utterly relaxed and jovial he was. As if today was no turning pt, but more of the same 85-year struggle. A scenario that some people are trying to impose on the Egyptian people, has no consensus amongst the Egyptian people and there are large masses who do not accept it. It will cause chaos in the process of building institutions that has already started. those who believe that Egypt can go back and destroy the legitimacy are mistaken. These people who believe that imposing their legitimacy by force on the great Egyptian people, the Egyptian people who were so eager for freedom and sacrificed blood for it, those people can not accept that imposition. Here's a summary of the main events today: ? Crowds of anti-Morsi rotesters have gathered in Cairo's Tahrir Square as a military deadline for resolving the crisis expired. The influential anti-Morsi Tamarod campaign urged its supporters to gather outside the Republican Guards headquarters where the president is believed to be. ? The Freedom and Justice party, the political wing of the Muslim Brotherhood, has refused an invitation to meet the head of the army. It accused the military of trying to impose opposition figure Mohammed ElBaradei as a unity leader. ? The head of the army General Abdual Fatah al-Sisi has held talks with opposition figures, including ElBaradei, and senior clerics. It was due to make a statement after that meeting. ? There have been conflicting reports about who controls the state media. According to some reports the army took control of the building in Maspero and ordered some staff to leave. But according to the Guardian's Patrick Kingsley Morsi's Republican Guards were still protecting the building. ? Morsi offered a series of concessions in a four-hour meeting with General Sisi on Tuesday, a Muslim Brotherhood source told the Guardian. The concessions, which included setting up a national government and hints that he would hold a referendum on his presidency, were rejected. ? The opposition Tamarod campaign has published its own roadmap for a political transition. It called for a new temporary president and prime minister and the election of a new body to draw up a new constitution within 30 days. ? Morsi vowed to protect his presidency with his life in a defiant late-night speech on Tuesday. Morsi's insistence on his legitimacy left?Egypt braced for its most decisive day since the revolution, with its military readying to suspend the country's constitution. ??The military leadership responded to Morsi by saying the army was ready to die to defend Egypt's people against terrorists and fools.??In a response headlined The Final Hours on its Facebook page, it said:? We swear to God that we will sacrifice even our blood for Egypt and its people, to defend them against any terrorist, radical or fool. The general command of the Egyptian armed forces is meeting with religious, national, political and youth figures, the army said on its official Facebook page on Wednesday, as a deadline loomed for President Mohamed Mursi to yield to mass protests and share power or give way. The General Command of the Armed Forces is currently meeting with a number of religious, national, political and youth icons ... There will be a statement issued from the General Command as soon as they are done, the army said. Al-Jazeera's Rawya Rageh says the the president's troops guard the building, citing a state radio presenter. The BBC's Aleem Maqbool has backed away from an earlier report that the army was in control. We do not go to invitations meetings with anyone. We have a president and that is it, said Waleed al-Haddad, a senior leader of the FJP told Reuters. A spokesman for Morsi said the president believed it would be better to die standing like a tree , defending the electoral legitimacy of his office, than to go down in history as having destroyed Egyptians' hopes for democracy. Saying that Morsi was not seeking to cling to office for its own sake, spokesman Ayman Ali told Reuters that, in his overnight speech to the nation, the president had defied calls to resign in order to defend the democratic system . It is better for a president, who would otherwise be returning Egypt to the days of dictatorship, from which God and the will of the people has saved us, to die standing like a tree, Ali said. Tamarod said it rejected other roadmaps being put forward, including one by the army which involves appointing a military head of government. Morsi has ?gone beyond the point of no return,? according to the respected Egypt watcher Michael Hanna, senior fellow at the Century Foundation thinktank. The most likely options are that Morsi is either pushed out of power or there is a last-minute deal to allow him to resign, Hanna told the Guardian. It is hard to imagine the crisis dragging out too much longer, because much of what has driven the military to act is a real fear about broad-based civil strife, and the country reaching a point of violence that tips it into something much more consequential and worrisome. But any military action comes with its own risks of counter violence from Islamist supporter of the president. It is clearly a very fraught moment for the country ... A defiant Muslim Brotherhood that seeks to confront the military, on the heels of an incendiary speech by the president, really does raise the risk of violence engulfing the country. A leaked version of an apparent transition road map from the military should be treated with scepticism, Hanna cautioned, but aspects of it appear plausible, he said. The idea of a military head of government is ?really troubling?, he added. Hanna pointed out that anti-Morsi rallies of the last few days ?far-surpassed? the level of discontent that ousted Hosni Mubarak. ?That in itself had a huge effect in eroding the legitimacy that he touted incessantly in his speech last night,? Hanna said. Much of the state, including the foreign ministry, is in open revolt against Morsi, Hanna added. The Brotherhood should focus on safeguarding its hard-earned position in Egyptian society which is in jeopardy by its mishandling of the crisis, Hanna argued. It is not the presidency and his executive branch that is the most important set of decision makers, it is the Muslim Brotherhood, he said.