On Sunday, Egypt's President Mohamed Morsi will complete his first year in office. Instead of being an occasion to celebrate ? he is the first elected president ? many fear the anniversary will mark the beginning of the collapse of Egypt's political system. The opposition has called for mass protests against Morsi and the Muslim Brotherhood to take place on the day. Although dissent and protest is a political right in a democracy, these protests could result in a coup against the democratic process, and could plunge Egypt into a cycle of violence and chaos. Many criticisms can be made about Morsi's performance and the Brotherhood's behaviour since the fall of Hosni Mubarak. Their inability to conduct a serious dialogue with, and facilitate real participation by, opposing political forces has been conspicuous. They took unilateral decisions on a number of issues on which a national consensus was needed. The opposition is not above reproach either. In its attempts over the past year to block the president and the Islamists, and its de facto rejection of the results of the free election, it is trying to change the rules of the democratic game. The opposition has committed two dangerous acts that are politically prohibited. First, in demanding Morsi's resignation it has aligned itself with the remnants of the former regime and the disbanded security agencies. In an interview with the London newspaper al-Hayat, published last week, Mohamed ElBaradei, the liberal head of the Constitution party, said: The word felool [remnants of the regime] has now become a thing of the past; it is necessary to embrace those who did not commit crimes from the last regime. His partner in the National Salvation Front, Hamdeen Sabahi, a leftist Nasserite and former presidential candidate, reaffirmed this position in an interview with an Egyptian TV station. He described those who oppose any alliance with the remnants of the former regime as narrow-minded political teenagers . These remarks coincided with several court rulings that acquitted a large number of top figures from the former regime. In June 2012 a court acquitted Mubarak of corruption. A previous ruling overturned his conviction on charges of conspiring to kill demonstrators during the revolution. Now the former president is being retried amid confusion about what charges against him still stand. A few days ago a court acquitted several members of the disbanded state security agency, among them the head of the agency and an assistant in the ministry of the interior. Another court acquitted his sons, Gamal and Alaa, on a number of charges. The process of exonerating former Mubark ministers and aides gives the impression there is an operation to cleanse history; it is as if the 30 years of tyranny and corruption was imaginary, without any factual basis. A prominent Egyptian journalist, Fahmi Huwedi, said: The festival of acquittal of all is not just a joke but a true reflection of the position of the judiciary towards the head of the former regime, its aides and its remnants. The second prohibited act has been the calls by opposition figures for the army to intervene and topple the elected president. If Morsi has a real democratic accomplishment to his credit, it has been the distancing of the army from politics and the dismissal of several members of the former high military council. He has convinced the new army leadership not to intervene in the transition process. Thus it is ironic that the opposition ? part of a revolution against decades of army rule ? should now call on the army to intervene, and that the army rejects involvement in the political process. Last month the minister of defence, General Abdel Fattah al-Sisi, told all political parties to stop demanding the army's intervention, saying the ballot box should be the sole means of change. However, some in the opposition still hope the army will intervene, especially if violence erupts during Sunday's protests. There is concern that security elements linked to the former regime may even provoke acts of violence and attack government installations in order to force the army to take control. The situation is polarised and politically gridlocked. Morsi's supporters are determined to resist attempts to oust him. In anticipation of Sunday's protests, the Islamist parties have called for public rallies. The first took place last Friday in central Cairo, and was huge. Clearly, the Islamists wanted to show that they still wield the most influence on the street, and that if the opposition resorts to demonstrations, the scale would tilt in favour of the Islamists. Most opposition leaders who describe themselves as liberals and leftists represent a political elite that has no wide presence on the streets. The ballot box has repeatedly confirmed this. They hope their alliance with the former regime will give them power and influence: Mubarak's regime still exerts influence in a number of key sectors, not least among the security agencies, the judiciary and businessmen. They have considerable influence through their ownership of media outlets. The Middle East is passing through its most dangerous transitional phase since the first world war. The impact of the Syrian uprising, its spread into Lebanon and Iraq, and the rise of sectarian tensions to unprecedented levels, could have drastic repercussions that are carried beyond the region. The descent of Egypt, the most populous and influential Arab country, into chaos will increase the danger and instability in the whole region. Egyptians should not allow this to happen. They still have an opportunity to build a better future. There is no alternative to a serious national dialogue in Egypt in which all parties should commit themselves to the democratic process ? even if it goes against their desires. ? This article has been launched with comments off. They will be switched on later this morning