This [royal] baby will not enjoy a much better diet, education or healthcare than the 730,000 or so other children born in the UK this year. It is also likely to have a similar outlook to most residents. Financial Times, 18 July 2013 Modern Britain tells itself few lies as convenient and comforting as this: that just because the wealthy sometimes act like us, their lives resemble ours. That Prince William strapping in an ?80 car seat demonstrates his homeliness; that Cameron flashing his iPad shows he's with it; that a banker's million-pound bonus is merely the ripe fruit of meritocracy. As the quotation above illustrates, this myth is accepted even by fine minds. Leave aside the regrettable issue of money and on all the really important stuff ? health, schooling, food ? the life chances of Britons today are roughly equal. The poorest he that is in England has a life to live as the greatest he, they said in the Putney Debates. Nearly 500 years later and thanks to the safety net of welfarism, the old aspiration has finally been realised. It is comforting nonsense. To see why, try the following thought experiment: imagine if baby George Alexander Louis were to be brought up not in his parents' home in Kensington, but in the East End London borough of Newham. As even non-Londoners appreciate, the two neighbourhoods are very different. You can currently buy a house a few minutes from Will and Kate's pad for ?25m mid-terrace, but you get a dance studio and indoor swimming pool ; for almost 1% of that price you could buy a six-bed home on the other side of town. Sprawling Newham is solid Labour; the Royal Borough of Kensington and Chelsea deigns to send up Greg Hands and Malcolm Rifkind to Westminster. Yet both locales are in one of the richest cities in history, while Newham has received Olympic money and a maze of transport links. The central line covers the distance between Notting Hill Gate and Stratford in a mere 27 minutes. A child in E7 should not be living that differently from one in W8. Yet the first consequence for Baby George of moving east will probably be a shortening of his life. Going by the latest census, a man in Kensington will typically live to 81.6 years; in Newham that is cut to 77.5 years. Any sister he has will suffer a similar drop: women can expect 86.1 years in Kensington, but 82 in Newham. Statistics aren't certainties, as geographer Danny Dorling reminds us: a man can see out a century in Green Street, or get hit by a bus on the King's Road. But these projections should worry us. Add up the total shortfall and the men and women of Newham can expect to miss out of 1,262,390 years of life. The divide gets starker if you look at the quality of health in those years. Government statisticians project that a George living in Kensington can expect to enjoy an extra 16.6 years without a major illness or disability than a George in Newham. Those are just some of the figures. What they cannot convey is the different norms between the multimillion-pound estates of Kensington and Newham, still one of the most deprived local authorities in Britain. Numbers cannot show you the newsagents' windows festooned with cards advertising spare rooms to share with two, three or more families. Nor can they tell you about how it has become normal for desperate Londoners to turn bathrooms and kitchens into their living and sleeping quarters. They can't recall all the stories in the local papers about beds in sheds and how workers on the Olympic development were living in landlords' gardens. And stats can only suggest the effect this has on children in Newham. Analysis from Public Health England's London team shows that over 42% of five-year-olds there fail to reach a good level of development that would enable them to do all right at primary. But that doesn't convey the other issues George and his class face at school. Dawn Foster, my colleague at the Guardian, was a governor at a Beckton primary between 2010 and 2011. The children would be either too skinny or very overweight; very few were of normal size, she says. Until the local council gave free lunches to all primaries, pupils at her school would turn up with a packet of crisps for their midday meals. And the kids would naturally bring other problems in from home. A blown gas boiler might mean no lunch at all. A bit of extra work would play havoc with parents' benefits nearly one in three households in Newham are on means-tested welfare, against 12.7% of all households in Kensington . Financial stress might well mean family stress. There'd be instances of some six-year-old being sexually aggressive, which usually indicated there was something going on at home. Terrible diets, trouble at home: not all of this can be ascribed to poverty, of course. But as Michael Marmot's Institute of Health Equity points out, there is a strong link between economic inequality and life chances. Put parents in high-stress conditions over which they have little or no control and they will struggle to feed their child, or read to them, or take them for a kickabout at the park. And from there: rubbish GCSEs, little chance of going to a good university ? but a really good chance of crap jobs on low wages, especially now the East End's factories have gone and the docks are still. Over 29% of all men in Kensington and Chelsea are in management jobs; the same goes for only 7.8% of men in Newham. And so the circle goes on, in a Britain where one's class is becoming so inescapable it might as well be one's caste. There are only 13 stops between Notting Hill and Stratford, but they might as well be in different worlds. Economic inequality is only part of that. Because accepting Britain's huge gap in wealth means accepting that some people deserve to have meaner, unhealthier and shorter lives.