Despite ? or because of ? the money and status, royal blood is not always a good thing in children's stories. Princes and princesses, along with other well-born young people, may have a tough time of it. Prince George can learn much about dangers in store for him and his potential siblings and friends by delving first into fairy and folk tales. Here, princesses in particular tend to do badly. Sometimes, existing at all is their only crime: I'm sure his highness's parents will not make the kind of mistake over godparents and invitations that led to Sleeping Beauty's fate, while the extended families know enough about step-parenting to avoid a repetition of the story of Snow White. But princes don't fare much better. Prince George may want to steer clear of the original Brothers Grimm version of The Frog Prince. In contemporary picture-book versions such as Berlie Docherty and Jane Ray's The Frog Prince, the transformation from pond life to royalty is brought about by a kiss. The Brothers Grimm tell a rather more violent story, with the inner princeonly released after being slammed against the wall. Ouch! Too painful for young royal ears to hear. Getting in touch with his feminine side and learning to understand what Cinderella might feel, Prince George could try Babette Cole's Prince Cinders, the story of a hard-done-by youngest brother who goes wild after being released from drudgery by a good fairy. George will, of course, be inundated with picture book versions of that most British of stories, George and the Dragon. In traditional versions he can celebrate with his namesake and simply feel royally proud of saving a kingdom from a fire-breathing tyrant. Or he can enjoy any number of retakes on the story, including Christopher Wormell's beautifully illustrated George and the Dragon, which features a dragon with a difference. Away from traditional tales, Harry and Margaret Rey's Curious George and its sequels including Curious George Rides a Bike and Curious George Goes to Hospital, delightful stories about the scrapes a young monkey gets into, will have a nicely personal feel for the young Prince George. In the UK Curious George was changed to Zozo when the book was first published in 1941, apparently to spare any blushes that might have arisen over featuring a monkey with the same name as a King. Finally, every prince ? and every other child, for that matter ? should one day read and enjoy Antoine De Saint-Exup?ry's The Little Prince, the teasingly philosophical wartime masterpiece.