From the moment she entered the Lindo Wing of St Mary's hospital, the Duchess of Cambridge was able to take advantage of the luxury facilities on offer at one of the most exclusive private maternity units in Britain, her every whim met immediately by a dedicated staff primed for the task. But while the world waited for the heir to the throne to make his entrance, just over 200 miles away at the Liverpool Women's hospital, the biggest maternity unit in the country, the midwives just got on with what they do best: bringing non-royal babies into the world. If the Duchess had decided to come and have her baby here she would have got just as good care, if not better, than in London, insisted Ange Winstanley, lead midwife on the labour ward. We might be busy, but for us each and every one of those women is as important as a royal. The hospital, which was opened by Princess Diana 18 years ago, is in the centre of Toxteth, one of the most deprived areas of the country. The care that mothers and babies receive on the NHS is some of the best in the world. Staff bombard new and expectant mothers and their partners with kind words and cups of tea, while wards feature private rooms and gleam with modern equipment provided in a ?10m makeover in 2010. On the Princess Diana ward, Stephen Eyers, 26, was less concerned about the arrival of the royal baby and more focused on the miracle that had just occurred in his own life. I'm just overwhelmed with joy, I can't explain it, he said, playing with the tiny hand of his son Callum, born at 11.34am. It was just one of the best experiences of my life. Eyers, like William, was there for the duration of the birth ? albeit with frequent trips to the bathroom. I was sick four times, he said. But as soon as he came out I was just crying. His partner, Stacey Peers, 26, cracking jokes after a 24-hour labour, said that she was only pleased her son had been born on the same day as the future king so he could get a royal coin. But describing the moment she saw her child, her face softened into a smile. I looked at him and all the pain went away ? for a few minutes at least, she said. Over in the delivery suite, which has 18 beds for women deemed to be at high risk, Jeanette Ratcliffe, 29, was recovering after being induced to give birth to daughter Milly. I did feel under pressure to hold on to her until Kate went into labour and as soon as we told our family the first thing they said was that Kate had also started, so she did steal our thunder a bit, she said. Partner Paul McCarthy, 30, said it had made an amazing day even better. It just makes it a bit more special, he said. It will be a nice story to tell her and we will have the silver coin to show her when she is older. It is fair to say that Ratcliffe was not thinking about the duchess when she went in labour. I was just thinking, give me my baby now ? I've been waiting such a long time. Amy Muscatelli, 24, was similarly unimpressed when her partner Curtis Booth, 25, mentioned ? just as another of her contractions struck ? that the duchess was also about to give birth. Asked how she had reacted, she replied: You can't really print it in a paper, but it was the pain talking. It meant 'I don't really care right now'. Her son Jacob, weighing 7lb and 9oz, was born at 9.21am. The LWH delivers around 8,500 babies a year, offers comprehensive care from fertility treatment to antenatal expertise, and hosts The Hewitt Fertility Centre, one of the world's most successful fertility treatment centres. It is different. She is an important person, and she should have a better room, better everything, said Justyna Dabrowska, holding newborn Igor . My baby is important to me, Kate's baby is important to her. Like the other women, Dabrowska said the midwives who helped deliver her son were friendly and kind ? a vital part of the job, according to midwife Ange Winstanley. I want women to get the treatment I would want myself, she said. We care about this, it's not just a job. Our ethos is to be kind and compassionate and send babies and mums home happy and healthy, no matter who they are. ? This article was amended on 23 July. Liverpool's Women's hospital is approximately 209 miles away from St Mary's in London.