Edward Snowden is not just trying to find his way out of Moscow's Sheremetyevo airport. He is also attempting to navigate his way through a thicket of international law on political asylum while staying beyond the reach of the US and its allies. It is a perilous balancing act that has so far proven hard to pull off. Washington has made it clear to friend and foe alike that there would be a heavy price to pay for providing shelter to the runaway American intelligence analyst. Hence the extraordinary step taken last week by France, Portugal, Spain and Italy, of denying airspace to Bolivian president Evo Morales's executive jet, wrongly suspected of carrying Snowden from Moscow to Latin America. And hence the hedged nature of most of the asylum offers Snowden has received to date. Vladimir Putin said two weeks ago that Russia would provide asylum on the condition he stop harming our American partners ; in other words, shut up and stop leaking to the press. Overtures from Ecuador, Venezuela, Bolivia and Nicaragua meanwhile, have been conditional on Snowden applying on their territory. Venezuela's offer seems firm, but Snowden must still get to Latin America to benefit from it ? a big condition in view of his circumstances for the past 20 days, locked in the sterile limbo of the Sheremetyevo transit lounge without a valid passport. His press conference was an attempt to escape that catch-22. Widney Brown, Amnesty International's senior director for international law and policy, said the Latin American states involved could theoretically have sent envoys to Sheremetyevo to furnish Snowden with travel documents. However, that would be a highly unusual procedure for use in extremis, Brown said. It may be that these states would prefer to go through the normal procedures for adjudicating asylum claims. Snowden's strategy ? to appeal for temporary asylum in Russia to allow him to file for asylum elsewhere ? is a reaction to these conditions. He is responding to Putin's conditionality by insisting he has no intention of harming the true interests of his home country, but it is not clear whether he would agree to a temporary gag while in Moscow. Judged on his record so far, it would seem out of character, but he may have little choice, and a Russian member of parliament has suggested the American fugitive was prepared to agree to such a deal. Temporary haven in Russia would give Snowden protected status so that even if there were a sealed Interpol warrant waiting for him when he emerged on to the streets of Moscow, his pending asylum request should, under international law, take precedence and be ruled on before any extradition requests. Both Amnesty International and Human Rights Watch have said Snowden has a good prima facie case for asylum, based on a well-founded fear of political persecution. Snowden's public statement at Sheremetyevo, couched in the language of the US constitution and international law, will have served to entrench that case. Human rights lawyers say those grounds have been strengthened by the extraordinary lengths to which Washington has gone to try to get him back, as well as the lack of whistleblower protection for national security officials in the US under the Espionage Act, the brutal treatment of the soldier behind the WikiLeaks revelations, Bradley Manning, and the prospect of long-term incarceration before trial, possibly in solitary confinement. Human Rights Watch notes: The US should also keep in mind that for many decades it has offered political asylum to people who suffer severe penalties for criticising their governments. It has called on Washington not to play by double standards. The Obama administration is unlikely to appreciate the implicit comparison with the world's dictatorships, but right now, Snowden just needs to persuade Putin.