MOSCOW ??? President Vladimir V. Putin told an audience of students on Monday that the United States had effectively trapped Edward J. Snowden, the fugitive former intelligence contractor, on Russian territory by frightening countries that otherwise might have accepted him. When Mr. Putin insisted that Russia did not want Mr. Snowden to cause damage to the United States, the students laughed out loud. Mr. Putin made the remarks on Hogland Island in the Gulf of Finland, where he was reviewing projects of the Russian Geographical Society. He spoke about Mr. Snowden, who announced on Friday that he would formally request asylum in Russia, during a meeting with student researchers who were attending an archaeological camp on the island. Russian officials said Monday that they still had not yet received an application from Mr. Snowden, and Mr. Putin did not say outright whether he would grant a request from him. But the president clearly signaled that it remained a possibility. Mr. Snowden arrived at Sheremetyevo Airport outside Moscow on a flight from Hong Kong on June 23, and he has been there ever since, living in the transit zone of the airport with the consent of the Kremlin and apparently with some support from the Russian authorities. On Friday, Mr. Snowden met at the airport with lawyers, Russian officials and representatives of human rights organizations. Mr. Putin???s comments came in response to a question from a geography student, Alexandra Schurova, who noted that despite living on the island, the students were interested in the spy action on the mainland. Mr. Putin, a former K.G.B. agent, teased that geographers had always been close to espionage activity and, according to a Kremlin transcript of the event, jokingly described Mr. Snowden as an unwanted Christmas present. ???He arrived on our territory without an invitation,??? Mr. Putin said. ???He didn???t fly to us; he flew in transit to other countries. But only when it became known that he was in the air, our American partners, in fact, blocked him from flying further. ???They themselves scared all other countries; no one wants to take him, and in this way they themselves in fact blocked him on our territory. Such a present for us for Christmas.??? Mr. Putin said Russia had invited Mr. Snowden to apply for asylum on the condition that he first stop his political activities ??? presumably all leaking of classified information that could harm the United States. But given Russia???s long intelligence rivalry with the United States, it is hard to believe that Mr. Putin has not been enjoying Washington???s discomfort over Mr. Snowden, and even his student audience laughed at the suggestion. ???Initially,??? Mr. Putin said, ???we offered him, ???If you want to stay, please, but you have to stop your political activities. We have a certain relationship with the U.S., and we don???t want you with your political activities damaging our relationship with the U.S.??? ???He said, ???No.???????? The students laughed. ???You laugh, but I am speaking seriously,??? Mr. Putin continued. ???He said: ???No, I want to continue my work. I want to fight for human rights. I believe that the United States violated certain norms of international law, interfered with private life.???????? The Obama administration has been pressing Russia not to grant asylum to Mr. Snowden, and it has been pressing other countries not to take him, particularly in Latin America, where Venezuela, Bolivia and Nicaragua have said they are willing to grant him asylum. President Obama spoke with Mr. Putin by telephone on Friday. Neither side has disclosed precisely what was said , but the White House has made clear that in its view, American interests are being harmed as long as Mr. Snowden is at large and not back in the United States to face criminal charges. Mr. Putin said on the island that he thought Mr. Snowden would move on from Russia. ???As soon as an opportunity to move somewhere emerges, he will do it, of course,??? he said.