On 26 February 2012, George Zimmerman, a self-appointed neighbourhood watch volunteer of mixed white-Hispanic parentage, shot dead an unarmed black 17-year-old, Trayvon Martin, in Sanford, Florida. Zimmerman admitted killing Martin but told police he fired in self-defence. He was released without charge that night but was arrested 44 days later following public outcry, including intervention by Barack Obama. Before shooting Trayvon, Zimmerman called 911 to report what he described as Martin's suspicious behaviour , telling the operator he looked like he was up to no good, on drugs or something . Zimmerman was warned by the operator not to follow the teenager. During the call he used the words fucking punks and said: These assholes, they always get away. On 13 July 2013, Zimmerman was acquitted of murder by the jury of six women, five of whom were white and one Hispanic, in the Florida state court. The jury accepted Zimmerman's contention that he shot Trayvon in self-defence, believing his life to be in immediate danger. He claimed Trayvon had emerged from the darkness to break his nose with a sucker punch and smash his head on a concrete pavement. The case hinged on the conflicting testimony of witnesses as to who was on top of the other during the struggle, and the key issue of whose screams were heard on a recording of a 911 call made by one of Zimmerman's neighbours, which also captured the fatal shot. Martin's mother, father and brother all testified that they were certain it was the teenager who was pleading for his life. Zimmerman's parents and a numbers of friends and neighbours took the stand to insist that it was Zimmerman. Black leaders have expressed outrage at the verdict and demanded that the authorities pursue a federal civil rights case against Zimmerman. In Washington, the justice department said it was evaluating whether it had enough evidence to support Zimmerman's prosecution in federal court. There have been protests across the US but they have been relatively small in scale, easing fears that the verdict would lead to violent unrest.