A jury deciding the fate of George Zimmerman, the Florida neighbourhood watch leader charged with the second-degree murder of Trayvon Martin, an unarmed black teenager, hinted on Saturday evening that it was close to reaching a verdict. The panel of six women trying the case at the Seminole County criminal justice centre sent a note to Judge Debra S Nelson late on their second day of deliberations asking for further clarification of the instructions given to them for the charge of manslaughter. There was no explanation why they were asking the question, but it suggested the jurors had moved on from sifting through the three weeks of evidence presented to them at the trial and were considering their final decision. To secure a conviction for second-degree murder, prosecutors needed to prove that Zimmerman, 29, acted with ill will, spite or hatred when he shot and killed the 17-year-old Martin in a violent confrontation at Sanford's Retreat at Twin Lakes gated community on 26 February last year. The charge carries a penalty of at least 25 years in prison. To prove the lesser charge of manslaughter, the state's attorneys needed to show beyond a reasonable doubt that he intentionally committed an act that caused Martin's death and that the killing was not justified or excusable. In Florida, manslaughter involving a firearm is punishable with a sentence of between 10 and 30 years. With the approval of Nelson, state attorney Bernie de la Rionda and lead defence lawyer Mark O'Mara sent a note back to the jury room saying that the court could not engage in general discussions but might be able to address a specific question regarding clarification if the jury wished to submit one. Nelson told the court that the jury had ordered dinner to be sent in to them, suggesting they planned to continue working well into the evening, having already spent 10 hours on Saturday locked in discussions. Zimmerman, who admits killing Martin but denies murder on the grounds of self-defence, remained outside the courtroom for most of the day, in a separate room from Tracy Martin and Sybrina Fulton, the dead youth's parents. Outside the courthouse, police stepped in to remove a vocal protester from a gathering of Martin family supporters and a smaller group proclaiming Zimmerman's innocence. Dozens of demonstrators, many carrying Justice for Trayvon banners, turned up during the day and their protests remained largely peaceful as they sang gospel songs and chanted Martin's name. Earlier, the civil rights leader Jesse Jackson issued a public appeal for calm. Reverend Jackson was one of those who led peaceful protests in Sanford and elsewhere soon after the shooting on 26 February last year, when Zimmerman was originally released without charge. Speaking at a peace rally in Chicago, and in a series of tweets, Jackson said the public reaction to the verdict, whichever way it goes, needs to be tempered. If Zimmerman is convicted, there should not be inappropriate celebrations because a young man lost his life, he said. If Zimmerman is not convicted, avoid violence, because it only leads to more tragedies. Self-destruction is not the road to reconstruction. Zimmerman's family also released a statement calling for restraint. Jurors heard from 56 witnesses in 12 days, although Zimmerman did not testify in his own defence. O'Mara told them that Zimmerman was forced to fire to save his own life after Martin broke his nose with a sucker punch and smashed his head on a concrete pavement. Prosecutors portrayed Zimmerman as an angry vigilante who wrongly assumed that the hoodie-wearing Martin was a criminal and was up to no good as he walked home to the house of his father's fiancee. The case brought issues of race, Florida's controversial gun laws and the right of a person to stand their ground into sharp focus. A special prosecutor, Angela Corey, charged Zimmerman with murder six weeks after the shooting. It emerged on Saturday that Corey had fired Ben Kruidbos, the IT director of the state attorney's office who testified at a pre-trial hearing last month that prosecutors had withheld from the defence photographs and text messages he recovered from Martin's mobile phone. Kruidbos received a hand-delivered letter at his house on Friday accusing him of deliberate, wilful and unscrupulous actions . Your egregious lack of regard for the sensitive nature of the information handled by this office is completely abhorrent. You have proven to be completely untrustworthy, Cheryl Peek, the managing director of the state attorney's office, wrote in the letter.