Let it be noted that on this day, Saturday 13 July 2013, it was still deemed legal in the US to chase and then shoot dead an unarmed young black man on his way home from the store because you didn't like the look of him. The killing of 17-year-old Trayvon Martin last year was tragic. But in the age of Obama the acquittal of George Zimmerman offers at least that clarity. For the salient facts in this case were not in dispute. On 26 February 2012 Martin was on his way home, minding his own business armed only with a can of iced tea and a bag of Skittles. Zimmerman pursued him, armed with a 9mm handgun, believing him to be a criminal. Martin resisted. They fought. Zimmerman shot him dead. Who screamed. Who was stronger. Who called whom what and when and why are all details to warm the heart of a cable news producer with 24 hours to fill. Strip them all away and the truth remains that Martin's heart would still be beating if Zimmerman had not chased him down and shot him. There is no doubt about who the aggressor was here. It appears that the only reason the two interacted at all, physically or otherwise, is that Zimmerman believed it was his civic duty to apprehend an innocent teenager who caused suspicion by his existence alone. Appeals for calm in the wake of such a verdict raise the question of what calm there can possibly be in a place where such a verdict is possible. Parents of black boys are not likely to feel calm. Partners of black men are not likely to feel calm. Children with black fathers are not likely to feel calm. Those who now fear violent social disorder must ask themselves whose interests are served by a violent social order in which young black men can be thus slain and discarded. But while the acquittal was shameful it was not a shock. It took more than six weeks after Martin's death for Zimmerman to be arrested and only then after massive pressure both nationally and locally. Those who dismissed this as a political trial a peculiar accusation in the summer of Bradley Manning and Edward Snowden should bear in mind that it was politics that made this case controversial. Charging Zimmerman should have been a no-brainer. He was not initially charged because Florida has a stand your ground law whereby deadly force is permitted if the person reasonably believes it is necessary to protect their own life, the life of another or to prevent a forcible felony. Since it was Zimmerman who stalked Martin, the question remains: what ground is a young black man entitled to and on what grounds may he defend himself? What version of events is there for that night in which Martin gets away with his life? Or is it open season on black boys after dark? Zimmerman's not guilty verdict will be contested for years to come. But he passed judgement on Trayvon that night summarily. Fucking punks, Zimmerman told the police dispatcher that night. These assholes. They always get away. So true it's painful. And so predictable it hurts.