The mother of Trayvon Martin has thanked supporters for attending rallies calling for justice over her son's death, as political calls mount for a change in controversial stand your ground legislation. On Sunday, a day after protesters took to the streets of more than 100 US cities to voice their anger over the acquittal of George Zimmerman on charges of second-degree murder, Sybrina Fulton used Twitter to say: I would like to personally thank EVERYONE who attended the Trayvon Martin marches and rallies throughout the nation yesterday. United we will continue to stand. Saturday's demonstrations, which were organised by the veteran civil rights campaigner Reverend Al Sharpton, represented the largest coordinated action to date calling on authorities to act over Martin's death. It came a week after a Florida jury found Zimmerman not guilty. Crowds chanted Justice, Justice at a series of rallies and vigils, with events in New York, Miami and Washington among the most well-attended. Campaigners called on the Justice Department to launch civil rights charges against Zimmerman, who shot Martin during a struggle in February 2012. The armed neighbourhood watchman followed the teenager as he walked home from a convenience store, carrying little more than a bag of Skittles candy and a soft drink. Zimmerman claimed in a phone call to police dispatchers that Martin was acting suspiciously. But many have suggested that the teenager was profiled due to his race ? Martin was black, while Zimmerman is hispanic. The issue of race was not discussed during Zimmerman's trial, in which his lawyers claimed that their client acted in self-defence when he opened fire. But since the not guilty verdict came down, black leaders and groups ? including the nation's oldest and largest civil rights organisation, the National Association for the Advancement of Colored People ? have called on authorities to open hate-crime proceedings against Zimmerman. Crowds at yesterday's rallies were seemingly emboldened by remarks, delivered on Friday, in which Barack Obama addressed the issue of racial discrimination. Trayvon Martin could have been me 35 years ago, the president said at an impromptu press conference at the White House. And when you think about why, in the African American community at least, there's a lot of pain around what happened, I think it's important to recognise that the African American community is looking at this through a set of experiences and a history that doesn't go away. There are very few African American men in this country who haven't had the experience of being followed when they were shopping in a department store. That includes me. The president's remarks were reported to have surprised White House staff, who had not expected him to talk in such personal terms about the experience of being black in America. The common experience of being profiled due to race was an issue Sharpton also drew on, during his address to protesters at the New York rally on Saturday: Racial profiling is not as bad as segregation, but you don't know the humiliation of being followed in a department store, he said. I'd never heard of Sanford, he added, referring to the town where Martin, who was unarmed, was shot dead by Zimmerman after an altercation. But I heard too many times of stories where people are killed and treated like they are worthless, and it was a sense of justice that we said that this man should not be let go. Sharpton was joined in New York by Fulton, who told supporters she was determined to fight so other young African Americans were no longer treated with suspicion because of their skin colour. I promise you I'm going to work for your children as well, she told the crowd. The hip-hop mogul Jay Z and his wife, the singer Beyonc? Knowles, made a brief appearance and joined in prayers at the rally in Manhattan, where there were shouts of I am Trayvon Martin . That chant was echoed at small gatherings in Boston, Chicago, Miami, New Orleans, Atlanta and Los Angeles. Despite some earlier fears, there were no reports of violence. The main focus of Saturday's action was to further pressure the Justice Department to investigate a civil rights prosecution against Zimmerman. But there were also calls for a rollback of controversial stand your ground laws, such as the one that could have given Zimmerman protection in Florida. Enacted in more than 20 states, such laws go further than traditional self-defence legislation. In general, they eliminate a person's duty to retreat in the face of a physical threat and legitimise lethal force if someone believes their life to be in peril. Zimmerman's lawyers did not rely on stand your ground , but the judge included a provision of the law in her instructions to jurors, allowing them to consider it as a legitimate defence. On Sunday, the Republican senator John McCain added his name to those calling for the law to be changed. Speaking on CNN's State of the Union, he said that he did not question the jury's decision in the Zimmerman case. But he added: I can also see that the 'stand your ground' law may be something that needs to be reviewed by the Florida legislature or any other legislature that has passed such legislation. McCain's home state, Arizona, has such a law in place. He told CNN that he was confident that the state legislature would now look again at the controversial self-defence law.