The prosecutor who charged George Zimmerman last year has defended her decision to bring a murder case against him, and praised the state attorneys who presented it. We promised that we would seek the truth for Trayvon Martin and due process for George Zimmerman, that we get all the facts and details of this very difficult case before a jury, and we chose to do it that way because we felt everyone had a right to know everything about this case, special prosecutor Angela Corey said in a courthouse press conference minutes after the verdict was read. For a case like this to come out in bits and pieces served no good to no one. As [assistant state attorney John] Guy told the jury yesterday, to the dead we owe respect, to the living we owe the truth. We have been respectful to the living, we have done our best to bring due process to all involved and we believe we have brought out the truth on behalf of Trayvon Martin. Corey defended the introduction of the lesser included charge of manslaughter, which gave the jury another option to hold Zimmerman responsible for Martin's death if they did not believe he was guilty of murder, and which could have led to a 30-year jail sentence. We charge what we believe we can prove, she said. That's why we charged second-degree murder. We truly believe that the mindset of George Zimmerman and the words that he used and the reason he was out doing what he was doing fit the bill for second-degree murder. This case has never been about race, nor has it ever been about the right to bear arms, not in the sense of prosecuting this as a criminal case. But Trayvon Martin was profiled, there's no doubt he was profiled to be a criminal. This case was about boundaries and George Zimmerman exceeded those boundaries. Bernie de la Rionda, the state's lead attorney, said: We live in a great country that has a great criminal justice system. It's not perfect but it's the best in the world and we respect the jury's verdict. I've tried 300 and something cases, about 80 murder cases and this is only the second murder case that I've lost. Am I disappointed? Yes, because I thought he was guilty. But what matters is what the jury said and I accept it. Fellow prosecutor Richard Mantei praised the dignity shown by Martin's parents, Sybrina Fulton and Tracy Martin, throughout the legal process. They've been dignified and shown class, they've kept their pain in check when they needed to and grieved when they needed to, and handled it as ladies and gentlemen, he said. One of Zimmerman's defence attorneys, Don West, had scathing words for the Florida state attorney's office. The prosecution of George Zimmerman was disgraceful, he said. I am gratified by the jury's verdict. As happy as I am for George Zimmerman, I'm thrilled that this jury kept this tragedy from becoming a travesty. For that we are eternally grateful. It makes me sad, too, that it took this long under these circumstances to finally get justice. Unlike what Miss Corey said that they brought the facts, they didn't. Anybody who watched this trial knew that the defence put on the case. We proved that George Zimmerman was not guilty. He refused to discuss his clashes through the trial with Judge Nelson, his controversial knock-knock joke as he presented defence opening arguments and the now infamous photograph of him enjoying an ice cream with his daughter. This trial is about George Zimmerman, not about ice-cream cones. I still think the joke was funny, I'm sorry I didn't tell it better but there was a reason for it. There needed to be a disconnect from an act that was hard to follow, he said, referring to prosecutor John Guy's forceful and profanity-laden opening address. Mark O'Mara, Zimmerman's lead defendant, praised the jury. They were very intent. Some jurors you have to wake up by shouting or dropping a file. Not this jury, he said. They listened, they took notes they were as engaged as everyone else in the process and it made for the type of verdict we had to have, one that listened to all available facts, the evidence and the law.