It's ? it's a baby! A boy baby, so no chance to test the new rules on female succession, unfortunately. But rejoice nonetheless! It would be churlish not to, and besides, the birth of his majesty brings to an end some of the most ? possibly the most embarrassing commentary since rolling news was invented. All day yesterday, they kept us posted: We don't know anything ; The couple has arrived at the hospital ; They arrived by car ; The room is air-conditioned. This fact thanks to the newshound Kay Burley . Beyond that, nothing, they said, hour after hour; you could see them shaking their heads even when on the radio. But what exactly did they want to know? Because, as anyone who has ever come within a sniff of a labour ward will be aware, you either know nothing: nothing yet ; more when it happens ? or you know everything: she's 6cm ; she's asked for an epidural ? she's been at 6cm for hours ? they've broken her waters and now she's in howling agony ? no, it was more like a giant crochet needle with a hook on the end ? she's 7cm! At this rate of dilation, she could have a baby in as little as four days. Princess Diana famously told Andrew Morton that she had to be induced because she couldn't handle the press pressure any longer, it was becoming unbearable there is a competing narrative, also from her, that she had to get William out to fit in with Prince Charles's polo commitments . This sounds clinically improbable induction is roughly as effective as a vindaloo ? if you want a baby out on a deadline, you get it out through the sunroof, as the saying goes . But the frenzy around Diana would have been a modest village fete compared to this carnival; the arrival of this future monarch somehow animated for me, in a way that nothing has before, the unique lunacy of royal-watching. Waiting for this baby to come out has never had anything to do with its constitutional import, except to use its place in history as a cover for the unabashed prying. There was a woman in labour, whom none of us had ever met, and Nicholas Witchell was disappointed not to be able to give us hourly updates on her vaginal dilation. You could argue, of course, that squeamishness around discussing the female pudenda is rooted in a deeper hatred of women, and if we could just reclaim the word vaginally as a useful adverb, one that we could happily use of a woman whether we knew her or not, that would be one more baby step in the march against the patriarchy. But I think Middleton ? and, as I say, I don't know her, so this is a wild guess ? would most probably say, let's not start with my vagina, ok? I have enough on my plate. Let's reclaim the word 'vagina' on the subject of someone else's vagina. As a nation, we walked a tightrope, and we walked it like cartoon elephants in skirts: the media vied furiously to see who could have least regard for a person's privacy, while the royal family tried in vain to maintain a sense of pomp, by using words like foolscap and insisting upon absurd, pre-digital practises, involving putting the information on a piece of foolscap, then sitting that on an easel in front of the palace, and then some pre-authorised persons taking a photo of it and disseminating the picture, and everyone hoping that they didn't blow the whole business, all the ceremony and history and portent, and indeed the future of non-standard paper sizing, by accidentally sticking it on Twitter. Around seminal life moments ? your first day at school, your graduation, your first minibreak with the person you love ? ideals accrue. It'd be nice if, on your way to school, you did not get run over. It'd be good if you could graduate without a cold sore ? You know the sort of thing. To this library, one could add, it would be nice if you could go through labour without having to worry about your in-laws being made ridiculous by putting their announcement on an easel when a nurse has already put it on Facebook. And actually, besides the threats to privacy and the hassle of pomp, there have been the inevitable dramatic comparisons : how was this baby born, compared to its birth-twin in Liberia? What will Kate's post-operative care be like, compared to a mother in the Central African Republic? Even though you can see how irresistible that is to campaigners for maternal health worldwide, how piquant, how potent, is that comparison, I don't think it's fair to Kate Middleton. When you make her the emblem of all the inequality in the world, you make her its agent. She isn't; she's a person who's had a baby, as precious and awe-inspiring to her as any baby is to anyone who's just had it. Some other time to rain on their ridiculous parade. ? This article was amended on 24 July 2013. An earlier version referred to Andrew Motion as a confidant of Princess Diana. That has been corrected to Andrew Morton.