Ta-Nehisi Coates, the Atlantic: Trayvon Martin and the irony of American justice When you have a society that takes at its founding the hatred and degradation of a people, when that society inscribes that degradation in its most hallowed document, and continues to inscribe hatred in its laws and policies, it is fantastic to believe that its citizens will derive no ill messaging. It is painful to say this: Trayvon Martin is not a miscarriage of American justice, but American justice itself. This is not our system malfunctioning. It is our system working as intended. To expect our juries, our schools, our police to single-handedly correct for this, is to look at the final play in the final minute of the final quarter and wonder why we couldn't come back from twenty-four down. Cynthia Tucker, theGrio: 'Reasonable doubt' for Zimmerman, but rarely for black defendants But reasonable doubt is an elastic standard, and it seems to work in favor of whites much more often than it does blacks. It is hard to imagine that a black 'neighborhood watch volunteer' who pursued and killed a white kid under the same circumstances would have walked away a free man. The prosecution was limited by shoddy police work in the crucial hours after Martin died, by a stand-your-ground law that invites violence and, critically, by the fact that Martin could not give his version of events. Zimmerman took care of that. But black men and women have been convicted with much less to work with. Eugene Robinson, the Washington Post: Black boys denied the right to be young The conversation we need to have is about how black men, even black boys, are denied the right to be young, to be vulnerable, to make mistakes. We need to talk about why, for example, black men are no more likely than white men to smoke marijuana but nearly four times as likely to be arrested for it ? and condemned to a dead-end cycle of incarceration and unemployment. I call this racism. What do you call it? Trayvon Martin was fighting more than George Zimmerman that night. He was up against prejudices as old as American history, and he never had a chance. Adam Cohen, Time magazine: The lessons of George Zimmerman's 'not guilty' verdict If the jury could not tell us what to think of Zimmerman, it had even less to say about the larger issues embedded in the case. Martin's killing has served as a morality tale, wrapping in it questions of racial profiling, self-defense and gun ownership. But the fact that Zimmerman was found not guilty does not mean young black men are not being racially profiled in large numbers ? any more than a conviction would have meant that they are. It does not mean we need more guns ? or fewer guns. It does not mean self-defense laws need to be changed ? or that they do not. And therein lies the real takeaway of the Zimmerman case: it is telling us as clearly as it can that for all these months, we have been paying too much attention to it. Like a badly prepared teacher who is overly reliant on in-class movies, we use glitzy trials to raise obliquely things that we should be talking about directly. Alex Fraser, Facebook post: Dear George Zimmerman For the rest of your life you are now going to feel what its like to be a black man in America. You will feel people stare at you, judging you for what you think are unfair reasons. You will lose out on getting jobs for something you feel is outside of your control. You will believe yourself to be an upstanding citizen and wonder why people choose to not see that. People will cross the street when they see you coming. They will call you hurtful names. It will drive you so insane some days that you'll want to scream at the top of your lungs. But you will have to wake up the next day, put on firm look and push through life. Beth Kassab, Orlando Sentinel: George Zimmerman jury reached right verdict Like it or not, the jury got this one right. Nobody wants to see two parents who already lost their teenage son also lose out on what they saw as justice. As painful as it may be, though, acquitting George Zimmerman was the only verdict the jury could logically reach. The state simply didn't prove second-degree murder. Or manslaughter. As much as I don't like many of the choices Zimmerman made the night he killed Trayvon, the evidence presented at trial gave way to more than one reasonable doubt about Zimmerman's guilt. Bob Seay, Facebook post: I am not Trayvon Martin Here's my point: You don't have to be Trayvon Martin to know this is wrong. You don't have to be black, or young, or a 'troubled student' or a pot smoker to know this was murder. And you don't have to be the parent of Trayvon Martin to know this was a gross miscarriage of justice. Let me be more blunt: This type of injustice will continue until enough guys like me ? guys who are not Trayvon Martin ? have had enough of it and finally say, 'no more'. Eric Zorn, Chicago Tribune: Zimmerman acquitted: your thoughts and mine Some of those outraged by the verdict are calling tonight for the US Justice Department to file civil rights charges against Zimmerman ? federal charges being a slippery way around the constitutional prohibition against double jeopardy ? and that sounds like many kinds of wrong. We need to move the conversations about race and guns forward and not keep this particular wound open any longer. And we can't let civil rights charges be used as political tools to attempt to assuage people who are angry about not-guilty verdicts in otherwise straightforward local criminal trials. If US Attorney General Eric Holder gives the go-head to such an effort, it will rip the country apart. John Lott, Fox News: We never should have witnessed a Zimmerman trial The George Zimmerman case should never have been brought. Saturday night after the 'not guilty' verdict was delivered, State Attorney Angela Corey justified bringing the case 'to put the facts out there'. But criminal cases should never be brought simply to put the facts before the public. No one should be charged with a crime unless prosecutors themselves really believe that the person committed a crime. Yet, the prosecution and their own experts' language consistently showed a lack of certainty. Prosecutors aren't supposed to bring cases where the best they can say is that something might 'possibly' have happened or that there was a 'chance' that it did. Andrew Rosenthal, the New York Times: With Zimmerman, the scandal is what's legal Mr. Zimmerman joined a neighborhood watch group. He armed himself under Florida's ridiculously lax gun laws and went looking for suspicious characters. When he thought he had found one ? a young black man in a hoodie who had just made a snack run ? he called the police. But he didn't stop there. Like a vigilante, he got out of his truck, with his gun, and tracked down Mr. Martin. Was it part of his calculation that he had a right to choose not to retreat from a dangerous situation, but stand his ground and open fire? We do not know. But we do know that, under Florida law, none of this context really mattered, because in Florida you can carry a gun in public, follow an innocent stranger and then stand your ground. Did we miss a compelling commentary on the George Zimmerman trial and/or verdict? If so, please post a link to it in the comment section below.