MILWAUKEE ? Less than 48 hours after the acquittal of George Zimmerman in the death of Trayvon Martin ignited passions and protests throughout the nation, a jury was selected here for a trial with some striking similarities. The defendant, a white man, shot and killed an unarmed black teenager, in an effort, prosecutors say, to take the law into his own hands. The defendant, John Spooner, 76, did not dispute that he shot Darius Simmons, 13, in May 2012, believing the teenager broke into his house and stole his shotguns two days earlier. Mr. Spooner was found guilty of first-degree intentional homicide on Wednesday, moving the trial into its second phase, where defense lawyers will try to prove that he should not be held responsible because of the state of his mental health. The shooting of Darius is just one example of racially charged cases around the country that are similar to Mr. Martin?s death. ?I think the timing is evidence of how this type of thing happens all too often in various communities around the nation,? said James H. Hall Jr., the president of the Milwaukee branch of the N.A.A.C.P. From the beginning, the shooting resonated among the city?s black residents, leading to claims of racial profiling and calls for Mr. Spooner to face hate crime charges. During the trial, Mark S. Williams, the lead county prosecutor, laid out a narrative of the shooting that was essentially undisputed by the defense. Mr. Spooner?s house had been burglarized two days before and, though he strongly suspected Darius of stealing four shotguns, the police said they did not find enough evidence to continue their investigation. Mr. Spooner then confronted Darius around 10 a.m. as the youth was retrieving a garbage can in front of his house and demanded the return of the guns, which the teenager denied knowing anything about. Mr. Spooner lifted a .32-caliber pistol and fired a shot into the chest of Darius, who fled down the street before collapsing near a playground. None of Mr. Spooner?s guns were found in the teenager?s home. The timing of the trial, so soon after Mr. Zimmerman was found not guilty on Saturday, has added a layer of complexity for lawyers working on the case and a heightened anticipation of the verdict from blacks in Milwaukee, many of whom say they have lost confidence in the legal system. ?We felt let down,? said Danielle Jackson, 34, a black resident of Milwaukee who was outraged by Mr. Zimmerman?s trial and is now watching Mr. Spooner?s case closely. ?If he gets off, that?s going to bring us down more,? she said Tuesday. In Milwaukee, a city with a history of racial tensions, many black residents have a deep distrust of law enforcement and the legal process. Despite outreach efforts by the police, black leaders in Milwaukee still criticize the department?s community relations, pointing to episodes like the death of Derek Williams, a 22-year-old black man who collapsed in the back seat of a police cruiser in 2011 after telling officers he was having trouble breathing and asking for medical attention. By the time the police offered CPR, it was too late. A medical examiner?s report suggested that police may have been in part to blame in the episode, though no charges were filed after a special prosecutor?s investigation. The police?s handling of Darius?s death was criticized, as well. Officers would not immediately allow the teenager?s mother, who witnessed the shooting, to accompany her son to the hospital, keeping her in the back of police cars for an hour and a half for questioning. They also searched the family?s home for Mr. Spooner?s missing firearms and arrested Darius?s brother, who had five unrelated municipal warrants. After an internal police investigation, a commission found none of its policies were violated by the officers, though their report admitted ?a dimension of racial insensitivity that negatively influenced the trust of some members of the community.? ?The people that I speak with seem to have this continuing frustration that there doesn?t seem to be anything they can do,? said Jonathan S. Safran, a private lawyer for Darius?s family, which filed lawsuits against Mr. Spooner and the City of Milwaukee last year. ?They continue to see cases that have what they perceive as the wrong results.? In an interview, Franklyn M. Gimbel, Mr. Spooner?s lawyer, said the timing of Mr. Zimmerman?s acquittal added a challenging variable to the trial, despite explicit instructions from the court that the jury, which has one black member, must not link them. ?I have people off the street sitting to make judgment here,? he said. ?Notwithstanding what they might have said during the selection process, they do have sometimes triggered memories about those kinds of things.? Mr. Gimbel said it was unfair to compare the two cases and argued that race was not a factor in Mr. Spooner?s trial, which was expected to end on Thursday. Many of Mr. Spooner?s neighbors, both black and white, agreed. They described a usually kind person who was frequently seen walking his dogs and talking with people of all races on the block. ?We all loved that old man,? said John Davis, 43, who is white and lives nearby. But while some of the city?s black residents expressed sympathy toward Mr. Spooner?s age and health problems ? his lawyer said he was having trouble breathing during the trial ? others cited their feelings about Mr. Martin?s death and said what little faith they had left in the legal process would be at stake when the jury decides whether Mr. Spooner was responsible or mentally ill. ?There wouldn?t be no loopholes if the roles were reversed,? said Derrell Price, 28, who is African-American and works at a thrift store on Milwaukee?s South Side. ?If he gets off like Zimmerman did, then this whole system is messed up.?