One of the six female jurors who acquitted the Florida neighbourhood watch leader George Zimmerman of murdering Trayvon Martin has revealed that three of the panel originally wanted to convict him. The middle-aged woman, who is white and has grown-up children, said she and her fellow jurors believed that Martin, an unarmed black 17-year-old, threw the first punch in the fatal confrontation, leaving Zimmerman in fear of his life. That, she said, was the determining factor in why the three changed their minds. The woman, with her face blacked out and identified only as juror B-37, insisted that justice had been served. George Zimmerman is a man whose heart was in the right place, but just got displaced by the vandalism in the neighbourhood and wanting to catch these people so badly that he went above and beyond what he really should have done, she told CNN's Anderson Cooper on Monday night. It just went terribly wrong, she said. Things just got out of hand. I think he's guilty of not using good judgment. The panel deliberated for more than 16 hours before all of them accepted that Zimmerman acted in self-defence, she said. In their first poll, one juror thought he was guilty of second-degree murder and two of manslaughter. It was just so confusing what went with what and what we could apply to what, she said. There was a couple of them in there that wanted to find him guilty of something. And after hours and hours and hours of deliberating about the law and reading it over and over and over again, we decided there's just no way or other place to go. Because of the heat of the moment and stand your ground, he had a right to defend himself. If he felt threatened his life was going to be taken away from him or he's going to have bodily harm then he had a right. That's how we read the law, that's how we got to the point of everybody being not guilty. She pointed to two pieces of evidence that were key to the case: the screams heard on a recording of a 911 call made by a resident of Sanford's Retreat at Twin Lakes gated community on 26 February last year, and the instructions of a police dispatcher whom Zimmerman called on a non-emergency line to report a suspicious male . It was George Zimmerman's. Because of the evidence that he had gotten beaten, she said when Cooper asked her whose voice the jury believed it was. She said the conflicting testimony of Martin's mother, Sybrina Fulton, and Gladys Zimmerman each claiming it was their son cancelled the other out. The police dispatcher, she said, was also at fault. [Zimmerman] shouldn't have gotten out of that car. The operator kind of egged him on. He should have said, 'Stay in your car,' not 'Can you see where he's gone?'. She insisted that the race of the two parties ? Martin was black, Zimmerman of mixed white-Hispanic parentage ? never came up in the jury room. The circumstances caused George to think he might be a robber or do something bad because of what had gone on, she said, referring to a recent series of burglaries in the development. If there was another person, Spanish, white, Asian, if they came in the same situation Trayvon was in, I think George would have reacted in the exact same way. We never had this discussion. I think he just profiled him because he was the neighbourhood watch, he profiled anyone who came in who did something strange. Several other statements the juror made highlighted the difficulties of processing so much information to try to reach a verdict. She referred several times to a 911 call that she said Zimmerman made, even though his call was to a police non-emergency line. She was confused when asked who she thought was the most credible witness. The doctor, and I don't know his name, she replied. He was awe-inspiring, the experience he had over in the war, I never thought somebody could recognise somebody's voice yelling, a terrible, terror voice. ? Cooper asked if she meant a friend of Zimmerman's, a man named John Donnelly who served as a combat medic in Vietnam and who testified that he recognised the defendant's voice on the tape. The juror, however, said no, she was referring instead to the defence medical examiner . That witness, Dr Vincent DiMaio, gave evidence about Martin's gunshot wound, not the recording. The woman concluded the interview in tears as she recounted the emotional toll of the experience. It's just hard thinking that somebody lost their life and nothing else can be done about it, she said. Both of them could have walked away, it just didn't happen. I feel sorry for them both. I wanted people to know that we put everything into everything to get this verdict. We thought about it for hours and cried over it afterward.