An angry backlash has forced a juror in the George Zimmerman murder case to abandon plans to write a book about her experience, as activists at the biggest civil rights group in the US tore up the agenda at their annual convention on Tuesday. New York publishing house Martin Literary Management issued a statement declaring it had rescinded its offer of co-operation to the middle-aged woman, known only as juror B37, after careful consideration in response to thousands of critical messages on social media. The woman gave a television interview on Monday night in which she revealed that the jury was initially split over Zimmerman's guilt. In Orlando, Florida, less than 30 miles from where Martin was killed last year, delegates at the annual convention of the National Association for the Advancement of Colored People NAACP stepped up their pressure on the Obama administration to launch a federal prosecution against Zimmerman. Former officials from the DoJ have been playing down the chances of new charges, which would require a prosecutors to prove that Zimmerman was motivated by race when he confronted and the fatally shot the teenager in a gated community in Sanford, Florida, in February 2012. But the attorney general, Eric Holder, raised hopes about the prospects of a fresh prosecution on Monday, when he said that he shared concerns about the tragic, unnecessary death of Martin, who was shot dead by Zimmerman as he walked home from a convenience store. Holder was due to address the NAACP convention on Tuesday. Benjamin Jealous, the president of the NAACP, said he was hopeful that Holder would address the organisation's demand for a federal trial. What matters here are the facts and the legal standard. We believe there are enough facts to meet the legal standard, and that the US Justice Department should bring criminal civil rights charges, Jealous told the Guardian. Any decision is likely to take months. Protests continued around the US in the wake of the verdict, with 14 arrests at demonstrations that turned violent in Los Angeles late on Monday. In New York, demonstrators chanted: Trayvon dead, Zimmerman free, this is not democracy, and carried pointedly worded banners that read: Trayvon was lynched . Meanwhile juror B37 appeared to express regret for pursuing a book deal. The woman, one of the six female jurors who on Saturday acquitted Zimmerman, a neighbourhood watch leader, released a statement acknowledging the depth of pain that exists among the general public over every aspect of this case . The woman said she had only realised the sensitivities surrounding the three-week trial, during which the jury was sequestered, after returning home. She said she now realised that writing the book, which she intended as a respectful observation of the trial from my and my husband's perspectives was no longer the direction in which she wanted to go. With her face blacked out, she appeared in a television interview on Monday night, revealing that only three members of the six-woman panel had initially voted to acquit Zimmerman. Two thought he was guilty of manslaughter, and one believed he was guilty of the original charge, second-degree murder. The woman said that she and fellow jurors believed that Martin threw the first punch in the fatal confrontation, leaving Zimmerman in fear of his life. That, she said, was the determining factor in why the three changed their minds. She insisted that justice had been served. George Zimmerman is a man whose heart was in the right place, but just got displaced by the vandalism in the neighbourhood ? he wanted to catch these people so badly that he went above and beyond what he really should have done, she told CNN's Anderson Cooper on Monday night. It just went terribly wrong, she said. Things just got out of hand. I think he's guilty of not using good judgment. The panel deliberated for more than 16 hours before all of them accepted that Zimmerman acted in self-defence, she said. Jealous said Holder would get a warm welcome at the NAACP convention in Florida. Holder always gets a hero's reception at the NAACP, because he has done a great job rebuilding the civil rights division of the Justice Department, which was virtually dismantled by George W Bush, he said. Eric Holder is often candid when he comes to speak to us. We expect he will make honest comments about the state of civil rights. Tensions in the wake of the verdict were apparent particularly in Los Angeles, where protesters ran through streets Monday night, breaking windows, attacking people on sidewalks and raiding a Walmart store, while others blocked a major freeway in the San Francisco Bay area in the third night of demonstrations. Fourteen people were arrested after multiple acts of vandalism and several assaults in Los Angeles' Crenshaw district, police said. The trial that we saw in Florida has ignited passions but we have to make sure that it will not ignite the city, Los Angeles mayor Eric Garcetti said. In Oakland, California, at least one person was injured and police made nine arrests when a protest turned violent Monday night. The Associated Press contributed to this report