CAIRO AP ? Protesters stormed and ransacked the Cairo headquarters of President Mohammed Morsi's Muslim Brotherhood group early Monday, in an attack that could spark more violence as demonstrators gear up for a second day of mass rallies aimed at forcing the Islamist leader from power. Organizers of the protests, meanwhile, gave Morsi until 5 p.m. on Tuesday to step down and called on the police and the military to clearly state their support for what the protest movement called the popular will. Sunday saw millions of Egyptians flood the streets nationwide in a massive outpouring of anger and frustration with the president and the Brotherhood, the Islamist group that propelled Morsi to power. The protests were largely peaceful, although in a sign of the volatility of the country's divisions, clashes erupted in the evening around the Brotherhood's Cairo headquarters between armed Morsi supporters barricaded inside the building and young protesters pelting it with firebombs and rocks. After clashes raged overnight, protesters managed to breach the compound's defenses and storm the six-story building early Monday, carting off furniture, files, rugs, blankets, air conditioning units and portraits of Morsi, according to an Associated Press journalist at the scene. One protester emerged with a pistol and handed it over to a policeman outside. Footage on local TV networks showed smashed windows, blackened walls and smoke billowing out of the fortified villa in the Muqatam district in eastern Cairo. A fire was still raging on one floor hours after the building was stormed. One protester tore down the Muslim Brotherhood sign from the building's front wall, while another hoisted Egypt's red, black and white flag out an upper-story window and waved it in the air in triumph. Health Ministry spokesman Yehya Moussa told state television that at least 16 people nationwide have been killed in violence related to the protests since Sunday, eight of them at the Brotherhood's headquarters. A total of 781 people have been injured, he added. It was not immediately clear whether the Brotherhood supporters holed up inside who had been battling the protesters late Sunday fled the building overnight. Morsi's critics view the Brotherhood headquarters as the seat of real power in Egypt, consistently claiming that the Islamist group's spiritual leader, Mohammed Badie and his powerful deputy, Khairat el-Shater, were the ones actually calling the shots in the country, not the president. The Brotherhood has in recent weeks fortified the building's walls in anticipation of the massive opposition protests in which millions took part on Sunday in a display of anger and frustration with the Islamist leader on the anniversary of his inauguration. On Monday, anti-Morsi protesters were gearing up for a second day of demonstrations. Some protesters spent the night in dozens of tents pitched in the capital's central Tahrir Square and in front of the president's Ittihadiya Palace. They have vowed to stay there until Morsi resigns. The president's supporters, meanwhile, continued their sit-in in front of a major mosque in another part of Cairo. The anti-Morsi demonstrators are calling for widespread labor strikes in an attempt to ratchet up the pressure on the president, but it was not immediately clear whether unions would respond to the call. Organizers are also calling for sit-ins at the Cabinet building, interim parliament, and another presidential place where Morsi has been working since late last week. Sunday's protests were the largest seen in Egypt in the 2? years of turmoil since the ouster of autocrat Hosni Mubarak in February 2011. Fears were widespread that the collisions between the two sides could grow more violent in coming days. Morsi made clear through a spokesman that he would not step down and his Islamist supporters vowed not to allow protesters to remove one of their own, brought to office in a democratic election. During the day Sunday, thousands of Islamists massed not far from the presidential palace in support of Morsi, some of them prepared for a fight with makeshift armor, sticks and shields. The anti-Morsi protesters aimed to show by sheer numbers that the country has irrevocably turned against him, a year to the day after he was inaugurated as Egypt's first freely elected president. But throughout the day and even up to midnight at the main rallying sites, fears of rampant violence did not materialize. Instead the mood was largely festive as protesters at giant anti-Morsi rallies in Tahrir and outside the Ittihadiya palace spilled into side streets and across boulevards, waving flags, blowing whistles and chanting. Fireworks went off overhead. Men and women, some with small children on their shoulders, beat drums, danced and sang, By hook or by crook, we will bring Morsi down. Residents in nearby homes showered water on marchers below ? some carrying tents in preparation to camp outside the palace ? to cool them in the summer heat, and blew whistles and waved flags in support. Mubarak took only 18 days although he had behind him the security, intelligence and a large sector of Egyptians, said Amr Tawfeeq, an oil company employee marching toward Ittihadiya with a Christian friend. Morsi won't take long. We want him out and we are ready to pay the price. The massive outpouring against Morsi raises the question of what comes next. Protesters have vowed to stay on the streets until he steps down. The president, in turn, appears to be hoping protests wane. For weeks, Morsi's supporters have depicted the planned protest as a plot by Mubarak loyalists. But their claims were undermined by the extent of Sunday's rallies. In Cairo and a string of cities in the Nile Delta and on the Mediterranean coast, the protests topped even the biggest protests of the 2011's 18-day uprising, including the day Mubarak quit, Feb. 11, when giant crowds marched on Ittihadiya. It is unclear now whether the opposition, which for months has demanded Morsi form a national unity government, would now accept any concessions short of his removal. The anticipated deadlock raises the question of whether the army, already deployed on the outskirts of cities, will intervene. Protesters believe the military would throw its weight behind them, tipping the balance against Morsi. The country's police, meanwhile, were hardly to be seen Sunday. In the lead-up to Sunday, some officers angrily told their commanders they would not protect the Brotherhood from protesters, complaining that police are always caught in the middle, according to video of the meeting released online. If the Brothers think that we will give up and leave, they are mistaken, said lawyer Hossam Muhareb as he sat with a friend on a sidewalk near the presidential palace. They will give up and leave after seeing our numbers.