Enraged followers of deposed Egyptian president Mohamed Mursi have vowed to continue to vent their anger across the weekend after violent clashes with anti-Mursi protesters left more than 20 people dead. The violence exploded on the streets of Cairo about 8pm on Friday as Mursi's followers attempted to cross the Nile and reach Tahrir Square, the central meeting point for the anti-Mursi opposition. Supporters of Mr Mursi, who are drawn largely from the ranks of the Muslim Brotherhood, Egypt's largest Islamist movement, had been gathering in larger numbers throughout most of Friday after attending midday prayers which religious leaders traditionally use for more politically oriented sermons. This is now our time to protest and show strength, said Hamdi Mohamed Rahman, 23, a law student, after attending midday prayers at the Estekama mosque near Cairo University. They are not the only ones who know how to organise themselves on the street, he said, referring to the mass demonstrations earlier in the week against Mr Mursi, which prompted Egypt's military to remove Mr Mursi from office. Tens of thousands of supporters of Mr Mursi then gathered at a political rally outside Cairo University throughout Friday afternoon, before slowly making their way towards the centre of the city. At another location, the Brotherhood's supreme guide Mohamed Badie address a large crowd and pledged that it was worth our lives to restore Mr Mursi to the presidency. The clashes began around sunset as the pro-Mursi supporters tried to cross the Nile on a number of different bridges leading into Tahrir Square, where anti-Mursi protesters had been celebrating all week. While the crowd movements had been carefully monitored by helicopters in the air, and ground troops stationed at different locations around the city, the military appeared to allow the clashes unhindered for several hours before finally intervening in the early hours of Saturday. At least five people were confirmed dead in Cairo, including three protesters shot dead outside the Republican Guard barracks where Mr Mursi is being held, security sources said. Fierce clashes also took place in the Mediterranean city of Alexandria with 12 people killed, while five police officers were gunned down in separate incidents in the North Sinai town of El Arish, and while it was not clear whether the attacks were linked to the ouster of Mr Mursi, hardline Islamists there have warned they would fight back. Friday's fatalities added to the dozens of deaths in a month of unrest, that looks set to continue with the Muslim Brotherhood declaring that it will not co-operate with the new transition government installed by the military on Wednesday that is working to restore confidence in the Egyptian economy and planning new elections. But neither the military, nor the new interim president Adly Mansour have provided many details about the road map to transition - adding to political uncertainty at a time when many Egyptians fear violence could polarise society even further. Leftist former presidential candidate Hamdeen Sabahi told the Reuters news agency he hoped the transition could last only six months. And, in common with allies on the liberal left, he insisted there had been no military coup, calling the idea an insult to Egypt.