Fresh presidential and parliamentary elections have been announced in Egypt amid reports that Mohamed Morsi has been told he is no longer in charge of the country. Egypt's state-run Al-Ahram newspaper reported on its website that the army told Mr Mursi at 7pm 6pm? UK time that he was no longer head of state, quoting a presidential source. The country's leading Muslim and Christian clerics and opposition leader Mohamed ElBaradei will shortly unveil the details of a political road map for a short transitional period followed by new national polls, state news agency MENA reported. It follows the end of talks with military chiefs who gave Mr Morsi an ultimatum to share power, which has now expired. Sworn in around a year ago, he was given until around?5pm 4pm BST to act on the ultimatum to meet the demands of the people or face military intervention. According to the Egyptian security forces, orders banning Mr Morsi, Muslim Brotherhood chief Mohammed Badie and his deputy Khairat al Shater from travelling abroad have been issued to airport officials. The army, which has entered the presidential palace as well as state TV buildings in Cairo to monitor content in the station's newsroom, has been accused of a military coup. Soldiers were said to be blocking any presidential statements from going out, forcing Mr Morsi's aides to use Facebook to communicate with the divided country. 		 			Video: 			Egypt: What's Driving The Protests? 		 		 	 Army movements were also reported elsewhere in the city, with armoured vehicles and troops including commandos deployed on strategic bridges and near protest sites, including Cairo University where supporters of the president gathered. Barbed wire and barriers were erected by soldiers around the barracks where the president was said to be working. For the sake of Egypt and for historical accuracy, let's call what is happening by its real name: Military coup, Essam al Haddad, the president's national security adviser, said in a statement on Facebook. 		 			Video: 			From Arab Spring To Summer Protests 		 		 	 Sky's foreign affairs editor Tim Marshall, in Cairo's Tahrir Square where tens of thousands of anti-government have returned, said: The pieces are in place for a coup. The army has put tanks on the outskirts of the city, it's positioned people. I think we are going to get some dramatic developments this evening. Whether it is a bona fide coup, or whether the Muslim Brotherhood are upping the anti to make sure their supporters come down in large numbers ... because if there is a coup, their supporters will react badly to this. Sky's Middle East correspondent Sam Kiley, outside Cairo University where supporters of the president have gathered, added: The military have moved at least have a dozen armoured personnel carriers supported by about two companies of troops, on one side of the university. On the other side there are a number of riot police. At the moment there is a tense standoff between supporters of President Morsi and the military, with his supporters building barricades, but also standing on the military side of the barricades trying to show a level of solidarity. The army said in an official statement that it was securing the area and denied what it said were reports that it was attacking Mr Morsi's supporters, saying: The Egyptian army belongs to all Egyptians. Mr Morsi has refused to step down, saying he will protect his democratic legitimacy with his life. As crisis talks involving military chiefs, political and religious leaders continued, Mr Morsi offered a coalition government as part of a solution to the standoff, but no new compromises. As the army deadline passed, he warned his elected leadership was the only safeguard against violence and instability - and that it was a mistake for the military to take sides . The crisis meetings followed reports in the state-run media that Mr Morsi would either step down or be removed from office when a political road map for the future of the country was drawn up by the military. The Al-Ahram newspaper said the plan would establish a three-member presidential council to be chaired by the head of the Supreme Constitutional Court, although the claims were rejected by an Egyptian military source. In a 45-minute televised address to the nation on Tuesday, Mr Morsi said he had been voted for in a free and fair election and it was his job to safeguard the revolution that put him in office. He called for calm and said Egyptians should not attack the army, police or each other. He said he was attempting to get the army to return to its normal duties and withdraw its ultimatum. The armed forces, which took control of the country after the overthrow of Hosni Mubarak in 2011, have intensified their presence in Egypt's cities in recent days. The Foreign Office has warned against all but essential travel to most of Egypt and said any Britons in the country should consider whether they have a pressing need to remain . The United States said it was very concerned about developments in Egypt and urged President Morsi to do more to address the concerns of protesters. We do remain very concerned about what we are seeing on the ground in Egypt, State Department spokeswoman Jen Psaki said. We feel there was an absence of significant steps laid out by President Morsi, she added.