A tense calm has descended on Egypt after a night of fierce clashes between supporters and opponents of the overthrown president,?Mohamed Morsi. At least 30 people were killed and more than 1,000 wounded in the violence that erupted on Friday and continued through the night. A coalition of conservative groups led by Muslim Brotherhood has vowed further demonstrations on Saturday, raising fears of renewed violence.The coalition is demanding the restoration of Morsi as president. He was deposed three days ago in a military coup. Battle lines remain drawn as anti-Morsi protesters spent the night in Cairo's Tahrir Square, with checkpoints manned by civilians. Pro-Morsi supporters have also vowed to come on to the streets to press their demand. The masses will continue their civilised protests and peaceful sit-ins in Cairo until the military coup is reversed and the legitimate president is restored, the Brotherhood-led coalition said in an early morning statement on Saturday. Meanwhile, a deputy leader of Egypt's Muslim Brotherhood, former presidential candidate Khairat El-Shater, has been arrested. Security sources said on Saturday that Shater, a wealthy businessman seen as the movement's main political strategist, was taken into custody on suspicion of incitement to violence. Mohamed Badie, the top leader of the Muslim Brotherhood, gave a defiant speech on Friday to a crowd of Morsi supporters and vowed to protect Morsi's presidency. God make Morsi victorious and bring him back to the palace, he said in the speech, which was partially aired on state TV. We are his soldiers, we defend him with our lives. A new Islamist group also announced its formation in Egypt, calling the army's ousting of Morsi a declaration of war on its faith and threatening to use violence to impose Islamic law. Ansar al-Sharia in Egypt said it would gather arms and start training its members, in a statement posted on an online forum for fighters in the country's Sinai region on Friday. Violence through the night Friday's clashes were triggered by the death of three Morsi supporters - reportedly killed by gunfire as they tried to march towards the military barracks where Morsi is believed to be held. Morsi supporters blamed the military for the incident, a claim rejected by the army. Rival groups also clashed near Tahrir Square. The overnight fighting finally subsided when the army separated the warring groups using armoured vehicles. We are not taking sides. Our mission is to secure the lives of protesters, military spokesman Colonel Ahmed Ali told AFP news agency. Meanwhile, the US condemned the fighting and urged all sides, including the army, to stop the violence. We condemn the violence that has taken place today in Egypt. We call on all Egyptian leaders to condemn the use of force and to prevent further violence among their supporters, State Department spokeswoman Jen Psaki said in a statement. We expect the military to ensure that the rights of all Egyptians are protected, including the right to peaceful assembly, and we call on all who are protesting to do so peacefully. A spokesman for the UN chief Ban Ki-moon quoted him calling for a peaceful end to the crisis. There is no place for retribution or for the exclusion of any major party or community, Ban reportedly said. Cairo in chaos After nightfall on Friday, a crowd of Morsi supporters marched from Nasr City, a district of Cairo, towards the Maspero state TV building and clashed with anti-Morsi protesters on the 6th October Bridge, which is located?over the Nile River. One man was seen apparently firing a gun, while gunshots could he heard in the area. People were seen throwing rocks as the two sides advanced and retreated in turn on the bridge near Tahrir Square. Four protesters were killed outside the Republican Guard headquarters after breaking away from a pro-Morsi demonstration, the official MENA news agency reported. MENA also said that?12 people were killed in Alexandria. Rioting was also reported in Al Manial district, an island in the Nile River, between Cairo and Giza, according to state TV. Five policemen had been killed in the northern Sinai town of El-Arish, after a soldier was also killed in the region. Egyptian armed forces denied reports that a state of emergency had been declared in the troubled Sinai Peninsula, and that curfews had been imposed.