NaturalNews New images have surfaced depicting what appears to be some of the more heinous radioactive consequences of the 2011 Fukushima Daiichi nuclear disaster. A slide show recently posted by MSN.com reveals deformed tomatoes with bulbous growth defects; cucumbers with unsightly leaves growing out of their flesh; disturbingly misshapen eggplants; peaches with elephantiasis-like outgrowths; unnaturally massive heads of cabbage; and Siamese corn that splits off into two cobs, all the consequences, say some, of Fukushima's ongoing nuclear fallout. The pictures were allegedly first collected by a Korean news outlet from people living within close proximity to the shuttered Fukushima plant. All sorts of fruits, vegetables and other plants are portrayed in the photo album as bearing potentially radiation-induced growth defects, which has stirred concerns about the safety of Japanese produce. Though it cannot be definitively proven that these produce defects are a direct result of the Fukushima disaster, some say they are still a cause for concern. Among the 'mutant vegetables' is a giant tomato apparently bubbling with tumors, a five-fingered turnip, and two peaches which have grown into figures of eight, explains the U.K.'s Daily Mail about the unconfirmed photo set. Two gardeners hold cabbages aloft -- one a normal size, the other at least four times bigger. And in one picture a cucumber seems to have formed into a strange hybrid with leaves erupting from the base. You can view the full photo album here: Since being published, however, the legitimacy of the photo set has been called into question, and MSN.com even issued a correction claiming that the deformed produce was not the result of Fukushima. But the basis for this correction was even more hearsay from an unidentified website in Japan, which declared the images unrelated to Fukushima. As of this writing, there appears to be no definitive proof either way to confirm the source of the disfigured fruits and vegetables. We have seen some evidence of increased mutation rates in plants and barn swallows in Fukushima, but we have not had the funding to do the sort of rigorous science that is necessary to examine such questions in a convincing manner says Timothy Mousseau, a biology professor at the University of South Carolina USC who is currently studying fauna near Fukushima. Meanwhile, some of the highest levels yet detected of radioactive cesium-134, cesium-137, strontium-90 and other nuclear isotopes were recently recorded in and around the Fukushima plant, including in ocean waters. The Tokyo Electric Power Company TEPCO , which operates the plant, has also reported that new steam plumes have been seen rising from the damaged reactor buildings, which is already increasing estimated cleanup costs. The government-backed National Institute of Advanced Industrial Science and Technology said decontamination work in Fukushima prefecture will cost up to 5.81 trillion yen $58 billion , far more than the 1 trillion yen the government has so far allocated, explains a recent Channel News Asia report.