Nuclear Reform Monitoring Committee deputy chairman Barbara Judge, left, talks with Tokyo Electric Power Co. President Naomi Hirose during a press conference at TEPCO headquarters in Tokyo Friday, July 26, 2013. The utility operating Japan's crippled nuclear plant says it delayed acknowledging contaminated water leaks into the sea because it did not want to worry the public until it was certain there was a problem. Hirose told the news conference that the company delayed the announcement even though obvious signs of leaks were detected in May because officials were waiting until they were certain there was a problem. AP Photo/Itsuo Inouye TOKYO AP -- The operator of Japan's crippled nuclear plant said Friday that it delayed acknowledging that the plant was leaking contaminated water into the sea because it did not want to worry the public until it was certain there was a problem. Tokyo Electric Power Co. acknowledged for the first time this week that its Fukushima Dai-ichi plant was leaking contaminated underground water into the ocean, a problem many experts had suspected since shortly after the crisis unfolded more than two years ago. The plant suffered multiple meltdowns after the March 2011 earthquake and tsunami destroyed its power and cooling systems. After a major leak of contaminated water in April of that year, TEPCO said it had contained the problem, and denied there were any further underground leaks into the ocean until Monday. TEPCO has repeatedly been criticized for delayed disclosures of problems and mishaps at the plant, which still runs on makeshift equipment and has been plagued with problems, including recent blackouts and minor water leaks from storage tanks. TEPCO President Naomi Hirose said Friday that the company delayed acknowledging contaminated water was leaking into the sea even though obvious signs of leaks were detected in May because officials were waiting until they were certain there was a problem before making such a major announcement. Hirose apologized for the delay and said that he and TEPCO executive vice president Zengo Aizawa would take a 10 percent salary cut for one month over the matter. Rather than proactively inform the public of potential risks, we retreated to negative thinking and tried to gather more data to ensure there was a problem because it was going to be a major announcement, Hirose said. We've been trying to reform, but we repeated the same mistake. Obviously, our effort is not enough. We are really sorry. TEPCO's quarterly meeting of its reform monitoring committee, which comprises four outside experts, was dominated Friday by discussion of the water leaks. The head of the reform committee, Dale Klein, said he was disappointed and frustrated by TEPCO's handling of the disclosure of the leaks. These actions indicate that you do not know what you're doing, and that you do not have a plan, and you're not doing all you can to protect the environment and people, Klein, former chairman of the U.S. Nuclear Regulatory Commission, said at the meeting. On Thursday, the chief of Japan's national federation of fisheries, Hiroshi Kishi, said TEPCO had betrayed the public by denying the leaks for more than two years and demanded the company take steps to stop the leaks immediately and step up monitoring of radioactivity in seawater near the plant. TEPCO last detected spikes in radiation levels in underground and seawater samples taken at the plant in May. The company says the contamination is limited to just near the plant, but the extent of the contamination is unknown. Most fish and seafood from along the Fukushima coast are barred from domestic markets and exports.