Prince William and Kate have announced the name of their newborn baby. He is to be George Alexander Louis and will be known as His Royal Highness Prince George of Cambridge. The name George had been the bookmakers? favourite for the new prince, who is third in line to the throne. The announcement from Kensington Palace brought to an end much speculation. The guessing game over the name was much shorter than the waiting game for the baby?s birth. Confirmation of the new name came just a day after the Duchess of Cambridge left hospital, and very quickly by royal standards. Six King Georges have worn the crown since George 1 came to the throne in 1714. The last, George VI, was the father of Queen Elizabeth and reigned from 1936 to 1952. Links to the past Alexandra, the female form of Alexander, is one of Queen Elizabeth?s middle names, and was also the name of the queen consort of King Edward VII at the start of the last century. Louis is one of William?s middle names, and was the given name of Prince Charles?s mentor and great-uncle Louis Mountbatten, who was assassinated by the IRA in 1979. The choice of name, which is relatively short by royal standards, does not necessarily mean the baby will eventually become King George VII. The queen?s father was christened Albert, but chose to be crowned as George VI. Safe and ordinary ?It?s interesting that they chose to go with just three names. It?s almost as if the royal family is coming down with ordinary people, who tend to have fewer middle names than monarchs,? historian Suzannah Lipscomb said. ?It is a name that none can find any problems with. George itself can?t be shortened in any obvious offensive way ? They?ve probably gone for something that is safe.? The names appeared to have no direct connection to the mother?s side of the family. ?They?ve kept it very simple by not trying to represent all parts of the family,? said royal historian Tracy Borman. 1 The power of the pen: Cartoonists worldwide react to the Charlie Hebdo attack | euronews, world news 2 euronews live TV - News | euronews : the latest international news as video on demand 3 [LIVE NOW] Massive unity rally in Paris, with similar marches in other French cities | euronews, world news 4 [LIVE] 12 dead after gun attack at French satirical weekly Charlie Hebdo | euronews, world news 5 [LIVE] Confusion over reports two killed in Paris shootout, as police close in on Charlie Hebdo suspects | euronews, world news 6 Medieval Bruges is to get its own underground beer pipeline | euronews, world news 7 NewsWires : euronews : the latest international news as video on demand 8 Muslim groups fear backlash after terrorist attacks in Paris | euronews, news 9 France: Angouleme council takes down anti-homeless cages around benches after outcry | euronews, world news 10 HarperCollins wipes Israel off the map | euronews, world news 11 Almost four million turn out for unity rallies across France | euronews, world news 12 International tv news | euronews: European and International tv news bulletin 13 Grim task of retrieving bodies after wreckage of missing AirAsia plane found | euronews, world news 14 eurovibes - a selection of Europe?s best music talent 15 Ukraine turns its back on its ?worst year since World War II? | euronews, world news 16 Italian pop icon Pino Daniele dies | euronews, world news 17 [Live] Armed Charlie Hebdo attack suspects ?located? near Paris | euronews, world news 18 world Weather | euronews: world ten day weather forecast 20 Pakistan Taliban ?kill over 100? in Peshawar school attack | euronews, world news