July 24, 2013|1:34 pm George Alexander Louis is Prince William and Kate Middleton's new baby son's name, it has been announced on Wednesday afternoon. Kate Middleton gave birth to a royal baby boy late on Monday afternoon, and immediately rumors spread over what the baby boy's name would be. It has now been confirmed that the new royal baby will be titled His Royal Highness Prince George of Cambridge. The news comes the day after hundreds of reporters, photographers and world media representatives gathered outside the hospital entrance where Duchess Catherine gave birth, as they awaited a presentation of the baby from the prince and duchess before they went home. Earlier on Tuesday Prince William's father, Prince Charles, visited the couple and his new grandson in the hospital. He came out after seeing them and said that he was delighted to be a grandfather and that the parents and baby were all doing fantastically. The world's media and royal fans have been trying to guess what name would be given to the new baby, with rumored names topping the list being George, James, Alexander, Henry and Albert. Michael was also another front runner for being one of the middle names ? Kate Middleton's father's name. However, the name can now be confirmed as George Alexander Louis. Duchess Catherine gave birth to a healthy baby boy on Monday at 4:24 PM BST, weighing 8 lbs 16 oz, at the Lindo Wing at St. Mary's Hospital in London. A 41-gun salute was held by The King's Troop Royal Horse Artillery at Green Park in London to mark the birth of The Duke and Duchess of Cambridge's child yesterday. The Honorable Artillery Company also fired a 62-gun salute from Gun Wharf at the Tower of London at the same time. The church bells of Westminster Abbey also rang out for three hours. Meanwhile, the new parents released a statement thanking staff at St. Mary's Hospital. We would like to thank the staff at the Lindo Wing and the whole hospital for the tremendous care the three of us have received. We know it has been a very busy period for the hospital and we would like to thank everyone - staff, patients and visitors - for their understanding during this time. President Obama congratulated the couple, tweeting: So pleased to congratulate The Duke and Duchess of Cambridge on the joyous occasion of the birth of their first child.