Britain's Prince William and his wife Kate have chosen three traditional royal names by calling their new new-born baby boy George Alexander Louis, William's office has said. The baby, born on Monday to global media frenzy and third in line to the British throne, will be known as His Royal Highness Prince George of Cambridge, Kensington Palace said in a statement. All three names had been among the favourites listed by British bookmakers, and the announcement was relatively quick by royal standards; it took a month for the name of Prince Charles, the heir to the throne, to be announced, and a week for William, his eldest son. George has been the name of six British kings. The last, George VI, was the father of Queen Elizabeth and reigned from 1936 to 1952. Alexandra, the female form of Alexander, is one of the queen's middle names, and was also the name of the queen consort of King Edward VII at the start of the last century. Louis is one of William's middle names, and was the given name of Prince Charles's mentor and great-uncle Louis Mountbatten, who was assassinated by Irish nationalist IRA fighters in 1979. The baby's arrival on Monday triggered frenetic coverage from global media who had camped for days on the doorstep of the London hospital where he was born, as well as celebratory gun salutes and the illumination of London landmarks in blue. Keeping it simple The choice of name, relatively short by royal standards, does not necessarily mean the baby will eventually become King George VII. The queen's father was christened Albert, but chose to be crowned as George VI. It's interesting that they chose to go with just three names. It's almost as if the royal family is coming down with ordinary people, who tend to have fewer middle names than monarchs, historian Suzannah Lipscomb, told Sky News. It is a name that none can find any problems with. George itself can't be shortened in any obvious offensive way ... They've probably gone for something that is safe. Some commentators said the names appeared to have no direct connection to Kate's side of the family. They've kept it very simple by not trying to represent all parts of the family, royal historian Tracy Borman told Sky News. I think there seems to be genuine joy, warmth and good feeling about this birth and the duke and duchess are so popular. People will be nothing but pleased.