By Anthony Bond and Rebecca English for the Daily Mail Published: 12:19 EST, 24 July 2013 | Updated: 08:21 EST, 25 July 2013 The Duke and Duchess of Cambridge have named their baby son George Alexander Louis. When he rules this country, perhaps not for half a century or more, he will be King George VII. Until then, he will be known formally as His Royal Highness Prince George of Cambridge. William and Kate came to a relatively quick decision yesterday about the hugely anticipated name. George had long been the favourite, with bookmakers shortening the odds in recent days. Scroll down for videos Heir to the throne: Kensington Palace revealed the baby's full name will be George Alexander Louis While there will be much speculation as to the inspiration behind the names,? palace officials were quick to insist it was simply ?because they liked them ? no more no less?. The Mail understands that William and Kate had already decided by the time they introduced the Queen to her heir ? and third great-grandchild ? at Kensington Palace yesterday morning. There is no royal protocol which dictates the sovereign must be given approval, but it is believed the couple discussed their choice with her during their 30-minute meeting. They then told other members of their immediate family before making the news public at 6.15pm. A statement issued by their office at Kensington Palace said: ?The Duke and Duchess of Cambridge are delighted to announce that they have named their son George Alexander Louis. ?The baby will be known as His Royal Highness Prince George of Cambridge.? It took only two days for the name to be released, compared with seven when William was born in 1982. At around 1pm yesterday the new parents were seen leaving Kensington Palace in a Range Rover with their son. They were on their way to Bucklebury in Berkshire, where they will stay with Kate?s parents. It is likely the Queen will have been thrilled by the choice of name, given that her father was George VI. He was christened Albert and was known to his family as Bertie, but monarchs are allowed to pick a name under which to rule. He chose George in honour of his father, George V, and to create the impression of stability after the scandal caused by the abdication of his brother, Edward VIII. George is also the fourth name of the Prince of Wales. Historian and biographer Robert Lacey said: ?George is obviously a tribute to the Queen?s father and will, I imagine, give Her Majesty great pleasure.? On Tuesday, the BBC?s royal correspondent, Peter Hunt, asked William whether he would name his son George in line with the bookmakers? predictions. The duke laughed and said: ?Wait and see.? Louis, the baby?s third name, is William?s fourth name ? he is William Arthur Philip Louis. It was chosen by Charles as a tribute to his close friend and mentor, Lord Louis Mountbatten, the Duke of Edinburgh?s uncle. He was assassinated by the IRA in August 1979 when his boat was blown up on a fishing trip off the coast of Ireland. The less obvious choice is Alexander, although there are also some royal relatives: Prince Philip?s grandfather was Prince Louis Alexander of Battenberg, for example. The first Prince George of Cambridge, born in 1819, led something of a scandalous life after refusing to have an arranged marriage because he fell in love with a commoner . When he wed actress Sarah Louisa Fairbrother, without the sovereign?s approval, she was already the mother of two of his children and pregnant with his third. By naming their son George Alexander Louis, the Duke and Duchess of Cambridge have picked a name which is synonymous with British kings. The middle name of Alexander will also prove popular in Scotland while Louis has deep significance in the Windsor family following the death of Lord Louis Mountbatten by the IRA in 1979. Here, ANTHONY BOND looks at the significance of the future king's names.