Grandparents, godparents and Queen Elizabeth II were all in attendance to celebrate Prince William and Kate's son on Tuesday From his big debut to his first overseas tour and taking his first steps, it's been a big year for the little prince Prince William and Kate's son marvels at butterflies in a new pair of photos released to mark the young royal's first birthday Not quite a one-year-old, the third-in-line Prince George is already showing his independence with his first steps. Gayle King reports. The best photos from Prince George of Cambridge's first year, in celebration of the future king of England's birthday Vanity Fair put the future king of England and his mom and dad on the cover for the August issue in a story detailing the challenges faced by the first-time parents. Contributor Katie Nicholl comments on how the couple has tried to maintain privacy and a sense of normalcy. The future king of England was on the sidelines of a charity polo match Sunday. He made small steps holding his mother's hand for support while his father, Prince William, and uncle, Prince Harry, played in the match. Gayle King reports. Prince William's wife Kate made her first public appearance since leaving the hospital after the birth of her baby, Prince George. The Duke and Duchess helped kick off a marathon in Wales. CBS News' Alphonso Van Marsh reports from London. The Duchess of Cambridge joined Prince William at the start of a 135-mile ultra marathon in Wales but she did not bring young Prince George. Gayle King reports. London hospital where Duchess Kate is being treated was on the receiving end of a hoax call from a radio station Prince William said in an interview released Monday that he is trying to be an independent parent, putting him and Kate Middleton in sharp contrast with other royal families. The first portraits of Prince George were captured by Kate's father. Mark Phillips reports. Prince William made one of his first public appearances since the birth of his son, Prince George, at an agriculture fair in Anglesey, Wales. The Duke of Cambridge told spectators that his newborn son is pretty loud and, of course, extremely good-looking. CBSNews.com's Ken Lombardi reports. Prince Charles: We'll call the new prince Georgie At an Oyster Festival outside of London, Prince Charles said George is a very good name for his first grandchild, but the family will be calling the baby Georgie. Charlie Rose reports. LEGOLAND Windsor, near London, is celebrating the birth of Prince George in its own unique way. The exhibition is attracting international attention. Royal baby name: Fit for a king? Prince William and the Duchess of Cambridge announced they've chosen the name George Alexander Louis for their son. Six kings have been called George. The newborn is third-in-line for the throne. Norah O'Donnell reports. Prince William and his wife revealed the name of their new son, George Alexander Louis, and people across London are weighing in on the choice. Alphonso Van Marsh is outside Kensington Palace with the latest. The Duke and Duchess of Cambridge departed Kensington Palace with their newborn son, taking him to spend time with Kate's parents in the English village of Bucklebury, west of London. Earlier they received a visit from Queen Elizabeth II. Mark Phillips reports. Britain's Queen Elizabeth II arrived at Kensington Palace on Wednesday to meet her great-grandson, the two-day-old Prince of Cambridge. His name is expected to be the next revelation to be made. CBS News' Mark Phillips reports on what we know so far, how royal parenting has changed since Prince William's birth and what's next for the royal bundle of joy. Prince William and his wife Kate emerged from St. Mary's Hospital in London to introduce the world to their newborn son, the future king of England. Mark Phillips reports. Royal baby: A full first day The world got its first glimpse of the royal baby Tuesday. The excitement grew as Prince William and Kate talked to the crowd as they showed off their newborn. Alphonso Van Marsh is in London with the latest. Prince William carried his newborn son to their car as the Duke and Duchess of Cambridge prepared to leave St. Mary's Hospital in London. The Duke and Duchess of Cambridge emerged from St. Mary's Hospital with their newborn son Tuesday. As the world was awaiting the first glimpse of Britain's new prince, The Queen's Guard played Congratulations during their daily changing of the guard parade at Buckingham Palace. Watch: Royal gun salute in honor of the new prince Royal gun salutes filled the sky in honor of the the new prince at Green Park and Tower Bridge in London. Kate Middleton, The Duchess of Cambridge, gave birth to a healthy 8 lb. and 6 oz. baby boy Monday at St. Mary's Hospital in London. The long-term future of the House of Windsor - a royal line that traces its heritage back more than 1,500 years -- is now in the hands of a prince with common blood. Mark Phillips reports. Watch CBS News anytime, anywhere with the new 24/7 digital news network. Stream CBSN live or on demand for FREE on your TV, computer, tablet, or smartphone.