Russia has still not received an application for asylum from Edward Snowden fueling speculation over his intentions. The NSA leaker is reportedly healthy and has all his necessities provided for in Moscow?s Sheremetyevo Airport. Several days have passed since Snowden?s announcement he would apply for Russian asylum and Moscow says it still has not received a formal request. ?There has been no application from Edward Snowden today,? Konstantin Romadanovsky, director of Russia?s Federal Migration Service told Interfax. ?If an application is received it will be examined under the established legal procedures.? The whistleblower dominated world headlines on Friday when he called an unexpected press conference at Sheremetyevo. Snowden dispelled some of the doubts surrounding his circumstances, but some are arguing that the whistleblower?s intentions are still unclear. Tatyana Lokshina, representative of the Moscow branch of the Human Rights Watch who attended Friday?s conference, said she did not understand Snowden?s motives. ?When a meeting like this is held, you expect some sort of outcome. I would say that nothing happened other than the representatives seeing with their own eyes that Snowden really is alive and well in Sheremetyevo Airport,? Lokshina told Interfax. She stressed that the overall message from Snowden was vague and devoid of any specifics. ?I don?t understand why Snowden invited us. Was he behind it? Was he the instigator of the meeting?? The former CIA employee declared his official status as an ?asylee? on Friday and appealed for help in guaranteeing his safe passage to Latin America. He said he welcomed the offers for asylum made by Bolivia, Venezuela and Nicaragua, adding that he had been made stateless and been ?hounded for his act of political expression.? The US has issued an extradition request for Snowden under espionage charges and accused Russia of granting him a ?propaganda platform.? Russia had previously said that it would be willing to grant Snowden asylum if he refrained from releasing any more information that could be potentially damaging to the US. Lokshina said on Friday that Snowden had no more secrets to disclose and that his ?job was done.? In spite of Snowden?s three-week-long stint in the airport?s transit zone, sources have assured that he is healthy and in good spirits. ?Judging by the fact that he has not approached the airport?s medical team, he feels good and is not complaining,? a source from inside the airport told Interfax, adding that he looked well. ?He can take a shower and get a haircut - with his own money of course,? said the source. The US fugitive arrived in Moscow on June 23 from Hong Kong, where he initially took refuge after releasing the classified information that blew the whistle on the NSA?s mass, covert surveillance program PRISM.