The fugitive NSA leaker Edward Snowden?s widely publicized detention in the transit zone of Moscow?s Sheremetyevo International Airport may well bring to mind Tom Hanks? 2004 film The Terminal, about a man who finds himself trapped at New York?s John F. Kennedy Airport after his passport is rendered invalid by the start of a revolution in Krakozhia, his fictionalized home country.? What are these airport transit zones, and, more importantly, are they legally important to us? As explained in a recent Slate article, transit zones first appeared as a means to resolve an administrative hassle.? Before transit zones were created, a traveler needed a ?transit visa? to pass through a country, even if only for a connecting flight, and even if the traveler never left the airport.? Obtaining and processing these visas was a nuisance.? To solve this problem, countries created transit zones?a space where national tax laws did not apply and, as a result, flyers can buy Rolexes and rum at the duty-free shops.? The reach of these zones quickly expanded.? International laws, as well as the laws in many countries, protect refugees against deportation to countries that would persecute the refugees.? In response, some countries have tried to claim that a refugee who enters only a transit zone has not actually entered the country, and thus has not earned the protections of immigration laws.? These zones are not necessarily limited to airports.? In Paris, for example, the transit zone covers places that are miles from the airport, including a hospital and a court.? Detainees transferred between these locations are deemed to be travelling within ?floating transit zones.? As a practical matter, Russia is using its transit zone as a convenient excuse to detain Snowden.? Russia simultaneously claims that it does not have jurisdiction over Snowden because he has not ?entered? the country, but will not allow Snowden to leave because he lacks the necessary documentation.? However, to maintain this position, Russia has had to ignore its own regulation.? Russia?s embassy website states that travelers who stay more than 24 hours in Russia must obtain a transit visa.? Thus, according to Max Fisher and The Washington Post, Russia must issue Snowden a travel visa or permit him to remain illegally.? Russia claims it has no jurisdiction over Snowden, but Russian officials are detaining him and refusing to let him leave.? At the end of the day, transit zones are legal fictions that countries use to serve whatever end they wish to pursue.