MOSCOW? -? Russian President Vladimir Putin on Monday accused the United States of trapping US intelligence leaker Edward Snowden in Moscow, saying he would leave Russia as soon as possible. As soon as there's the chance to move somewhere he will certainly do this, Putin said in his first public remarks since Snowden summoned several rights activists and lawyers for a dramatic meeting Friday at state-controlled Sheremetyevo airport. Putin accused Washington of preventing Snowden from leaving Russia after the fugitive ex-intelligence analyst arrived from Hong Kong on June 23. He arrived on our territory uninvited, he did not fly to us, he was flying in transit to other countries, Putin said in televised remarks. But as soon as he was in the air, it became known, and our American partners essentially blocked off his further flight. Snowden was checked in for a flight from Moscow to Havana, Cuba on June 24 but never boarded the plane. They themselves scared off all the other countries, no one wants to take him, and therefore they essentially themselves trapped him on our territory, Putin said. A nice gift to us for Christmas, the strongman president was quoted as saying by Russian reporters travelling with him on a visit to the island of Gogland in the Gulf of Finland. Asked what will happen to Snowden, Putin said: How would I know? That's his life, his fate. But he also noted a change in position by Snowden, who said Friday he wanted to apply for asylum in Russia until he can travel on to Latin America. The Russian president conspicuously refrained from indicating if or when he might grant asylum to the world's most famous fugitive. Putin said earlier this month that Snowden could claim asylum in Russia only if he stopped his leaks. The condition initially prompted Snowden to withdraw his application, before the rights activists who met him on Friday said he had promised not to harm US interests in the future. Judging by his latest statement, he is somewhat changing his position, but the situation has not been finally clarified so far, Putin said. Russia's Federal Migration Service said earlier Monday that it had not yet received an application from Snowden. Putin, who is set to host US President Barack Obama for a bilateral summit in Moscow followed by the G20 summit in Saint Petersburg in early September, reiterated Russia's refusal to damage ties with Washington for Snowden's sake. 'We have certain ties with the United States. We do not want you through your activity to damage our ties with the States,' he said he had told Snowden. He said 'no'. You are laughing but I am serious, added Putin, addressing a group of students. He said Snowden had vowed to continue his activism. We said: 'That will be without us, then. We have other battles to fight,' he said with a smile. Snowden, whose passport has been revoked by Washington, has been marooned in the airport's transit zone for the past three weeks. In a sign that Moscow may seriously consider an application from him, the speaker of the lower house of parliament, the State Duma, Sergei Naryshkin, said Friday that Snowden could apply for either temporary asylum or political asylum. Requests for political asylum are reviewed by the Kremlin and granted by the president. Observers have noted that Snowden's Friday meeting did not include some figures likely to upset Putin, such as Russia's best-known rights campaigners or organisations that deal with refugees. But among those invited were figures such as Vyacheslav Nikonov, a lawmaker from ruling party United Russia, who would probably not have been known to Snowden before his arrival in Russia. Washington has reacted sharply to the possibility that Moscow might offer Snowden a safe haven and accused it of providing him a propaganda platform .