Nicolas Maduro of Venezuela and Daniel Ortega of Nicaragua made their offers during separate speeches in their home countries Friday afternoon. Snowden has asked for asylum in numerous countries, including Nicaragua and Venezuela. As head of state, the government of the Bolivarian Republic of Venezuela decided to offer humanitarian asylum to the young American Edward Snowden so that he can live without ... persecution from the empire, Maduro said, referring to the United States. He made the offer during a speech marking the anniversary of Venezuela's independence. It was not immediately clear if there were any conditions to Venezuela's offer. In Nicaragua, Ortega said he was willing to make the same offer if circumstances allow it. Ortega didn't say what the right circumstances would be when he spoke during a speech in Managua. He said the Nicaraguan embassy in Moscow received Snowden's application for asylum and that it is studying the request. We have the sovereign right to help a person who felt remorse after finding out how the United States was using technology to spy on the whole world, and especially its European allies, Ortega said. The offers came following a flap about the rerouting of Bolivian President Evo Morales' plane in Europe earlier this week amid reports that Snowden might have been aboard. Spain on Friday said it had been warned along with other European countries that Snowden, a former US intelligence worker, was aboard the Bolivian presidential plane, an acknowledgement that the manhunt for the fugitive leaker had something to do with the plane's unexpected diversion to Austria. It is unclear whether the United States, which has told its European allies that it wants Snowden back, warned Madrid about the Bolivian president's plane. US officials will not detail their conversations with European countries, except to say that they have stated the US's general position that it wants Snowden back. President Barack Obama has publicly displayed a relaxed attitude toward Snowden's movements, saying last month that he wouldn't be scrambling jets to get a 29-year-old hacker . But the drama surrounding the flight of Morales, whose plane was abruptly rerouted to Vienna after apparently being denied permission to fly over France, suggests that pressure is being applied behind the scenes. He did not identify who they were and declined to say whether he had been in contact with the US But he said that European countries' decisions were based on the tip. France has since sent a letter of apology to the Bolivian government. Meanwhile, secret-spilling website WikiLeaks said that Snowden, who is still believed to be stuck in a Moscow airport's transit area, had put in asylum applications to six new countries. He had already sought asylum from more than 20 countries, many of which turned him down. The Brotherhood?s website quoted Ahmed Mansour as posting: ?This is a token gesture offered to the Jews by [former IAEA chief and Egyptian politician Mohamed] ElBaradei so that he can become President of the Republic in the fake elections that the military will guard and whose results they will falsify in their interests?All with the approval of America, Israel and the Arabs, of course. On July 5, WHO announced that the organization is appointing an Emergency Committee under the International Health Regulations IHR for the Middle East Respiratory Syndrome MERS . This is the first such committee to be appointed since the committee for Swine Flu in April 2009.? The Emergency Committee will meet by telephone on July 9 and, if needed on July?11. The membership will be announced on July 8. After 2009, WHO was criticised for keeping the membership list secret until after the committee had ended its function. ? A PHEIC is defined in the IHR Article 1 as ?an extraordinary event which is determined, as provided in these Regulations: i to constitute a public health risk to other States through the international spread of disease and ii to potentially require a coordinated international response?.? The tasks of the Emergency Committee Article 48 are to advise the Director-General on whether an event constitutes a PHEIC, when this PHEIC is terminated, and proposals for temporary recommendations Article 15 to member states on health measures to ?prevent or reduce the international spread of disease and minimize interference with international traffic? Article 1 , including modification and termination of these recommendations. These measures may concern travel advice, surveillance, clinical management, infection control and other areas.? Member states are expected to follow the recommendations. If member states want to implement additional health measures, they must justify this according to a certain procedure Article 43 .? The main factors in a risk assessment is virulence ?severity? , transmissibility and population immunity. Information may come from studies of the virus, the reservoirs, the population, animal experiments, and epidemiological investigations around cases. Virulence: The MERS-CoV is highly virulent and seems to be causing severe disease or even death in most patients as of today 42 of 79 known patients have died . However, we do not yet know the full clinical spectrum of this disease. There may be several milder cases that remain undiagnosed. Transmissibility: The reservoir of MERS-CoV is unknown and so is the source of infection for most known cases. There have been a few instances of transmission between humans, especially in hospital and family care settings. Probably, the route of transmission between humans is droplet spread and direct contact with body fluids. Still, the transmission seems to be not very effective. Population immunity: It is likely that very few people have protective immunity against this virus. In conclusion, MERS is currently not a great danger to global health. However, the case-fatality risk seems very high, much is still unknown about the virus, and cases are still occurring in the Middle East with occasional leakage to European countries by returning travellers Since the IHR went into force on June 15 2007 there have been several events that fulfil the definition of a PHEIC. Still, only the 2009 swine influenza pandemic has been declared a PHEIC lasting from April 25, 2009 till 10 august, 2010 . This probably means that WHO considers that not all such events need to be declared a PHEIC. The WHO probably will make such a determination only when it sees an actual need now or in the near future.? Secondly, the actual determination in itself may cause worries, influence people?s risk perception and lead to unnecessary measures, such as screening in airports or quarantining travellers. Labelling MERS as a PHEIC may lead to false beliefs in the dangers of this outbreak. And this tendency is worsened by the fact that the only previous PHEIC was the 2009 influenza pandemic. Thus, any declaration of a PHEIC needs to be accompanied by clear risk assessment and risk communication.? ?That would certainly leave many of us speechless,? said one senior diplomat from a NATO country. ?Turkey has every right to choose its own air defense system but we do not quite understand the logic of opting for a Chinese system with no interoperability with the existing [NATO] assets.? A NATO ally defense attach? in Ankara said that deploying a Chinese air defense system to protect Turkish airspace could have political repercussions. ?Questioning Turkey?s geopolitical trajectory would then be legitimate,? he said. Turkey?s defense procurement officials are about to wrap up their assessment on four rival solutions in a multibillion dollar program to build advanced long-range anti-missile and air defense systems, strongly leaning toward the Chinese bid. One defense official said that the government had come to the conclusion that the Chinese proposal was technologically satisfactory, allowed sufficient levels of technology transfer and was much cheaper than rival solutions. He said that the decision to select the Chinese contender was awaiting final approvals from Defense Minister Ismet Yilmaz and Prime Minister Recep Tayyip Erdo?an. Western diplomats warn that Turkey may be deprived of the capability to integrate the Chinese-Turkish system into Turkey?s mostly NATO-owned early warning assets. ?I cannot comment on how the [U.S.] administration would react to that. But I can tell you that integrating a Chinese or Chinese-Turkish air defense system into NATO assets may not be a good idea,? a U.S. diplomat said. Defense sources admit that U.S. officials had warned the ?procurement bureaucracy? several times about the potential difficulties in achieving interoperability if Turkey decided to go for a Chinese or a Russian architecture. ?I see that the Turks remain defiant. But I do not think it would be practically possible to integrate neither the air defense nor the anti-missile components of the planned Turkish-Chinese architecture into NATO radars,? a London-based Turkey specialist said. ?The Turks would have the same problem if they chose the Russian system, but I think for the Americans China represents a more direct threat.? About half of Turkey?s network-based air defense picture radars have been paid for by NATO, according to a defense official. They are part of the NATO Air Defense Ground Environment. ?Turkey can always decide to build a standalone system. But in that case, abstracting the air defense system from NATO assets would mean that Turkey will lose half of its radar capabilities,? said one defense analyst. He said Turkey would need interface data to make its own air defense architecture interoperable with NATO assets, primarily data on the Identify Friend and Foe system. ?This is top secret and cannot be installed into any Chinese system,? the analyst said. Egypt's Islamist-led Shura Council in disarray following Morsi ouster. AA . The 270-member council was elected in February 2012 and included a majority of 115 members loyal to?the Muslim Brotherhood, the group from which Morsi hails. Allies of the Brotherhood garnered an estimated 20 seats in the council. The ultraconservative Salafist Nour Party ? not allied with the Brotherhood ??occupies 48 seats. This puts the total number of Islamist MPs in the Shura Council at around 158 MPs or around 75 per cent of the total. The fate of the Shura Council was further shrouded in mystery when El-Sisi urged it to finish revising a law regulating elections for the House of Representatives the lower house of Egypt's parliament, formerly known as the People's Assembly as soon as possible. The law was drafted by the Shura Council last month and referred back to the HCC for revision. The question now is whether, once the draft law is revised by the HCC, it will be sent back to the Shura Council for ratification, meaning that the council was still endowed with legislative powers. Before Morsi was removed from office on Wednesday, several members of the Shura Council, estimated at 35 and mostly allied to secular forces, tendered their resignations. Ahmed Fahmi, chairman of the Shura Council and leading official of the Muslim Brotherhood's Freedom and Justice Party FJP , has not come to his office since Monday. On that day, he held a closed-door meeting with FJP spokesman Essam El-Erian. Fahmi, however, tried to hold another meeting to discuss the flurry of resignations from the council, but failed to do so because his two deputies ? one from the Nour Party and one from the liberal Wafd Party ? refused to attend. After Morsi was removed from office on Wednesday, the majority of Shura Council members ? particularly those of the Muslim Brotherhood ? did not show up. An informed senior security official in charge of guarding?Shura Council headquarters told Ahram Online that he did not receive any official orders that?Shura Council MPs should be barred?from entering the building. But in spite of this, said the security official, no Muslim Brotherhood deputy has dared to enter the council. He indicated that most Muslim Brotherhood deputies had visited the Shura Council two or three days ago to collect their personal belongings. The security official's interview with Ahram Online came in response to several online statements issued by Muslim Brotherhood activists announcing that Shura Council MPs had decided to meet for an urgent session with the aim of dismissing Defence Minister El-Sisi from office and stressing that Morsi's removal amounted to a military coup. Commenting on this, the security official told Ahram Online that he thought that if Muslim Brotherhood MPs had decided to remove General El-Sisi from office as minister of defence, they would do this not through the Shura Council but rather through meeting inside one of their FJP offices. He pointed out that the Brotherhood's FJP had an office near the Shura Council ? on the nearby Mansour Street ? that they could use for an urgent session. But this would be very difficult because the office is directly in front of interior ministry headquarters and near Tahrir Square, where anti-Morsi rallies were being held. Meanwhile, El-Sisi's statement on Wednesday left constitutional experts divided over the fate of the Shura Council. A constitutional law professor with the Shura Council, who asked not to be identified, told Ahram Online that as there was not clear word about whether or not it would be dissolved, the Shura Council will remain in effect. He said: I think the final word on the issue will be settled when the judge presiding over the High Constitutional Court, who is now himself acting as interim president, issues a constitutional declaration determining, among other things, whether the Shura Council should be dissolved or not. Most constitutional law professors, however, agree that, as long as the constitution, promulgated last December, was suspended, the Shura Council should automatically be dissolved. Rafaat Fouda, a Cairo University constitutional law professor, stressed that, the HCC last month ordered that the Shura Council be dissolved because the laws governing the election of its members violated the constitution. He added: It's true that the HCC also said that the Shura Council should stay, but only until the election of a new House of Representatives. Fouda went on: Now, after the 30 June Revolution, the equation has completely changed. No one in Egypt will allow parliament, heavily dominated by Muslim Brotherhood, will be entrusted with drafting laws until a House of Representatives is elected. Fouda also argued that apart from the fact that it was ruled unconstitutional by the HCC last month, the resignation of most secular deputies, along with the arrest of several Muslim Brotherhood deputies, now makes it quite difficult for the Shura Council to convene again. ?There is absolutely no guarantee that this virus will stay as it is. It could very well follow the same path as SARS did 10 years ago,? Dr. Arnaud Fontanet, who heads the emerging diseases epidemiology unit at the Institut Pasteur in Paris, said in an interview.? ?The virus has shown a potential for human-to-human transmission. And whether such transmission is sustained depends on the intensity of control measures as well as the characteristics of the people involved in transmission,? said Marc Lipsitch, an infectious diseases specialist who teaches at Harvard University.? The study, published in the journal The Lancet, analyzes what is known about how often people who have been infected with the MERS virus spread it to one or more other people. The authors used the data to calculate what is called the basic reproduction number, known in the parlance of infectious diseases as the R nought.? In order for a disease to achieved sustained spread, the average infected person must spread a bacterium or virus to at least one other person. That is an R nought of one. A pathogen with a basic reproduction number of less than one would peter out.? The measles virus, which is very contagious, has a basic reproductive number of between 12 and 18, meaning that among people who are susceptible to the virus, each infected person would be expected to pass the virus to between a dozen and 18 other people. In a 2003 study in the journal Science, Lipsitch and colleagues estimated the R nought of SARS to be three.? There are many holes in the available data. For instance, Saudi Arabia, which is responsible for 63 of the 77 confirmed MERS cases, often does not disclose if new infections have links to previous ones ? which might mean they caught the virus from another person ? or are what are called sporadic cases, people thought to have been infected by an animal or exposure to the virus in the environment.? The authors tried to work around the gaps by calculating best- and worst-case scenarios. Both, it turns out, came up with a reproductive number of less than one, which suggests the virus doesn?t yet have pandemic potential, they said. Those rates were 0.60 and 0.69 respectively.? Plans to abandon the agreements must be approved by EU governments and the bloc?s executive Commission. While their approval looks highly unlikely, the vote served to prove the simmering anger which exists within the assembly, caused by recent NSA leaks. Saudi Arabia and the UAE threw their weight and purses behind Egypt?s generals aiming to put their first big spoke in the US-sponsored Arab Revolt or Spring , after they failed to hold the tide back in Libya, Egypt and thus far Syria. To learn the name of the Egyptian politician designated to lead his country when the army bows out, read the coming issue of DEBKA Weekly due out Friday. 1. Should the Obama administration cut off the annual US aid allocation of $1.3 billion, Saudi Arabia and the UAE would make up the military budget?s shortfall; 2. The Saudis, UAE and other Gulf nations, such as Bahrain and Kuwait, would immediately start pumping out substantial funds to keep the Egyptian economy running. The Egyptian masses would be shown that in a properly managed economy, they could be guaranteed a minimal standard of living and need not go hungry as many did under Muslim Brotherhood rule. According to our sources, the Saudis and the UAE pledged to match the funds Qatar transferred to the Muslim Brotherhood?s coffers in Cairo in the past year, amounting to the vast sum of $13 billion. This explains President Barack Obama?s caution Thursday morning, July 4, in his expression of deep concern over the ousting of the Egyptian president and the suspension of its constitution. He urged the military to restore government to civilian hands - without accusing them outright of a coup d?etat - and to ?avoid arresting President Moris and his supporters.? Thursday morning, Washington ordered US diplomats and their families to leave Cairo at once, leaving just a skeleton staff at the embassy for emergencies. DEBKAfile: This step is only one symptom of the broad gulf developing between the Obama administration and Egypt?s post-coup administration headed by Defense Minister and coup leader Gen. El-Sisi By means of the successful military putsch in Cairo, Saudi King Abdullah had his revenge for the toppling of his friend Hosni Mubarak in February 2011, for which he has never forgiven President Obama whom he held responsible. The Saudi-Gulf intervention in Egypt?s change of government also ushers in a new stage of the Arab Revolt for the Middle East. For the first time, a group of traditionally pro-US conservative Arab governments has struck out on its own to fill the leadership vacuum left by the Obama administration?s unwillingness to pursue direct initiatives in the savage Syrian civil war or forcibly preempt Iran?s drive for a nuclear bomb. The removal of Muslim Brotherhood rule in Egypt has far-reaching ramifications for Israel. In the immediate term, it gives Israel some security relief ? especially, easing the dangers posed from Sinai to its southern regions.