Paul Lynde, noted comedian and actor on the cult hit ?Bewitched?, was once quoted as saying, ?I wish I had the nerve not to tip.? It?s an interesting quote that goes right to the heart of tipping etiquette. When you go out to eat a tip is almost expected for the hard working waiter or waitress at your favorite restaurant. To not tip them frankly takes a lot of balls or just a complete lack of class. Since the George Zimmerman verdict, a new trend of non-tipping has started. ?No Justice, no tip.? Basically waiters and waitresses are beginning to be punished by people for simply working at a restaurant that is located in the country that acquitted George Zimmerman. I thought this movement was all about ?justice? and ?fairness.? How does taking income from a person who makes $2.50 an hour fair or just? Over the past decade those on the front lines of the hospitality business have been forced to endure political anger aimed at them. In another instance that became a sort of fad for a little while was people practicing a ?redistribution plan? of their own. This plan was simply not to tip and to tell the waitress they are redistributing income. I bring this up to show that it?s not just liberals, but Republicans, practicing this classless political protest as well. I understand better than anyone the anger and frustration at the political goings on in America, however, to force another American to suffer because of something that they have nothing to do with is the essence of incivility and mob mentality. Aristotle said, ?All persons ought to endeavor to follow what is right, and not what is established.? You see, in America we have established political lines in the last decade that I personally believe will never go away. We have become more divided politically, spiritually, racially and ethnically than ever before. A large part of this is because we have allowed these things to bleed into everything else in our lives. I am guilty of this myself, although I have never attacked a person verbally or physically in public for a shirt they have on or refused to leave a tip because Barack Obama thinks others are entitled to my money. I do tend to choose the places I shop and the movies I see based on the political agenda of those who create or run them. It is something that I have endeavored to change about myself. I will be the first to tell you that Jamie Foxx is a ridiculous libt-dolt who rarely furthers any debate, however, his movies are pretty funny and I have a good time watching them. With the acquittal of George Zimmerman continuing to reverberate nationwide, Attorney General Eric H. Holder Jr. said Monday he shares concerns about ?the tragic, unnecessary shooting death? of an unarmed black teenager in Florida last year, and he vowed to pursue a federal investigation into the matter. In a speech at the social action luncheon of the Delta Sigma Theta sorority, Holder pledged that the Justice Department would ?continue to act in a manner that is consistent with the facts and the law? and would work to ?alleviate tensions, address community concerns and promote healing? in response to the case. After interviewing nearly three dozen people in the George Zimmerman murder case, the FBI found no evidence that racial bias was a motivating factor in the shooting of Trayvon Martin, records released Thursday show. Even the lead detective in the case, Sanford Det. Chris Serino, told agents that he thought Zimmerman profiled Trayvon because of his attire and the circumstances ? but not his race. The Duval County State Attorney released another collection of evidence in the Zimmerman murder case Thursday, including reports from FBI agents who investigated whether any racial bias was involved in Trayvon?s Feb. 26 killing. The evidence includes bank surveillance videos from the day of the killing, crime scene photos and memos from prosecutors. Among the documents is a note from the prosecutor who said one of the witnesses said her son, a minor, had felt pressured by investigators to say the injured man he saw was wearing a red top. The boy?s testimony had been considered key, because it backed up Zimmerman?s allegation that he ? wearing red ? was being pummeled. Federal agents interviewed Zimmerman?s neighbors and co-workers, but none said Zimmerman had expressed racial animus at any time prior to the Feb. 26 shooting of Martin, a black teen, in a confrontation at a Sanford housing complex. As Sanford police investigated the circumstances of Martin?s death, the FBI opened a parallel probe to determine if Martin?s civil rights had been violated. Two co-workers told agents they spoke with Zimmerman the day after the shooting, and both said they noticed injuries to Zimmerman?s nose and the back of his head. One person said Zimmerman was ?absolutely devastated.? Zimmerman told both colleagues that he followed Martin ? whom Zimmerman described as a ?suspicious person? ? so he could tell police where the teen went, but was then ?jumped? by Martin. Zimmerman told both that Martin reached for Zimmerman?s gun before Zimmerman shot Martin. In all, the FBI interviewed 35 people about Zimmerman, from current and former co-workers to neighbors and an ex-girlfriend. Demonstrations, from Florida where the trial took place to Atlanta, DC and New York, remained largely peaceful, though Los Angeles protesters managed to shut down an entire freeway and thousands of New Yorkers mobbed Times Square and blocked traffic for an hour. Emotional crowds screamed 'Justice for Trayvon' and carried signs that likened the struggle of the slain teen and his supporters to that of the original civil rights movement. Fever pitch: Activists demand justice for Trayvon Martin after marching to Times Square from New York's Union Square July 14. The march continued uptown toward Harlem as tensions mounted and arrests began Massive protest: In Times Square on Sunday, thousands rally in response to the acquittal of George Zimmerman in the Trayvon Martin trial Solidarity: Protestors chanted 'Justice for Trayvon' into the night at rallies across America, including a gathering of thousands in New York City's Times Square on Sunday night Sonia Medina, of Suwanee, Ga., holds a sign while joining a protest the day after George Zimmerman was found not guilty in the 2012 shooting death of teenager Trayvon Martin, Sunday, July 14, 2013, in Atlanta. AP Photo/David Goldman 'Justice for Trayvon': Protestors of all races and backgrounds swarmed Times Square, angry at the George Zimmerman acquittal. 'Justice for Trayvon' was the night's call to arms Enough protestors had gathered on foot in Los Angeles to shut down the city's 10 freeway. With cars backed up in their wake, the mob chanted their rallying cry: 'Who's streets? Our street, our freeway.' Elsewhere in Los Angeles, protestors have had confrontations with police, according to NBC4, which reports that LAPD has fired rubber bullets into the crowd. As the night began to wear on in the City of Angels, protests became more serious. If it hasn't been proven, it's just not there, O'Mara said. You can't fill in the gaps. You can't connect the dots. You're not allowed to. As the court proceedings wind down and come to a close I think there are a few things that need to be said before the jury brings back a verdict. Although I am an ardent supporter of George Zimmerman and those who choose to protect themselves from the criminal element, I also am a human being and I understand that anytime there is loss of life it is a tragedy. This doesn?t make George Zimmerman a murderer, but this is why no matter what everyone loses. If Zimmerman is convicted, an innocent man will spend the rest of his life in jail for no reason. His parents will have lost their child to the criminal justice system and it will be yet another family irreversibly damaged by this tragic event. If the jury convicts Zimmerman it will not bring Tracy Martin?s son back nor will it assuage the guilt and constant wondering of, ?What could I have done?? If Zimmerman is acquitted, as he should be, the Martin?s will be left without their son and George Zimmerman will never live a day without looking over his shoulder. I think that it will be many years before anyone in the Zimmerman family will be able to feel safe. As Twitter erupts with violent threats against Zimmerman, his family and White people in general I think we are learning a lot about ourselves as a nation. Part of what we are learning is how America won?t be a winner in this either. Regardless of the outcome, I think we can all plainly see that we haven?t ?come so far? with racism in America. In fact, I would wager that we are almost as divided now as we were in 1964. I mean just look around. You have random Black teenagers and young adults threatening random violence on innocent White people because a Hispanic guy shot a Black guy in self-defense. The key here is that underneath everything is this insidious thought process that, ?Whitie is conspiring against us.? In a recent poll, thirty-seven percent of American Adults said they feel that Blacks are the most racist demographic in the country. Compare that to less than half, fifteen percent, that believe Whites are more racist. Ironically Blacks agree that they are the most racist. In reality, most people didn?t approach this with an open mind. They saw George Zimmerman, who originally was reported to be White, then a White Hispanic and now the media begrudgingly say he identifies himself as a Hispanic and they saw Trayvon Martin, a seventeen-year-old ?angel?, who was murdered.