Fukushima is here, it is no longer a Japanese problem ~ it is a growing world problem which is still being ignored. Here's an update on my report of May 14,2013 where I demonstrated that a creeping and never ending deadly fog of radiation, invisible to the eye but not to the immune system, continues to blanket the West Coast while its human cost is barely being mentioned ~ mainly due to a worldwide media blackout : Allen L Roland The Fukushima Genie that was released over two years ago is still spouting and leaking forth deadly radiation while silence remains supreme among the worldwide media. According to Natural News reporter Ethan Huff, the lack of reliable information ~ at least in Japan ~ may be less the fault of government than mainstream media: New data released by Japan's Ministry of Health, Labor and Welfare MHLW shows once again that the Fukushima Daiichi nuclear disaster is far from over. Despite a complete media blackout on the current situation, levels of Cesium-137 Cs-137 and Cesium-134 Cs-134 found in produce and rice crackers located roughly 225 miles ~ 362 km away from Fukushima are high enough to cause residents to exceed the annual radiation exposure limit in just a few months, or even weeks. ?? ?18,000 Becquerel's per liter -- TEPCO measurement of? Cesium-137 on July 8. ??? 900,000 Becquerel's per liter ? TEPCO?s measurement of the total radioactivity in the water leaking from Reactor #1.? This radiation load includes both Cesium isotopes, as well as Tritium, Strontium and other beta emitters.? There are more than 60 radioactive substances that have been identified at the Fukushima site. ? Here?s another Becquerel perspective on the same situation:? A Becquerel is a standard scientific measure of radioactivity, similar in some ways to a rad or a rem or a roentgen or a sievert or a curie, but not equivalent to any of them.? But you don?t have to understand the nuances of nuclear physics to get a reasonable idea of what?s going on in Fukushima .? Just keep the measure of that safe drinking water in mind, that liter of water, approximately a quart, with 10 Becquerel's of radioactivity.? ? ?60 Becquerel's per liter -- For nuclear power plants, the safety limit for drinking water is 60 Becquerel's, as set by the NRA, with less concern for nuclear plant workers than ordinary civilians. ? ?? 60-90 Becquerel's per liter -- For waste water at nuclear power plants, the NRA sets a maximum standard of 90 Becquerel's per liter for Cesium-137 and 60 Becquerel's per liter of Cesium-134. Meanwhile, TEPCO is secretive, severely limiting access to the complex by journalists and by any experts who are not beholden to the nuclear industry.? TEPCO has also been accused of doctoring photos and videos to hide cracks in the aging concrete buildings and containment tanks. The workers are overexposed to radiation, underpaid, and must be rotated out after a few months, to be replaced by others with little experience of the facility. In March 2013, researchers from the Stanford University Hopkins Marine Station issued a report on Bluefin tuna caught off the California coast and tested for radioactive cesium. The report found that Bluefin tuna were 100 per cent contaminated, that not one was cesium-free. The report did not address such questions as whether cesium would continue to accumulate in tuna or whether it was appearing in other fish species. The important aspect of this research, according to the Stanford News, was that: ?The work supports the idea that the Fukushima radioisotopes can be used to reliably determine the previously unknown trans-oceanic movements of juvenile Pacific Bluefin tuna. This information could be used to prevent tuna from being overfished.? Reporting on the same radiation leaking information, the Two Rivers Tribune in northern California noted: ?On the coast of California, there is a deep sea kelp forest at Corona del Mar that now contains concentrations of radiation that are 250 times higher than levels found in kelp prior to the Japanese nuclear accidents. A research article published in Scientific American reports that radiation accumulated in fish that ate near the kelp?. Presently, there is no research as to what is the exact effect on fish and their offspring will be from the increased levels of radiation that are being found?. ?The Japanese government has banned both the domestic sale and international export of most fish that are caught off the Fukushima coast. Radiation levels are still rising two years after the nuclear accidents. In January of 2013 the tested levels of cesium were about 2,540 times what is considered safe for human consumption. Strontium levels are 240 times the legal limit.?