...experiments... Ahmad Farhan...: Juli 2013 ...experiments... Ahmad Farhan... ...Various Latest Info...: ...Enjoy in My Blogger...: Fish Jumat, 26 Juli 2013 News On Japan INSIDE JAPAN Grandma on feeding tube without consent symbolizes Japan A quarter of a million bedbound elderly people are kept alive in Japan, often for years, by a feeding tube surgically inserted into their stomach. A few months ago, my 96-year-old grandmother became one of them. Bloomberg Suspect arrested over murder of 5 in Yamaguchi Police in Shunan, Yamaguchi Prefecture, on Friday morning arrested a 63-year-old man who had been wanted in connection with the murders of five of his neighbors in the mountain hamlet last Sunday night. Japan Today China coastguard in disputed waters for first time: Japan Chinese coastguard ships entered the territorial waters of Japanese-controlled islands at the centre of a bitter row, Japan's coastguard said on Friday, the first such incursion by the organisation. Economic Times Small plane crashes into house owned by Japanese in US Midwest, injuring 2 A small plane crashed into a U.S. house and ignited a fire Thursday, injuring two men on board the plane but leaving a Japanese woman inside the home unscathed, authorities said. montrealgazette.com Japan's women live longest, reclaiming longevity title from Hong Kongers Japan's women retook their place as the world's longest-lived last year, edging out Hong Kongers as their life expectancy bounced back from the dip caused by the 2011 tsunami. news.com.au 1,000-Yen trial fee begins for Mt. Fuji climbers A 10-day trial scheme to collect a 1,000-yen entrance fee from those climbing Mount Fuji, Japan's highest mountain, was introduced on Thursday. Jiji Press Child abuse cases in Japan jump 11.5 pct in FY 2012 The number of child abuse cases detected by 207 child counseling centers in Japan in fiscal 2012 that ended in March jumped 11.5 pct from the previous year to 66,807, a Health, Labor and Welfare Ministry survey showed Thursday. Jiji Press SOCIETY Jul 26 Truck rear-ends car, killing man, 2 children A man and his two children died Friday when the car they were traveling in was rear-ended by a 10-ton truck on the Isewangan Expressway in Aichi Prefecture. Japan Today Jul 26 Tenjin Festival climaxes in Osaka An annual summer festival has climaxed in Osaka City with a grand boat procession and display of fireworks. NHK Jul 25 Ex-Japan policeman freed after murder charges dropped A former police officer in central Japan was released from jail Thursday, a day after public prosecutors dropped murder and arson charges against him due to insufficient evidence. Jiji Press Jul 25 Speed member Takako Uehara wins suit against tabloid The Tokyo District Court on Wednesday ruled in favor of actress and singer Takako Uehara, 30, in a lawsuit for libel filed against publisher Bungeishunju. Tokyo Reporter [ More... ] BUSINESS Jul 26 Japan Post Group to strengthen ties with Aflac Japan Post Group and US life insurer Aflac have agreed to expand the scope of their tie-up on cancer insurance. NHK Jul 26 SoftBank CEO Son loses temper, clashes with Japanese bureaucrats Months of cool-headed calculations won Japanese Internet billionaire Masayoshi Son a takeover battle for No.3 U.S. carrier Sprint Nextel Corp. But the emotional tycoon showed a glimpse of his fiery temper during a run-in with Japan's bureaucrats. Wall Street Journal Jul 25 Meiji to raise milk prices by 1%-4% Meiji Co. has said it will raise the shipment prices of 16 milk products by about 1 percent to 4 percent on Oct. 1. Yomiuri Jul 25 Toyota, Ford end hybrid partnership Toyota Motor Corp. and Ford Motor Co. have ended a partnership to jointly develop gas-electric hybrid systems for trucks and sport utility vehicles, the automakers said Tuesday. Japan Times Jul 24 Popular Kiri brand cheese recalled in Japan About 60,000 boxes of Kiri cheese have been recalled in Japan after metal fragments were found in the popular brand, its importer said Wednesday. Global Post [ More... ] ECONOMY Jul 26 Consumer prices rise at fastest pace since 2008: ministry data Consumer prices in June rose the most since 2008, 0.4 percent from a year earlier, an early sign that Japan's economy may be starting to shake off deflation, the Internal Affairs and Communications Ministry said Friday. Japan Times Jul 26 Is the Japanese foreign bond binge finally under way? Japanese investors snapped up foreign bonds for a third straight week last week and analysts say that the long-awaited trend may be finally under way, signaling the next leg lower for the yen. cnbc.com Jul 26 Japan central bank finds the pessimists come from within Some Bank of Japan policymakers are becoming more vocal in expressing concerns about the economic outlook, threatening to pick away at what has been a unified public position of optimism key to the central bank's reflationary message. Reuters Jul 25 TPP trade talks in Malaysia end after Japan's debut The 18th round of the Trans-Pacific Partnership trade negotiations ended Thursday, after welcoming Japan as the 12th member and with the group reiterating the goal of concluding a deal by year-end. Kyodo Jul 25 Japan export slowdown raises concern on China's economy Japan's export growth unexpectedly eased in June from a year earlier in a worrying sign that China's slowing economy is hurting overseas demand and could potentially undermine Tokyo's efforts to revive the world's third-biggest economy. Reuters [ More... ] STOCK MARKET Jul 26 Nikkei ends 2.97 pct lower on stronger yen Tokyo stocks tumbled nearly 3 percent Friday, weighed down by the yen's climb against the U.S. dollar. The 225-issue Nikkei Stock Average closed down 432.95 points, or 2.97 percent, from Thursday at 14,129.98. china.org.cn Jul 25 Tokyo stocks close down 1.14% TOKYO stocks have closed 1.14 per cent lower as a stronger yen helped erase early gains stoked by strong data on US new home sales. news.com.au Jul 25 Japan Post to move up listing to Spring 2015 Japan Post Holdings Co. intends to move up its stock listing to spring 2015, about half year earlier than previously planned, President Taizo Nishimuro said in an interview Wednesday. Jiji Press Jul 24 Tokyo stocks end 0.32% lower Tokyo shares have closed 0.32 per cent lower after US stocks ended mixed in a market that traders said looked overheated. Daily Telegraph Jul 23 Tokyo stocks close 0.82pc higher Japanese shares ended 0.82 percent higher on Tuesday, with sentiment lifted by Tokyo's upgrade of the economy in which it used the world recovery for the first time in almost a year. brecorder.com [ More... ] POLITICS Jul 25 Japan welcomes Caroline Kennedy's nomination as envoy Japan Thursday welcomed U.S. President Barack Obama's nomination of Caroline Kennedy as the next ambassador to the country. Jiji Press Jul 25 President Obama nominates Caroline Kennedy to become ambassador to Japan President Obama on Wednesday afternoon announced he was nominating Caroline Kennedy as the US ambassador to Japan, an appointment that would catapult the only surviving child of slain President John F. Kennedy to a dynamic diplomatic post. boston.com Jul 25 Abe begins 3-nation tour to deepen ties with ASEAN Prime Minister Shinzo Abe embarked Thursday on his third trip to Southeast Asia since retaking the premiership late last year, aiming to deepen economic and security ties with the Association of Southeast Asian Nations through visits to Malaysia, Singapore and the Philippines. Kyodo Jul 25 Fukushima announces resignation as SDP head Social Democratic Party leader Mizuho Fukushima said Thursday she will step down from the top party post to take responsibility for the SDP's poor showing in Sunday's House of Councillors election. Jiji Press Jul 25 Kaieda 'asked Kan to leave' defeated DPJ Amid turmoil erupting within the Democratic Party of Japan due to its massive defeat in Sunday's House of Councillors election, DPJ President Banri Kaieda is believed to have urged former Prime Minister Naoto Kan to quit the party Wednesday, describing Kan's support for an independent candidate in the recent race as a rebellion against the DPJ. Yomiuri [ More... ] EDUCATION Jul 24 Antics of 3 students at Universal Studios Japan result in charges Police in Osaka said Tuesday that Universal Studios Japan has filed charges against three university students for allegedly interfering with the operation of the park, following a series of high-spirited stunts last year. Japan Today Jul 24 Princess Kako to have homestay in Massachusetts Princess Kako, 18, the daughter of Prince Akishino, the emperor's second son, and Princess Kiko, will have a homestay for a month in Massachusetts next month, the government said Tuesday. Japan Today Jul 23 34 students suffer food poisoning in Fukuoka Police and health officials said Tuesday that 34 junior high and high school students suffered food poisoning Monday during a stay at a hotel in Fukuoka. Japan Today Jul 22 10 surprising things about parenting in Japan For our Motherhood Around the World series, our second interview features photographer Yoko Inoue, who moved from Brooklyn to the Japanese countryside with her husband and son. Here are 10 things that have surprised her about being a mom in Japan... A Cup of Jo Jul 15 Japan's Koji Suzuki wins U.S. suspense thriller novel award A novel by Japan's Koji Suzuki won the Shirley Jackson Award for 2012, given to writings in the fields of psychological suspense, horror and dark fantasy. Kyodo [ More... ] SCIENCE & TECHNOLOGY Jul 24 Kanebo cosmetics users advised to visit hospitals An association of Japanese dermatologists is calling on users of the skin-whitening products made by Kanebo to visit hospitals for examinations. NHK Jul 24 Japan's tsunami debris litters Canadian shore Two years after the tsunami which devastated parts of Japan's coast nearly 400,000 tons of debris is still drifting across the Pacific Ocean. Aljazeera Jul 23 Fukushima reactor site engulfed by steam Workers at the crippled Fukushima nuclear plant in Japan have reported steam inside a battered reactor building for the second time in less than a week. news.com.au Jul 23 Operator of crippled Japan nuke plant says likely that radioactive water leaking into sea A Japanese utility said Monday its crippled Fukushima nuclear plant is likely leaking contaminated water into sea, acknowledging for the first time a problem long suspected by experts. washingtonpost.com Jul 21 Neutrino change confirmed in Japan A team of Japanese and foreign researchers has confirmed the existence of a previously undetected type of neutrino oscillation, a discovery that has eluded scientific investigators. Yomiuri [ More... ] ELECTRONICS Jul 25 4 mil. IDs stolen from major provider in Japan A major Japanese Internet service provider says 4 million sets of members' IDs and passwords have been stolen. NHK Jul 25 Sony head-mounted monitor to hit market Sony Corp. has said it will release head-mounted equipment that enables doctors to watch high-resolution three-dimensional images inside the bodies of patients during endoscopic surgeries. Yomiuri Jul 23 Bizarre merchandising, tabletop Nintendo and new releases for Wii U Gangsters. Hostesses. And lots and lots of street fighting. No, this isn't a night in Shinjuku's Kabukicho red-light district. It's an evening with Yakuza, Sega's crime opus on the Wii U. Japan Times Jul 18 NEC and the sorrow of Japan Sadly enough, NEC's share price rose 2.6% on the news that it is going to shutter its mobile phone unit. It's a tragic epitaph for what was once a genuinely exciting brand. It's also a sad reminder of the profound failure of Japan's technology industry. Yahoo! News Jul 17 Japanese adults spend crazy money on cellphone games Over the last decade, people's behavior during their daily train ride has completely changed. In the past, Japanese were known to be avid readers of paperbacks bunko and manga magazines, and would do so even on Tokyo's notoriously crowded trains. Now, however, it is rare to spot someone on the train who is not staring into their cellphone. Japan Times [ More... ] TRAVEL Jul 26 Tenjin Festival climaxes in Osaka An annual summer festival has climaxed in Osaka City with a grand boat procession and display of fireworks. NHK Jul 25 1,000-Yen trial fee begins for Mt. Fuji climbers A 10-day trial scheme to collect a 1,000-yen entrance fee from those climbing Mount Fuji, Japan's highest mountain, was introduced on Thursday. Jiji Press Jul 25 Visitors to Japan hit record high in Jan.-June The number of foreign visitors to Japan in January-June rose 22.8 pct from a year before to an estimated 4,954,600, hitting a record high for the first-half period, the Japan National Tourism Organization said Wednesday. Jiji Press Jul 25 Flower-decorated floats parade in Kyoto Floats adorned with flowers and textiles along with women donning flower-decorated hats paraded through Japan's ancient capital of Kyoto on Wednesday. NHK Jul 25 Yokohama offers tourists free internet service Yokohama City is offering free internet access to foreign visitors. The new service is available via a password obtained at tourist information offices in the city. Visitors can enjoy free internet for 2 weeks at 500 venues, including restaurants and tourism facilities. NHK [ More... ] DOCUMENTARY & MOVIE Jul 26 'Barefoot Gen' marks 40th birthday Hadashi no Gen Barefoot Gen , a manga series by the late Keiji Nakazawa, marks the 40th anniversary of its publication this year, reminding both child and adult readers alike of the horrors of nuclear warfare. Japan Times Jul 24 Leopard print Lamborghinis and diabolical Diablos: Inside the fast and furious world of Japan's Yakuza mafia He is a self-professed associate of Japan's notorious Yakuza who admits that his business interests are somewhat dubious. Daily Mail Jul 06 The Wolverine sharpens claws to take on Japanese culture Hollywood has a somewhat chequered history when it comes to depictions of Japan and Japanese culture. From the thoroughly reprehensible Bond excursion You Only Live Twice, to the twin monstrosities that were 1989's Black Rain and 1993's Rising Sun Sean Connery really should have known better by this point , film-makers have rarely strayed far beyond cliche and stereotype when depicting life on the archipelago. guardian.co.uk Jun 26 Japan lost the war to United States because of oil Today everyone understands the role of oil in the society. Oil was the main goal, and often, the main weapon in the wars of the twentieth century, especially during the Second World War. Pravda Jun 24 Hayao Miyazaki completes new animation film Animation film director Hayao Miyazaki has completed his first new movie in five years. NHK [ More... ] SPORTS Jul 26 Soccer: Australia goes down 2-3 in thriller against Japan Australia's hopes of winning the East Asian Cup on its debut appearance crashed in extraordinary fashion after they came from 2-0 down to level against Japan late in the game before shipping a third goal to lose 3-2 in a thrilling encounter in Hwaseong. The Age Jul 24 Man United humbled in Japan Manchester United stumbled to a 3-2 defeat against Japan's Yokohama Marinos Tuesday in their second loss in three games under new manager David Moyes. supersport.com Jul 23 Man-U footballers meet Fukushima evacuees A group of young Fukushima evacuees got to meet some of their sporting heroes on Monday. NHK Jul 22 Hakuho clinches 26th sumo tournament title Yokozuna Grand Champion Hakuho has finished the Nagoya Grand Sumo Tournament, clinching his 26th title with 13 wins and 2 losses. NHK Jul 17 Sumo: Hakuho posts second 40-match win streak Yokozuna Hakuho compiled the second 40-bout winning streak of his career on Tuesday, when he defeated sekiwake Myogiryu on the 10th day of the Nagoya Grand Sumo Tournament at Aichi Prefectural Gymnasium. Japan Times ?http://www.newsonjapan.com/ Diposkan oleh Ahmad Farhan di 22.33 Kirimkan Ini lewat Email BlogThis! Berbagi ke Twitter Berbagi ke Facebook Bagikan ke Pinterest Posting Lebih Baru Posting Lama Beranda Langganan: Entri Atom Loading... Total Tayangan Laman Lencana Facebook Ahmad Farhan Afs Buat Lencana Anda Feedjit Plurk.com Formulir Kontak Nama Email * Pesan * SHINee ???_Everybody_Music Video Shinee- Replay MV SHINee ??? _ RingDingDong ??? _ MusicVideo GIRLS`GENERATION ????_My oh My_Music Video Girls' Generation - GALAXY SUPERNOVA Music Video Full Ver GIRLS`GENERATION ????_LOVE & GIRLS_Music Video Girls' Generation ????_I GOT A BOY_Music Video Girls' Generation ????_Dancing Queen_Music Video GIRLS`GENERATION????_FLOWER POWER_Music Video GIRLS`GENERATION ????_Oh!_Music Video Girls' Generation ????_THE BOYS_Music Video KOR ver. Girls` Generation ???? _ Gee _ MusicVideo GIRLS' GENERATION ????_PAPARAZZI_Music Video Girls' Generation ????_MR. TAXI_Music Video JPN ver. Girls' Generation ???? _ RunDevilRun ???? _ MusicVideo Girls' Generation ???? _ Genie ?????? _ MusicVideo Girls' Generation ???? _ ? Hoot _ MusicVideo Girls' Generation SNSD - Day By Day MV albert enstain what about this blog? penemu orang islam Loading... penemu biologi Loading... elektronik terbaru Loading... Apple, Google, Microsoft Loading... bbc news Loading... Follow My Instagram twitter Tweet oleh @ahmadafahv Mengenai Saya Ahmad Farhan Lihat profil lengkapku Google+ Followers Follow by Email Pengikut Free Blog Content Translate Arsip Blog Juli 2 Februari 12 Januari 11 Desember 56 November 63 Oktober 5 September 16 Agustus 7 Juli 32 April 1 Juni 3 Entri Populer FAKTA-FAKTA PARK CHANYEOL: F A K T A - F A K T A P A R K C H A N Y E O L : Nama lengkap : PARK CHANYEOL . Hangul untuk nama lengkap Chanyeol itu ???. Cha... SNSD Yoona Selca with Fans Lirik lagu EXO - Growl Korean+Indonesia ver. ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Korean Ver. :? [Tao] Yo OK sexy [Kai] neo hogshi molla gyeonggo haneunde [Tao... SNSD Yoona - 'Prime Minister and I' Behind The Scenes SNSD Yoona at 2013 KBS Drama Awards G-Dragon is the perfect K-Pop Star, newspaper La Press write Canada?s French daily newspaper, ?La Press?, have brought Bigbang?s G-Dragon to their focus highlight. ... YoonA Greets Fans with an Adorable Selca Yoona SNSD berbagi gambar menggemaskan dirinya di halaman resmi Facebook SM Entertainment bersama dengan pesan , Itu akan ... Super Junior's Ryeowook shows support to EXO, VIXX and TASTY Super Junior?s Ryeowook has given his support to EXO for their comeback stage and latest album, ?Miracles ... Super Junior's Donghae takes selca with S.M Rookies? Jeno Super Junior?s Donghae has shown his closeness with one of S.M Rookies, Jeno. The friendship between the two of them was shown in a video... Yoon Shi Yoon funny Catch SNSD's Yoona looking for something in the box waste The series Prime Minister and I finally released photos of the scene meeting Yoona of Girls ' and Yoon Shi Yoon . Both wer... YoOnA Loading... Girls Generation Loading... SHINee Loading... K-PoP Loading... Hollywood Loading... Share It Wikipedia Hasil penelusuran Google+ Followers Google+ Badge Template Travel. Diberdayakan oleh Blogger.