? ?At the recent International Atomic Energy Agency IAEA Ministerial Conference in St.?Petersburg June 2013 , director general Yukiya Amano repeated the familiar platitudes about Fukushima that deflect and deny the heavy responsibility of the IAEA and the Japanese nuclear establishment for having failed to prevent the catastrophe ? one that every anti-nuclear group in Japan had been warning about for years. In a report on the conference published by The Hindu, Mr. Amano refers to Fukushima as not a disaster, accident or catastrophe, but as a ?tragedy,? a word that suggests it was caused by cruel gods rather than human failings. He went on to repeat the familiar trope about ?lessons learned? and the effective steps taken to make nuclear power plants safer. Such statements from the head of the global nuclear establishment are emblematic of what is argued below: in trying to sustain itself against mounting evidence that points to its unacceptable dangers and costs, the nuclear industry has resorted to deceit and self-deception. Psychological experiments have revealed that deceit is soon followed by self-deceit, all the better to make the deception more likely to succeed. This strategy may be an evolved mechanism of the brain, and it may succeed in the short term, in terms of the reproductive success of an organism, but it can come at a high cost to individuals and groups over the long term. The vicious circle of deceit and self-deceit reaches a point at which the inconsistencies become absurd to outsider observers. It is notable that Mr. Amano made comments that mostly reflect the responsibility of the IAEA to promote nuclear power, but not the responsibility to guarantee safety. Many regulatory bodies have been captured by the industries they are supposed to oversee, but the IAEA doesn?t even have to pretend that it operates at arm?s length from industry. It is the founding mission of the IAEA to promote nuclear power, in addition to advancing safety. It is as if the U.S. Environmental Protection Agency could be proud of promoting British Petroleum and Union Carbide, or as if the Federal Aviation Administration spent much of its budget on convincing the public to use airplanes instead of trains and cars. At the conference in St. Petersburg, Mr. Amano touted the fact that, unlike in the aftermath of the Chernobyl accident when nuclear expansion stopped, many countries are building their first nuclear power plants, in spite of the Fukushima ?tragedy.? He even suggested ?growth could be much higher,? and he claimed ?nuclear power actually has a very good safety record? and is a ?tried and tested technology.? Mr. Amano added that it has advantages over fossil fuels and renewable sources of power. There are uranium resources that can last for thousands of years in fast neutron reactors, he says, and nuclear provides a steady supply of electricity at stable prices with low greenhouse gas emissions. After finishing this advertisement, he got around to saying something about safety, admitting that it was the ?number one challenge? for the nuclear industry. This simple, easily digested message intended for mass consumption not for the audience in the room actually reveals much about the psychology of nuclear promotion. We could ask what scenario, if any, would prompt the IAEA to give up promotion of nuclear energy and lead the world toward alternatives. Before 2011, we might have thought that the answer was a triple meltdown and the barely averted evacuation of Tokyo. The 50-year, trillion-dollar cleanup estimates vary wildly, but they have been in the hundreds of billions so far should have been the final nail in the coffin. It was the nightmare scenario that we were promised could never happen. What about something worse, but still of a higher probability than we would like to admit, such as the destruction of a spent fuel pool near a large metropolis? That event would require the evacuation of millions of people, if the authorities were brave enough to admit the necessity. Based on what happened during the Fukushima catastrophe, we can conclude that it?s more likely the authorities would decide that the future cancer cases were preferable to the economic damage and the deaths caused by a panicked evacuation. The truth of the situation would be revealed in stages in the hope that the depopulation of the city could be done over several months. Nonetheless, you can bet that the director general of the IAEA, and every other representative of the nuclear industry, would be feeding the media with statements about how lessons have been learned and nuclear is still a feasible alternative to fossil fuels. The cup is always half full, regardless of what happens. Future generations will be the ones to decide whether nuclear leaders were evil or simply misguided, but their predicament brings to mind some well-known fictional characters who found themselves ensnared by the ?insane root that takes the reason prisoner? Macbeth I.III.83 . Once a person has committed to an errant path, evidence of mistakes will not be sought, and if they are found, they will be ignored and denied. The farther the person goes, the worse the self-deception gets. The situation might seem appalling to outside observers, but the traveler on the path will delude himself or put on a brave face. In the television drama Breaking Bad, the mild-mannered chemistry teacher Walter White falls for the temptation of supplementing his income by making methamphetamine to sell to the local kids. Step by step he is ensnared in ever greater sins that require ever more twisted rationalizations. At one point he lets a young woman die of a drug overdose because calling for an ambulance at that moment would jeopardize his criminal operation. That death impacts her father who is an air traffic controller. He goes back to work still distraught and distracted, and causes a mid-air collision of two passenger jets. Walter knows the father, and knows that he himself is responsible for the chain of events. Back at the high school where he works, he is cornered by the principal to say a few words to the assembly of students traumatized by the air disaster, and all he can say to the stunned crowd is a line eerily similar to what nuclear Pollyannas would say repeatedly about Fukushima just one year after this story was broadcast: ?I guess, what I would want to say is to look on the bright side. First of all, nobody on the ground was killed.? The whole speech is worth citing as an artistic depiction of what a person sounds like when speaking through layers of self-deception:? ? and an incident like this over a populated urban center ? that right there ? that?s, that?s just got to be some minor miracle. So? Plus neither plane was full. You know, the 737 was what? Maybe two thirds full, I believe, right, yes? Maybe even three quarters full? Well, at any rate, what you?re left with, casualty-wise, is just the fiftieth worst air disaster ? actually tied for fiftieth. There are, in truth, fifty-three crashes throughout history that are just as bad or worse. Tenerife? Has anybody heard of Tenerife? No? In 1977, two fully loaded 747s crashed into each other on Tenerife. Does anybody know how big a 747 is? I mean, it?s way bigger than a 737. And we?re talking about two of them. Nearly six hundred people died in Tenerife, but do any of you even remember it, at all? Any of you? I doubt it. You know why? Because people move on. They just move on. And we will too. We will move on and we will get past this because that is what human beings do. We survive. And, uh... and we survive and overcome. The actor Bryan Cranston effectively conveys Walter?s tortured conscience leaking through in these perplexing rationalizations. To suppress his guilt, he focuses on the difference between two thirds full and three quarters full, and he chastises his audience for not knowing about a plane crash that happened fifteen years before they were born. The students and teachers in the scene, and the audience on the other side of the screen, get that there is something gravely amiss with Mr. White. Yet in reality, when an industrial catastrophe occurs, leaders of the industry and its various overseers do much the same thing. They downplay, shrug and make similar optimistic pronouncements, and the world doesn?t bat an eye. The nuclear industry is at that point in the play where Macbeth declares, ?It will have blood they say: blood will have blood? III.IV.122 , or ?I am in blood stepped so far that I should wade no more. Returning were as tedious as go o'er? III.IV.136-138 . Nuclear industry promoters are not killers like these fictional villains. Day-to-day life in the nuclear industry must be as banal as in any other profession. But the effects of institutional deception with nuclear technology can be just as devastating as those of deliberate crimes. If the Macbeth analogy is unfair, let?s just say they are in for a dime, in for a dollar.? The nuclear industry is in the same phase of its life cycle, and there is a certain irony in the fact that James Hanson, a former leading NASA climate scientist, is one of the main voices promoting the idea nuclear expansion can save us from global warming. Private investors are not interested. The public hates it and doesn?t trust promises about safety. The argument that nuclear can prevent global warming just doesn?t hold up to scrutiny. It couldn?t possibly expand enough to make a difference. Nonetheless, the industry persists in its message because that is all it can do. It deceives and self-deceives because it is ?a bureaucracy in need of employment.? To explain the extent of this self-deception, in the following section let me count the ways nuclear apologists ignore the inconvenient truths that are stacked around them. In many cases, these issues are deliberately ignored, while in others it is simply a matter of ignorance. Nuclear professionals are atomized in their specialties, working on isolated tasks without a comprehensive view of the global situation. The staff at a French power plant, for example, may do their jobs very well, but they are unlikely to have had any education in the historical, political, environmental and social aspects of nuclear technology. While they enthusiastically support nuclear power and accept what they tell each other about nuclear safety within their profession, they often have little awareness of how their operations are connected to the social and environmental impacts of uranium mines, waste disposal sites and enrichment facilities. If they do get a glimpse of a disastrous problem once in a while, like to cite just one example , the uranium waste contamination of drinking water in Jharkhand, India, they prefer to look away. Although there are hundreds of such problems around the world, they think each can be dismissed as an isolated, rare case of a failure to employ best practices. Proponents look to an ideal of how nuclear technology should be managed rather than at the reality of how it is managed. The advocates of nuclear energy promote it as being ?carbon-free,? but numerous scientific studies have been done to determine the amount of carbon energy that must be consumed at the front end and the back end of the nuclear cycle. The front end involves mining, refining, and enriching uranium, transporting it, and building and operating power plants. The back end involves cleaning up mine sites, decommissioning power plants and transport and storage of nuclear waste. In 2008, Benjamin Sovacool examined 103 studies on this question for his report Valuing the Greenhouse Gas Emissions from Nuclear Power: A Critical Survey. In the conclusion he wrote: Rather than detail the complexity and variation inherent in the greenhouse gas emissions associated with the nuclear lifecycle, most studies obscure it; especially those motivated on both sides of the nuclear debate attempting to make nuclear energy look cleaner or dirtier than it really is? the mean value of emissions over the course of the lifetime of a nuclear reactor reported from qualified studies is 66 g CO2e/kWh? Thus, nuclear energy is in no way ?carbon free? or ?emissions free,? even though it is much better from purely a carbon-equivalent emissions standpoint than coal, oil, and natural gas electricity generators, but worse than renewable and small scale distributed generators? lifecycle studies of greenhouse gas emissions associated with the nuclear fuel cycle need to become more accurate, transparent, accountable, and comprehensive? No identifiable industry standard provides guidance for utilities and companies operating nuclear facilities concerning how to report their carbon-equivalent emissions.? Sovacool, and many others who discuss this question, tend to not mention the one variable that is the most damning for nuclear power. The energy and financial costs of the nuclear waste problem extend so far into the future that it might as well be considered infinite. We must conclude that the cost is enormous but unknowable, and, beyond being a financial consideration, it also involves questions about the technological competence of future generations, the health impacts that will fall on them, and the morality of leaving this mess for people who probably won?t be enjoying the comforts some of us have in the 21st century. No one knows how problematic the back end will be, nor can anyone know the consequences of nuclear disasters yet to come. The Japanese have been trying for decades to create a closed nuclear fuel cycle, but the Monju fast breeder reactor has worked for only a few minutes since it went critical in 1994. A sodium coolant leak in 1995 rendered it inoperable, and this was followed, as is the norm with many operators, by cover-ups and falsified reports, then by more problems with a restart in 2010. The project is now effectively over. The reprocessing facility in Rokkasho is another boondoggle. The main reason it can?t be closed down now is because promises were made to the prefecture where it is located. The fuel was to be reprocessed and magically made to disappear as it was ?burned up? in reactors around Japan, but all nuclear plants in Japan were shut down after Fukushima, and many of them may never operate again. To now admit that the project failed would be to tell the people of Aomori prefecture that they are stuck with the nuclear waste that sits on the site. There is a similarly stalled project in the US regarding a fuel reprocessing facility that is supposed to extract plutonium from warheads and convert it to MOX mixed oxide fuel. The facility under construction in South Carolina is now far over budget up from $4.9 billion to $7.7 billion and plagued by design problems. There is some doubt about whether there will be a market for the final product at prices that make the expense worthwhile. A report by Matthew Wald in The New York Times notes that the Obama administration budget request now says the idea of making reactor fuel may be unaffordable. Edwin Lyman of the Union of Concerned Scientists said, ?Just about everything is going wrong.? His group opposes the plant because it disagrees with claims that this technology ?burns up? warhead plutonium. Instead, it adds to the world a material that can be used to make dirty bombs, or it can be purified to make nuclear bombs. Wald reports that the massive increase in the projected capital cost of the plant, and the overall cost of the program, are what caught the attention of budget planners. An executive at Areva, the French company that is in the partnership building the factory, noted the lack parts of manufacturers and skilled workers. There has been no new nuclear plant construction in the US for thirty years. Unfortunately, as usual it is the cost, not the concerns about environmental impacts, that gets the attention of legislators who have called for the termination of this program. In a perverse way, the Fukushima catastrophe was a good thing for the nuclear industry because it put nuclear energy back on the front page and provoked ham-handed propaganda efforts like the film Pandora?s Promise. The PR machine has worked overtime since March 2011, planting editorials, holding international conferences, and getting employees to troll the comments on media websites. This appeal to the public through the mass media is necessary because the expansion of nuclear is now mostly a political issue and PR battle because the public is being asked to pay for it. Private financial capital has disappeared, and no insurance company will cover the risk of accidents.?Daniel Eggers, a utilities analyst with?Credit Suisse was quoted in a Bloomberg report saying, ?In a competitive market, you can?t even come close to making the math work on building new nuclear plants. Natural gas is too cheap, demand is too flat, and the upfront costs are way too high.? As was the case with NASA during the space shuttle program, when the agency had to convince taxpayers that low-gravity experiments with corn were of urgent importance, the IAEA can only maintain its reflexive emphasis on promotion and job preservation, paying lip service to safety, but discounting any evidence that gets in the way of the primary objective of self-preservation and expansion. Catastrophic nuclear accidents such as the core meltdowns in Chernobyl and Fukushima are more likely to happen than previously assumed. Based on the operating hours of all civil nuclear reactors and the number of nuclear meltdowns that have occurred, scientists at the Max Planck Institute for Chemistry in Mainz have calculated that such events may occur once every 10 to 20 years based on the current number of reactors - some 200 times more often than estimated in the past [emphasis added]? Jos Lelieveld, one of the authors of the study, said, ?Not only do we need an in-depth and public analysis of the actual risks of nuclear accidents. In light of our findings I believe an internationally coordinated phasing out of nuclear energy should also be considered.?? The most compelling evidence of the failed promise of nuclear energy is the numerous hibakusha communities not all of them victims of weapons programs and nuclear waste sites around the world that have become intractable, nation-bankrupting, looming environmental catastrophes. If we used to worry about a far-off day when post-industrial societies would confront nuclear waste without the resources and knowledge to handle it, we can now relax. That day is already here. Private and public debts are at record heights, and state governments of a declining imperial power can?t even afford to fix schools or potholes on city streets. Some American states have even desperately proposed a tax on hybrid vehicles because of all the gasoline tax their owners don?t pay. If it is so difficult to raise funds for basic social services and infrastructure repairs, nuclear waste cleanup is not likely to rank as a priority or be considered affordable. If the IAEA could honestly face up to the problem, it might advocate it has no enforcement powers for a moratorium on new nuclear construction until proper action were taken on the legacy of nuclear waste. But of course, this would mean the end of nuclear power because there would be no money left over, and no public will to create more nuclear waste. The billions or trillions of dollars necessary to finish the job would make the true cost of this technology clear to the world, so the nuclear industry must suppress the seriousness of the problem. It brushes the problem aside with bland promises that solutions are at hand. But we have to wonder. If it were that simple, the problem would have been solved by now. The Hanford Site, Washington State. After it was declared a Superfund site in 1989, work continued for 23 years until whistleblowers revealed last year that serious problems were ignored before concrete was poured on the new treatment facility. Some have questioned whether remediation is possible at all. Manhattan Project waste dumps in St. Louis, the Niagara Region of New York State and numerous other locales across America. Seventy years after the dawn of the nuclear age, The Washington Post reports that cleaning up what is still left of the Manhattan Project wastes will cost more than what was spent in 21st century equivalent dollars to build the atomic weapons of the 1940s. USA Today gave extensive coverage to this issue in a series that ran in 2001. Decommissioning projects needed at numerous nuclear fuel facilities, such as in Paducah, Kentucky. US taxpayers are on the hook for this debacle after USEC Inc. made its profits leasing the government-owned site, then walked away from it in June 2013. See the series of articles published by Ecowatch. Sellafield, UK. Former weapons facility and fuel plant. $120 billion now estimated for cost of cleanup. Private contractors failed and government might have to take over the job that government was previously thought to be not capable of. La Hague, France. Former weapons facility and fuel plant. About $4 billion estimated to be necessary for decommissioning, but work is not going to well. There is a curious discrepancy in cost estimates compared with the similar facility in the UK Sellafield . L?Autorit? de s?ret? nucl?aire recently ordered La Hague to cease some operations until several ?serious gaps? in security are addressed. Radioactive and chemical pollution left at uranium mine sites. It is often said that all of America?s nuclear waste could fit onto a football field, but this overlooks the fact that for each kilogram on the field, there are hundreds more of mine tailings, processing chemicals, radon gas, and depleted uranium used to the make conventional weapons. Besides, that football field full of waste is, gram for gram, much more toxic than any other kind of industrial waste product, and energy has to be spent cooling it and containing it for long periods of time. Pointing to its small size is a dishonest distraction created by people who know it is an apples-to-oranges comparison. Depleted uranium, used in armor-piercing weapons, vaporized and scattered over Iraq during two US invasions. This use of uranium is unrelated to electricity production, but using it wouldn?t be so easy if the material were not conveniently available as a waste product of producing uranium fuel. According to John Pilger?s report in The Guardian, a senior UN humanitarian official in Iraq wrote, The US government sought to prevent WHO from surveying areas in southern Iraq where depleted uranium had been used and caused serious health and environmental dangers. A WHO report, conducted jointly with the Iraqi government, contains damning evidence of a stunning rise in birth defects where depleted uranium and toxic metals were used by invading American and British forces. The ongoing cost of decommissioning the wreckage of Chernobyl and Fukushima. All of the nuclear waste legacies listed here are associated with costs estimates of a few billion dollars here, a few billion dollars there, but with deadlines that span generations, and sites that will be toxic for thousands of years, it is impossible to put a price on the cleanup costs of these two famous meltdowns. The word cleanup is relative and, of course, a misnomer. Mitigation is the appropriate term that should be used, and the standards used are relative, depending on what we decide we can spend. It would be na?ve to think that people of the future are going to have the will or the means to do everything possible to eliminate the toxic legacy of the nuclear age. Many poisoned lands will just be left as sacrifice zones. Unfortunately, this preoccupation with the distant past has led to the absurdity of both NRA and TEPCO forgetting that there was a damaging earthquake under Kashiwazaki only six years ago, not 400,000. Furthermore, they are repeating the arrogant mistake of NASA engineers who couldn?t foresee the famous O-ring failure in the Challenger disaster. O-ring wear was noted after previous space shuttle flights, but since it was only one third of the way through, NASA engineers optimistically concluded that this was proof that the O-rings had been designed with a ?threefold safety factor? Trivers, 203 . This mistaken assumption, which overlooked cold weather as a factor in the wear, was obvious only after the O-ring wore through completely on the Challenger flight, killing all the astronauts on board. The same hubris seems to be underway at TEPCO because safety inspections on the Kashiwazaki reactors have been completed and the company is confident that they will survive the next earthquake simply because they survived the last earthquake. Look at the wonderful safety factor built into them! TEPCO engineers assume they know the maximum magnitude and peak ground acceleration of any future earthquake that will strike, which just happen to be less than the design limits of the reactors. This optimism bias and self-deception is driven by the need to quickly produce a revenue stream. TEPCO is bankrupt, with no way to pay for the Fukushima Daiichi decommissioning and all the compensation owed, let alone its normal operations. The government also believes that ?cheap? nuclear energy is necessary to restore Japan?s positive balance of trade. For economists who focus on the country?s demographics and other problems, this is seen as an irrelevant issue. The TEPCO plan, endorsed by the Abe government and Keidanren Japan Business Federation , is to use Kashiwazaki as a cash cow for the corporation and the nation. In other words, the plan is to risk a new meltdown catastrophe as a way to pay for the damage caused by the last one. If the NRA approves the restart of Kashiwazaki, even though it is now known to be on an active fault that nearly caused a devastating accident, it will be interesting to see how Yukiya Amano, himself a veteran of the Japanese nuclear establishment, will respond. If the IAEA were truly focused on safety, it would recognize that all of Japan is at risk of earthquakes that could exceed the design basis of existing nuclear plants. The quake damage at Fukushima Daiichi not the tsunami damage has still not been determined. The sensible thing for Mr. Amano to do would be to recommend that his native country save itself and abandon nuclear energy. But this won?t happen. When the restarts are announced, the IAEA will look away and, if it says anything at all, it will issue the same bland statements that were made about all of Japan?s safety lapses prior to 2011: Improvements have been made, this time it will be different, Japan is in compliance with international standards, and the IAEA does not interfere with energy policy decisions of member states. After all that has happened, this is the measure of how our system of global governance assesses the urgency of the problem. By the absurd reasoning of institutional self-deception, the Chernobyl and Fukushima ?tragedies? provided wonderful opportunities to make improvements in nuclear safety, so why not have more? Finally, what about me? Am I self-deceived? Perhaps I am, but the logic of self-deceit says I couldn?t know. But I have no self-interest behind my arguments which would motivate me to deceive others. If anything, my life would be harder in a less energy-intensive world. As Bill McKibben wrote,??...tackling climate change has been like trying to build a movement against yourself.? The pro-nuclear argument claims that I?ve got it all wrong, as they think nuclear expansion could somehow prevent climate change from happening. But climate change will continue regardless of help from nuclear, and regardless of the causes, so the pro-nuclear argument amounts to saying that when people of the future are faced with rising sea levels, weather extremes and social disorder, they will curse us for not having left them more nuclear waste to add to their problems. If that is indeed a possibility, I?m willing to live with it.