Fukushima radiation leaks rise sharply, officials baffled Via?opednews.com, 11 July 2013?- Fukushima Situation Normal, in The SNAFU Sense of Normal Bad as the situation is at Fukushima, it's gotten worse. Perhaps you've heard that radiation levels of the water leaving the Fukushima, Japan, nuclear power plane and flowing into the Pacific Ocean have risen by roughly 9,000 per cent. Turns out, that's probably putting a good face on it. By official measurement, the water coming out of Fukushima is currently 90,000 times more radioactive than officially safe drinking water.? These are the highest radiation levels measured at Fukusmima since March 2011, when an earthquake-triggered tsunami destroyed the plant's four nuclear reactors, three of which melted down. As with all nuclear reporting, precise and reliable details are hard to come by, but the current picture as of July 10 seems to be something like this: ? On July 5, radiation levels at Fukushima were what passes for normal, which means elevated and dangerous, but stable, according to measurements by the owner, the Tokyo Electric Power Company TEPCO . ? On July 8, radiation levels had jumped about 90 times higher, as typically reported. ?TEPCO had no explanation for the increase. ? On July 9, radiation levels were up again from the previous day, but at a slower rate, about 22 per cent. ?TEPCO still had no explanation. ? On July 10, Japan's Nuclear Regulation Authority NRA issued a statement saying that the NRA strongly suspects the radioactive water is coming from Fukushima's Reactor #1 and is going into the Pacific. We must find the cause of the contamination . . . and put the highest priority on implementing countermeasures, NRA Chairman Shunichi Tanaka told an NRA meeting, according to Japan Times. As for TEPCO, the paper reported, The utility has claimed it has detected no significant impact' on the environment. in the SNAFU sense of Normal' Neither the NRA nor TEPCO has determined why the level of radioactivity has been increasing. Both characterize the increase as a spike, but so far this is a spike that has not yet started to come down. Here's another perspective on the same situation: ? 10 becquerels per liter -- The officially safe level for radioactivity in drinking water, as set by the NRA. A becquerel is a standard scientific measure of radioactivity, similar in some ways to a rad or a rem or a roentgen or a sievert or a curie, but not equivalent to any of them. ?But you don't have to understand the nuances of nuclear physics to get a reasonable idea of what's going on in Fukushima. ?Just keep the measure of that safe drinking water in mind, that liter of water, less than a quart, with 10 becquerels of radioactivity. ?60 becquerels per liter -- For nuclear power plants, the safety limit for drinking water is 60 becquerels, as set by the NRA, with less concern for nuclear plant workers than ordinary civilians. ? 60-90 becquerels per liter -- For waste water at nuclear power plants, the NRA sets a maximum standard of 90 becquerels per liter for Cesium-137 and 60 becquerels per liter of Cesium-134. At some of Fukushima's monitoring wells, radiation levels were in fractions of a becquerel on July 8 and 9. At the well or wells that are proving problematical, TEPCO has provided no baseline readings. ?9,000 becquerels per liter -- On July 8, according to TEPCO, the company measured radioactive Cesium-134 at 9,000 becquerels per liter. ?Since TEPCO characterized this as 90 times higher than on July 5, the implication is that the earlier reading about 100 was less than twice as toxic as the allowable limit and only 10 times more toxic than drinking water for civilians. ? 11,000 becquerels per liter -- TEPCO's measurement of Cesium-134 on July 9. ?? ? ?18,000 becquerels per liter -- TEPCO measurement of ?Cesium-137 on July 8. ? ?22,000 becquerels per liter -- TEPCO's measurement of Cesium-137 on July 9. ? ?900,000 becquerels per liter -- TEPCO's measurement of the total radioactivity in the water leaking from Reactor #1. ?This radiation load includes both Cesium isotopes, as well as Tritium, Strontium and other beta emitters. ?There are more that 60 radioactive substances that have been identified at the Fukushima site. A becquerel is a measure of the radioactivity a substance is emitting, a measure of the potential danger. There is no real danger from radiation unless you get too close to it -- or it gets too close to you, especially from inhalation or ingestion. ?? The water flow through the Fukushima accident site is substantial and constant, both from groundwater and from water pumped into the reactors and fuel pools to prevent further meltdowns. In an effort to prevent the water from reaching the ocean, TEPCO is building what amounts to a huge, underground dike -- a deeply sunken coastal containment wall. ?The NRA is calling on TEPCO to finish the project before its scheduled 2015 completion date.