Prominentes 			17,735 posts 		 Prominentes 			17,735 posts 		 Prominentes 			17,735 posts 		 Prominentes 			17,735 posts 		 Prominentes 			17,735 posts 		 					Posted 18 July 2013 - 12:56 PM 					 				 					How War in Syria Turned These Ordinary Engineers Into Deadly Weapons Inventors Abu Yassin pulls open the heavy iron gate of the school and steps back. ?Peace be upon you,? he says in Arabic, grinning and extending a hand, his arm stained to the elbow with aluminum powder. ?Welcome, welcome.? He turns and waves for me to follow. We walk along a short pathway toward the front door, past an assortment of ordnance laid out on the concrete, bombs that fell from the sky but failed to explode: an ovoid 88-millimeter mortar shell, a big 500-pounder with twisted tail fins, a neat row of pale-gray Russian cluster bomblets, their nose fuses removed. ?Later! I will open them later!? he says, eyebrows waggling with anticipation. The four-story school is shaped like a C around a set of basketball courts, paved with stone tiles and pocked at the far end with small dark craters. A set of white plastic lawn chairs and a table have been arranged in the central courtyard near the door leading into the school. A young boy walks over in silence. ?Let?s see, coffee or tea?? Yassin says, distracted, contemplating the plastic furniture. Another assistant, an older man in a filthy smock, comes out and stands beside us holding a silver cylinder the size of a soda bottle. It?s wrapped in clear plastic tape and sprouts a red fuse, which the man proceeds to light. The fuse sputters as he steps forward and pitches the cylinder underhand across the courtyard, where it bounces and rolls to a halt some 30 yards away. ?Explosion!? he yells as Yassin looks on. With a deafening clap, the bomb bursts in a cloud of flame and smoke, buffeting our faces with a pressure wave. Yassin scurries forward and crouches on his haunches to examine the crater it leaves. Slowly he walks back, shaking his head. ?Very bad, very bad,? he mutters?but then, remembering his guest, his expression brightens to a smile. ?Please, sit down.? Abu Yassin, a former network engineer who has emerged as one of Aleppo?s most prolific weapons manufacturers. THE CONFLICT IN ALEPPO, like the wider civil war in Syria, has been mired in stalemate for more than a year. The rebels moved into the country?s largest city in the late summer of 2012, seizing nearly two-thirds of it within a couple of weeks. Since then, though, regime and rebels have stayed locked in grinding urban warfare. The business of Aleppo?s inhabitants has become violence?and Abu Yassin has bent his unusual ingenuity to that task. A former network engineer, he has become one of Aleppo?s premier bomb makers, part of a burgeoning homemade-weapons industry that has sustained the Syrian revolution. Yassin?s factory inside the abandoned school churns out hundreds of pounds of explosives every day, and he is constantly seeking to innovate ways of killing people. After we settle into the plastic chairs, the boy returns bearing a tray of Turkish coffee. From a quarter mile away, we can hear gunfire and shelling at the front line?the thump of outgoing artillery, the crunch of incoming. Periodically, the older assistant returns and lobs another bomb into the courtyard, its blast interrupting our conversation as bits of concrete plink against the plastic table. Yassin then wanders over to inspect the crater, squatting down like a tracker on his quarry?s trail. The bomb maker added nitrocellulose to his mix today, in a bid to give his explosives more power; now he is checking the craters for residual ammonium nitrate, which would indicate an inefficient reaction. Soon three more guests arrive, led in by Yassin?s younger brother Abu Ali. Abu means ?father of? in Arabic, and many rebels take their son?s name as a nom de guerre; I have used them in this story at their request. Ali, who runs the business half of the operation, owned a small shopping mall in Aleppo before the war; he is jowly and unshaven, clad in a tattered, calf-length leather trench coat and a cream turtleneck sweater streaked with grease. He has brought with him a rebel commander, a stout man wearing a pistol in a shoulder holster, along with two of the commander?s men. They have just come from a nearby front line. ?I need 50 of every kind of bomb,? the commander tells Yassin, who nods toward his assistants. As the soldiers ferry armloads of homemade grenades to their waiting car, Yassin and the commander walk into what was once the principal?s office. Now hanging on the wall above the desk is the rebel tricolor?green, white, and black, with three red stars?and below it a black flag with a Muslim profession of faith written out in stark white Arabic script, the kind of flag displayed by Islamist groups linked to al Qaeda. The center of the room is dominated by a long wooden table upon which lie samples of Yassin?s homemade wares: mortar shells, detonators, antitank mines, bottles of foul-smelling ammonium and napalm, shotgun-launched grenades, and hand-thrown bombs of various shapes and sizes. In the corner stands a robot stippled in green camouflage, with four wheels and a single arm ending in a claw. The commander tells Yassin about an upcoming operation to capture a mosque held by the regime. Yassin nods and strokes his beard. Already he is calculating exactly which explosives and mines will be most useful, how much they will cost, and how he will balance this commander?s demands with the needs of the dozens of other rebel groups that come to him each week, desperate for weapons. After two years of increasingly vicious combat, the civil war has become a battle of annihilation, one increasingly tainted by sectarian extremism and human rights abuses on both sides. Nearly 100,000 people have died, and the rebels all know that they too will likely join the dead if the government of Bashar al-Assad prevails. Once they led ordinary lives, many of them in the ranks of the middle or professional classes, but those days are gone. They fight for their lives and for their country, but Abu Yassin is also fighting for his own redemption?for a victory that might justify, in retrospect, the dark purpose to which he has turned his prodigious powers of invention. Workers assemble grenades at a makeshift factory in a rebel-held district of Aleppo. AFTER THE COMMANDER LEAVES, Yassin sits down at the desk. Until the war ends, he is the closest thing to a principal that this school will have. With silver fingers he plucks a cigarette from his pack of Cedars and pulls out a lighter marked Seny Eriosson. He is wearing a gray tracksuit, and his dark, matted curls are covered by a faded orange-and-black-checkered cotton kaffiyeh that he wears over his head like a bandana, winding the tails across his brow in the Arab style. This, together with his fur-lined vest, lends him a rustic air, but he speaks in the lengthy, didactic manner of a professor. When asked a question, he often looks upward in calculation, drums his fingers against his beard, and then mutters a rhetorical ?OK? before he finally launches into an answer. His high cheekbones are sun-darkened and gaunt, and as he speaks his eyes bulge and narrow with the intensity of a mad prophet. His cigarette lit, Yassin talks about the day when it first seemed possible Assad could fall. He had been working in Lebanon, building and maintaining the corporate IT network of a firm in Beirut. The office was a place of rationality and achievement, demarcated from the chaos of the city by air-conditioning. It was a Microsoft shop. Yassin wore a jacket and tie. He was splitting his time between a Beirut apartment and a home in the nearby Syrian capital of Damascus, where his wife and two children lived. Though the average Syrian had suffered under decades of economic stagnation and isolation, Yassin?s yearly salary was roughly $25,000, which meant he lived well. He wasn?t especially political. When the Arab Spring arrived and unrest in Egypt and Libya spread to Syria and the army was ordered into the streets, Yassin couldn?t believe what he was watching. Glued to Al Jazeera in his Beirut apartment, he was amazed at the mayhem in the Syrian streets, the open defiance of Assad. Even then he regarded this unrest as an interested spectator, not a participant. He kept his job and his cross-border commute. But toward the end of 2011, as the uprising became an armed rebellion, it also took on an uglier cast. Resistance hardened among the Sunni Muslims roughly 75 percent of Syria?s population , who had grown tired of rule by Alawites, a sect that represents just one-eighth of Syrians but happens to include the two men, Hafez al-Assad and now his son, who have ruled the nation since 1970. Yassin is from a Sunni family in Aleppo, and his brother and parents still lived in the city; as the killing there escalated, he was drawn to go fight beside his friends and loved ones. He resigned from his job, returned to Damascus, and kissed his wife and children good-bye?that was the last time he saw them. Then he drove 200 miles north into the fury of the civil war, crossing regime lines into the rebel-held portion of the city. By the time he arrived, he found that Ali had already joined a band of fighters in the south of the city, in the working-class neighborhood of Salaheddine. Yassin initially volunteered as an ambulance driver, which let him witness firsthand the human sacrifice the rebels were making. His first ambulance was hit by a mortar shell just seconds after he got out of it. His second went up in flames after its gas tank was shot while he was driving. Meanwhile, he observed that his brother?s group of fighters, just like the others around town, suffered primarily for lack of weapons. The Salaheddine group had 85 pump-action shotguns that had been smuggled in from abroad, as well as three dozen Kalashnikov assault rifles they had captured from the regime. Against them, Assad had a professional army equipped with heavy machine guns, tanks, artillery, and air power. One day Yassin was in the headquarters of the katiba?the local battalion, which does its best to supply bands of fighters?and watched as a commander arrived and asked for ammunition. Supplies were desperately low, and the commander was allotted just 50 bullets for his entire team. The commander?s face fell; he would be sending his men to die. Yassin?s mind was working. He had no military experience. As a young man, he had studied to be a lawyer. Then he had worked as a sales representative for a commercial expo and trade fair company. After that he had gone back to school to study network engineering. Now, at the age of 39, he would reinvent himself again. He and Ali left frontline combat to build a new operation, which they dubbed the Military Engineering Katiba. As startup capital, they used the savings they?d accumulated before the war. They couldn?t manufacture rifle rounds, but they could make explosives and grenades to help their fighters conserve ammunition. Using the contacts they had built with other rebel units, they were granted use of the school, long since abandoned, many of its windows smashed in by shelling from the front line in Salaheddine. They swept the courtyard clean of glass and got to work. A selection of Abu Yassin?s homemade bombs. MOST MODERN EXPLOSIVES get their power from compounds that have complex nitrogen bonds. Ammonium nitrate, one of the world?s most prevalent fertilizers, fits the bill nicely. It can be obtained in large quantities, and due to its low cost it?s widely used as an explosive in mining and quarrying. And because it?s so easily obtained, it?s a favorite of terrorists and guerrillas the world over. ?Any peasant can obtain it,? Yassin tells me at the school. We walk into one of the classrooms, which has been entirely emptied of furniture. Instead, 50-kilogram sacks of Turkish fertilizer sit stacked against the far wall, surrounded by empty artillery shells and lengths of aluminum piping to be used as casings for future bombs. An older man and two young boys?they can?t be more than 12?are at work without gloves or masks, their faces and hands as black as coal miners?. With a shovel, they mix an enormous pile of gray powder; a fine particulate suspension hangs in the air, illuminated by rays of sun through the glassless windows. Several additives are mixed with ammonium nitrate to boost the power of the explosion. The most common is diesel fuel, but Yassin claims to have a nine-part secret recipe that works far better; the one key ingredient he?ll reveal is powdered aluminum, hence the silver dust that constantly coats his hands and arms. He casts an expert eye over the pile. It hasn?t been completely blended yet, and I can still pick out many of the constituent parts by their color and texture: whitish fertilizer, chunky grains of TNT, black ground charcoal, silver aluminum dust. In the jargon of explosives engineering, ammonium nitrate is ?insensitive,? which means it?s difficult to detonate. Think about a campfire: You need to burn paper and then kindling before the flames are hot enough to consume thick wood. Bombs are much the same. You need a ?primary? explosive, some highly sensitive substance that reacts in contact with a burning fuse or an electrical spark. Yassin and his brother used Google to find instructions for making common primary explosives such as mercury fulminate and lead azide. Then, taking over the school?s chemistry lab, they tested the recipes. One day when Ali and some others were making mercury fulminate, the stuff exploded on them. Four men lost eyes and fingers, and Ali?s face and arms were peppered with glass shards. Since then, Yassin has tried to source commercial blasting caps from Turkey whenever he can. When Yassin and Ali started the katiba, their first product was a basic hand grenade that the rebels could use in close-quarter urban combat. They packed the explosives, along with steel tailings that would turn into deadly shrapnel, into plastic tubing, then inserted a detonator and booster charge. Once they?d mastered elementary bomb-making, they turned to more complex devices. There were large bombs, for example, made from empty fire extinguishers or propane tanks, which could be buried and then triggered by wire at the approach of regime forces. There were antitank mines with charges that cut through vehicle armor?a particularly advanced and lethal technology that had been devastating to American forces in Iraq. But as winter went on and bodies filled the streets, Yassin dreamed of bolder inventions. For that he needed proper factories, with machines and engineers capable of building electronics. In January, Yassin got hold of a machine shop in the old city so he could start producing the weapons he saw in his head. In the school hallway, there is an olive-green 75-mm mortar, newly arrived from his shop. It?s the highest-quality homemade weapon I?ve ever seen. ?This is the work of months of development,? Yassin says, patting the mortar. ?It takes eight days to polish the inside of the tube.? Indeed, the inside of the barrel is perfectly smooth, and the tube connects to its stand with a pair of smoothly greased threads; the mortar shells, shaped like bowling pins, have been painted and finely milled. Yassin is selling it for around $500?cheap, considering that a professional one on Aleppo?s black market would cost thousands of dollars. Yassin isn?t trying to make much of a profit. Once he masters a device, he keeps trying to find less expensive ways to manufacture it. With the homemade grenades, he has been able to cut costs by using steel tailings he gets for free from a generator factory. That has brought the unit cost of each grenade down to the equivalent of $3, which is exactly what he sells them for. I ask him what he plans to make next. He rummages around in the principal?s desk, under a set of exam booklets, before pulling out a small brass device and handing it to me. ?Take a look at this,? he says, and I turn it over in my hand. It looks like a plumbing fitting. ?It?s a pressure-sensitive detonator,? he says. ?Be careful, it?s live.? I flinch and hand it back to him, asking what it?s for. He points to a stack of metal objects in the corner, shaped like old-fashioned fire-alarm bells. They are what are known in military parlance as victim-operated improvised explosive devices?or, in plain English, land mines. In Aleppo?s old city, fighters launch homemade grenades with a slingshot. AMONG THE SYRIAN REBELS, Yassin is far from alone in applying his ingenuity to homemade weapons. More than in any of the other Arab nations riven by war in recent years?more than in Egypt, Libya, or Iraq?the rebels here have taken a DIY approach to arming themselves. This has been born out of a combination of necessity other rebellions have been better supplied and uncommon opportunity, as rebels have been able to hold significant territory where workshops can be set up and kept safe from regime attacks. Though regional countries like Saudi Arabia and Qatar have supplied arms to the rebels?and the US decided in June to begin its own limited program?weapons have been scarce enough that the rebels continue to manufacture their own. The whole region around Aleppo, which had been the center of Syria?s heavy industry, quickly became particularly fertile ground; as the rebels captured machine shops, steel mills, and power plants, they began adapting them to the task of war. Some of the rebels? creations verge on the outlandish. When I ask about one odd-looking, 15-foot-long wooden trebuchet, which its proud creator is using to hurl 4-pound fragmentation bombs, he tells me he got the idea from the videogame Age of Empires. Another Aleppo inventor gained fame with an armored car called Sham II an improvement on an earlier Sham . Two crew members sit inside the car, an old diesel chassis with steel panels welded around the outside, and look at TV screens. While one drives, the other uses a PlayStation controller to aim and fire a machine gun mounted on the roof. With the rebellion divided among countless autonomous little bands, each town and neighborhood has become its own armorer. But the demands of fighting Assad?s army have resulted in some limited coalescence among the fractious rebel katibas. In many areas, they have banded together into larger units called liwwas, Arabic for brigades. These units handle logistics for their subordinate katibas, sourcing weapons and materials from Turkey and Jordan as well as setting up factories and staffing them with workers. The liwwas also barter and trade weapons and expertise among themselves. In Aleppo, I meet Abu Mahmoud Affa, a former housepainter who now commands a liwwa called Shield of the Nation. He is wearing camo fatigues and chain-smoking in his office, another abandoned school. With his big frame, protruding belly, and bushy white beard, he looks like a cross between Che Guevara and Santa Claus. His bulk is accentuated by his pixie-faced 12-year-old son, Mahmoud, who accompanies him everywhere toting an M-16 some two-thirds his height. Affa agrees to drive me to one of the factories his men have set up, on the condition that I wear a blindfold. With a scarf wrapped around my face, I feel the car twist and turn as we speed through Aleppo?s narrow streets. Soon the hubbub of traffic and pedestrians dies off, replaced by the sound of machine-gun fire. We are entering a frontline area. At last the car stops, the passenger door opens, and I am pulled out and told to walk, Affa?s big hands guiding me forward. ?Who is this motherfucker?? someone asks, thinking I?m a prisoner. ?A journalist, he?s a journalist,? Affa says. The light through my scarf darkens, and finally the blindfold is lifted. I?m in a narrow one-room shop with a low ceiling and roller blinds on the front. Several fighters sit on mats with their weapons, smoking and regarding me with curiosity. Affa leads me toward the back of the shop, where the rebels have bashed a hole in the concrete. We duck through it, and I find myself in a second shop, dominated by a massive central lathe and a collection of machine tools. Affa introduces me to Abu Abed, a slender balding man in an oil-stained smock who presides over the shop. Before the rebellion, he worked at a munitions plant near Al-Safira, south of the city, where the government made everything from bullets to helicopter-launched rockets. When he defected to the rebels, he brought his knowledge of weapons manufacturing with him. Shield of the Nation has a whole network of small factories like this one, each focused on different components. ?Usually we work one item at a time and make a few hundred of them before moving on to the next,? Abed says. This factory doubles as a head office of sorts, where the others send their pieces for assembly. It?s also where Abed and his colleagues experiment with new designs. Most of the equipment has been borrowed from an auto transmission workshop. Despite the fact that they?re working with explosives, everyone is smoking; piles of steel shavings and cigarette butts litter the floor. No one bothers with eye or ear protection, even as the lathe howls and shoots metal sparks across the room. ?Now we?re making a piece for the mortar,? Abed says. The mortar is the liwwa?s pride; they designed it by reverse-engineering a captured 82-mm Russian model. Aside from IEDs and grenades, their most popular item is a short-range rocket similar in design to the ones developed by Palestinian militants in Gaza. To make the rockets, they cut the U-joints off the ends of car driveshafts, later reusing them to join the mortar tube to its baseplate. To fire them, they employ an ingeniously crude method. After they use repeated test firings to determine the mortar?s range?usually around 2 kilometers?the rebels check Google Maps to pick a suitable spot that sits the same distance from their target. They transport the rocket there and then use a compass to aim it. After blindfolding me again, Affa walks me out to the car. By the time I get back to my neighborhood in Aleppo it?s dark, and I lie on a mat on the floor of my borrowed apartment, listening to a city at war with itself: the woodpecker rattle of machine guns, the swoop of incoming mortars, the crash of artillery, the demented grind of a MiG?s cannon. The regime is shelling the town, and the rebels are firing back, but I can sense myself on one side of a more visceral divide?those who fire blindly into the dark and those who wait fearfully within it. A deserted street in the Salaheddine district of Aleppo. ABU YASSIN HAS MADE a promotional video for his Military Engineering Katiba. It begins with a montage of clips of his work?bombs exploding, beakers smoking, circuits and IEDs being assembled?accompanied by a dramatic orchestral track that sounds like it was ripped from a videogame. Then Yassin appears, sitting in a darkened room in front of a window, such that only his silhouette is visible. He looks like a supervillain. A Syrian rebel flag hangs above his shadow. ?In the name of God the most gracious and most merciful,? he begins, and then goes on to list an extensive menu of products that his shop produces. Yassin sees the video as a sort of marketing instrument, one that he can show to the rebel commanders who flock to him for weapons. He?s proud of what he has achieved on his own, without help from wealthy Arab donors or foreign intelligence services. ?Nobody can tell me what to do!? he exclaims one day as we sit in the principal?s office, drumming his fingers against the wooden desktop. He is wearing the same grease-darkened scarf and gray tracksuit he had on when we first met. He rubs his eyes and calls for another cup of black coffee?he seems never to sleep. ?And they all need me.? Some of his inventions have failed. He tried to modify remote-controlled model airplanes to carry video cameras so he could use them as spy drones. But he couldn?t build the gear light enough for the planes to fly above the range of small-arms fire. Then there?s that claw-armed robot, which Yassin and some engineering students spent two weeks assembling, based on a design from a Japanese website. ?We were forced to make our own circuits,? he explains, ?and they had less capability than the ones the design called for.? He dreamed of using the claw to retrieve weapons or even wounded men on the battlefield, but the robot never worked well enough to deploy. Yassin seems to believe that anything can be accomplished with the right combination of gadgetry?even advanced modern weaponry on a par with the stuff that militaries use. ?There?s one kind of circuit that I?m looking for,? he says, ?that will allow the rockets to track aircraft by seeking their heat.? It?s a self-conception that harks back to an older, pre-corporate ideal of the heroic solo inventor, like those of the golden age of American innovation in the days of Edison, the kind satirized by Rube Goldberg in the 1920s or, in the 1980s, by the breakfast-making contraption at the beginning of Back to the Future. For all his technological enthusiasm, Yassin at times betrays how deeply his lethal new trade troubles him. ?These things are for killing people,? he tells me once, in sudden disgust. ?Every time I make a bomb, I feel sorrow.? He hopes that eventually, in the new Syria, the one that he will help to build, he will find justification for his bloodied hands. ?I?m tired of talking about death,? he tells me one day. He announces that he is planning a new project called Amar Arabic for ?Works? to revitalize the moribund and devastated city after the war. As part of this effort, he says, he has invented a new strain of bread yeast and a new kind of quick-drying cement. He wants to produce cleaning chemicals. He will make enough to supply the whole city. He will build as many factories as necessary. And the labor force? Why, the streets of Aleppo will be filled with unemployed men! ?Working in such a factory will give them a purpose again and make them feel hope,? he says, eyes flashing. As for when Amar can begin, he is vague. In the meantime, he is left to feed and tend a machine that sucks in explosive material and spits out mangled bodies. CURIOUS TO SEE his products in action, I visit a band of rebels he supplies in Aleppo?s old city, where the winding paths of what was once a medieval town have been built up three or four stories high. The buildings have high, thick stone walls and interior courtyards, which, coupled with the narrow streets and mazelike layout, make them ideal havens for urban guerrillas; the artillery and airpower have trouble reaching their targets, and tanks can?t enter the denser quarters. In the courtyard of a stone house in the Kastel Harami district, I meet with Abu Mohammed, a rebel leader affiliated with Ahrar al-Suria, or the Freemen of Syria. Mohammed?s house is a well-appointed dwelling with grape vines, bronze wind chimes, and a small tortoise. The commander himself?tall and thin-lipped, with desert-camo pants and a black beard and turban?is squatting in the courtyard when we arrive, busily pouring an incendiary mixture of industrial adhesive and gasoline into a collection of empty Nutella jars. He stands up and walks over to show me the rest of his arsenal. He has some rockets and a crate of homemade mortar shells; a grocery bag brims with spherical metal grenades the size of oranges, also homemade, with fuses sticking out of their tops, like bombs in a cartoon. After filling the rest of the jars, Mohammed and his men gather their rifles and head into the street. We wind our way like mice through the dense geometry of the old city. I follow him down a narrow alley, then into a courtyard. We weave through a hole bashed in the courtyard wall into a small cavity between the houses, then across a plank to another roof. Finally we descend into a third courtyard, where a group of rebels waits for us, clad in a motley mix of combat fatigues and regular clothes. They have assault rifles as well as a couple of grenade launchers and a light machine gun. The sound of gunfire and explosions, omnipresent in Aleppo, has intensified considerably. The crack and whiz of bullets is actually audible overhead. The attack is about to begin. In the Salaheddine district, rebels and local residents carry the body of a fighter for burial. Mohammed motions for me to follow him up another set of stairs at the far end of the courtyard. At the top, on a second-story terrace, a younger rebel waits next to an 8-foot-high metal stand shaped like a Y with a loop of thick elastic dangling from it. This, I realize, is a giant slingshot. The attendant rebel, thickset with a fan-shaped beard and close-shaved mustache, introduces himself as Abu Zakaria. He hefts a grenade from one of the shopping bags that another rebel has carried up. ?Angry Birds,? he says in English, laughing and jerking a thumb toward the slingshot. The crack of rifle fire sounds again, and bullets snap overhead?even closer than before, now that we?re one story up. Zakaria pats the wall we have our backs against. The regime soldiers are 15 meters that way, he tells me. From the opposite side of the terrace, another group of rebels comes running, yelling for us to take cover. The previous night, they snuck up in the dark and planted a massive IED against the foundation of the house the regime soldiers were occupying. Now they are going to detonate it. We crouch and stick fingers in our ears just before an enormous blast shakes the earth, followed by the rattle and clank of falling debris. Now it is time to engage the slingshot. Mohammed places a grenade in the band and draws it back tight, squatting on his haunches, clenching it with all his might. Zakaria puts a cigarette lighter to the fuse. With a snap, Mohammed releases the grenade?but the angle is too low. We hear the metallic clink of the bomb, that $3 staple of the Military Engineering Katiba, hitting the courtyard wall and bouncing back toward us. Everyone shouts and scrambles to escape. Near me in the courtyard is a double-leaf door to a hallway, but one of the leaves is latched shut, and three men have already bunched up at the open side, jamming into a bottleneck. My only option is the bathroom, so I dive into it, sliding face-first on the cool tiling. Another rebel jumps in on top of me just before we feel the violent concussion of the grenade, which strikes me not as sound but as silence. For a full minute, the world is quiet. Then men?s voices fade in, sounding like faraway radio chatter. Gradually I begin to hear again, albeit with a tremendous ringing in my ears. Miraculously, no one is hurt. Mohammed and Zakaria go right back to the slingshot and begin lobbing grenades toward the regime lines, this time successfully. After exhausting their supply, Mohammed waves for everyone to pull back to the lower courtyard, where they gather in a circle and chant ?God is great!? After that we retreat another hundred yards into an alley. The assault has ended as abruptly as it began. Instead of pressing the attack, the rebels break for an hour to lunch on falafel sandwiches. When they return to the front line, the rebels are greeted with fresh machine-gun fire: The regime soldiers have regrouped. Neither the first rebel IED nor a second one have succeeded in collapsing their house. A group of rebels run shouting down the alley with a young compatriot, his face pale and taut. He has been shot through the thigh, and as they heft him into a waiting van and try to improvise a tourniquet, a bright arterial jet spurts crimson onto the cobblestones. Afterward, as the blood congeals, Zakaria rests against the stone wall, fingers probing the skin of his trembling brow. ?We?ve been fighting in this same position for three months,? he says, glancing at the ground. ?But tomorrow we will advance, God willing.? In Aleppo?s Al-Sukri neighborhood, residents search for survivors after a regime airstrike. ON MY LAST NIGHT IN ALEPPO, I go for a final visit with Abu Yassin. Although it?s late March, the weather is still cold, and that evening has brought rain. A full moon illuminates the streets, but there is no power in most of the city, and as I approach the school, the waxy yellow of its generator-powered light stands out through the drizzle. One of Yassin?s henchmen opens the heavy gate for me; the bomb maker is sick, he tells me. I find Yassin in the principal?s office, slumped into a sofa, a heavy woolen blanket wrapped around him up to his chin. There are dark hollows under his eyes, and his face looks even more gaunt. He makes a feeble attempt to get up. ?Sorry,? he says, then coughs wetly. He has been bedridden with fever for two days. I have a few lingering questions about his manufacturing process, but insistently he turns the conversation to Amar, his yeast and cement factories, his grandiose plans for the new Syria. He wants to show me something, he says. It is a picture of him before the war, in a suit and tie, clean-shaven, his angular features softened into a ropy handsomeness. The bearded and kaffiyeh-wearing man in front of me is almost unrecognizable as the same man. We both laugh. ?I hate this,? he says, glancing around his room full of weapons. ?Do you know what my dream is?? He waits for a moment, and I shrug. I have heard all about the glorious future he envisions. ?My dream,? he says, ?is to go to a caf? with my friends. Nothing more. Just a caf?. And then to walk home slowly and find my wife and children asleep.? An incoming mortar round whistles outside in the dark; then, down the street, a distant thump. ?We hope that this bad dream is going to end,? he says. He sweeps his hands around the principal?s office. ?This is a school! Where are the children? Where are they?? He slumps forward a moment and then begins coughing. He rubs his temples, lights a cigarette, smokes until his cough subsides. He looks at me and forces a grin. ?But I am hopeful for the future. Syria can be a great country again. Our laborers built half the Gulf countries. They can build our own.? Yassin insists on walking me to the front gate himself. We stand for a moment, contemplating the empty moonlit streets. There is a vacant lot across the road from the school; beyond that stands a line of four-story apartment buildings, with one missing like a broken tooth. During this very day, a regime jet dropped a bomb on it, burying three families under the rubble. Despite his illness, Yassin helped supervise the rescue operation. He spent half the day inhaling pulverized concrete dust, shouting hoarsely for silence so he could listen for buried cries. ?It will be fine,? Yassin says again, gazing out across the empty lot. He turns to me, and his bulging, sallow eyes catch the moonlight. ?You just ? have to think!? he says in his broken English, stabbing his fingers toward his temple, the man of reason asserting his control over destiny. ?You can do anything if you think!? A new chain of explosions flicker on the horizon like faraway lightning. Yassin?s face relaxes. ?Peace be upon you,? he says, and turns to go. 					 					 Prominentes 			1,274 posts 		 Prominentes 			17,735 posts 		 Prominentes 			17,735 posts 		 Prominentes 			17,735 posts 		 Prominentes 			17,735 posts 		 Prominentes 			17,735 posts 		 Prominentes 			17,735 posts 		 Prominentes 			17,735 posts 		 Prominentes 			17,735 posts 		 Prominentes 			17,735 posts 		 Prominentes 			17,735 posts 		 Prominentes 			2,508 posts 		 Prominentes 			17,735 posts 		 			17,735 posts 		 			17,735 posts 		 			17,735 posts 		 			17,735 posts 		 The current hit, ?Man of Steel,? has taken in more than $630 million at the worldwide box office to date, and climbing. Along with its star, Henry Cavill, the upcoming film brings back Amy Adams, Laurence Fishburne and Diane Lane. Snyder is co-writing the story with David S. Goyer, who will then pen the screenplay. Production is expected to begin in 2014, with an anticipated release date in Summer 2015. Silverman stated, ?Zack Snyder is an incredibly talented filmmaker, but beyond that, he?s a fan first and he utterly gets this genre. We could not think of anyone better suited to the task of bringing these iconic Super Heroes to the screen in his own way.? Kroll added, ?We are thrilled to be back in business with Zack and his team on this next movie. The success of ?Man of Steel? is a wonderful testament to the love and support that both fans and new audiences, worldwide, have for these characters. We are very excited to see what Zack has in store for all of us.? Zack Snyder, who made a surprise appearance at Comic-Con today, breaking the news to audiences there, later said, ?I?m so excited to begin working again with Henry Cavill in the world we created, and I can?t wait to expand the DC Universe in this next chapter. Let?s face it, it?s beyond mythological to have Superman and our new Batman facing off, since they are the greatest Super Heroes in the world.? 			17,735 posts 		 			17,735 posts 		 			17,735 posts 		 			17,735 posts 		 			17,735 posts 		 			17,735 posts 		 			17,735 posts