Prince William and his wife Kate have named their newborn baby boy George Alexander Louis, sticking firmly to British royal tradition with a first name used by six previous kings. George was the clear favourite during the fevered speculation about the prince's name, as it pays tribute to Queen Elizabeth II's beloved father King George VI, who reigned from 1936 until his death in 1952. The new baby, who is third in line to the throne, will now officially be known as His Royal Highness Prince George of Cambridge, after his father and mother the Duke and Duchess of Cambridge. The announcement Wednesday came just hours after the queen met her great-grandson at Kensington Palace for the first time since his birth on Monday, leading to speculation she had given the name her final clearance then. The new parents, both 31, and their little prince later left for Kate's parents' house in rural Berkshire, outside London, seeking a respite from the global media frenzy that has swirled around them for days. The Duke and Duchess of Cambridge are delighted to announce that they have named their son George Alexander Louis. The baby will be known as His Royal Highness Prince George of Cambridge, Kensington Palace said in a statement. The baby will not automatically be King George VII when he comes to the throne, however, as there have been reports that William's father Prince Charles may take that title when he succeeds the queen. Prince William had said that the couple were still working on the name when they gave the world its first glimpse of the then-unnamed baby outside St Mary's Hospital in London on Tuesday evening. Louis is one of William's middle names and was also the first name of Lord Louis Mountbatten, the Viceroy of India and a mentor to Prince Charles. Mountbatten was killed in 1979 when the Irish Republican Army blew up his boat off the coast of Ireland. Alexander meanwhile puzzled the pundits, apart from the fact that the queen's middle name is Alexandra. But George, which was the 12th most popular name for baby boys in England and Wales in 2011 and derives from the ancient Greek word for farmer, was widely predicted. George is obviously a tribute to the Queen's father and will, I imagine, give her majesty great pleasure, historian and royal biographer Robert Lacey said. George VI, whose birth name was actually Albert and was known as Bertie, was the subject of the Oscar-winning film The King's Speech which portrayed his struggle to overcome a severe stutter and lead his nation during World War II. The first British king to bear the name was the German-born George I, the first monarch of the House of Hanover, who ruled from 1714 to 1727. Other famous royals to hold the name include George III 1760-1820 whose madness has also been depicted on film. -- 'George was the front runner' British bookmakers said they had taken a loss on the name but the size of the betting market on the royal baby compensated for it. It was a royal flush -- we have paid out ?250,000 290,000 euros, $383,900 on George, Rory Scott of the betting firm Paddy Power told AFP. George was the consistent front runner for months. But I didn't think they would go for it because of the reports about Charles wanting to be George VII when he takes the throne. But historian Judith Rowbotham was surprised they chose George, the same name as the last Prince of Cambridge whose personal life caused great scandal in Victorian Britain. It's going to give some mileage for comparison, said Rowbotham. His personal life was not to the pace of the Victorians, but on the other hand he was a very good military commander and presided over a number of important reforms. The naming was relatively quick by royal standards. Charles and his first wife Diana took a week to announce William's name in 1982, while the world had to wait a month after Charles was born in 1948. The queen had earlier spent around half an hour at Kensington Palace meeting William, Kate and the boy who will one day succeed her as head of state of Britain and monarch of 15 Commonwealth realms around the globe. She said on Tuesday she was thrilled and remarked on how heavy he was when he was born, at eight pounds six ounces 3.8 kilogrammes . Prince George's uncle Prince Harry -- William's younger brother, who has been knocked down to fourth in line to the throne -- and Kate's sister Pippa Middleton made separate visits to the couple at the palace. The Cambridges have now slipped out of the public eye after unveiling the baby on Tuesday to cheers from the international media camped outside St Mary's Hospital in London. The baby behaved impeccably, raising a tiny hand above his white blankets -- his first royal wave of a lifetime that will be spent in the spotlight. Congratulations have poured in from around the world, while Chinese fortune tellers predicted the baby will grow up to be determined but introverted -- and a hit with the ladies.