LONDON AP -- Royal officials say Britain's new prince has been named George Alexander Louis. Palace officials said Wednesday that the 2-day-old baby and third-in-line to the throne will be known as His Royal Highness Prince George of Cambridge. Earlier in the day, the baby met his great-grandmother Queen Elizabeth II. His parents -- Prince William and Kate -- then brought him to Kate's parents in their village near London -- pretty much like any regular family. THIS IS A BREAKING NEWS UPDATE. Check back soon for further information. AP's earlier story is below. After the frenzy and the flashguns, Britain's new royal baby and his parents spent Wednesday out of the media spotlight. But for how long? The 2-day-old prince doesn't have a name yet, but he's the most famous infant on Earth, and as a future British king he faces a lifetime of celebrity. Palace officials say Prince William and his wife Kate are spending 'private and quiet time for them to get to know their son' -- and, perhaps, to figure out ways to shield him from intense public and media interest. At least the relationship got off to a good start. The baby slept through his first photo op outside London's St. Mary's Hospital, while his parents beamed as they chatted easily with reporters. For a royal family that has had a fraught relationship with the media, it was a positive sign. 'I thought, is this an Oscar-winning performance?' said Ingrid Seward, editor-in-chief of Majesty magazine. 'But I think they were so genuinely overjoyed that they wanted to show off the baby.' After leaving the hospital, the couple introduced their son to his uncle, Prince Harry, and to great-grandmother Queen Elizabeth II, keen to see the baby before she starts her annual summer vacation in Scotland later this week. Then they headed to see Kate's parents in their village near London -- pretty much like any regular family. There has been so much royal drama in the last few decades that it's easy to forget that William had, by royal standards, a relatively normal childhood. His parents' troubled marriage may have ended in divorce, but Prince Charles and Princess Diana were devoted parents who tried to spend as much time as possible with their children -- albeit with an assist from nannies. The queen was sometimes away on official tours for months at a time when her children were young, but Charles and Diana took William along on a tour to Australia when he was just 9 months old. The queen was educated at home, in keeping with royal tradition. But she sent her own children to boarding schools, and Charles and Diana did the same with William and his younger brother Harry -- choosing Eton, one of the biggest and most prestigious boys' schools in the country. 'William's childhood was normal by upper-middle-class standards-- private schools, expensive holidays, McDonald's in a smart part of town as opposed to a grotty part of town,' said royal historian Robert Lacey. 'I think really one is going to see more of the same.' Lacey thinks Kate's middle-class background will also help ensure her son gets a broader world view than some of his royal predecessors. The baby's maternal grandparents, Carole and Michael Middleton, are self-made millionaires who run a party-planning business from the village of Bucklebury, west of London. 'From Buckingham Palace to Bucklebury -- these are the two elements that will be in this child's upbringing,' Lacey said. Lacey noted that on Kate's side the baby prince had 'a grandfather who started off dispatching aircraft from Heathrow Airport and a grandmother who started out as a flight attendant and grew up on a council estate, who came from coal-mining stock in Durham in northern England . That is all funneling through.' Historian Antonia Fraser noted on BBC radio that the Middletons also provide an example of marital stability --'unlike so many royal marriages recently.' William's childhood normality was possible because the palace struck a deal with the media -- privacy in exchange for a number of agreed photo opportunities at birthdays and during school holidays. Seward said Kate and William would try to arrange a similar deal for their son. 'When they have got time to think, they will have to do some kind of deal with the press,' she said. 'In return for some really beautiful photographs, they will be left alone.' The British press adhered to the agreement while William and Harry were children. But once they reached adulthood, all bets were off. Photos soon appeared of Prince Harry on drunken nights out, or wearing a Nazi outfit to a costume party. Tabloid reporters were also secretly hacking the mobile phone voicemails of royal aides in quest of scoops. The revelation of the scale of that illegal eavesdropping -- on celebrities, politicians and crime victims as well as the royals -- horrified the British public and chastened the rambunctious press, although that may be a temporary state of affairs. Palace officials still have some sway over newspaper editors. When they complained about photos of William and Kate walking on a beach near their home in Wales, British newspapers did not run them. But the foreign press is impossible to control, as the palace learned when an Italian magazine ran topless pictures of Kate taken during a holiday in France. But, Lacey points out, the media can cut both ways. This baby will be the first future monarch to grow up in the era of Twitter, Facebook and other social media. 'That will give him an incredible insight into how the country and population he is supposed to represent live and breathe and enjoy themselves and corrupt each other,' he said. 'In the Middle Ages we have legends of idealistic princes who would dress in ordinary clothes and go out into the streets of town after dark to see how their subjects lived. The electronic media, for all their hazards, do offer this new dimension to an heir.' Jill Lawless can be reached at http://Twitter.com/JillLawless