Empress of Soul credits mentor Sammy Davis Jr. for her star turn. These stars make 40 and even 50! look like the new 20. India?s legendary actor Pran, who played some of Bollywood?s most memorable villains in a career that spanned six decades, died of pneumonia at a Mumbai hospital Friday, his doctor said. He was 93. A luxury, British website has created a once-in-a-lifetime epic travel itinerary that will take one couple to all 109, three-Michelin-starred restaurants around the world, for the cool sum of about $275,000. The News' team of reporters is covering all the festivities leading up to the Midsummer Classic. Just when you thought it was safe to go back to your television... After the whirlwind of social media surrounding Thursday night?s broadcast of ?Sharknado,? the telepic?s star Tara Reid says she?d be up for another go-around. The reason it's called underwear is because you're supposed to wear it on the INSIDE of your clothing. Check out celebs who've decided to flip flop their blouses for bras and their pants for panties. Talk about a wine cooler. A French winemaker has introduced a Coca-Cola-flavored wine called Rouge Sucette, or ?Red Lollipop,? that?s 75% wine and 25% sugar, water and cola flavoring, The CUT reported. According to Victoria Moore, a wine critic at ?The Telegraph,? the soda-flavored wine ?is something the French have already embraced.? Get a leg up on scoring summer?s best-dressed title in these flirty summer frocks. From shifts to kaftans, minis and midis, beating the heat has never looked better. For a chic daytime look, add a pop of color with a bright bracelet or shoe. Tragic story of Oscar Grant's death is one of the most extraordinary films you'll see this year. The Peacock network yanked White's prank show, Betty White's Off their Rockers Thursday, a candid camera style show in which old people would punk young ones. According to Johnny Swet, co-owner and mixologist at JIMMY in Manhattan, the motto behind this summer?s freshest mojitos is short and sweet. Going green is in ? and yes, that applies to smoothies. Consider that green smoothies are easy to make, healthy and tasty, and their recent popularity makes sense. High-profile stars who are involved with Scientology. The pop star is listed as an underage guest on the Chicago police citation. The biopic is about the making of the 1964 movie musical, ?Mary Poppins. The sensor-embedded diaper tracks hydration and kidney health. The singer will release a single from the new album on August 19. The 1954 Mercedes-Benz Formula 1 racecar was driven by Juan Manuel Fangio. The former NBA star has a boozy new venture. The robots and monsters were movie magic ? but the anguish in their eyes was real. Aaron Sorkin show retains first-season flaws, but the actors are strong. Smartphones are now so ingrained in Americans' lives that they're unwilling to put them down. Billionaire George Soros is going full-steam ahead with a September wedding to Tamiko Bolton. Lohan is finally returning to the big screen - to play a troubled actress mired in scandal. Sheen is asking to cut Mueller's monthly child support payments to zilch. The star recalled a wild encounter with a big cat while on a safari. See the most striking news photos from across the globe ... Guys get hammered, while girls might get just a little buzzed -- or so they say. Amanda Seyfried is channeling the risqu? side of her ?Lovelace? character. The NBA star and husband of Khloe Kardashian lashed out. If you've got it, flaunt it. That?s what Cheyenne Lutek was thinking... Is it possible to always be glamorous? Sofia Vergara seems to think so. New research revealed some good news and some bad news about Americans and their health. The good news? Exercise is on the rise throughout the country. The bad news? So is obesity. Men and women in more than two-thirds of the counties in the United States reported becoming more active over the last decade, according to data from the Institute for Health Metrics and Evaluation at the University of Washington. Eat your broccoli! President Obama gave the crunchy crucifer a ringing endorsement earlier this week, telling children attending the Kids? State Dinner that it was his favorite food. Justin Bieber reached out to former president Bill Clinton on Wednesday, after a video of the teenage pop star surfaced online, showing him urinating in a restaurant mop bucket and later yelling F-k Bill Clinton! as he exited a New York City night club. It wasn't Saturday night, but John Travolta sure caught dancing fever in Rio. Could the royal bundle of joy be a Bastille Day baby? Great Britain's betting 5-to-1 odds that the Duke and Duchess of Cambridge welcome their royal progeny on July 14 ? France's national holiday. The country star isn?t expecting a baby, she confirmed via Twitter. To brighten your summer style, pick a print and then pick another. The trick to successful wardrobe mixology is to choose pieces in complementary shades and distinctly different patterns. Carole Collen, 52, stumbled across the suggestive fruit in her vegetable patch at her home in Dartford, Kent, on Tuesday morning. Peppi Marchello, the vibrant lead singer for the beloved Long Island band the Good Rats, has died. The vocalist, known for his powerful vibrato, died of a heart attack Wednesday evening at 9 p.m. He was 68. People tend to overlook 'liquid calories,' particularly those that come from alcoholic beverages ? because if you don't chew, it seems like it doesn't count. Sadly, that's not the case. When Busy Philipps and her husband, Marc Silverstein, announced the name of their newborn baby girl, they may have heard crickets. The couple have given their daughter the name Cricket Pearl Silverstein, reports E! News. Are these the strangest animals you've ever seen? Forget critics. When it comes to his new movie, ?Bhaag Milkha Bhaag,? out Friday, Bollywood director Rakeysh Omprakash Mehra frets about the opinion of one man ? his subject, legendary track star Milkha Singh. The answer to the question of healthier processed foods will be based on how you define healthier. If your definition is simply a processed food that contains a smaller quantity of an unwanted component, or more of a wanted one, then no doubt there are many healthier processed foods ? and no doubt, too, consumers are flocking to them. When writing your will, don't forget to include access to social media, online photos and more Sam Mendes? license has been officially renewed. The Academy Award winner announced Thursday he?s returning to the director?s chair for a second-straight James Bond film months after bowing out over scheduling conflicts. 'Why can?t we discover that Peter is exploring his sexuality?' Garfield said. Charles ?Chuck? Foley died at a care facility in the Minneapolis suburb of St. Louis Park. Lady Gaga is being sued by former assistant, and is losing. The rapper was pulled over for speeding on a California parkway. Not surprisingly, Sheen came back empty-handed. FC Online Marketing Inc. is weighing in on Biggest Loser star Tara Costa. Chad Gaudin faces a lewdness charge. A deep sense of symmetry hovered over Cyndi Lauper's NYC concert. Amanda Bynes seems to have gone off the deep end. Check out the child star's downward spiral. See which stars have allegedly upgraded their physical assets... Glee creator Ryan Murphy confirmed the rumors in a tweet Thursday. Volleyball golden girl Kerri Walsh Jennings posed pregnant and after giving birth for The Body Issue. Hasselbeck spent 10 years on ABC's hit talk show The View. Who says John Mayer can?t make dreams come true? Here's a sneak peek at the athletes stripping down. Fourteen-month-old Sorella Stoute has already made her first adult purchase. See the most striking news photos from across the globe ... Country star showing improvement but remains in critical condition with congestive heart failure. She may be a 43-year-old mother of twins, but Jennifer Lopez is hotter than ever. Charlie Harper's spirit will return to CBS in the form of a long-lost daughter who is 21, gorgeous and gay. Kenny Ortega broke down crying as he testified about Michael Jackson's shivering and rambling state. The couple, engaged since 2012, is reportedly taking the plunge this weekend. In an interview that went viral this week, he got emotional about dressing up as a woman for the flick. Kenny Kramer, the inspiration for the quirky ?Seinfeld? neighbor, is now a fully licensed minister. 'Scrubs' star took some time to help Matt Hulbert pop the question. Paris-based label joins forces with Toilet Paper magazine on a new Autumn-Winter 2013 ad campaign. The 20-year-old daughter of Whitney Houston and Bobby Brown isn?t hiding her love for Nick Gordon. The 29-year-old actress spills secrets about her big day to SNL star Jason Sudeikis. George Clooney and Stacy Keibler's break up was certainly not a sudden one. Photos showed Glanville stumbling out of a Hollywood hotspot with a male friend. Plastic surgery is on the rise in Venezuela as more women strive to look ?white. Cupcake shop has just the treat to beat the heat this summer ? a new line of ice cream sandwiches. Is Willow Smith's new music video too grown-up? We all know Rihanna is a good girl gone bad, but sometimes the beauty goes above and beyond. John says he is grateful to be alive after receiving the diagnosis. Cyrus was spotted visiting her fianc? while he films his latest project. A cup contains 200% more caffeine than a typical coffee and comes with a health warning. A man brought a sign to the show declaring Taylor Swift is with Satan. There's a certain kind of 9-year-old boy who will go crazy for Pacific Rim. Kanye West slammed the leak on his Twitter feed. It?s easy to take artisanal salt-making with a grain of, well, salt. Check out the child star's downward spiral before marijuana arrest... Can you say TMI? Check out pictures straight from celebrities' hospital beds. International travelers spend an average of 36 minutes to get through customs at JFK. The 37-year-old ex-model allegedly busted into her estranged spouse?s apartment. Breaking up is especially hard to do for Kristen Stewart. The 23-year-old actress returned to her car parked outside her studio apt in North Hollywood to find what appeared to be an unwanted reminder of her ex-boyfriend Robert Pattinson. The ice bar is named for its constant 23 degrees Fahrenheit temperature. Even when she's off duty, this supermodel knows all her best angles. NBA journeyman player Jason Collins? ex-fiance has rebounded from the shock and hurt of being dumped a month before their wedding day in 2009. But except for a pair of brief phone calls from the former Net revealing that he was coming out of the closet as a gay man, Carolyn Moos is still waiting for her closure. Take a look back at Hillary Clinton's hairstyles through the years from her long locks to her shorter 'dos. A photographer in Indonesia took astonishing images of a snail crawling over the amphibian. The reason it's called underwear is because you're supposed to wear it on the INSIDE of your clothing. Check out celebs who've decided to flip flop their blouses for bras and their pants for panties. Are these the strangest animals you've ever seen? Sure, celebs have access to the ritziest hair salons in the country, but somehow the rich and famous still manage to have bad hair days. They may look good now, but at one point, these celebrities weren't picture perfect when it came to their pearly whites. Baby bumps never go out of style among the celebrity set. See which stars are expecting and who's showing off the bump. Prom night is about one thing, and one thing only: the dress. Sure, everyone wants a great hairdo, pair of heels and date, but what every girl really cares about is finding that dress ... and Hollywood starlets are no exception. Check out some of the most memorable prom moments from the silver and small screen. Whoa! From a house made entirely of legos to a home carved out of a cave, these crazy homes are sure to shock you! Sure, sometimes working in an office can feel more like you're working in a zoo, but the newest internet craze has taken a wild day at work to another level! These clever shots by office goofballs involve matching up a coworker's face with a wild animal's body. We hate to burst your bubble, but even the rich and famous have body parts that should stay safely covered.