? ? Lover Point ? ?: July 2013 ? ? Lover Point ? ? Monday, 15 July 2013 Food Intolerance: Real Reason You Can't Lose Weight? A new diet is challenging conventional wisdom that simply eating too many calories is the driver of weight gain. Rather, it claims, food intolerances ? chemical reactions to common foods, including ?healthy? ones such as soy and egg whites ? are triggers of weight gain for up to 70 percent of Americans. ?Your body is not a bank account. It?s a chemistry lab,? says JJ Virgin, author of The Virgin Diet, Drop 7 Foods, Lose 7 Pounds, Just 7 Days, a book that became a New York Times best-seller just two weeks after its release in late November. What Virgin means is this: Traditional diets view your body as a caloric bank account in which calories in must balance calories out. However, a more basic, hidden problem of food intolerance underlies the inability to lose weight. What Is Food Intolerance? We are all familiar with food allergies, which can trigger life-threatening breathing difficulties or hives when someone eats an offending food, such as shellfish or peanuts. These are reactions of the immune system. SPECIAL: These 5 Things Flush 40 lbs. of Fat Our of Your Body ? Read More. Food intolerances are also triggered by the immune system, but in a different way. They are subtle, may take hours or days to manifest, and can include a variety of symptoms, from bloating and gas to skin conditions, achy joints, and excess body fat. Solve the Problem Theoretically, food intolerance can be triggered by any food, and each one of us has a unique body chemistry. But in more than 25 years of solving the weight problems of athletes, CEOs, celebrities, and other clients, as a nutrition and fitness specialist, Virgin has identified these seven foods as the most likely culprits: 1. Gluten 2. Soy 3. Eggs 4. Corn 5. Dairy 6. Peanuts 7. Sugar and artificial sweeteners She has devised a plan that enables anyone to identify which foods are causing problems and learn how to eat to lose weight for good. Although her book is called a ?diet,? it isn?t one in the usual sense. ?It treats food as information,? she tells Newsmax Health, ?connecting the dots between what you eat, how you feel, and what you weigh.? 3-Step Plan In practice, Virgin?s ?diet? has three steps: 1. Transform. For three weeks, eliminate the seven foods most likely to trigger reactions. In addition to being found in obvious places soy in soy milk, or gluten in baked goods and pasta, for example , all seven are ingredients in many packaged and restaurant foods, so you need to be vigilant. 2. Test and Customize. Gradually start eating the seven foods, one at a time, and keep a diary of how you feel. This determines how much of a given food you can tolerate, if any, so that you get to know your own body chemistry and customize your diet. 3. Sustain. Continually eat the way that works for you, and you should never have to ?diet? again. To make this work, you have to follow the plan 100 percent ? cheating during the first 21 days will put you back at square one. But most people who stick with it for at least a week experience significant weight loss, feel better, and continue, Virgin says. Read Latest Breaking News from Newsmax.com http://www.newsmaxhealth.com/Headline/food-intolerance-triggers-food-allergies-gluten/2013/07/15/id/515024#ixzz2Z8McNPqX Alert: What Is Your Risk for a Heart Attack? Find Out Now Posted by Muhammad Ali Khan at 09:53 Top 15 actrices m?s deseadas de 2013 Top 15 actrices m?s deseadas de 2013 El nuevo curso cinematogr?fico nos trae el regreso de antiguos sex symbols, la irrupci?n de nuevos talentos y la consolidaci?n de j?venes actrices que aspiran a ocupar el trono de las m?s deseadas por Hollywood. Elaborar una lista de bellezas es siempre complicado, ya lo sab?is, pero estas son nuestras 15 apuestas para 2013. Hay muuuuchas m?s, pero nadie puede dudar de los talentos de nuestras favoritas. Jessica Alba Tras un a?o y medio dedicada a su familia, Jessica vuelve en 2013 por triplicado con la comedia A.O.C.D. y los dos nuevos proyectos de su colega Robert Rodr?guez: las secuelas de Machete y Sin City, en ambas dando vida a mujeres de armas tomar. Megan Fox Un tanto fuera de ?rbita tras la movida con Michael Bay a cuenta de la tercera parte de Transformers, Megan, que ha sido mam? este a?o, tratar? de coger impulso con la nueva comedia de Judd Apatow, Si fuera f?cil, en la que interpreta un peque?o pero explosivo papel. Zoe Saldana A finales de a?o rodar? la secuela de Avatar a las ?rdenes de James Cameron, pero antes la veremos en la segunda parte de Star Trek dando vida a la oficial de comunicaciones Uhura, que trae por el camino de la amargura tanto a Kirk como al se?or Spock. Mila Kunis La chica de Mark Whalberg en la reciente Ted nos regalar? su presencia en dos t?tulos muy distintos. En Oz. Un mundo de fantas?a interpretar? a una malvada bruja, y en Blood Ties, que la emparejar? con otras dos bellezas, Marion Cotillard y Zoe Saldana, ser? la chica de un mafioso. Kim Kardashian La presentadora y dise?adora de moda m?s voluptuosa de la tele americana est? decidida en 2013 a explotar su imagen como actriz. La veremos en lo nuevo como director de Tyler Perry, Confessions of a Marriage Counselor, en la que todos tratan de echarle el guante. Naomi Watts Tras el ?xito de Lo imposible, la actriz australiana se convertir? en Diana de Gales en el biopic que ha dirigido Olivier Hirschbiegel El hundimiento y a continuaci?n dar? vida a Marylin Monroe en Blonde, drama que prepara Andrew Dominik M?talos suavemente . Charlize Theron Si 2012 fue un a?o redondo gracias a Blancanieves y la leyenda del cazador y Prometheus, Charlize quiere repetir ?xitos en 2013 con otros dos proyectos de envergadura: la cuarta parte de Mad Max sin Mel Gibson y el nuevo proyecto de terror de Scott Derrickson Sinister . Natalie Portman La oscarizada actriz de Cisne negro sigue con la ambici?n intacta. Este a?o la veremos en la segunda parte de Thor, junto a Chris Hemsworth, y en el nuevo trabajo del siempre estimulante Terrence Malick, el drama rom?ntico Knight of Cups. Heather Graham Una de las pelirrojas con m?s estilo de Hollywood quiere recuperar su trono de sex-symbol con la tercera y ?ltima parte de Resac?n en Las Vegas, en la que retomar? su papel de novia de Stu Ed Helms . Talento y atributos no le faltan. Scarlett Johansson Parece que lleve toda la vida actuando, pero la sensaci?n rubia a?n no llega a los 30 a?os. En 2013 volver? a dejar huella de su talento en Hitckcock, dando vida a la actriz Janet Leigh protagonista de Psicosis , y en la cinta de ciencia-ficci?n Under the Skin, de Jonathan Glazer. Vanessa Hudgens Es una de las actrices m?s deseadas y con m?s proyecci?n de Hollywood desde que Zack Snyder explotara todas sus virtudes en Sucker Punch. En 2013 la veremos en la secuela de Machete y en la comedia Spring Breakers, junto a las tambi?n incre?bles Selena G?mez y Ashley Benson. Halle Berry Otra que quiere enmendar su carrera como sea es Halle Berry, no hace tanto sex-symbol indiscutible y una de las mujeres m?s atractivas del planeta. Lo intentar? de la mano de los hermanos Wachowski en El atlas de las nubes y en la comedia colectiva Movie 43 Olivia Wilde Hasta nueve proyectos tiene filmados o en proceso de postproducci?n la guap?sima potagonista de House, Tron y Cowboys & Alien?genas. Lo m?s destacado para este 2013 es su concurso en la comedia The Incredible Burt Wonderstone, con Jim Carrey y Steve Carell. Eva Green La novia de Daniel Craig en Casino Royale desplegar? todo su exotismo en la esperad?sima secuela de 300, titulada finalmente 300: Rise of an Empire, en la que da vida a la reina Artemisa de Halicarnaso. No veremos a Le?nidas, aunque los hechos narrados se suceden en paralelo a las batalla de las Term?pilas. Freida Pinto Lanzada tras los ?xitos consecutivos de Slumdog Millionaire, El origen del planeta de los simios e Immortals, este bellez?n de la India ha cautivado al mism?simo Terrence Malick para coprotagonizar su nuevo proyecto, Knight of Cups, junto a Natalie Portman y Cate Blanchett. Posted by Muhammad Ali Khan at 07:49 Friday, 12 July 2013 Jerusalem's Germans Jerusalem's Germans The Templers: German settlers who left their mark on Palestine In the late 19th Century a group of German Christians called the Templers settled in the Holy Land on a religious mission. What began with success though ended three generations later, destroyed by the rise of Nazism and the war. Kurt Eppinger's community of German Christians arrived in the Holy Land to carry out a messianic plan - but after less than a century its members were sent into exile, the vision of their founding fathers brought to an abrupt and unhappy end. The Germans were no longer welcome in what had been first a part of the Ottoman Empire, then British Mandate Palestine and would soon become Israel. On 3 September 1939, we were listening to the BBC and my father said: 'War has been declared' - and the next minute there was a knock at the door and a policeman came and took my father and all the men in the colony away. Aged 14 at the time, Kurt was part of a Christian group called the Templers. He lived in a settlement in Jerusalem - the district still known as the German Colony today. By the late 1940s though, the entire Templer community of seven settlements across Palestine had been deported, never to return. They had landed two generations earlier, led by Christoph Hoffmann, a Protestant theologian from Ludwigsburg in Wuerttemberg, who believed the Second Coming of Christ could be hastened by building a spiritual Kingdom of God in the Holy Land. Kurt's grandfather, Christian, was among several dozen people who joined Hoffmann in relocating from Germany to Haifa in Palestine in 1869. Hoffmann had split from the Lutheran Evangelical Church in 1861, taking his cue from New Testament concepts of Christians as temples embodying God's spirit, and as a community acting together to build God's temple among mankind. But building a community in what was then a neglected land was an immensely difficult endeavour. Much of the ground was swamp, malaria was rife and infant mortality was high. The Templers saw 'Zion' [Biblical synonym for Jerusalem and the Holy Land] as their second homeland, says David Kroyanker, author of The German Colony and Emek Refaim Street. But it was like being on the moon - they came from a very developed country to nowhere. In fact, the Templers arrived in Palestine more than a decade before the first large-scale immigration of Jewish Zionists, who fled there to escape destitution and pogroms in Russia - and in many ways they served as a model for the Jewish pioneers. Initially the Templers concentrated on farming - draining the swamps, planting fields, vineyards and orchards, and employing modern working techniques unfamiliar to Palestine they were the first to market Jaffa Oranges - produce from their Sarona settlement near Jaffa . They operated steam-powered oil presses and flour mills, opened the country's first hotels and European-style pharmacies, and manufactured essential commodities such as soap and cement - and beer. In his book The Settlements of the Wuerttemberg Templers in Palestine 1868-18, Prof Alex Carmel of Haifa University observes how the Templers soon gained a reputation for their skills and their diligence. They built exemplary colonies and pretty houses surrounded by flower gardens - a piece of their homeland in the heart of Palestine . Symbols of their fervent religious beliefs are still evident in the Jerusalem neighbourhood where the Templers began to settle in 1873. They named the district Emek Refaim Valley of Refaim after a place in the Bible, and verses from the Scriptures, inscribed in Gothic lettering, survive on the lintels of their former homes. Most of the buildings, with their distinctive red-tiled roofs and green shutters, are intact protected by a preservation order and lend the district a continental elegance which has helped make it one of Jerusalem's most expensive areas. In the first years of Jewish immigration, in Palestine the know-how in terms of agricultural and industrial modernisation was in the hands of the Germans, notes Jakob Eisler, a Templer historian in Stuttgart. A Biblical verse on the lintel of a former Templer house in the German Colony, which reads: Arise, shine, for your light has come, and the glory of the Lord rises upon you. Isaiah 60, 1 Although they were few in number, they had a very big impact on the whole of society, and especially on the Jews who came there, he says. Without the help of the Templers it would have been much more complicated for the Jewish settlers to establish so much. If you compare the modernity of Jewish colonies in the 1880s and '90s with the German colonies at that time, the Germans are leading. While Palestine was worlds apart from Germany, the Templers remained fiercely patriotic, proudly retaining their German citizenship and even their Swabian dialect. When the German Kaiser Wilhelm II visited Jerusalem in 1898, the Templers turned out in their finest attire to cheer him, and their colony of Wilhelma, near Jaffa, was named in honour of King Wilhelm II of Wuerttemberg. With the advent of World War I, many Templers went to fight for Germany, dying on the battlefields of Europe and in Palestine, which was eventually conquered by the British. A memorial to 24 of their WWI dead stands in the Templers' well-tended cemetery, tucked away behind two large green gates on Emek Refaim street. Germany's defeat was disastrous for the Templers. Their German loyalties meant they were now considered enemy aliens by the British, and in 1918 850 of them - most of their population - were sent to internment camps in Egypt and their properties and livestock seized. The visit of the Kaiser was an important event for the Templers in 1898 It would be another three years before they were all allowed back to rebuild their now dilapidated settlements. The returnees displayed the same drive as their predecessors half a century before but there was no longer such close collaboration between the Templers and Palestine's Jewish immigrants. In the 1920s the Jews didn't need any Germans for modernisation because the British were there, so the British Mandate authority was building the roads and planning the expansion of the cities and doing all those things which in the Ottoman time no-one was caring for, notes Dr Eisler. In the Mandate time Jews came to the land and were competing with the Germans so a lot of the Germans no longer saw themselves as helping development but rather they saw their own future under threat. After WWI, hundreds of Templers were expelled to Egypt, where they lived in internment camps Nevertheless, relations between Templers and the Jewish community remained good, and despite increasing violence between Jews and Arabs in Palestine, life for the Templers was peaceful. Rosemarie Hahn, who was born in the Jerusalem colony in 1928, recalls the period with a deep sense of nostalgia. I have only happy memories, she says, her German accent, like Kurt's, still discernible. For us as children it was like living in our own homeland - we didn't know anything else. We were friends with everybody - my best friends in kindergarten were a Jewish girl and an Arab girl. English, Jewish, Arab, Armenian - everybody was accepted into our school. But that changed after 1934. My Jewish friend was taken out of school, and my brother had a Jewish friend who never came back - because of the politics. Rosemarie Hahn circled near front went to a Templer school in the German Colony in Jerusalem. Ludwig Buchhalter circled, back row , head of the Nazi party in Jerusalem, was a teacher there By this time, the Nazi party had risen to power in Germany and the ripples had spread to expatriate communities, including in Palestine. A branch was established in Haifa by Templer Karl Ruff in 1933, and other Templer colonies followed, including Jerusalem. While National Socialism caught the imagination of many of the younger, less religious Templers, it met resistance from the older generation. The older Templers were afraid that the Fuehrer would overtake Jesus ideologically, says Mr Kroyanker. Many of the young people were easily influenced by Nazism - there were many young Templers who studied in Germany at the time... and when they came back they were very excited about Nazism. At the beginning there was some sort of disagreement between the older generation and the newer generation, and in the end the newer generation won the battle. In Jerusalem, a teacher at one of the Templer schools, Ludwig Buchhalter, became the local party chief and led efforts to ensure Nazism permeated all aspects of German life there. The Nazi party gained a foothold in Templer communities across Palestine Ludwig Buchhalter circled The British Boy Scouts and Girl Guides which operated in the German Colony were replaced by the Hitler Youth and League of German Maidens. Workers joined the Nazi Labour Organisation and party members greeted each other in the street with Heil Hitler and a Nazi salute. Under pressure from Buchhalter, some Germans boycotted Jewish businesses in Jerusalem while Jews did the same in return . David Kroyanker tells of a macabre turn of events when, in 1978, a box containing a uniform, dagger and other Nazi artefacts was discovered hidden in the roof-space of a house belonging to an 82-year-old Holocaust survivor in Emek Refaim. Buchhalter's house - now the site of a luxury apartment block - on Emmanuel Noah Street served as the Nazi party headquarters and Buchhalter himself drove with swastika pennants attached to his car. He later recalled how he once forgot to remove them while driving through a Jewish area and was stoned and shot at. Continue reading the main story German communities in Palestine, 1939 German Templer in Jerusalem Templers: 1,290 members German-speaking Protestant Churches: Up to 500 members Catholic Church: Up to 180 members Source: Heidemarie Wawrzyn BBC History: Learn more about WWI and WWII The extent to which the Templers as a whole adopted Nazism is a matter of historical debate. While some were enthusiastic followers, others were less committed, and among others still there was defiance and resistance. You can find dozens of those who were really active and you can find those who were going with the stream and others who were afraid not to go into the party, exactly as you could find in Germany, says Dr Eisler. Figures vary, but according to Heidemarie Wawrzyn, whose book Nazis in the Holy Land 1933-1948 is due to be published next week, about 75% of Germans in Palestine who belonged to the Nazi party, or were in some way associated with it, were Templers. She says more than 42% of all Templers participated in Nazi activities in Palestine. Curiously, Nazi chief Adolf Eichmann, architect of the Final Solution, cultivated a legend that he was born in the Templer colony of Sarona just north of Jaffa - though this was untrue. As war loomed in Europe, once again the position of the Templers in Palestine became insecure. In August 1939, all eligible Germans in Palestine received call-up papers from Germany, and by the end of the month some 249 had left to join the Wehrmacht. Continue reading the main story ?Start Quote Kurt Eppinger As a child I couldn't understand why we were being deported, but as it turned out, it was a blessing in disguise? Kurt Eppinger On 3 September 1939, when Britain along with France declared war on Germany, all Germans in Palestine were, for the second time, classed as enemy aliens and four Templer settlements were sealed off and turned into internment camps. Men of military age, including the fathers of Kurt and Rosemarie, were sent to a prison near Acre, while their families were ordered into the camps. For the next two years at least, the Templers were allowed to function as agricultural communities behind barbed wire and under guard, but it was the beginning of the end. In July 1941, more than 500 were deported to Australia, while between 1941 and 1944 400 more were repatriated to Germany by train as part of three exchanges with the Nazis for Jews held in ghettos and camps. A few hundred Templers remained in Palestine after the war but there was no chance of rebuilding their former communities. A Jewish insurgency was under way to force out the British and in 1946 the assassination by Jewish militants of the former Templer mayor of Sarona, Gotthilf Wagner, sent shockwaves through the depleted community. Contemporary reports say Wagner was targeted because he had been a prominent Nazi. Sieger Hahn, Wagner's foster son, says Wagner was killed because he was an obstacle to the purchase of land from the Germans. With the killing of two more Templers by members of the Haganah Jewish fighting force in 1948, the British authorities evacuated almost all the remaining members to an internment camp in Cyprus. The last group of about 20-30 elderly and infirm people was given shelter in the Sisters of St Charles Borromeo convent in Jerusalem, but in 1949 some of them too were ordered to leave the country - now the State of Israel - accused of having belonged to the Nazi party. The last Templers left in April 1950. Posted by Muhammad Ali Khan at 11:34 The existence of a second Prisoner X being held in top-secret conditions in an Israeli jail has prompted comments in the Israeli parliament and media. The case was revealed in legal documents released this week concerning the original Prisoner X , an Australian-Israeli who hanged himself in his prison cell in 2010. He has been identified as Ben Zygier, a disgraced Mossad spy. The second prisoner is also said to involve a member of security services. The Knesset's chairman of the Committee on Defence and Foreign Affairs, Avigdor Lieberman, told parliamentarians the case was extremely serious but insisted Israeli prisoners' rights were protected. Media reports say that the detainee has been kept at Ayalon Prison, near Tel Aviv for many years. Even the guards do not know his identity. The windowless high security cell where the man is kept neighbours one where Mr Zygier killed himself. Well-known lawyer Avigdor Feldman, who visited the first Prisoner X and specialises in security cases, said that the second prisoner faced allegations that were worse than Ben Zygier's case . Without getting into details, [they are] much more grave, much more sensational, much more amazing, much more riveting, Mr Feldman told Tel Aviv radio station 103 FM. He said only that the individual was a Jewish male who had worked for the security services. Mystery remains The strange circumstances of the arrest and detention of Mr Zygier were revealed in Australian news reports in February. They had been subject to reporting restrictions in Israel which have since been eased. Israeli officials have never published the charges in the case but say the prisoner had jeopardised national security and agreed to being held in isolation while he prepared his defence. Photographs and details of Ben Zygier made the front pages of Australia's newspapers on 14/2/13 Details about Prisoner X were revealed in the Australian media The Australian Broadcasting Corporation, which broke the original story about Mr Zygier, said he was arrested after unwittingly sabotaging a top secret spy operation aimed at bringing home the bodies of Israeli soldiers missing in Lebanon. When the case was first in the headlines, Israel's Internal Security Minister, Yitzhak Aharonovitch, said that there were no other hidden prisoners. This week the minister said he stood by those comments as arrests were reported and handled by the prosecution and courts in accordance with the law. However, he admitted there were some cases that remained confidential for national security reasons. On Monday, the Justice Ministry published a document on the first Prisoner X case which included a reference to the second, unidentified prisoner. The Israeli newspaper, Haaretz, cited court documents saying he had been convicted without giving information about his crime. Posted by Muhammad Ali Khan at 11:29 They are Scotland's most notorious bloodsucking pests, but the Mountaineering Council of Scotland is highlighting the benefits of midges and ticks. Swatted, warded off with smelly repellent or twisted out with tweezers from where they have burrowed into skin, midges and ticks usually get short shrift by people they encounter. Midge bites can cause irritating red itchy sores while those of ticks can result in serious, long-lasting medical problems. But to raise greater awareness of the health risks the latter can pose to human health, the Mountaineering Council of Scotland MCofS has explored the positive benefits of the tiny pests. The pros include their importance as a food source for wild birds. Heather Morning, mountain safety advisor at the MCofS, said there was a serious message behind compiling the list. Continue reading the main story Midge versus tick According to the MCofS the pests do have some positive benefits Midges: Food for pipistrelle bats, birds such as warblers and swifts and insect-eating plants sundew and butterwort. Protect wild landscapes by putting people off from visiting the areas Ticks: Food for birds. Used by scientists as an indicator of the health of habitats - fewer ticks mean fewer numbers of mammals they feed on. Ticks also play a role in killing off weak and older animals Winner? MCofS say it is up to people to decide Ms Morning said: Tick bites are linked to an alarming rise in cases of Lyme disease, which can have serious long-term effects on people's lives. The disease is a bacterial infection that is spread to humans by infected ticks. Flu-like symptoms and fatigue are often the first noticeable signs of infection. Diagnosed cases of Lyme disease can be treated with antibiotics, but if left untreated neurological problems and joint pain can develop months or years later. Earlier this year, a group called Worldwide Lyme Protest UK urged for more medical professionals to be given the skills to diagnose and treat the infection. Nicola Seal, from Aberdeen, who co-ordinated a protest in May, said it was poorly understood, leaving thousands of patients without the appropriate treatment. Official estimates put the number of new UK cases each year at around 3,000, but Lyme disease charities say the figure could be as high as 15,000 annually because so many people do not have their condition diagnosed. Key ingredient Tourists put off returning to Scotland after being repeatedly bitten by the tiny biting midge are estimated to cost the tourism industry ?286m a year, according to expert Dr Alison Blackwell. In 2009, two men cycling from Land's End to John O'Groats in their underwear for charity were badly bitten by midges shortly after reaching the Highlands. Adam Dunn and Gavin Topley, from Branksome, near Bournemouth, had taken no other clothes, money, food or insect repellent for their journey. They relied on offers of free accommodation and meals. Also in 2009 a woman on Skye told how she was using midges as a key ingredient in food for wild birds. Elaine Bunce added the biting insect to beef dripping and flour to create her Original Highland Midge Bites. She advertised in a local newspaper for people to send her expired insects collected from midge killing machines, as it takes a thousand for each ball. Posted by Muhammad Ali Khan at 11:27 Edward Snowden re-emerges for Moscow airport meeting Edward Snowden re-emerges for Moscow airport meeting Steve Rosenberg was watching the media circus at Sheremetyevo airport as Edward Snowden made his first appearance in three weeks Fugitive US intelligence leaker Edward Snowden has met human rights groups and lawyers at a Moscow airport, in his first appearance in three weeks. In a statement, Mr Snowden said he was seeking asylum in Russia because he was unable to travel to Latin America, where Venezuela had granted him asylum. He had dropped an earlier Russian application after Moscow said he could stay only if he stopped the US leaks. The Kremlin reiterated its condition on Friday. Mr Snowden could hypothetically stay in Russia if he first, completely stops the activities harming our American partners and US-Russian relations and, second, if he asks for this himself, President Vladimir Putin's spokesman Dmitry Peskov said. Continue reading the main story At the scene Olga Ivshina BBC Russian Service, Moscow He exists - the first words of lawyer Genri Reznik, when he spoke to journalists after the meeting. And no-one laughed at the phrase, because no-one had actually seen Edward Snowden in several weeks. Mr Reznik joked that he even touched the former CIA contractor to make sure he was alive. Russian MP Vyacheslav Nikonov remarked that Mr Snowden was nervous and did not joke, but looked quite resolute and even handsome. He looked as if he was not fed very well, but he's got a perfect haircut, said Mr Nikonov. All human rights activists who participated in the meeting said they thought Mr Snowden had quite a good chance of being granted political asylum in Russia. Almost all stated their readiness to help him get asylum, or in court, if he asks for that. US President Barack Obama is due to have a telephone conversation with Mr Putin later on Friday. White House spokesman Jay Carney said the phone call had been scheduled for several days, Reuters reported. Russian lawmaker Vyacheslav Nikonov, who attended the meeting at Sheremetyevo airport, said Mr Snowden had not specified whether he was seeking temporary or permanent asylum. He said that he needs asylum in Russia to freely move around, Mr Nikonov said. It suits him perfectly well staying in the airport because everything is fine here. The only thing he wants is to be given freedom of movement. Mr Snowden is wanted by the US on charges of leaking secrets about US surveillance schemes. The former CIA contractor has been stuck in transit since arriving in Moscow from Hong Kong on 23 June. He is unable to leave the transit zone without asylum documents, a valid passport or a Russian visa, none of which he reportedly has. The American has sent requests for political asylum to at least 21 countries, most of which have turned down his request. However, Bolivia, Nicaragua and Venezuela have indicated they could take him in. But some European countries are likely to close their airspace to any plane suspected of carrying the fugitive. 'Unlawful campaign' On Friday, Mr Snowden said he formally accepted all offers of support or asylum he had already received and all others that may be offered in the future . But he added that the US and some European countries had demonstrated a willingness to act outside the law . Russian lawmaker Vyacheslav Nikonov described Mr Snowden as a hot potato This unlawful threat makes it impossible for me to travel to Latin America and enjoy the asylum granted there in accordance with our shared rights, Mr Snowden said in a statement released on the Wikileaks website. He also asked the rights groups and lawyers present at the airport meeting to assist him in requesting guarantees of safe passage from the relevant nations in securing my travel to Latin America, as well as requesting asylum in Russia . Continue reading the main story Snowden leaks timeline 5 June: First leak published in the Guardian saying the National Security Agency NSA is collecting the telephone records of millions of people in the US 6 June: Details of the US Prism internet surveillance programme published by the Guardian and Washington Post 9 June: Guardian identifies Edward Snowden as the source of the leaks, at his own request, and says he has been in Hong Kong since 20 May 14 June: US files criminal charges against Mr Snowden 23 June: Mr Snowden leaves Hong Kong for Moscow, Ecuador confirms he has applied for political asylum 2 July: Bolivian leader Evo Morales' plane is diverted to Vienna and apparently searched for Mr Snowden 6 July: Bolivia, Venezuela and Nicaragua say they would offer Mr Snowden asylum Who is Edward Snowden? Where will Snowden end up? Microsoft's work with NSA revealed Mr Snowden had invited around 10 activists, including Sergei Nikitin, the head of Amnesty International's Russia office, prominent Moscow lawyer Genri Reznik and Russia's presidential human rights ombudsman, Vladimir Lukin. Mr Lukin was later quoted by Interfax news agency as saying Mr Snowden should be given refugee status instead of political asylum in Russia. It would be better if the UN or Red Cross did it, he said. Last month, Mr Snowden had already tried to apply for Russian asylum but President Putin said at the time he would only be welcome if he stopped his work aimed at inflicting damage on our American partners . A large press scrum had gathered at the airport ahead of Friday's meeting, which was closed to journalists. Ms Lokshina released a photo showing Mr Snowden at the talks. The fugitive, who is reportedly staying at the airport's Capsule Hotel, had not been seen in public in nearly three weeks. He had sent his meeting request via an email message, which instructed those attending to bring a copy of the invitation and identification papers because of tight security. Act of espionage' Also on Friday, members of the Mercosur, the South American trade bloc, were gathering in the Uruguayan capital of Montevideo to discuss allegations of US spying over Latin American governments. Continue reading the main story Art installation of an eye in Berlin Q&A: Prism internet surveillance What could 'they' know about me? Brazilian President Dilma Rousseff told reporters that any act of espionage that violates human rights deserves to be condemned by any country that calls itself democratic . Argentina, Brazil, Uruguay and Venezuela were also expected to give a joint statement condemning European countries for closing their airspace to Bolivian president Evo Morales on his way back from Moscow last week. His plane was forced to land in Austria after France, Portugal, Italy and Spain barred it from flying through their airspace - apparently because of suspicions that Mr Snowden was on board. Mr Snowden's leaking of thousands of classified US intelligence documents have led to revelations that the National Security Agency is systematically seizing vast amounts of phone and web data. They have also indicated that both the UK and French intelligence agencies allegedly run similarly vast data collection operations, and the US has been eavesdropping on official EU communications. Posted by Muhammad Ali Khan at 11:24 Greece's life-saving austerity medics Greece's life-saving austerity medics The Greek health system is buckling under the strain of massive budget cuts, an expanding client list and worsening public health. A network of volunteer-run health clinics has emerged to help ease the burden. Giorgos Vichas is not someone with time on his hands. Middle-aged, with a head of thick black hair flecked with grey, he has a look of alert determination - but for a moment his gaze becomes wistful. When I was studying to become a doctor what I really wanted to do was travel to places that needed voluntary workers, he says. In the end, he was able to fulfil that ambition without getting on a plane. Eighteen months ago Dr Vichas co-founded the Metropolitan Community Clinic at Helliniko in Athens, for Greeks who found themselves in need without health insurance. The crisis in Greece has caused a humanitarian crisis in terms of the health sector. I never imagined we would have to set up social clinics and work on a voluntary basis, he says. Like many European countries, Greek citizens pay for their healthcare by a system of insurance, with contributions from employers, the state and the beneficiaries themselves. When someone loses their job, they lose their healthcare plan too. Continue reading the main story Find out more A pharmacisit looks for a prescription drug at her pharmacy in Athens Greece - In Sickness and in Debt, presented by Zeinab Badawi, is a documentary for Assignment on the BBC World Service, and Our World on the BBC News Channel Assignment Our World Download the documentary podcast The state gives them a short period of grace, but then they're on their own and have to stump up the cash for drugs and treatment. When the troika of the European Commission, the IMF and the European Central Bank agreed a 240bn-euro rescue package for Greece in 2011 the condition was that the Greek government should make tax system improvements, cut the public sector workforce and lower public spending to reduce its debt burden. What nobody had really properly considered is the impact of the austerity measures - in particular the detrimental effect on that most vital of public services: health care. There are now around 40 community clinics operating across Greece. Dr Vichas's clinic has 9,500 patients on the books but with a nationwide unemployment increase of 20% since last year 215,735 people the number of people flocking to the Helliniko clinic is growing fast. People come to get treatment and drugs. Stamatis Govostis, a dignified, neatly turned-out man in his late fifties, is in no doubt what would happen to him if it weren't for Dr Vichas and his team of volunteers. That's easy, he says - his eyes watering with emotion. I would be dead. He says he feels like an old workhorse who, after working all his life as a waiter, is simply being left to suffer and die. Dr Vichas says his clinic is the only place in the city where cancer patients can get free chemotherapy. They are also providing 200 families with milk formula for their babies. The municipality provides the premises for the clinic, on a disused American military base, and pays the overheads. But the medical professionals - which include paediatricians, gynaecologists and cardiologists - work there for nothing. All the drugs are donated by individuals and pharmaceutical companies. They enter the clinic by the plastic bagful, higgledy piggledy, to be processed by a team of volunteers led by pharmacists. They sort them, date them, label them and store them. Individuals and companies donate drugs to the clinic What we're really proud of is this - it's a bit ugly, but it's our storeroom, says Martha Frangiadakis, one of the volunteers. She started to help at the clinic after seeing fellow Athenians suffering day after day on the streets and on TV. You sit in your living room and drink your coffee and say, 'Oh my, people are having such problems!' And you feel terrible. And ok, I come and sort meds once a week - big deal. But it's something. If the clinic finds itself particularly short of a medicine, it posts a request on its blog. But if the clinic's storeroom can't supply a patient with what he or she needs, it's not uncommon for volunteers to walk with them to a pharmacy and pay for it out of their own pocket. The clinic's pride and joy: the storeroom full of the sorted medicines Katerina Dolianiti and Alexandros Zaganas recently came to the Helliniko clinic in desperation. Their seven year-old son, Christos, had been diagnosed with angioneurotic edema of the larynx. The pair knew immediately what this meant, since Alexandros has the same rare disorder. Continue reading the main story Previously in the Magazine The hospital asked us for a lot of money... the man at the administration office told us we had to pay the whole amount or they would not let the baby leave the hospital with me. Anna Greek hospitals tighten payment rules They knew that Christos would be prone to sudden and dramatic swelling that would move rapidly along his body. If the swelling reached his stomach it would be excruciatingly painful - if it reached his face or neck, it would be life-threatening. For this reason, Christos would always have to have with him a syringe filled with a strong anti-inflammatory. Each syringe costs 600 euros ?520 , and Christos might need two or three a month. The family used to own a caf? and a bar, but both businesses closed during the recession. Now, Katerina and Alexandros are unemployed, like 27% of the working-age population - the highest rate in the EU. Every time we go to the hospital they won't see us, says Katerina. Because we don't have insurance, we can't get the injection. If it's urgent and he needs the injection, sometimes I have to lie and say that I am insured. I don't like doing this but I have to. Katerina has previous unpaid medical bills of her own, but there is no hiding from the system and they will eventually be added to her tax bill. She is so worried for her son that she checks on him every 10 minutes or so and won't let him play with his brothers - but she is also worried that her unpaid tax bill could land her in jail. Christos Zaganas should always have a syringe of anti-inflammatory with him Thank God that these community clinics are now operating and these doctors are helping - otherwise there would be no way of getting treatment, she says. People are dying - people do not have insurance and they can't get into hospitals. Dr Vichas is now acting as an intermediary between the family and a local hospital: he is trying to get to supply anti-inflammatories for free. His clinic has a track record of applying pressure on behalf of patients with complex or serious problems. He recently succeeded in getting the state to waive a 6,000 euro ?5,200 fee for a cancer operation on a patient he had referred himself. Dr Vichas has described Athens' volunteer medics as a Robin Hood network The Evangelismos General Hospital in central Athens is one of the largest in Greece. They have felt the pain of the 23% cut in the Greek health budget - last year, their budget was 103 million euros ?90m , down from 150 million euros ?130m in 2009. The CEO of the hospital, Michail Theodorou, runs a tight ship. He says that the hospital has been able to make efficiency savings, and the quality of service to patients has not suffered. One of his senior doctors is more forthright and frank: Ilias Sioras, a cardiologist and staff representative at the hospital with 25 years' experience, says that the staff are struggling, with nurses sometimes scheduled to work for three weeks without a day off. Dr Sioras adds that some doctors don't follow the law and ask for all the patients' insurance details. Every day I break the law, he says. I never ask for insurance for any patient. He gives patients diagnostic tests for free, and says that as yet, no doctor has been punished for bending these rules. The Greek health service has been hit by multiple blows since the country's economy was thrown into turmoil. As well as the budget cuts and the care needs of patients without insurance, there has been a migration into the state-sponsored insurance scheme of citizens who had previously paid for private healthcare. Continue reading the main story Is a sick economy making people sick? A new book by David Stuckler and Sanjay Basu makes the case that between January and May 2011 there was a 52% rise in the incidence of HIV infection in Greece following government cuts to prevention programmes They also claim that homelessness has gone up by 25% and homicides doubled between 2010 and 2011 Cuts to spraying programmes have led to the re-emergence of West Nile virus and malaria - Medecins Sans Frontieres told the BBC that if a further three cases of locally-caught malaria are recorded in the Lakonia region this year, Greece will reappear on the list of countries where the disease is endemic Aris Violatzis, a clinical psychologist working for the Klimaka NGO, says that on the island of Crete, the suicide rate increased by 80% between 2010 and 2012 Dr Panos Eustathiou from the Ministry of Health agrees that Greece and the Greek health service are facing difficulties, however he insists that no-one - including non-Greek citizens and Greeks without insurance - is being turned away from hospitals. Health services continue to be provided to all Greeks, he says. He also denies that the emergence of community clinics is a sign that the health service is collapsing. These are signs of a society operating in austerity and difficulty, he says. These are positive signs for a civilisation and society - not signs of disintegration. At the Hellinikon clinic in Athens, Dr Vichas does not see it that way. He says that the government have disregarded their patients, although like many Greeks, he feels they are not ultimately to blame. We are sure the troika are aware of what is going on, he says. It is the troika who are manufacturing these policies. He says that his team cannot continue firefighting the city's health problems forever. He is especially worried about poor children falling behind with their vaccinations and malnutrition among babies with insufficient supply to milk powder. You could compare our situation to the story of Hydra and Hercules, he says. When you cut off the head, and you feel like you have achieved something, another four or five grow. Posted by Muhammad Ali Khan at 11:21 Gene therapy trial 'cures children' Gene therapy trial 'cures children' A disease which robs children of the ability to walk and talk has been cured by pioneering gene therapy to correct errors in their DNA, say doctors. The study, in the journal Science, showed the three patients were now going to school. A second study published at the same time has shown a similar therapy reversing a severe genetic disease affecting the immune system. Gene therapy researchers said it was a really exciting development. Both diseases are caused by errors in the patient's genetic code - the manual for building and running their bodies. Decline Babies born with metachromatic leukodystrophy appear healthy, but their development starts to reverse between the ages of one and two as part of their brain is destroyed. Wiskott-Aldrich syndrome leads to a defective immune system. It makes patients more susceptible to infections, cancers and the immune system can also attack other parts of the body. The technique, developed by a team of researchers at the San Raffaele Scientific Institute in Milan, Italy, used a genetically modified virus to correct the damaging mutations in a patient's genes. Continue reading the main story Analysis The hype around gene therapy was huge - nipping into the genome and tweaking a bit of DNA was supposed to change medicine. However, it failed to meet expectations - there was a death in one trial and other patients developed leukaemia. It turned out that introducing the new genes could activate cancer genes. The potential was there - but safety was a massive concern. There has been years of research to come up with safer options. It took until 2012 for the first gene therapy to be approved in Europe. But there is now growing optimism that other therapies will follow. Europe backs first gene therapy Bone marrow stem cells are taken from the patient then the virus is used to 'infect' the cells with tiny snippets of DNA which contain the correct instructions. These are then put back into the patient. Three children were picked for treatment from families with a history of metachromatic leukodystrophy, but before their brain function started to decline. Dr Alessandra Biffi told the BBC: The outcome has been very positive, they're all in very good condition, with a normal life and going to kindergarten at an age when their siblings were unable to talk. It is something which is very pleasing to us. 'New era' She said that all treatments had side effects and these patients needed to be followed for longer, but the evidence so far suggested the treatment was safe. Gene therapy is a field that has promised far more than it has delivered and has been hampered by serious concerns about safety. Dr Biffi said lessons had been learnt from previous failings: Experience showed that gene therapy could be improved and we could be at the starting point for a new era to achieve more than we did in the past. In the other study, published simultaneously in the journal Science, symptoms such as repeat infections and eczema had lessened in the three patients treated. Prof Bobby Gaspar, from Great Ormond Street Hospital in London is working on a Medical Research Council trial using gene therapy as a treatment for adenosine deaminase deficiency - which also leads to immune problems. He told the BBC News website: This is really exciting. Metachromatic leukodystrophy is a very significant neural degeneration which cannot be cured in any other way and now the study shows they can live relatively normal lives. It raises the prospect that other diseases can be treated in the same way. Prof Luigi Naldini, who leads the San Raffaele Telethon Institute for Gene Therapy, said: Three years after the start of the clinical trial the results obtained from the first six patients are very encouraging. The therapy is not only safe, but also effective and able to change the clinical history of these severe diseases. After 15 years of effort and our successes in the laboratory, but frustration as well, it's really exciting to be able to give a concrete solution to the first patients. Gang violence cause of high levels of mental disorders Young men in gangs are significantly more likely to suffer from a mental disorder and need psychiatric help than other young men, says a UK study. It surveyed 108 gang members and found that half had an anxiety disorder, more than 85% a personality disorder and 25% screened positive for psychosis. Exposure to violence was the likely cause of their mental health problems, it said. Experts said opportunities to help young people were often missed. The research team from Queen Mary, University of London, started by surveying 4,664 men aged between 18 and 34 in Britain. Researchers included significant numbers of men from areas of the country with high gang memberships, such as Hackney and Glasgow East, from areas with high ethnic minority populations and areas of social deprivation. Continue reading the main story ?Start Quote One vulnerability leads to another. The earlier they are dealt with the better.? Andy Bell Centre for Mental Health From the total sample, 3,284 said they had not been violent in the past five years, 1,272 said they had assaulted another person or been involved in a fight and 108 said they were currently in a gang. Cycle of violence The gang members and the violent men were found to be particularly prone to mental disorders and more likely to access psychiatric services. Prof Jeremy Coid, lead study author and director of the forensic psychiatry research unit at Queen Mary, University of London, explained the likely cause. It is probable that, among gang members, high levels of anxiety disorder and psychosis were explained by post-traumatic stress disorder PTSD , the most frequent psychiatric outcome of exposure to violence. He said the fear of future violence and victimisation led young men to experience extreme anxiety. The study, published in the American Journal of Psychiatry, said: Readiness to retaliate violently if disrespected, excitement from violence, and short-term benefits from instrumental violence lead to further cycles of violence and risk of violent victimisation. The study also found that, of the 108 gang members surveyed, around a third had attempted suicide. The authors said this could be linked to the notion that impulsive violence may be directed both outward and inward . However depression was significantly less common among gang members and violent men, the study found. Andy Bell, deputy chief executive of the Centre for Mental Health, said they had carried out their own research in this area and found very high rates of multiple health and social issues in both boys and girls in gangs. It is very clear they have numerous problems throughout their lives, often related to drug, alcohol problems and maltreatment at home - and they all contribute to poor mental health. One vulnerability leads to another. The earlier they are dealt with the better - but sadly opportunities are often missed. Street therapy Prof Coid agrees that healthcare professionals should be aware of gang membership when assessing young men with psychiatric illnesses in urban areas. The study reports that although just 1% of 18- to-34 year-old men in Britain are gang members, in areas such as Hackney this rises to around 8.6%. Yet the average age of gang membership can be as low as 15, it adds. MAC-UK, a charity based in Camden and Southwark, in London, targets the mental health needs of young people aged 16 to 25 involved in gangs and antisocial behaviour in a novel way. Dr Charlie Alcock, chief executive officer of the charity and a clinical psychologist, says youth offending is a public mental health issue which requires a different approach. We support young people by taking mental health on to the streets and working with them in a place which is convenient and comfortable for them. We believe one in three young people has an unmet mental health need, she says. These can range from stress and anxiety to hearing voices and more serious forms of psychosis. Chinese banking system stable, says regulator Chinese banking system stable, says regulator China's banking system is stable, despite ongoing fears of a credit crunch spooking financial markets, according to the country's top regulator. The issue with tight liquidity in the interbank market has started to ease, said the head of the China Banking Regulatory Commission, Shang Fulin. Fears over bad bank loans sent Chinese stocks to a four-and-a-half-year low last week. Global markets also fell sharply. Concern over bad loans in the economy led to a spike in interbank rates, which are the interest rates banks charge each other on a daily basis and a sign of how much faith that banks have in each other. For example, a spike in the London-based Libor benchmark lending rate preceded the start of the 2008 financial crisis as US and UK banks refused to lend each other as the scale of bad debts became apparent. Recently some foreign institutions and industry players showed concern about risk in areas including local government debts, Mr Shang said on Saturday. As long as we apply the right risk-management measures, these risks are controllable. Asset bubbles? China has been trying to impose more discipline on its banks amid fears of bad loans impacting on its economy. After the global financial crisis, Chinese banks - led by the state-owned institutions - lent out record sums of money in an attempt to help maintain China's rapid growth rate. There are fears that the availability of easy money may have created asset bubbles - especially in the property sector. And if China's growth slows fast, or if asset prices decline sharply, some borrowers may not be able to repay some of these loans. These days the issue with tight liquidity in the interbank market has started to ease, Mr Shang said. This situation will not affect the overall pattern of stable operations in the domestic banking sector. He added that Chinese financial institutions had excess reserves of 1.5 trillion yuan $244bn; ?160bn as of 28 June. On Friday, China's National Audit Office said that some state-owned banks had violated lending regulations, saying 28.4bn yuan of loans had been issued by some banks for projects without proper procedures or necessary guarantees. US banking giants see profits jump US banking giants see profits jump JP Morgan and Wells Fargo post big jump in profits JP Morgan Excluding the effect of last year's trading loss, net revenues were largely unchanged from a year ago JP Morgan has recorded a profit of $6.5bn ?4.3bn for the second quarter of 2013, up 31% from a year ago. JP Morgan's steep rise in profits was flattered by the heavy losses controversially incurred by the US banking giant's chief investment office last year. Dubbed the London whale , trader Bruno Iksil ran up $6.2bn in losses in total. Separately, Wells Fargo reported a 20% rise in quarterly profits to $5.27bn as it set aside less money for bad loans. 'Strong performance' Net revenues at JP Morgan's large retail bank were slightly down from a year ago, but rose 10% at its investment bank, and also rose at its asset management unit. JP Morgan is the first of the big US banks to report results. As the US's biggest bank by assets, JP Morgan is looked at as a bellwether for the health of banking industry. The figures are the first the bank has posted since chairman and chief executive Jamie Dimon overwhelmingly won a shareholder referendum in May on whether he should hold both posts. He said in a statement that the results showed a strong performance across our businesses . The US economy was showing broad-based signs of recovery, but consumers and small businesses remained cautious, he said. The strength of the US economy is a key issue, with all eyes on when the US Federal Reserve will end its massive bond buying programme. Questions about when the Federal Reserve might tighten policy have worried markets since the end of May, when chairman Ben Bernanke first hinted at the end of the programme. I think most banks are concerned with near record surges in currency and interest rate volatility, Larry McDonald, senior director at Newedge USA, told the BBC. That's the big concern right now - much more than the London whale in the past. Housing impact Wells Fargo, the biggest US mortgage lender, saw profits rise from $4.4bn to $5.27bn on revenue that barely changed at $21.4bn. Provision for bad loans fell 64% to $652m. The consumer loss levels have improved rapidly due primarily to the positive momentum in the residential real estate market, with home prices improving faster and in more markets than expected, said Wells Fargo's chief risk officer Mike Loughlin. Analysts had been watching for the bank's results to see how higher interest rates - and a potential slowdown in loans - were affecting business. Mortgage rates have been on the rise since May, and 30-year rates reached a two year high on Thursday. While revenues were flat, mortgage applications rose 4.2% compared with the first quarter of 2013 - suggesting that higher rates and the prospect of the Fed winding down its stimulus programme were not affecting consumer demand. Will Egypt's post-Morsi era be safer for women? Sex attacks in Cairo's Tahrir Square have become a grim feature of the site synonymous with protests, but could the political changes make a difference to the treatment of women? A roped off section of staircase creates a safe passage for women as they exit the metro in Cairo's Tahrir Square during protests. But it is not manned by transport security, or the police. It is male volunteers, who cordon off a pathway so that women can get into the square without being pressed upon by the men already outside. These volunteers are protecting women against minor incidents of sexual harassment: touching and groping. But brutal attacks continue to take place. Hassan Nassar, a 22-year-old youth activist, spent much of last week's protests working to protect women in Tahrir Square. He spent some time bringing women out of the metro, and other times patrolling the area. Continue reading the main story ?Start Quote Hassan Nassar Harassment has nothing to do with the Brotherhood because it's always been around? Hassan Nassar Youth activist Women who have been victims of assault, and witnesses too, report a similar sequence of events. They say a group of men isolates the woman, then other men on the outside tell onlookers they are trying to help someone in distress. We go into the middle of crowds to get the girls out and take them to a car to get away, Mr Nassar says. I do it because this doesn't belong in our society. You can imagine it's your sister or your mum and you have to help. Sexual assaults during protests in Tahrir Square, in particular since the mass protests against a power-grabbing constitutional declaration in November 2012, have become so frequent that activist groups have formed to take action against them. One of the groups is Operation Anti-Sexual Harassment and Assault. Their volunteers alone helped more than 150 women following incidents of physical sexual harassment, including three rapes, between 30 June and 3 July 2013. Maryam Kirollos, a member of Operation Anti-Sexual Harassment and Assault, blamed the Morsi government's inaction for the continual occurrence of these attacks. She told the BBC that people who went to Tahrir Square and did nothing to help were also at fault. 'Problem with society' Hanya Moheeb, a freelance journalist, was one of 19 women sexually attacked by mobs in Tahrir Square on 25 January 2013, the second anniversary of the revolution that toppled former President Hosni Mubarak. She believes the issue of violence against women became worse under the rule of the Muslim Brotherhood, to which the ousted President Mohammed Morsi belongs, because they view women as tools of sex . This became the official stance of institutions, she says. Continue reading the main story ?Start Quote The Brotherhood wanted to go back 100 years in women's rights, it was a catastrophe? Omneya Talaat Women's rights activist But following the military's announcement to remove President Morsi from office, she is feeling optimistic. If things go fine for the opposition, I think it will be a big step for support of women's rights. The Muslim Brotherhood, however, says the issue of violence against women is not of its doing. This culture does not respect women, says Hamza Zoba, a spokesperson for the Muslim Brotherhood's Freedom and Justice Party. Islamic culture respects women. This issue is not related to the government but to culture. It's up to society. NGOs should be protecting women. And it is not only the group's members who believe that. Some of their opponents do too. Harassment has nothing to do with the Brotherhood because it's always been around. It's a problem with society and a lack of security, Hassan Nassar says. But throughout the last 12 months of President Morsi's rule, the Brotherhood has come under fire for its women's rights policy. Continue reading the main story UN Women report 2013 UN women report PDF download A survey of experiences of sexual assault and harrassment in Egypt[738k] Most computers will open PDF documents automatically, but you may need Adobe Reader Download the reader here The group condemned a UN declaration calling for an end to violence against women, saying the declaration would lead to the complete disintegration of society . And women's rights groups reject the now suspended constitution, drawn up by a committee with a large Brotherhood contingent, saying it does not guarantee equality. Women are only mentioned in the context of the family. Omneya Talaat, a writer and women's rights activist, said she was shocked by the constitution that was finalised in December 2012. We would have been doomed, she says. The Brotherhood wanted to go back 100 years in women's rights, it was a catastrophe. But now any future for the Muslim Brotherhood's rule is looking increasingly precarious, she is more hopeful. I can't say I'm optimistic or pessimistic, but I'm very sure that respect for women's rights will happen, she says. [Without the Brotherhood] the law will be on women's side. 'Virginity tests' But there are other factors at play. Sexual assaults are not a new phenomenon in Egypt and sexual harassment is commonplace. Almost every woman in Egypt has experienced it, no matter their age, says Lamia, 24, who lives in a village east of Cairo. Continue reading the main story ?Start Quote Marina Alfred Mishreki My parents are less strict with my brother because he's a boy? Marina Alfred Mishreki Lamia believes politics won't change that. Our leaders are focused on political issues, she says. To develop we need education and we have to be good people. Egypt is a strongly patriarchal society and many also attribute the lack of action on violence against women to this. Marina Alfred Mishreki, 22, used to work night shifts in a call centre. I used to come back at 5am and the neighbours asked a lot of questions, she says. They might have thought I was a prostitute. There were sometimes men who accused me of that. She now has to be home by 10pm to keep her father happy. My parents are less strict with my brother because he's a boy, even though he's younger than me, she says. To some extent it's that my father is concerned for me, but it's more about showing his authority. There are taboos for women talking about sexual assaults. Many men blame women themselves, due to the clothes they wear or the fact they are in a certain place at a certain time. Women might also be accused of lying. In the 18-month period under the Supreme Council of the Armed Forces, between the election of Mohamed Morsi as president and the ousting of former President Hosni Mubarak, the authorities carried out so-called virginity tests ostensibly to prevent women lying about being raped. At least six women taking part in a sit-in in Tahrir Square in March 2011 were subject to these tests. The military confirmed to researchers from Human Rights Watch that all female detainees underwent these tests so they could not accuse guards of rape in prison. One of those women, Samira Ibrahim, filed a case against the military and the court ruled to make virginity tests illegal. But the army doctor accused of carrying out the examinations was acquitted in a military trial. The history of attacks on women at protests goes back to 2005, when women at an anti-government demonstration were groped and assaulted. But it is widely acknowledged that celebrations of public holidays are a time for women to be wary of attacks. During Eid festivities each year, women in downtown Cairo are targeted by groups of young men, and it is also common following football matches. But the opening up of society since the toppling of Mubarak has allowed the creation of dozens of anti-harassment groups. After the revolution, these groups flourished. Before that we were just individuals who wanted to do something, but now we're organised, says Hassan Nassar. He believes the only way to stamp it out is a dedicated security presence at large gatherings along with social awareness campaigns. But until then, he is ready to help in Tahrir Square. Deadly French train crash at Bretigny-sur-Orge Deadly French train crash at Bretigny-sur-Orge Seven people have been killed in a train crash at Bretigny-sur-Orge, south of the French capital Paris, officials say. The intercity train had just left Paris and was heading towards Limoges when it derailed, crashing into a station platform at about 17:00 16:00 GMT . Passengers were said to be trapped inside the train and a local official said there were many casualties . Interior Minister Manuel Valls said seven people died and dozens were hurt. Map It was a constantly evolving situation, he told reporters. Bretigny mayor and local MP Michel Pouzol said four of the carriages were lying wrecked on the station platform. He said the emergency services were responding to a red alert , put into action when many casualties are expected. A police source told the AFP news agency the train had crashed at high speed and split in two - part of it continued along the track while the other section rolled onto its side. The cause of the crash is as yet unclear. Other media reports spoke of passengers being electrocuted and crushed. Guillaume Pepy, president of the French rail company SNCF, said it was a catastrophe . The company said 385 passengers were on board when it crashed. French routes were particularly busy at the time of the crash due to the run-up to a holiday weekend marking Sunday's Bastille Day. Are you in the area? Have you been affected? Send us your comments using the form below. Flight have resumed at London's Heathrow Airport after a fire on a parked Ethiopian Airlines Boeing 787 Dreamliner jet. All runways were closed for nearly 90 minutes after the fire at 16:30 BST. No passengers were aboard the plane at the time, a Heathrow spokesman said. Fifty Dreamliners worldwide were grounded in January after malfunctions with the plane's lithium-ion batteries. Boeing modified the jets with new batteries and flights resumed in April. The Ethiopian Airlines Dreamliner in the Heathrow incident - named the Queen of Sheba - flew from Addis Ababa to Nairobi on the first commercial flight since the grounding. Pictures of the Heathrow fire showed the Queen of Sheba close to a building and surrounded by fire vehicles. London Fire Brigade said its crews assisted Heathrow staff. Fire-retardant foam appeared to have been sprayed at the airliner, but no damage was immediately apparent. Production difficulties Cannot play media. You do not have the correct version of the flash player. Download the correct version Aerial pictures show the plane surrounded by emergency crews A Heathrow spokesman said: Heathrow's runways are now fully open following an earlier fire on board an Ethiopian Airlines aircraft which the airport's emergency services attended. The aircraft was parked on a remote parking stand and there were no passengers on board. Arrivals and departures were temporarily suspended while airport fire crews attended to this incident. This is a standard procedure if fire crews are occupied with an incident. Heathrow reopened shortly before 18:00 BST but was advising passengers to check the status of their flights with the airlines. Gatwick Airport said it was experiencing minor delays on departing flights as it assisted Heathrow with flights that were diverted. Meanwhile, Thomson Airways said one of its Dreamliners travelling to Florida returned to Manchester Airport as a precautionary measure, not connected to the Heathrow fire. Thomson, which became the first British carrier to operate the aircraft earlier this week, and is taking delivery of eight of the planes, said the plane had experienced a technical issue . British Airways is due to take delivery of the first two of its 24 Dreamliners. Virgin Atlantic said it remains committed to taking on the first of its 16 Dreamliners in September 2014. The battery problems followed production difficulties for the Dreamliner, marketed as a quiet, fuel-efficient aircraft carrying between 201 and 290 passengers on medium-range routes. Continue reading the main story Dreamliner troubles Boeing 'may never find 787 fault' Dreamliner: The modern aircraft plagued with problems New batteries give Dreamliner take-off It was due to enter passenger service in 2008 but it was not until October 2011 that the first commercial flight was operated by Japan's All Nippon Airways. The groundings of all Dreamliners in service in January followed two major incidents concerning the plane's two lithium-ion batteries. On 7 January, a battery overheated and started a fire on a Japan Airlines 787 at Boston's Logan International Airport. Nine days later, an All Nippon Airways 787 had to make an emergency landing in Japan after a battery started to give off smoke. The two batteries are not used when the 787 is in flight. They are operational when the plane is on the ground and its engines are not turned on, and are used to power the aircraft's brakes and lights. In addition to new versions of the batteries which run at a much cooler temperature, they are now enclosed in stainless steel boxes. Boeing shares fell more than 6% on the New York Stock Exchange on news of the fire. A Boeing spokesman said: We're aware of the event. We have Boeing personnel on the ground at Heathrow and are working to fully understand and address this. Wednesday, 3 July 2013 ? ? Sachin Tandolkar Best Style ? ? Newer Posts Older Posts Home Subscribe to: Posts Atom Watermark template. Powered by Blogger.