Here are the possibilities for the Jodi Arias case as I see fit.? The graphic to the right, if you enlarge it click it , really breaks things down in simplest terms. I also give my own opinion for each one, and which possibilities I feel are likely. We?ll start with the most severe and most obvious one, M1, which, by now, unless you use HLN as your ?news source? when it?s an op-ed tabloid channel, you know is off the table. Read and don?t forget to opine in the comments below! [dropshadowbox]Murder 1[/dropshadowbox] Not a chance.? Take that to the bank.? Premeditation was thrown out the door.? Look at the circumstantial evidence that Rock Star used.? There was no fake stolen gun that TA never owned.? In fact, cash, a DVD player, and a stereo were all stolen from a house that day.? Did Jodi plan on playing dance music too?? HLN doesn?t tell you this, but I will.? Many people buy gas cans before driving through the desert; that?s just a red herring.? If she turned her license plate upside down in Arizona ? which would make her more noticeable ? how did she get through the Hoover Dam checkpoint?? More importantly, the physical evidence obviously points to a struggle.? Even if you believe all of Juan?s whacky stories, the physical evidence at the scene proves there was no premeditation ? clearly, and it?s not even close.?? And this isn?t to mention that Dr. Horn and Detective Flores lied about the crime scene themselves. [dropshadowbox]Murder 2 [/dropshadowbox] This sentence carries 10-23 years, which, to Sugar Sherry who is so sweet to prosecutors, most likely means 23 years in a high profile case.? Jodi would serve 19 of them.? Subtract 5 for time served.? So while serving 85% of the maximum penalty, with 5 years served already, she?ll be serving roughly 14 years in prison if Sugar Sherry sentences her to the maximum penalty.? This is a distinct possibility. This carries 7-21 years and involves crimes in the ?heat of passion?.?? Of course Juan will push it to the brim.? He?ll ask for all kinds of things to come in that weren?t presented in trial that were his opinion, Juan knows damn well that manslaughter is judicial suicide for him.?? If he decides to run for higher offices after losing this case, he?ll be laughed at.? But this was a heat of passion crime, and manslaughter could very well happen.? So Jodi will serve 85% of that, less 5 years time served, so will serve roughly 12 years in prison if Sugar Sherry sentences her to the maximum penalty. This is the right decision.? She?s guilty of nothing but defending herself against a violent con man.? But by Judge Sugar Sherry not sequestering the jury, and all of Rock Star?s courtroom violations, the jurors may feel compelled to convict Jodi of something after the Mormon media blitz.? Please don?t suggest that the jurors don?t watch HLN, read websites, and talk to others about the case.? If you believe that, then you believe a bear doesn?t shit in the woods.? Regardless, she?ll appeal any sentence handed down with no problem.? In this scenario, Jodi would go back to the Maricopa County Jail, pick up her belongings, process out, and go home after having served 5 years with her presumption of innocence. As I said, I?d like to know what you think.? Leave your comment s below.? But please don?t leave an ignorant Nancy disGrace HLN comment like ?she stabbed him 27 times and therefore she should receive the death penalty?.? I?d prefer educated comments ? if possible.