Edward Joseph Snowden is an American technical contractor who used to work for United States National Security Agency NSA . He is also a former employee of Central Intelligence Agency CIA . He is accused of leaking the details of the several top secrets of British and US government mass surveillance programs to the press. The American whistle-blower was in search of an asylum all around the world. However, Venezuela is believed to extend an offer to provide the fugitive with an asylum. Nicaragua and Bolivia are also in the list of the counties who want to offer him asylum. These counties have natural gas, billions of dollars in arms shipments and similar geopolitical agendas in common. So it can be easily believed that they are in a race to accept Snowden. Russia, being the traditional rival of Washington also seems keen in Snowden. This might provide a huge push back in the US backyard. The recent revelations from Snowden show the actual face of America from behind the mask. According to Snowden, America has tried to spy on other European allies repeatedly. This can give rise to a ferocious debate between the countries and eventually result in a cold war. Germany is particularly outraged with this revelation. These methods of spying redirect to the methods adopted by the enemies during a cold war. No European country is happy with the fact that the USA tries to spy into their secrets. The Ecuadorian President Rafael Correa has backed away from offering Snowden an asylum. He opined that Snowden has appeared to lose an escape route under the care of Russian authorities. However, he was doubtful about the possession of a passport with Snowden. He also expressed his dismay over the Russian laws. However, he agreed to his decision of reviewing the request of Snowden on providing asylum to him if he reports at an Ecuadorean Embassy. Russia?s influence on the world comes with the natural gas resources present there. US influence might be challenged by Russia at any point of time and this agenda has always been there as a reason of cold war between them. Snowden is considered to be the most dangerous person in American perspective as his statements may enrage the ally counties and disturb their relationships with the USA. However, the other countries have appreciated the mentality of Snowden who denounced the war plans and illegal activities of spying of the US government.