MOSCOW AFP ? Fugitive U.S. intelligence leaker Edward Snowden on Friday told rights activists he would seek asylum in Russia, in his first encounter with the outside world since becoming marooned at a Moscow airport three weeks ago. The meeting at Sheremetyevo airport with rights groups and lawyers appeared an attempt by Snowden to find a way out of an increasingly difficult situation as he seeks to escape U.S. espionage charges for leaking sensational details of widespread U.S. surveillance activities. Participants, including representatives of Human Rights Watch and Amnesty International, told reporters after the meeting that Snowden told them he wanted asylum in Russia since he could not fly out of the country without travel documents. They also said that the 30-year-old had vowed not to harm the United States, apparently in response to a key Kremlin condition that he stop leaking damaging information about Washington?s spy program. Snowden has been holed up at the airport?s transit zone since arriving on a flight from Hong Kong on June 23 before his U.S. passport was revoked. Human Rights Watch representative Tanya Lokshina told reporters agency that Snowden said ?he wants to stay here?. He has applied for asylum in 21 countries. Moscow said last week that Snowden had withdrawn his application for asylum in Russia after learning it was conditional on not harming U.S. interests. ?As far as I understand, he is seriously ready to obtain political asylum in Russia,? ruling party lawmaker Vyacheslav Nikonov, who also attended the meeting, told reporters. The Kremlin swiftly responded Snowden could stay in the country if he stops revealing confidential U.S. information, reiterating the position set out by President Vladimir Putin. ?Mr. Snowden could hypothetically stay in Russia if he: first, completely stops the activities harming our American partners and U.S.-Russian relations and second, if he asks for this himself,? Putin?s spokesman Dmitry Peskov said in comments quoted by Russian news agencies. The powerful speaker of the Russian lower house of parliament, Sergei Naryshkin, told state television that Russia should grant Snowden asylum, describing him as a ?defender of human rights?.