Several protesters were arrested this weekend when demonstrators expressed their anger at the acquittal of George Zimmerman in rallies across the nation, although most of the events were peaceful with marchers wearing hoodies, carrying signs and chanting Justice for Trayvon Martin. The largest rally took place Sunday night in New York City and lasted until early this morning. Thousands of marchers spontaneously moved through different Manhattan neighborhoods and shut down traffic from Union Square to Times Square. A group of the protesters made their way to the Bronx Criminal Courthouse near Yankee Stadium at around 3 a.m. The event started as a peaceful march, but protesters began to get rowdy, and police made a handful of arrests after bottles were thrown at officers, ABC News station WABC-TV reported. Slideshow: The George Zimmerman Case in Pictures The majority of protests throughout the country were peaceful after the emotionally charged verdict finding Zimmerman not guilty of murder in the 2012 slaying of Trayvon Martin. Police in Oakland, Calif., declared an unlawful assembly with reports of demonstrators' throwing rocks and bottles at police and even attacking journalists, according to ABC News Station KGO-TV. Police estimates put the crowd at about 200 people at its height Sunday. In Los Angeles, hundreds walked on Interstate 10 Sunday, causing police to close down a main artery for traffic for about minutes. At a nearby street corner a crowd threw rocks and batteries at officers, prompting them to fire beanbag rounds, Police Cmdr. Andrew Smith told ABC News station KABC-TV. Timeline of Events, From Trayvon Martin's Death Through Start of George Zimmerman's Trial Zimmerman, 29, was found not guilty in the death of Martin late Saturday night. Zimmerman was accused of second-degree murder for shooting Martin, 17, Feb. 26, 2012, in Sanford, Fla. He claimed self-defense. The trial's not guilty verdict has ignited a national debate that extends beyond Martin to issues of racism, profiling and equal justice. In Sanford, the Rev. Lowman Oliver at the Baptist Church urged people to speak out against the verdict. It is a righteous thing. It is that which is good and that which is evil. Now you choose which side you're going to be on, Oliver said Sunday. But if you sit still and do nothing, you have chose on the evil side. Get up from where you are and we got to get together and do something about it. Fists pumping, black and white, young and old, men and women came together at Washington, D.C.'s Malcolm X Park to honor Martin. Rally organizer Mike Stark led a crowd of hundreds, chanting, No justice, no peace. In what universe does it make any sense, could it be considered legal, to stalk, confront, and murder a completely innocent teenager? Stark asked a vocal, yet peaceful crowd. Dressed in Martin's symbolic hoodie, Asantewaa Nkrumah-Ture suggested a different approach: Ask all organizations, civil rights groups, sororities, fraternities, nonprofit groups, etc., to boycott the convention and tourism industry of the state of Florida, she said. If I can't get justice one way, I surely will get it another. About 200 people turned out for a rally and march in downtown Chicago, saying the verdict was symbolic of lingering racism in the United States. As a white person I hate to see this and to say, you know that make a generalization that racism is still strong, protester Billy Dodd said. Civil rights activist the Rev. Jesse Jackson said people need to keep the pressure on for justice. They'll be civil law suit filed that we should rally around, Jackson said. We can all urge the Department of Justice to rally around and they must. The Justice Department said it is looking into the case to determine whether federal prosecutors should file criminal civil rights charges now that Zimmerman has been acquitted in the state case. In Miami, more than 200 people gathered for a vigil. You can't justify murder, one poster said. Another read, Don't worry about more riots. Worry about more Zimmermans. ABC News' Betsy Klein, ABC News Radio and The Associated Press contributed to this report.