As the trial of George Zimmerman winds down, the Orlando police are reportedly bracing for possible riots in the event that the defendant walks. The Broward County Sheriff?s Office release two public service announcements urging people to ?raise their voice, not their hands? if they are unhappy with the verdict. Meanwhile, church leaders, who have been given seats at the trial,?have pledged to use their influence in the community to quell any violence. Given the way law enforcement delayed over Trayvon Martin?s fatal shooting?it was 46 days before George Zimmerman was arrested?there is cause for concern. It was a groundswell of protest from the black community that brought the shooting to the nation?s attention?remember the One Million Hoodie March? This case has sparked a movement?in defense of young black men and in opposition to Stand Your Ground law. But the pre-emptive call for calm runs counter to recent history, and may be akin to racial fear mongering. The last major racial riot occurred in Los Angeles after four police officers were acquitted in the brutal beating of Rodney King. That was 21 years ago. Since then, there have been several other racially-charged cases that might have provoked an outpouring of protest but did not.?The police officers who murdered Sean Bell in a hail of 50 bullets were acquitted in 2008, and no riots ensued. The indictment of the officer that shot and killed Bronx teenager Ramarley Graham was tossed out earlier this year, even with?footage?of the police following him into his Bronx home. His mother didn?t call for riots. She?made t-shirts to protest. In some ways, the calls for order recapitulate what this case is all about?the assumption of violence on the part of the black community, and of black men. No one seems to be concerned about the possible violence of Zimmerman supporters?if Zimmerman is convicted. To try to preemptively deter the black community from taking matters into their own hands should they feel justice has not been done is ironic considering that Zimmerman?s actions themselves were a kind of vigilanteeism?a violence above and beyond what many, including the prosecution and Martin?s family, feel was necessary. If Zimmerman is acquitted, people will be upset, but they will find other avenues to show their dissatisfaction. The black community has become more sophisticated in protesting injustice, and there is talk already of using economic boycotts and other means that are more effective than upheavals that would only result in heavier police repression. Should Zimmerman walk, the response will be long-term and focused on ending Stand Your Ground so that this cannot happen again. After all, this case probably would not even have come to trial without the sustained outpouring of protest?all of it non-violent. Polite is an award-winning blogger and author of the chapbook?The Poetic Ruminations of Mr. Born Nice.?More of his political and social commentary may be found at his blog,?politeonsociety.com It is a shame how the media and Law Enforcement, under pressure from the NAACP and other fractions of the African/American community, are not only forced to over cover certain events, but put people on trial without a solid case. The Poli ce Chief quit his job because of pressure from his boss African/American . His boss African/American interferes with an on going Police investigation, but still has a job and no charges are filed by local Police or the State, why? Last week, we got the agonizing news that a defenseless white man who had been beaten severely by a gang of six Black teenagers succumbed to his injuries and died. He was a living breathing person just as you and I. He was?46 year old Pat Mahaney. ?He was walking on a public street not bothering anyone. His cowardly attackers charged at him from behind, and all SIX of them beat him. After the cowardly attack, Mr. Mahaney was so traumatized that he was afraid to go out of his home. He lived for another year but collapsed, first psychologically than physically, under the weight of living with his injuries and caring for his elderly mother. The police in Cincinnati have called this a ?boredom beating? perpetrated by a gang of black teenage boys seeking entertainment. Decent people ask if this was an isolated incident and why these boys would do such a thing out of boredom. Hand-wrung apologies from ?sagacious? social scientists aside, the answer is quite simply because they ?felt like it.? ?Boredom beatings? are the natural extension of giving these people EVERYTHING. They are born in public hospitals; their teenage mothers and Baby Daddies pay nothing. They are taken home to public housing projects, live rent free, go to government schools where they pay nothing, and are taught to hate America especially White America and that when one of them is killed by a would-be victim, it?s the victim?s fault. They see white people not as their neighbors and fellow Americans, but as their oppressors. They are fed free of charge three times day at government schools, given clothing, given free transportation to and from school, and promoted from grade to grade by their height and not their academic achievement. They are fed at home with free Welfare and SNAP cards. When they get arrested, they get free lawyers. When they get pregnant or father a child, they often give the child to their 40 year old grandmother and roam away to impregnate or become pregnant again. After all of this free stuff is delivered to their feet, they come to believe they are also entitled entertainment. When they realize their government cradle-to-grave package doesn?t include entertainment, beating defenseless white people to death becomes the recreational activity of choice for some ? not all ? but some of these people. To keep this cycle in motion, they sell their vote to their Democrat enablers every two years.? Any questions? The American legal system is the WORST in the Western world, not the best as LAWYERS keep saying on TV. Put your heads in the sand folks, if you can't see the rioters then they can't see you! Thank you for your insight. There are no riots going on right now. The authors point proven. People are quick to dismiss the logical, sound, mature voices?that are in opposition to their opinion by focusing on the people who are immature and hyperreactive. But the truth is?fear is what got Zim in this mess, Fear is what feeds riot preparation Fear is what feeds racism and racial biases - as well as all the other isms. The longer you seek out the boogy man, you greater the likelihood that you are the boogyman you seek. Let's keep in mind that Zimmerman was never attacked! Trayvon was defending himself from an over aggressive Zimmerman. Mr. Zimmerman got out of his car in the rain to follow this boy after he was warned by 911 to back off. He did not back off, to me he went to great lengths, far and beyond the call of a radical individual. Seems to me as if he was looking for trouble, had he gotten a slug in his head then what? Mr. Martin would have been convicted of murder. The justice system may FREE him but there's an ultimate judge ahead, that one is certainly the best one and no man could sway the outcome! Yes, bracing for possible riots is racist fear mongering right? ?There are plenty of idiots that are happy to label this a racist conspiracy theory by us silly racist whites filled with hatred. ?Meanwhile they ignore the multitude of racist blacks on twitter talking about killing whitey if Zimmerman goes free. ?People aren't racially fear mongering they're responding to the facts that the media seems incapable of dealing with. The press has often labeled a hispanic as white. ?They ignore Martin's racist creepy cracker comments. ?They've acted as if Zimmerman who was violently attacked committed a hate crime by defending himself. ?The defense tried to hide evidence of various facts surrounding Martin. ?MSNBC doctored the 911 tape. ?Rather than showing Martin for who he was the media used an innocent looking photo of Martin from years ago. ?The President himself inserted his racism by saying Martin looks like his would be son, in effect trying to gain support for Martin. ?The prosecution has been forced into bringing this case. ?And civil rights leaders have turned this into a racial issue. ? Meanwhile a disproportionate amount of black on white murders, robberies, rapes and other crimes continue to happen on a daily basis and the media never dares to suggest that these are often hate crimes. ? The LA riots where innocent whites and Koreans were beaten and had their property destroyed...that happened. ?This writer needs to find his way back to reality if he ever was in touch with it and Time needs to get this hack off of their site. ? No matter how much the media wants us to believe that whites are the evil racists here, there are those of us still left that have eyes and common sense and know how to use them and no brainwashing will change the facts and what we see on a daily basis. ?The only proven racist in this case is Martin, who responded to questioning with violence. ?It was that racist attitude and violent escalation that led to someone being forced to defend himself. ?Let's not forget the facts. ?If Zimmerman wanted Martin dead, Martin would have never gotten close to him. ?For those too ignorant to know that assault weapons are semi automatic just like any other gun, perhaps they're also too ignorant to know that guns kill from a distance. ? Are you kidding me!!!!? So now if the racist blacks say they are going to protest and riot, and bus people in from all over the country for that very purpose, it is racist of police to take any measures whatsoever until what, AFTER the rioting starts? And do you want to know the kicker to this? If the police did nothing until after the PROMISED civil unrest and riots start, and people get hurt, especially any blacks, it will then be labelled gross negligence by racist cops to not protect blacks. @HWallWally Regardless of your feelings about the outcome of this case, it's really sad that the general consensus among many seems to be calling for retaliative street violence.? The point of the article is that the notion of cops preparing for race riots is perpetuating racial division.? What do you think a call for arms is going to do?? How about we skip the barbaric rush to violence and try to actually gain something positive from this tragedy? @pennyhunters Zimmerman was attacked. He was following the mandate of neighborhood watchers to observe and report. Trayvon was not the innocent 12 year old in the photographs the media used to spin this story, he was by many accounts a drug dealer who had been involved in numerous burglaries. Ballistics and forensic investigation confirm that Trayvon was on top of George Zimmerman when he was shot. Mr. Zimmerman was in a public space, performing a volunteer public service. Following someone is not the same as initiating contact. Trayvon initiated contact and when physically attacked George Zimmerman exercised his right under Florida Law to stand his ground. Perhaps this should be a cautionary tale for would-be thugs: Honest, Decent people are no longer willing to stand down and take what the animals have to deliver, we are prepared to respond in kind. @merica97870210 Get some, Colbert!? I wish race was a non-issue in all cases but I definitely think it should be one in this matter.? How can we move on from racism if everyone is so desperate to cling to it like a ball and chain that can't be escaped?? Support for and opposition to the verdict is not clearly drawn down racial lines.? It wasn't just angry black people at the protests across the country.? Outrage over the verdict was felt by people of multiple races just as it wasn't only white people happy with the jury's decision.? I wish people wouldn't immediately rush to find hints of racism in everything that happens.