July 15, 2013 -- 				Will George Zimmerman face civil rights charges? Following Saturday's not guilty verdict in the Trayvon Martin murder case, there are calls for the U.S. Justice Department to pursue criminal civil rights violations against Zimmerman. Historically, federal civil rights laws go back to the Civil War when states were not enforcing the rights of African Americans under the 13th Amendment. Over the years, more statutes were passed, including one in 2009 that may apply in the Trayvon Martin case. However, many legal experts doubt there is enough evidence for the feds to step in. Pressure is mounting for federal criminal charges in the shooting death of Trayvon Martin, the NAACP says more than a million people have signed its online petition asking for the justice department to act. The Justice Department shares your concern, I share your concern, said Attorney General Eric Holder. Holder says the Justice Department will continue its civil rights investigation it opened last year. If the feds act, legal experts say charges would come under the Shepard Act, a civil rights law that was passed four years ago. The federal statute which would be prosecuted is hate crime statute which requires the federal government not only was a crime committed it was because of Mr. Martin's race, said Jon Loevy, civil rights attorney. It's a high burden that Loevy says will be difficult to prove, especially since George Zimmerman was already acquitted in a state court. The feds do not automatically step in every time somebody gets acquitted in a state court, it's uncommon for the federal government to prosecute a crime that's already been prosecuted in state court, Loevy said. The Rodney King case was a rare exception. Legal experts say besides the videotape, there was a variety of evidence that indicated the beating by police officers was racially motivated. Former federal prosecutor Jeff Cramer says that kind of evidence is absent in the Martin case. There is nothing to indicate what even happened that night, let alone what was in the defendant's state of mind when he shot Mr. Martin, said Jeff Cramer, Kroll Investigations and former federal prosecutor. Zimmerman trial protesters aim to keep up momentum 	 Thousands of demonstrators from across the country - chanting, praying and fighting tears - protested a jury's decision to clear neighborhood watch volunteer George Zimmerman in the shooting death of an unarmed black teenager, and organizers say they'll try to maintain the momentum with vigils next weekend. 	 Rallies on Sunday were largely peaceful as demonstrators voiced their support for 17-year-old Trayvon Martin's family and decried the verdict. Police in Los Angeles said they arrested six people, mostly for failure to disperse, after about 80 protesters gathered in Hollywood on Sunset Boulevard and an unlawful assembly was declared. New York police said at least a dozen people were arrested on disorderly conduct charges during a rally in Times Square. 	 Advocates want federal civil rights charges against Zimmerman, who was acquitted Saturday in Martin's 2012 shooting death. The Rev. Al Sharpton said Monday that his organization will hold vigils and rallies in 100 cities Saturday in front of federal buildings. 	 The Justice Department has said it's considering whether federal prosecutors should file criminal civil rights charges now that Zimmerman has been acquitted in the state case. The department opened an investigation into Martin's death last year but stepped aside to allow the state prosecution to proceed. 	 Sunday's demonstrations, held in cities from Florida to Wisconsin, attracted anywhere from a few dozen people to a more than a thousand. 	 At a march and rally in downtown Chicago attended by about 200 people, 73-year-old Maya Miller said the case reminded her of the 1955 slaying of Emmett Till, a 14-year-old from Chicago who was murdered by a group of white men while visiting Mississippi. Till's killing galvanized the civil rights movement. 	 Fifty-eight years and nothing's changed, Miller said, pausing to join a chant for Justice for Trayvon, not one more. 	 In New York City, more than 1,000 people marched into Times Square on Sunday night, zigzagging through Manhattan's streets to avoid police lines. Sign-carrying marchers thronged the busy intersection, chanting Justice for! Trayvon Martin! as they made their way from downtown Union Square, blocking traffic for more than an hour. 	 In San Francisco and in Los Angeles, where police dispersed an earlier protest with beanbag rounds, police closed streets Sunday. 	 President Barack Obama, Sharpton and the Rev. Jesse Jackson have urged calm. In Oakland, Calif., during protests that began late Saturday night, some angry demonstrators broke windows, burned U.S. flags, vandalized a police squad car and spray-painted anti-police graffiti. 	 Los Angeles Mayor Eric Garcetti urged protesters to practice peace after rock- and bottle-throwing. Later, more than 100 officers in riot gear converged and ordered people to disperse. A handful of people were given citations, mostly for blocking a street or jaywalking 	 Rand Powdrill, 41, of San Leandro, Calif., said he marched in San Francisco with about 400 others to protest the execution of an innocent black teenager. 	 If our voices can't be heard, then this is just going to keep going on, he said. 	 Earlier, at Manhattan's Middle Collegiate Church, many congregants wore hooded sweatshirts similar to the one Martin was wearing the night he was shot. Hoodie-clad Jessica Nacinovich said she could only feel disappointment and sadness over the verdict. 	 I'm sure jurors did what they felt was right in accordance with the law but maybe the law is wrong, maybe society is wrong; there's a lot that needs fixing, she said. 	 At a service in Sanford, Fla., where Zimmerman was tried, teens wearing shirts with Martin's picture wiped away tears during a church sermon. 	 Protesters also gathered in Atlanta, Miami, Milwaukee, Philadelphia and Washington, D.C., along with a host of other cities. 	 In Miami, more than 200 people gathered. You can't justify murder, read one poster. Another read Don't worry about more riots. Worry about more Zimmermans. 	 Carol Reitner, 76, of Miami, said she heard about the vigil through an announcement at her church Sunday morning. I was really devastated. It's really hard to believe that someone can take the life of someone else and walk out of court free, she said. 	 In Philadelphia, about 700 protesters marched through downtown to the Liberty Bell, alternating between chanting Trayvon Martin's name and No justice, no peace! 	 We hope this will begin a movement to end discrimination against young black men, said Johnathan Cooper, one of the protest's organizers. And also to empower black people and get them involved in the system. 	 In Atlanta, about 75 protesters chanted and carried signs near Centennial Olympic Park. 	 I came out today because a great deal of injustice has been done and I'm very disappointed at our justice system, said Tabatha Holley, 19, of Atlanta. 	 I'm just disappointed in America. 	 The Associated Press contributed to this report.