Civil rights groups mobilized for protests in cities across the United States on Saturday amid charged emotions over the not-guilty verdict in the shooting death of unarmed black teenager Trayvon Martin. The demonstrations, which began in Miami, come a day after President Barack Obama publicly identified with the slain 17-year-old and the deep frustrations felt among African Americans over the verdict. Trayvon Martin could have been me 35 years ago, Obama told reporters in his most expansive reaction to a Florida jury's decision one week ago to acquit neighborhood watch volunteer George Zimmerman of the killing. Praising the incredible grace and dignity shown by Martin's parents through the ordeal, Obama said some soul-searching on race was in order and it was understandable that there be protests and vigils. But he said a resort to violence would dishonor Martin's death. The 29-year-old Zimmerman, who said he acted in self defense, fatally shot Martin in the chest on the rainy night of February 26, 2012, during an altercation in a gated community in Sanford, Florida. A jury of six women, all but one white, cleared him of second-degree murder and manslaughter charges. Thousands of people were expected to turn out for Justice for Trayvon vigils outside federal courts in Miami, New York, Chicago and Los Angeles organized by civil rights activist Al Sharpton. The slain youth's mother, Sybrina Fulton, was expected to attend the protest in New York, and his father, Tracy Martin, was scheduled to speak at the vigil in Miami. Other civil rights luminaries such as Jesse Jackson and Martin Luther King III have joined the campaign, which seeks to maintain public pressure for a federal civil rights investigation into the killing. Organizers also are targeting Stand Your Ground laws like Florida's, which asserts that citizens can use lethal force -- rather than retreat -- if they sense their lives are at risk. People all over the country will gather to show that we are not having a two- or three-day anger fit, Sharpton said earlier this week in Washington. This is a social movement for justice. In his surprise appearance Friday, Obama did not comment directly on the Florida verdict but he called for a review of the controversial state self-defense laws. I just ask people to consider if Trayvon Martin was of age and armed, could he have stood his ground on that sidewalk? Obama asked. And do we actually think that he would have been justified in shooting Mr Zimmerman who had followed him in a car because he felt threatened? The teen's parents said they were deeply honored and moved by Obama's comments. President Obama sees himself in Trayvon and identifies with him. This is a beautiful tribute to our boy, they said in a statement. We seek a future when a child can walk down the street and not worry that others see him as dangerous because of the color of his skin or the clothes on his back. Critics of the verdict argue that Zimmerman racially profiled the youth -- who had no criminal record -- and was able to kill him with impunity because of a biased criminal justice system. But Zimmerman -- who has a white father and a Peruvian mother -- insists that race was not a factor in the incident. Obama urged better training of law enforcement at the state and local levels to reduce the kind of mistrust in the system that sometimes currently exists. He said young African American males needed greater encouragement in the face of negative stereotypes that many blacks believe were at the root of the shooting death. There are very few African American men in this country who haven't had the experience of being followed when they were shopping in a department store. That includes me, he said. I don't want to exaggerate this but those sets of experiences inform how the African American community interprets what happened one night in Florida, he said.