In appointing Adli Mansour the new interim leader, [Defense Minister] el-Sissi also said a government of technocrats would be formed with full powers to run the country. He did not specify how long the transition period would last or when new elections might be held. Top military officials and opposition leaders met Wednesday and agreed on a political roadmap for the country's future, el-Sissi said. A new presidential cabinet will be formed as well as a national reconciliation committee, which will include youth movements that have been behind anti-Morsi demonstrations. El-Sissi also warned said the military would deal decisively with any violence sparked by the announcements. Before el-Sissi's address, Egyptian troops, including commandos in full combat gear, were deployed across much of Cairo, including at key facilities, on bridges over the Nile River and at major intersections. Witnesses told Reuters that the army erected barbed wire and barriers around Morsi's work compound, and moved in vehicles and troops to prevent supporters from getting to his palace. A travel ban was put on Morsi and the head of his Muslim Brotherhood, Mohammed Badie, as well as Badie's deputy Khairat el-Shater, officials told the Associated Press. Minutes before the military?s deadline for Morsi to resolve the nation?s political crisis passed Wednesday afternoon, the embattled leader called for national reconciliation, but vowed he would never step down. Millions were in the main squares of major cities nationwide, demanding Morsi's removal, in the fourth day of the biggest anti-government rallies the country has seen, surpassing even those in the uprising that ousted against his autocratic predecessor Hosni Mubarak. Critics say Morsi set the nation on a path toward Islamic rule. Khaled Daoud, spokesman of the main opposition National Salvation Front, which pro-reform leader Mohamed ElBaradei leads, said that ElBaradei, Sheik Ahmed el-Tayeb, grand imam of Al-Azharmosque, and Pope Tawadros II, patriarch of Egypt's Coptic Christian minority, were part of the Wednesday meetings with military leaders. The state-run Al-Ahram newspaper -- which also seemed to be following a military line -- reported that the military had placed several leaders of Morsi's Muslim Brotherhood under surveillance. Employees at Egypt's state TV station said military officers were present in the newsroom monitoring its output, but not interfering with their work. In an emotional 46-minute speech late Tuesday, Morsi vowed not to step down and pledged to defend his constitutional legitimacy with his life in the face of three days of massive street demonstrations calling for his ouster. The Islamist leader accused Mubarak loyalists of exploiting the wave of protests to topple his regime and thwart democracy. There is no substitute for legitimacy, said Morsi, at times angrily raising his voice, thrusting his fist in the air and pounding the podium. He warned that electoral and constitutional legitimacy is the only guarantee against violence. On Tuesday, clashes in Cairo and elsewhere in the country left at least 23 people dead, most in a single incident near the main Cairo University campus. The latest deaths take to 39 the number of people killed since Sunday in violence between opponents and supporters of Morsi, who took office in June last year as Egypt's first freely elected leader. Since being elected in what many hailed as Egypt's first legitimate elections, Morsi has sought to consolidate executive power and approved a constitution that would give his Muslim Brotherhood backed party nearly unchecked power as the economy worsened, food and fuel prices soared and attacks on religious minorities were carried out, seemingly with tacit state approval.