? ? ?Posts ? ?FAQ ? ?Myths ? ?About ? ?Contact ? ?Tweets ? ?Quotes ? ?Videos ? ?Links ? ?Plan CO2? Let Me Introduce You To My Little Friend: CH4 [Methane]! In the UK, if a person smells any gas in a building or outside, they are told to call an emergency number straight away so that an engineer can come and fix the leak and remove the danger. In the Arctic, atmospheric plumes of gas have been detected that are over 150kms across and likely to have disastrous consequences for our civilisation. We simply cannot ignore this problem; it underpins the fabric of all our lives. We must respond. Last year I attended the EGU conference in Vienna to meet with Dr. Igor Semiletov and Dr. Natalia Shakhova and was extremely grateful to them for giving me time to discuss the issue of changing conditions in the Arctic. Increased temperatures from human caused greenhouse gas emissions are increasing the risk of methane release from thawing subsea permafrost. These two scientists make annual trips to the East Siberian Arctic Shelf ESAS , in order to gain a better understanding of what is known to be the largest hydrocarbon store in the world. The methane is trapped in the frozen clathrate deposits that has been frozen for millions of years. In this stable condition we tend to consider the methane less of a risk, however, during the course of the last decade, things have started to change. It is important to realise that methane CH4 is approximately 20 x more powerful greenhouse gas than carbon dioxide CO2 over a 100yr timescale. Afterwhich it breaks down into CO2. Obviously with current atmospheric increases in emissions and the effects of warming already being felt, we do not have a 100yrs. In a shorter timescale of 20yrs, methane is estimated to be 100 x more potent as CO2 as a greenhouse gas. Baring in mind that there is currently 5 gigatonnes of methane in the atmosphere and that the East Siberian Arctic Shelf ESAS is estimated to have between 100?s and 1000?s of gigatonnes trapped in the permafrost, if there is any destabilisation, supply of methane could rapidly move the world to a much hotter and dangerous state for humans and many other forms of life. As a species humans add 35 billion tonnes of carbon dioxide to the atmosphere each year in the form of emissions. Over the course of the last 200 years this has caused a global temperature rise of about 0.8 C. Although this seems tiny, we are only just starting to understand how sensitive the Earth is to changes in temperature. Add to this that the Arctic has been warming at around 8 times the speed of the mid latitudes and it?s not hard to see why the Arctic Sea Ice has gone into an accelerated melt. It may seem obvious that if we heat the planet up then we will melt the ice. When joining the dots on the severity of what climate change really means, it is important to grasp ?feedbacks?. These are the Earth?s response to changes within the climate system. A general rule of thumb is that ?positive feedbacks? generally are bad for us and ?negative feedbacks? are not. In the case of the Arctic, it is important to understand that there are multiple feedbacks [watch this comprehensive analysis by David Wasdell, Apollo-Gaia Director for more information] that come into play when the temperature changes. The Arctic sea ice is one that has caught the world?s attention because we are entering a phase where we no longer have a northern polar ice-cap. This is, in turn, setting off other positive feedbacks, one of these being the heating of the Arctic ocean as it absorbs sunlight and starts to thaw the subsea permafrost in the shallow seas of the ESAS. This is effectively removing the seal on a vast store of potent methane greenhouse gases that could take us from a steady increase in temperature to the awful sounding ?runaway? global heating. During the interview with Dr Shakhova, I was chilled when she showed me 2 charts, one with small insignificant plumes of methane from over ten years ago, contrasted with a chart from 2011 where the plumes of escaping gas from the permafrost were over a kilometre wide. Dr Shakhova also stated that in recent years all the conditions were changing making the risk of a game changing release of methane from the ESAS much more likely. Dr Shakhova even pointed out that it was likely ?in decades?. Dr Semiletov went further to say ?anytime!?. Below are a few video clips from the interview in April 2012. I am very much looking forward to seeing the new work by Dr?s Semiletov and Shakhova et al that will be released shortly, giving us a far greater understanding, and up to date view, of the state of this all important region in the Arctic. In the meantime, the methane issue has been the focus of NASA?s ?Carbon in Arctic Reservoirs Vulnerability Experiment? CARVE who have detected 150 kilometre plumes of atmospheric methane. This raises a few questions that are critical to our future civilisation: For a longtime the methane issue has remained outside the larger conversation of impacts of global warming, except by reference to far off future risks. There are a handful of scientists such as Professor Peter Wadhams, Head of the Polar Institute at Cambridge University, who, based on submarine observations of the Arctic sea ice?s collapse in volume, has been pointing out that a methane feedback may not be as far away as we think. Professor Wadhams has made these points in the face of angry cries of ?Alarmist? from UK politicians with financial interests in the hydrocarbon industry. The work of scientists including the Russians, Wadhams and NASA?s CARVE team now means we can no longer ignore the risk of methane as part of the Earth?s complex system of feedbacks to temperature change. It also is very likely that at 2C the world will not be the beautifully hospitable place that it has been for humans for so long. It is very likely that we are close to that ?tipping point? of no return where global heating goes into a runaway phase and we lose our only life support system. I sincerely hope this isn?t the case but we have to acknowledge the risk if we are to react appropriately. In order to answer the third question posited above, we have to comprehend the enormity of the task of transitioning away from fossil fuels coal, oil and gas . To say it cannot be done is to kiss the world, as we know it, goodbye. It can be done but it will take the will of all of us together, starting with citizens around the world, to politicians and those in the hydrocarbon business themselves. Whilst in Vienna in 2012, I also interviewed Dr James Hansen, one of the most outspoken climate scientists alive today and former Head of The Goddard Institute for Space Studies in New York. You can watch a video clip at http://vimeo.com/71179724 on what Hansen proposes as a way to curb emissions and start turning the tide on our collective response to global heating. So how do we respond? It is clear that we need to make changes at a societal level. Never forget that each and everyone of us is a part of society and, as such, we have influence. The action we need to take is tied in with our attitude to the problems we face. The hydrocarbon industries lobby our governments and institutions to make sure their needs are not ignored. This is for one reason alone: profit. Societal reliance on this form of energy is no longer necessary. We should be transitioning away from hydrocarbon fuels. We can?t because these powerful companies are tucked tight inside the framework of our civilisation. There is no doubt that as such, we are entering a phase of willful self-destruction. The only thing that can stop it is us. A good example of this institutional integration is the Royal Geographic Society where Shell?s logos feature prominently and they even have their own page on the society?s web site aligning themselves with our respected institutions, paying lip service to our future concerns. This is disgusting. We should treat hydrocarbon companies as we did the tobacco industries once it was proven how harmful tobacco is to our health. These companies project the use of oil and gas way into the middle of the century. Don?t believe it. On this course, we will end up clinging to an inhospitable planet, barely recognisable as it is today. Take action. The first and most effective thing you can do is contact your local elected representative and tell them straight. I sent the following email to my own Member of Parliament, Mary McCleod MP and waiting patiently for a reply. It is critical to remember that they have our future in their hands but we have their vote. Let?s use it! A note on climate fixes such as ?Climate Engineering? aka geoengineering : I have not mentioned proposed climate engineering proposals in this post as we are currently working on an in depth look at several projects that are already in progress. Climate engineering raises many scientific, political and ethical issues and to many people the idea that man can engineer Earth?s climate is a crazy and hubristic fantasy. No matter what we think, it is important that we are all cognisant of the arguments being put forward. We will be interviewing leading commentators and authorities, not just from the climate and engineering backgrounds but also from ethical and philosophical disciplines to help form a view of this controversial subject. The worst case scenario is that we ignore the subject altogether and the decision to engineer climate falls into the hands of a foreign international power willing to gamble the fate of billions, or, a wealthy individual who can afford to take an equal gamble and become what Clive Hamilton has titled his recent book, an ?Earthmaster?. Groups such as the Arctic Methane Emergency Group have been calling for climate engineering to be deployed immediately to cool the Arctic and prevent the runaway heating that climate scientists most fear. The argument for both sides is compelling and the more we shy away from zero carbon emissions the more climate engineering solutions start to look like a relatively cheap alternative. It is time for us all to be part of this critical discussion.