The death penalty, which Occupy properly refers to as premeditated state-sponsored murder, needs to be abolished ? sooner rather than later.? The United States is the only country in the western hemisphere, and one of only a couple democracies India, Japan that still carries out this ancient, antiquated form of revenge ? but the only democracy that carries state-sponsored murder out with regularity. ?Currently, 32 states still have the death penalty as a form of punishment, while 18 have abolished it. View the? for a more detailed breakdown on premeditated state-sponsored murder in the United States.? It?s time for the federal government or SCOTUS to come up with a 50 state solution: abolish all state-sponsored murder! This is among many reasons why Occupy is staunchly against the death penalty, which is more accurately described as premeditated state-sponsored murder.? HLN media sensationalism, rogue prosecutors and rogue judges, as well as dirty cops have all contributed to America?s death penalty epidemic.? Slowly but surely, we?ll have more and more politicians like former Illinois Governor George Ryan Republican : In one sweep, Governor Ryan, a Republican, spared the lives of 163 men and 4 women who have served a collective 2,000 years for the murders of more than 250 people. His bold move was seen as the most significant statement questioning capital punishment since the Supreme Court struck down states? old death penalty laws in 1972. It seemed sure to secure Mr. Ryan?s legacy as a leading critic of state-sponsored executions even as he faces possible indictment in a corruption scandal that stopped him from seeking re-election. Bravo, Governor Ryan!? It?s about time someone spoke the truth! Read Governor Ryan?s full article on why he instituted a moratorium on premeditated state-sponsored murder. Ultimately, on January 11, 2003, just two days before leaving office, Ryan commuted to ?life? terms the sentences of everyone on or waiting to be sent to Illinois? death row?a total of 167 convicts?due to his belief that the death penalty could not be administered fairly. He also pardoned four inmates, Aaron Patterson, Madison Hobley and Leroy Orange who were released , and Stanley Howard. However, Patterson is currently serving 30 years in prison after being arrested for drug trafficking he committed after his release from death row. Howard remains in prison for armed robbery.? Ryan declared in his pardon speech that he would?ve freed Howard if only his attorney had filed a clemency petition; Ryan then strongly urged investigators to examine Howard?s alleged robbery case, because it appeared to be as tainted as his murder conviction.? These were four of ten death row inmates known as the ?Death Row 10,? due to widely reported claims that the confessions that they had given in their respective cases had been coerced through police torture. Ryan won praise from death penalty opponents: as early as 2001 he received the Mario Cuomo Act of Courage Award from Death Penalty Focus, in 2003 the Rose Elizabeth Bird Commitment to Justice Award from the same organization, and in 2005 he was nominated for the Nobel Peace Prize. Many conservatives, though, were opposed to the commutations, some questioning his motives, which came as a federal corruption investigation closed in on the governor and his closest political allies. Why question his motives?? Did it ever dawn on you that perhaps Governor Ryan has a point? Uber-Conservative columnist Pat Buchanan called Ryan ?pathetic?, and suggested that the governor was attempting to save his public image in hopes of avoiding prison himself. Buchanan noted ?Ryan announced his decision to a wildly cheering crowd at the Northwestern University Law School. Families of the victims of the soon-to-be-reprieved killers were not invited.?? Buchanan fails to realize that Northwestern University Law School has helped exonerate death row inmates. Globally, capital punishment has been used in almost every part of the world, but in the last few decades many countries have abolished it. Usage of capital punishment is usually broken into the four categories set out below. Of the 195 independent states that are UN members or have UN observer status: The information above is accurate as of 2013 when Chad, DR Congo, Cuba, Qatar, and Zimbabwe became de facto abolitionist countries because they had carried out no executions for ten years. The United States is not ?the leader of the free world?.? The United States houses 25% of the world?s prison population.? China, a communist nation, has 4 times the population of the United States.? Yet the United States has more prisoners than China and Russia ? COMBINED! It?s time for the United States to stop being so pompous as to believe ?we?re right? and ?the rest of the world is wrong?.? Yes, it?s time for the United States to join the developed world, and abolish premeditated state-sponsored murder ? permanently! As always, please leave your thoughts and comment s below!