Trayvon Martin's death and the George Zimmerman verdict did not cause racial divide in this country. The country was already divided. Trayvon Martin's death and the George Zimmerman verdict have opened dialog on America's racial divide.? The Martin death and Zimmerman verdict ?are difficult to approach without emotion, taking into consideration that two human beings--one who has been killed and one whose life has changed forever. Opening this American dialog on racial divide is comparable to opening a? festering ? wound ?that seems to have gone untreated for centuries. However, treatment has been applied many times during the history of our nation. The problem is that the treatment had to be forced by circumstances that were resisted by certain factions of the population. F or example, ?after? t he Civil War, in order to placate the old Confederacy, the Union handed over the U.S. Senate to the southern states that were? fashioned new? weapons to fight? for their Lost Cause and Jim Crow was born to keep former slaves as close to slavery as possible. Then came the Civil Rights Movement that struck down Jim Crow laws that were replaced by more subtle forms of discrimination and so on and so on. The purpose of this blog post is: Recent controversy and heated exchanges between the different factions of American society over Trayvon Martin's death and the George Zimmerman verdict make it clear? that we, as a nation, have ?a problem, a serious problem in race relations that did not start with the shooting of a teenage boy by a neighborhood watch captain. The problem runs deep into the soul of America's violent origins and development. As much as I love this country and would not want to live or to have been born in any other, I think it is time to make a close observation of what most of us do not understand or do not want to see and, certainly, do not want to acknowledge about our nation. We are? divided. We pretend otherwise in each other's faces. But what happens behind closed doors and closed minds? A long way from healing, if ever, is in our future if we do not change the way we talk about each other behind each other's backs because the way we talk about each other behind closed doors reveals how we feel about each other. Don't get me wrong, I do not care if you love me and you should not care if I love you. What should matter to both of us, however, is how we treat each other. Now, if it takes a law to make me treat you better and make you treat me better, then make a law. However, the law will not bring us out of the mired abyss we have created here in our beloved country, but it will make us tolerate each other until we grow more accustomed to being around each other. As I see it, t he racial divide that keeps people in the state of unrest is more about a cultural divide. Those who have are intolerant of those who do not have, or those perceived to not have. Because history has prescribed certain skin to be associated with those who do not have, a stereotype formed.? Well, it is time to bury that outdated character along with Jim Crow, a minstrel character that represented a set of legal discriminatory statutes that began a dismantling with Rosa Parks, Martin Luther King and the Montgomery Bus Boycott in 1955, and other civil rights leaders of that era who had a clear set of goals to get specific laws struck down. This struggle had a much more directed purpose than where to sit on a bus.? The laws on the books changed, but the way we perceive each other remains fundamentally unchanged as people in different cultural settings and income brackets grow farther and farther apart in lifestyle and understanding of a common environment. We, the amalgamated Americans, ?do not trust each other to do the right thing toward one another. Could our own racism be how we got to this current state of agitation? Could racist-fueled distrust be why so many have hijacked this death and verdict? If racial divide is beyond repair, where do we go from here?? If racial divide is not beyond repair, how do we go about repairing it? Have we become too comfortable with our own racism? As I see it, the racial divide that continues to deepen in this country was a racial ditch long before we knew who George Zimmerman and Trayvon Martin were. Here is another thing. Is right to use Trayvon Martin in this way? Does he deserve to have his image defiled, waved on flags, worn on clothing or flashed on posters? Would this be the case i f there was no racial divide in America? Could selfish motivations be tempted to use him that way if there was no racial divide?? In fact, if there was no racial divide in our nation, we probably would not know who the principals in this case were. There would be no reason to know the names of the judge or attorneys or witnesses or others, if we were not a nation divided along a color line cut so deeply into our own racist, yet mixed race flesh.? Americans did not think racial divide was beyond repair when the nation elected a mixed race white and black president twice, a man who?is black,?even though his mother was white and the grandparents who raised him were white, a black man because, when you look at him, he looks like a black man. Depending on how the genetic cards fall, a mixed race person? does not have to look mixed race to be mixed race. In this country, a black person rarely gets to choose sides. If we look black or can be demonstrated as being black, we are black. Historically, the one drop rule classified people as black if African heritage could be demonstrated in their bloodline, no matter how minute the drop and even when they did not look black.? Looking like a black person and being treated like a black man, he or she must accept the fact that he or she is a black person. The U.S. Census has recently begun allowing Racially Mixed People in America? Google Affiliate Ad to declare their racial identity by providing multiple racial choices on Census documents. However, surveys show that mixed raced persons are still considered and treated as black if any feature can be detected in them by the observer. Littie Nash was one of the great thinkers?and also possessed elevated written and verbal communication skills. She wanted me to be a thinker, too, and make more of my life than she had been allowed to make of hers, although she managed, through school later in her life, to become a credentialed? nutritionist and award-winning baker.? My mother did not waste compliments on me. She reserved accolades to celebrate real accomplishments, not just because I dragged my lazy butt out of bed before noon on Saturday or because I made an 'A' on my report card.? Some things you have to do, she said. And those things are recognized, but there will be no all-day hullabaloo. My mother demanded a certain behavior from me and that behavior included language use, carriage, attire, and how I spend my time and with whom I associated. If you present yourself in a certain way, she said, People perceive you in a certain way, good or bad. If you hang around certain types of people, you are regarded in the same way as those people.