SAN FRANCISCO AP ? Protesters angered by the acquittal of George Zimmerman held largely peaceful demonstrations in three California cities, but broke windows and started small street fires Oakland, police said. A BART police vehicle is vandalized during a protest after George Zimmerman was found not guilty in the 2012 shooting death of teenager Trayvon Martin, early Sunday, July 14, 2013, in Oakland, Calif. Protesters angered by the acquittal Zimmerman held largely peaceful demonstrations in three California cities, but broke windows and started small street fires Oakland, police said. AP The gatherings Saturday night ranged from a few dozen to a couple hundred people turning out to protest the verdict in the Florida courtroom over the death of Trayvon Martin, and police said some of the demonstrations continued into the early hours Sunday. The Oakland police dispatch office said about 100 people protested, with some in the crowd breaking windows on businesses and starting small fires in the streets. As the protest wound down with the crowd dispersing, the office said that as of 2 a.m. PDT it had no word of any arrests. A man throws a trash can at the window of a building during a protest after George Zimmerman was found not guilty in the 2012 shooting death of teenager Trayvon Martin, early Sunday, July 14, 2013, in Oakland, Calif. AP Local media reports said some Oakland marchers vandalized a police squad car and police formed a line to block the protesters? path. The Oakland Tribune said some windows on the newspaper?s downtown offices were broken, and footage from a television helicopter show people attempting to start fires in the street and spray painting anti-police graffiti. Protesters also reportedly burned an American and a California state flag and spray painted Alameda County?s Davidson courthouse. The Oakland demonstration followed a raucous but largely peaceful one in San Francisco. Police say officers escorted demonstrators as they marched on the city?s Mission District. The group was dispersed by 10 p.m. The verdict also sparked protests in Los Angeles, where demonstrators gathered in Leimert Park, the city?s historically black neighborhood. Police said that about 200 protesters gathered for what they termed a peaceful vigil. City News Service said that at one point a smaller group stopped an Expo Line train as police urged them to return to the nearby park. But police couldn?t immediately confirm that report. Lt. Andy Neiman of the LAPD Media Relations Department said another group of 50 to 100 demonstrators started marching around midnight. ?There was a period where crowds were running among vehicles, but police dissuaded them,? he said. Neiman said he knew of no arrests. Officials said police called in officers from around the city to keep a watch on demonstrators. More than 40 people gathered at Sacramento City Hall, and the Sacramento Bee reported that protesters chanted: ?What do we want? Justice. When do you we want it? Now. For who? Trayvon.? A banner behind speakers read, ?No justice, no peace!?