The neighbourhood watch volunteer, 29, was acquitted of the murder of the teenager over the weekend after claiming he shot the victim in self-defence. A jury found he was not guilty of second-degree murder or the lesser charge of manslaughter after the victim died during a nighttime confrontation in Florida in February 2012. However, federal prosecutors are exploring the possibility of filing criminal civil rights charges against Zimmerman. Former U.S. Attorney Alan Vinegrad said federal prosecutors would have to show not only that the attack was unjustified, but that Mr. Zimmerman attacked Mr. Martin because of his race and because he was using a public facility, the street. President Barack Obama and a number celebrities have expressed sadness at the verdict, with largely peaceful protests against the decision taking place across America. Mr Obama said: I know this case has elicited strong passions. And in the wake of the verdict, I know those passions may be running even higher. But we are a nation of laws, and a jury has spoken. Rand Powdrill, 41, said he came to the San Francisco march with about 400 others to 'protest the execution of an innocent black teenager'. He said: If our voices can't be heard, then this is just going to keep going on. Destiny's Child star Beyonce called for a moment of silence for the black teenager at a concert, while rapper Young Jeezy released a song in his memory. Despite his acquittal Zimmerman's freedom may be limited, with the possibility of civil lawsuits from the victim's family. Zimmerman's brother Robert told CNN his sibling will 'be looking over his shoulder the rest of his life.' Martin's parents said Zimmerman, who identifies himself as Hispanic, had racially profiled the teenager. However, despite this race was barely mentioned at the trial. Prosecutors portrayed Zimmerman as a vigilante grown frustrated by break-ins in his neighborhood committed primarily by young black men. Zimmerman assumed Martin was up to no good, prosecutors said. Martin's family maintained the victim was the aggressor, however defence attorneys said Martin knocked Zimmerman down and slammed his head against the sidewalk. The American Justine Department have a history of using federal civil rights law in an effort to convict defendants who had been acquitted. However, history has shown it to be difficult to get convictions in such high-profile cases.