Egypt?s ?president Mohamed Morsi was warned by the army today he would be booted out unless he agrees to power sharing with his opponents. As the defiant Muslim Brotherhood leader ignored calls for him to quit and vowed to stay in office, chief of staff General Abdel Fattah al-Sisi said he will dissolve parliament to tackle the political crisis that has brought millions of protesters to the streets and sparked violent scenes with more than 20 deaths. Seven people were killed in clashes between Morsi?s supporters and ?opponents in Cairo?s Tahrir Square today as ?military chiefs discussed their next move. But al-Sisi insisted the army would not run the country ? instead installing an interim council, composed mainly of civilians from different political groups, to take charge until an amended constitution is drafted within months. He said: ?The armed forces will not be part of politics or rule. Wasting more time will lead to more division and conflict. The national security of the country is in danger.? Military sources refused to say how the army would deal with Morsi if he refused to quit. But al-Sisi plans to open talks with the main opposition National Salvation Front and other political, religious and youth ?organisations once the president?s deadline to accept power sharing passes tomorrow. He had been given 48 hours on Monday by the chief of staff to comply with the order. Al-Sisi said there will be a new presidential election, but polls would be delayed until strict conditions for selecting candidates were in force, the sources revealed. The warning to Morsi was welcomed by opposition figures. Mahmoud Badr, chief of protest group Tamarud - Rebel Coalition, said: ?The statement of the armed forces has a single idea? supporting the will of the Egyptian people at this moment.? But the president?s supporters appealed for people to take to the streets to prevent a coup. The call went out as Foreign Minister Mohammed Kamel Amr became the latest, and most high-profile, member of Egypt?s cabinet to desert the cabinet over the turmoil. Al-Sisi was appointed by Morsi in his second month in office after previous chief of staff Field Marshal Hussein Tantawi was axed by the president. Trained in the US and Britain, the commander has previously called on Egypt?s feuding ?politicians to sort out their ?squabbles. But until now he has resisted calls for the army to oust Morsi, insisting: ?No one is going to remove anybody.? Al-Sisi insisted changes would be entirely different from the military rule that followed the overthrow of President Hosni Mubarak in a 2011 popular uprising. Expert's view: Coup would tear nation apart, says Fawaz A Gerges Egypt is deeply and dangerously polarised between two opposing camps ? the Islamists led by President Mohamed Morsi and the majority of the country. Egyptians have turned against Morsi?s authoritarian leadership and economic mismanagement a year after his election. Institutions are incomplete or paralysed. There is no parliament because the one voted in has been disqualified by the ?judiciary. The Muslim Brotherhood-elected Morsi has been trying to sideline the ?judiciary because he does not trust the Mubarak-appointed judges. The world is waiting to see what the ?military will do next after its ultimatum has been rejected by Morsi. There is the threat of a coup but I do not believe that will happen. My reading is the military is trying to pressure the government and the opposition by offering a road map but it will not intervene directly in the political process. This road map will include a new Prime Minister, a new attorney general and a revised constitution. These are the outlines of a compromise. The alternative is Egypt drifting to more chaos and possibly civil strife. Morsi is a democratically elected ?president. Forcing him out would plunge the country into greater turmoil.