By Ayman Mohyeldin, Charlene Gubash and Ian Johnston, NBC News CAIRO - In a long-awaited response, Egyptian President Mohammed Morsi early Tuesday rejected an order by the army to resolve a political crisis that has?drawn millions of people into the streets demanding his resignation, calling a deadline set confusing and saying he would instead pursue national?reconciliation on his own. The presidency issued a statement at almost 2 a.m., nine hours after an ultimatum by Egypt?s military, which said the mass protests were an??unprecedented? expression of the will of the people and gave the government 48 hours to meet the opposition's demands.? Morsi's response was much less direct than the army?s edict but seemed to indicate he had a different plan. The president of the republic was not consulted about the statement issued by the armed forces, it said. The presidency sees that some of the?statements in it carry meanings that could cause confusion in the complex national environment. The statement from Morsi's office continued, The presidency confirms that it is going forward on its previously plotted path to promote comprehensive?national reconciliation ... regardless of any statements that deepen divisions between citizens. ? The army's earlier statement was read on state television just hours after the headquarters of Morsi?s Muslim Brotherhood movement were ransacked.? Gen. Abdel Fattah al-Sisi said if the crisis wasn?t resolved, the army would intervene. The protesters' main demands are that Morsi announce early elections and step down, allowing a temporary government to take over. If the demands of the people are not realized within the defined period, it will be incumbent upon the armed forces ... to announce a road map for the?future,? the statement said. It was followed by patriotic music. The road map would be created by the army, which would also oversee the plan's implementation, the statement said. It was unclear if the military was effectively demanding Morsi's resignation, but a Muslim Brotherhood politician insisted there would not be a coup. On his Facebook page Monday, Morsi said he was meeting with Gen. al-Sisi as well as Prime Minister Hisham Kandil. What they discussed was not disclosed. Sixteen people were killed and more than 700 were wounded during the protests Sunday and early Monday. The military statement stressed that the military would remain neutral in politics and maintain its role as protector of the people and the nation?s borders. The statement said the military will not be a party in politics or rule. But it added the armed forces had a responsibility to act because Egypt's national security was facing a grave danger. A source at Egypt's presidential palace said Morsi's office was not told in advance that the 48-hour ultimatum would be issued. In Cairo's Tahrir Square, the vast crowd began to chant that the army and the people were one after al-Sisi's address. Army helicopters circled over the city flying Egyptian flags. However, Yasser Hamza, a leader of the Brotherhood's Freedom and Justice Party,?warned against misinterpreting the army statement.? For an institution of state to come and stage a coup against the president, this will not happen, he said. Any force that goes against the constitution is a call for sabotage and anarchy. ? In a formal response to al-Sisi's statement, an alliance of Islamist groups that includes Morsi's Brotherhood was careful not to criticize the army itself, instead saying that their political opponents were trying to manipulate the army to assault legitimacy in a way that would lead to a coup. In a statement read at a press conference attended by a Reuters reporter, the alliance also said it respected all initiatives to resolve the country's political crisis but that they had to respect constitutional principles.? As the military statement was read, U.S. President Barack Obama urged all sides to refrain from violence shortly after he arrived in Tanzania. We're all concerned about what's happening in Egypt, Obama said. There is more work to be done to create the conditions in which everybody feels that their voices are heard and that the government is responsive and truly representative. ? U.S. State Department spokesman Patrick Ventrell said the U.S. is closely watching the situation in Egypt and is in touch with all sides, and?encouraged groups to avoid violence. Our message publicly and privately has been very consistent, that we want to see Egyptians succeed, that we don't take sides, we don't have a?particular party or group or interest that we're backing.? Ventrell said. ?Indeed, the only thing that we're backing is the Egyptian people and the goal?of their success in their democratic transition, that they can get their economy back on track, that they can fully see their democratic transition?succeed. In a statement, the United Nations also called for Egyptians to resolve differences through ?democratic means.? In the latest resignation in Morsi's government, Egyptian Foreign Minister Mohammed Kamel Amr offered to step down, state news agency MENA reported early Tuesday, without giving a source. Since Sunday, at least five other non-Brotherhood government ministers have tendered their resignations from the Cabinet, apparently in sympathy with the protesters, underlining a sense of isolation for the party that won a series of elections last year but has failed to build out alliances to form a broader consensus.? The attack on the Brotherhood building was the bloodiest incident of the weekend's huge and mostly peaceful protests against Morsi. It began after dark Sunday and continued for hours, with guards inside the suburban Cairo building firing on youths hurling fire bombs and rocks. Reuters cited medical and security sources as saying that eight people were killed, but the figure could not be independently confirmed by NBC News. Protesters breached ?the Cairo compound's defenses and stormed the building. Crowds later carried off furniture, files, rugs, air conditioning units and portraits of Morsi, according to an Associated Press journalist. One protester emerged with a pistol and handed it over to a policeman outside. ? Footage on local television showed broken windows, blackened walls and smoke coming out of the building. A fire was still raging on one floor hours after the building was invaded. One protester tore down the Muslim Brotherhood sign from the building's front wall, while another hoisted Egypt's red, black and white flag out an upper-story window and waved it in the air in triumph. The images were reminiscent of the destruction of the state security headquarters when President Hosni Mubarak was toppled in 2011. Organizers behind Sunday's protests -- who managed to get 22 million signatures calling on Morsi to step down -- ?said they would give him until Tuesday at 5 p.m. 11 a.m. ET to meet their demands or they would call for nationwide strikes.? Protesters also demanded?early elections, but late Sunday night word from the presidential palace was that Morsi had no intentions of calling them.? Some anti-Morsi protesters spent Sunday night in dozens of tents pitched in the capital's central Tahrir Square and in front of the president's Ittihadiya Palace. They have vowed to stay there until Morsi resigns. Morsi supporters, meanwhile, went on with their sit-in in front of a major mosque in Cairo.? Sunday's protests were the largest seen in Egypt in the 2? years of turmoil since the ouster of autocratic Mubarak in February 2011.? NBC News' F. Brinley Bruton, Jeff Black, Reuters and The Associated Press contributed to this report. Related: This story was originally published on Mon Jul 1, 2013 7:05 AM EDT