CAIRO // Adly Al Mansour was sworn in as Egypt?s interim president yesterday as the military began to arrest Muslim Brotherhood members including the group?s leader. Mr Al Mansour, Egypt?s most senior judge, pledged that the dramatic removal of Mohammed Morsi, Egypt?s first freely elected president, had ?corrected the path of its glorious revolution? and vowed to include all members of society, including the Brotherhood, in a national reconciliation initiative. ?The Muslim Brotherhood are part of this people and are invited to participate in building the nation as nobody will be excluded, and if they respond to the invitation, they will be welcomed,? he said. Those first comments ? and similar, conciliatory statements from the army and opposition politicians yesterday ? were a testament to what promises to be Egypt?s biggest challenge after Mr Morsi?s abrupt departure: convincing the Brotherhood to participate in politics after undemocratically flinging them from power. As Mr Al Mansour offered inclusion, the military launched a sweep against the Brotherhood leadership that included the group?s supreme guide, Mohammed Badie, a figure venerated among its followers. Mr Badie was arrested late on Wednesday from a villa where he had been staying at a Mediterranean coastal city and was flown by helicopter to Cairo, security officials said. Brotherhood officials yesterday defiantly vowed not to take part in what they have called an illegal coup and planned major demonstrations in support of Mr Morsi today. They denounced ?the terror of the police state through its arrests of Brotherhood leaders?. Flanked by top Egyptian religious authorities and opposition politicians, the defence minister General Abdel Fattah El Sisi announced the end of Mr Morsi?s presidency in a live press conference on Wednesday night that was met by cheers in Tahrir Square and calls of resistance from the Mr Morsi?s supporters. The new ?road map? for the coming months includes suspending the constitution, appointing a new technocratic government and holding early presidential elections as soon as possible. Coming just two and a half years after Hosni Mubarak was forced to hand power to the military after huge protests, the events highlighted Egypt?s still rocky experience with democracy. When the dust settled yesterday morning, Mr Morsi was under military detention, Muslim Brotherhood-affiliated television stations had been shut down and arrest warrants were issued for leaders of the group, moves that were criticised by human rights groups. Salil Shetty, the general secretary of Amnesty International, said the TV station shutdowns were a ?blow to freedom of expression?. ?No one should be punished for the peaceful rights to freedom of expression, association or assembly,? he said. ?Anyone taken into detention should be charged promptly with a recognisable criminal offence, or released. And security forces should refrain from using unnecessary and excessive force.? Mr Morsi was believed to be held in a military facility. Egyptian state media said Saad Al Katatni, a leader of the Brotherhood?s Freedom and Justice Party and former speaker of parliament, and Rashad Al Bayoumi, a deputy leader of the Brotherhood, were being held in Tora Prison ? the same place where former president Hosni Mubarak is being held on charges of corruption and having a role in the killing of protesters in 2011. Besides Mr Badie, the public prosecutor announced arrest warrants for Khairat Al Shater, deputy leader of the Muslim Brotherhood and a major financier of the group. Criminal charges against the men were not revealed. Mr Al Shater?s son, Saad, said yesterday his father was ?safe? and not under arrest. Asked what charges were being laid against the Brotherhood members, he said ?there are no charges, just kidnappings?. Essam El Erian, an influential Brotherhood politician who faces criminal charges in the Emirates over anti-UAE comments, said on Facebook that ?waves of sympathy? for the group would rise over time. ?The end of the coup will come faster than you imagine,? he wrote. The country was still reeling yesterday from the dizzying turn of events, which inspired celebrations by tens of thousands of anti-Morsi protesters into the early morning yesterday. Honks and cheers could be heard throughout the night. On Thursday, the military sent jet fighters in a V formation over Cairo, leaving a trail of red, white and black smoke ? colours of the Egyptian flag. The celebrations had a dark lining, however. At least seven people died and more than 300 were injured in street clashes after the military?s announcement, bringing the death toll over the past week to more than 50. The end of Mr Morsi?s presidency marked the single largest catastrophe in the more than 80-year history of the Muslim Brotherhood. With its social welfare network, built up over decades, and message of ?Islam is the solution?, its representatives handily won the most votes in Egyptian elections held since Mubarak resigned. Mr Morsi won the presidency almost exactly a year ago, narrowly defeating former prime minister Ahmed Shafiq thanks in part to liberals who could not bear the thought of installing a former Mubarak aide in power after the January 25, 2011, revolution against the same regime. His critics said he squandered a historic chance to lead Egypt by monopolising power and neglecting the country?s most pressing problems, especially the dilapidated economy. Mr Morsi?s supporters have countered that he accomplished as much as possible in a year, but was opposed by a conspiracy from remnants of the Mubarak regime bent on destroying the chance for a successful Brotherhood president. The military?s removal of Mr Morsi left many broad questions about Egypt?s future in its wake. By suspending the constitution, written last year and ratified by a national referendum, Egypt was in a state of ?constitutional vacuum?, said Zaid Al Ali, an expert on Arab constitutions at the International Institute for Democracy and Electoral Assistance, a non-governmental organisation. ?There are no rules governing the country, apart from what the military and the people around them informally decide,? he said. ?We don?t know the powers of the interim president or how long he will be in office. The army said the transition will be quick, but what if he?s not? There are no guidelines yet.? Mr Al Mansour was soon expected to announce a new constitutional declaration that would codify the country?s political transition in law. Analysts, much like Egyptian society, were sharply divided on whether the removal of Mr Morsi was the best course of action for Egypt. While many agree that he performed poorly as president and made decisions that contributed to the country?s polarisation, some believe that the military-led incursion into politics was a blow to the country?s nascent democracy. ?This is a sad day for Egypt and for democracy in the Arab world,? said Radwan Masmoudi, the president of the US-based Centre for the Study of Islam and Democracy. ?True the Brotherhood did this to themselves, but the military must always stay out of politics if we want democracy to grow or to succeed.? He warned that the consequences of Mr Morsi?s deposition could be ?decades more of violence, radicalism and terrorism?. bhope@thenational.ae twitter: For breaking news from the Gulf, the Middle East and around the globe follow The National World. Follow us