The Fukushima nuclear plant crisis continues unresolved in a bad way. Two reports in the last week indicate that the cheery face that plant mismanager operator Tepco has been trying to put on the aftermath of the disaster is not in line with conditions at the plant. If I parse these English language accounts correctly, there are two separate problems that Tepco has been forced to confess to in the last week corrections and amplifications from those who can read Japanese appreciated; even in the days when Japan was heavily covered by the business press, there were large gaps between what was common knowledge in Tokyo v. what you?d see in the Western press . One outstanding problem got a nasty update over the weekend. Tepco admitted some time ago that radioactive water was getting into the Pacific, but has been at a loss to explain how that was happening. The Japan Times hat tip Deontos tells us that Tepco announced this past weekend that they think they?ve figured it out: The water in the underground passage, which runs under the turbine building of reactor 2, contains 2.35 billion becquerels of cesium per liter, roughly the same as that measured right after the crisis began in spring 2011? The trench is believed to be the source of the groundwater problem that?s been baffling Tepco?s experts for months. Their current theory is that the highly radioactive water found and left in the trench in 2011 is now leaking directly into the groundwater, which is seeping into the sea. Tepco finally admitted Monday that contaminated water was getting into the Pacific. The admission came after the Nuclear Regulation Authority pointed out that highly radioactive water was ?strongly suspected? to be seeping into the ground under the site and making its way to the sea. Yves here. This sort of thing is above my pay grade, but as a layperson, I find several things to be troubling. First is that the radioactivity is apparently getting into the ocean via groundwater. Have there been any reports on the extent of the groundwater contamination? Even if Tepco could wave a magic wand and stop the leaking now, you?d still have continuing effects from the contaminated groundwater then contaminating the ocean yes the main effects will be local, such as on local fish, but still? . Second is that the concentration of radioactivity in the trench water has not fallen much in two years despite the leakage. Shouldn?t the impact of the leak be to reduce the level of radioactivity in the trench water? If this was an osmotic type-process, you?d expect to see the radioactivity of water in the trench fall as the radioactivity of the water on the other side rose. And if this is a straight leak radioactive water goes into clean water, no flowback , wouldn?t you see pressure and/or water levels in the trench falling as in why would it take these guys so long to figure this out? Third is that Tepco ?hopes? to fix the problem by per the Japan Times by ?building a wall out of liquid glass between the reactors and the sea? to isolate the radioactive water and then removing it. ?Hopes? is one of those formulations in Japanese that often refers to aspirations rather than plans. Does anyone know if a process like this has ever been implemented successfully? The second problem came to light last week, but appears to have gone largely unnoticed in the West. Tepco has been using water to cool the No. 1 reactor. It?s running out of storage space for the contaminated water. It promises to clean it up some before discharging it into the ocean. If you read this article from OilPrice carefully, I believe it has some elements of the story that was updated over the weekend the confession about groundwater leakage conflated with the other issue what to do about ever-increasing amounts of water contaminated by cooling the plant that eventually has to go?somewhere . This conflation may not be OilPrice?s doing. Japanese allows speakers to be very vague, and if I were Tepco, I?d be as vague and confusing as possible. By Charles Kennedy. Cross posted from OilPrice The 11 March 2011 earthquake and subsequent tsunami that devastated Tokyo Electric Power Co.?s Fukushima Daiichi nuclear power plant has left TEPCO struggling with a potential public relations disaster ever since. Since the onset of the incident TEPCO used massive sprays of water to cool the damaged reactor complex. The debacle ignited concerns worldwide about the release into the environment of radioactive debris from the stricken nuclear facility, a topic that both TEPCO and the Japanese government worked to downplay. Relentlessly upbeat and optimistic information has been sparingly released by TEPCO ever since, but on July 25 the Japanese newspaper Asahi Shimbum reported that Japan?s Nuclear Regulation Authority chairman Shunichi Tanaka told journalists that ?The Fukushima No. 1 nuclear reactor plant is filling up with water. Inevitably the contaminated water will have to be discharged into the sea after TEPCO processes it properly and lowers its radioactivity levels below the standards.? Since the incident TEPCO has been pouring water over the damaged complex reactors to cool them for more than two years, but contaminated water has been building up at the rate of an Olympic-size swimming pool each week since then. Three months ago TEPCO stated that the space to store the irradiated water was limited and asked for government approval to shift groundwater with ?low levels of radiation? from the stricken facility to the Pacific via a ?bypass.? Japan?s Nuclear Regulation Authority head Shunichi Tanaka cautiously told journalists, that he believed that the maritime leakages since Fukushima were ongoing, stating, ?I think contamination of the sea is continuing to a greater or lesser extent. It was contaminated at the time of the accident, but I think it has been continuing for the last two years. Coming up with countermeasures against all possible contamination scenarios is a top priority.? The existence of nuclear power plants is a total mass extinction even waiting to happen, far above the threat posed by mere climate change. Prototype pebblebeds have already had feed-jams and fires. You can listen to the happy-talk if you like, but you can no longer say you weren?t warned. It is literally delusional to think this technology will be made safe. It is unlikely that safety was even a theoretical possibility. Oh yes: And spent fuel. Nobody talks about that?for good reason! It just accumulates and accumulates, and no one has a clue what to do with it. Vitrification? Too energy intensive?you have just negated the value of going nuclear in the first place. Dry cask storage? Even that is too expensive. End of story! Spent fuel can go critical. Before Fukushima, no one really thought it likely. Now we know it is part of the routine. It is now the eventual fate of every nuclear plant in the world to melt and burn. They won?t all burn at the same time?this will be strung out over years and decades. Get a map. Look at where the plants are. Look at where you live. Get out a compass and start drawing circles. Generally, anything within 100 kilometers is no go. You mileage may vary. Weather and prevailing winds matter. TEPCO is showing us what disaster response will look like. It will consist of soothing talk. Don?t expect anything more, and don?t expect any truth, either. It is up to you to decide if you are in the exclusion zone, and it is up to you to act accordingly. Take responsibility for you own life?nobody else will! Heh? Depends on the nuclear power, really. The designs in use right at the moment, I?d say were problematic I?d hesitate to say ?mass extinction event? problematic- that?s just emotions, sir? but there?s other designs, other reactions other than Uranium or Uranium/Plutonium that can be used. These designs I refer to were not chosen, not because of their safety or efficiency/effectiveness, but rather because not a single one of them were effective at small sizes like you?d find on a military vessel and they didn?t produce byproducts that could be later weaponized. The military developed the basic designs you mostly see Chernobyl?s a differing story? , especially in Japan, for subs and carriers. The designers then scaled those military purposed devices up. The fact that they have suspended rubble removal from bldg5 due to a steam plume off the containment vessel i think is a pretty good indication a continuing and uncontrolled fission reaction is occurring. What would tell the tale is the composition of the RA speicies being generated. Short half life is bad juju of course. As I have mentioned, they are sooooo fckd on this. Last i heard is that the radiation remains sufficiently intense that it will still fry any electronic devices? like a remote telemetry devices cameras robotic widegets and the like. The bright side of near 0 wstrn MSM coverage is that at least they aren?t getting it wrong! It bugs the shite out of me that we all may die because the plutocratic bought leadership refused to admit that we have a potential life threatening situation here for many, if not all of us. Damaged rods and ?molten goop? can?t just mix to create fission. The correct geometry must exist. Also, boron is being added to the coolant which is a fission ?poison?. This long after the accident, it?s highly unlikely recriticality would occur. There is no evidence that any of the cores have breached containment. It is believed that the a portion of the core of reactor #1 has breached its vessel and is sitting on the floor of secondary containment, the drywell vessel, perhaps having melted through a meter or so. The base of the drywell vessel is embedded in 39 feet of concrete. That isn?t to be confused with integrity of the containment being maintained however, as evidenced by the high volumes of water leakage, only that fuel has not exited containment. None of this can be known with absolute certainty however as nobody can go in and visually inspect the fuel. However between computer simulations, radiation readings, instrument readings at time of accident, and views into secondary containment with robots and endoscopic equipment, this is the current best estimates. That the fuel in reactor #1 would experience the most damage makes sense given it was uncovered thus loss of cooling within 4 hours of the earthquake and tsunami as opposed to two days and 3-4 days later. After shutdown, heat dissipation follows an exponential curve. My response was misplaced,.. moving a copy for clarity I? m glad you like my technical term goop. I have seen no evidence that precludes a molten and uncontrolled radioactive mass to form and reform a critical concentration if it is mobile molten . I have in the past been involved in the design/supply of process equipment for uranium enrichment and processing fuel ?beads? for control rods. In all cases, an enrichment calculation defines the maximum diameter/length volume of a process vessel to avoid criticality if it were to hypothetically fill 100%. If this is a response to what I wrote, please reread. ?It is believed that the a portion of the core of reactor #1 has breached its vessel and is sitting on the floor of secondary containment.. To be more succinct, lets restate: ?It is believed that the core of reactor #1 has breached its vessel. It?s a binary, either it has or it hasn?t, kinda like being ? a portion? pregnant. One thing that has been proven, Tepco and the Japanese government are not credible and are demonstrably incompetent. I certainly don?t expect them offer any candid assessments short of being cornered with evidence. In general, slow neutron chain reactions required a moderator water, heavy water, carbon, etc. . Goop and collapsed fuel rods won?t normally have the water moderator present in sufficient quantities for a chain reaction. In addtion, boron is a profound nuclear poison. To the extent that water containing boron has penetrated the ?goop?, no chain reaction is possible. In theory, a large enough quantity of enriched uranium could reach criticality without any moderator. Whether this has happended in Japan is unclear, but current indications are that it has not. In any case, the presense or absense of an ongoing chain reaction is easy to detect. A chain reaction produces a radiation signature that is easy to measure. From Wikipedia ?Neutron beam observed 13 times at crippled Fukushima nuke plant. These ?neutron beams? as explained in the popular media, do not explain or prove a criticality excursion, as the requisite signature combined neutron/gamma ratio of approximately 1:3 was not confirmed . A more credible explanation is the presence of neutrons from continued fissions from the decay process. It is highly unlikely that a recriticality occurred in Fukushima 3 since workers near the reactor were not exposed to a high neutron dose in a very short time milliseconds , and plant radiation instruments would have captured any ?repeating spikes? that are characteristic of a continuing moderated criticality accident. TOKYO, March 23, Kyodo News http://english.kyodonews.jp/news/2011/03/80539.html? You?re right. That?s an excellent compilation of information. Thanks! They?re dead on that critical info often gets buried by Tepco, requires some technical understanding, and/or will be reported in Japanese but not English thank goodness for Google translate . After a quick glanceover, it mostly looks to be very good reporting. 		samhill July 29, 2013 at 5:48 am			 My uninformed two cents: The plant is right on the coast as are most for obvious reasons, and it?s not the ocean view so the water table can only be a few feet down ? ever dig a hole at the beach? So yes, as commented already, they must have had basement pumps going continuously from the first day it was built. The NYC subway is like this, and there are sections where pumps have been operating routinely 24/7 for the last 100 years. If anyone believes the leaks into the oceans are fully controllable or the least bit surprising to Tepco they are extremely gullible. The quantity of cooling water pumped through the failed and breached reactors everyday is simply enormous, impossible to totally contain, monitor, or store, and even more impossible to appropriately decontaminate, as if there is even the technology for that. If the reactors are heating up again expect even more water to be hastily forced in any way they can. Everything from Tepco and the Japanese govt. is a fairy tale, as should be expected seeing the fairy tale is all they got. My guess is behind closed doors Tepco welcomes the continuous leaking into the ocean and ground water, and every so often when the desperately improvised storage tanks are overwhelmed they mysteriously leak and empty themselves. How do you say, ?oops, darn, how?d that happen?? in Japanese? Leaking into the ocean is going to be this thing?s story for centuries to come, and yes it?ll contaminate the globe. Note date is one year ago, so 1-2 year projection at that time is just beginning to occur now. Found this by googling ?Fukushima Ocean Radiation Maps. Probably, you will be able to swim in the ocean for a long time to come. If I have to carry $1 million dollar?s worth of liability insurance on my auto, why are nuclear power companies and other corporations in other industries not required to also carry such insurance commensurate for the damage they may do? The likelihood of me or many other drivers every individually causing $1 million dollars worth of damage is slim yet we must carry the insurance. Extrapolating this principle to TOO BIG CORPORATIONS, I suspect that if they were required to carry insurance for the potential damage they could cause, their business models would be quickly fractured and the companies and their particular racket out of business. Here in Canada we have a good illustration of this. The usual Oil Perps are deep drilling off the CDN East Coast. Previously, their liability insurance was a paltry $30 million, now to be raised to a still paltry $1 billion. A man made oil disaster a la BP in LA would cause billions Carl Sagan billions worth of damage. The horrific weather in the North Atlantic would make the BP disaster look like a picnic. Looking at the Bigger Picture: how much liability insurance do all those thousands of blossoming biotech and nanotech labs carry? Is it enough to ever fix the man made disasters they might cause? How much insurance needed for destroying the Biosphere? See Bill Joy, Why The Future Doesn?t Need Us. The reason nuclear plants are backstopped by taxpayers is because private insurers won?t touch them. Either they?d have insurance that was inadequate or more inadequate or the US government provides their excess liability. I don?t know what the total bill for Tepco will be. I don?t think I can count that high. But factor in a semi-circular 20km radius that is uninhabitable that they?re required to purchase for starters. Followed by a 40 yr cleanup effort that will be a non-stop money pit. It?s been plagued by problems and will continue to be so. Corrosion from seawater could create a nightmare the likes of yet to be seen. Children in Fukushima prefecture are being reported to have alarming rates of thyroid disorders. Thanks, jrs, you got the point. We could even then make an economic axiom: backstop catastrophe and you will get them. Moral Hazard squared. As technology moves ahead and becomes more and more powerful like the ability to create financial derivatives, e.g. , there is more and more likelihood of uninsurable, man made catastrophe. Thinking that the Pacific is huge and will ?dilute? the radiation is a mistake I am not assuming willful disinformation, I don?t know you, Jim . This stuff is going to be running into the ocean for a long time, and much of what is going in has a half life of thousands, if not tens of thousands of years. They can?t stop what they can?t get near, and there doesn?t seem to be any urge to save their own country, much less the rest of us. And if people think that the coriums haven?t left the buildings, I would urge you to google the explosion of Reactor 3, full of MOX full. That is the most spectacular example of what Tepco told the world was ?a cold shutdown?, with the resulting plume circling the northern hemisphere every 40 days since 3/11. Japan and the US just keeps raising ?allowable limits? which are never ?immediate health risks.? The amounts of radiation in the tunnel, the 2.3 millions bq/liter are just measurements of cesium 134 and 137 combined. NO OTHER isotopes are listed. And while c134 has a shorter half life on ?only? a little over 2 years, c137?s half life is over 30. The rest of the radioactive soup will be with us for a long time. And we sure don?t see the heroic efforts made by the former Soviets in Ukraine. I think Japan is finished, and if we don?t get on this in a world emergency fashion, it will be a very different planet in not too many years. 		TomDor July 29, 2013 at 11:18 am			 Alas, man?s centrism upon this planet, his feelings of superiority above all else, his delusion of dominion. We still do not recognize our own follies as we ascribe false images to ourselves. We implore the alcoholic to recognize and admit the disease within him in order that they may curb themselves of the affliction. We have created capitalism and, support a system that encourages everyone of us to ?get-one-over on our fellows?. Yet this system is oppositional to our existence upon this planet?. grab a resource, an asset and manipulate it?s price higher so the next fellow can be that much more impoverished. Most all of us did it throughout the real estate bubble and most all of us are paying the consequences of our follies?. yet we refuse to recognise or admit our follies so that we may curb our disease? praise the noble alcoholic for his efforts to unveil the truth unto himself. One speculates about the minds of men who transgress upon the ?morality of men? ? we label them as psychopaths who stab others in the back to gain their advantage? we wonder how such men rise to the top and, grant ourselves forgiveness that we have not had a hand in the situation. Well, of course men of that, earned reputation, will rise to the top because, we live in a system that encourages the outcomes. If we do not recognize our disease we will not be able to change it. We all most went along laughing and dancing down this path?.drinking and laughing aloud. When the drink was gone we blamed certain people while never acknowledging our own culpability no matter how small ? we will not curb anything until we admit our own responsibility. Forgiveness will not occur nor will actions toward correcting the mistakes take place without recognition of our follies. Perhaps pride has us captured. Simple math will tell us that continuously adding water to a container will eventually fill that container. ? the half life of radioactive materials will tell us how long water will need to be added and at what rate that water will need to be added to dilute radioactive materials to an acceptable level or cool it sufficiently. If the container can not be increased in size quickly enough it will overfill the container ? that overflow is, by definition uncontained. I would assume the calculations are already known by Tepco and the government as, I can not image such simple math is not employed. This is such a massive tragedy. One that anyone who knew about the fault line could have predicted. It?s probably safe to say that there will never be enough money in all the world to mitigate human foolishness. Isn?t this where the idea of money breaks down altogether? All of the trillions that went into the shadow banking system to keep world finance from a meltdown will be a drop in the bucket compared to what is necessary to keep our insane infrastructure from imploding. At Fukushima, all the heavy particles will sink to the bottom of the ocean and stay there forever and when a storm comes along, or maybe another tsunami, they will be churned up and reenter circulation, so when you think about it they aren?t just one time contaminants, they are continuous contaminants. For how long ? 50,000 years? I? m glad you like my technical term goop. I have in the past been involved in the design/supply of process equipment for uranium enrichment and processing fuel ?beads? for control rods. In all cases, an enrichment calculation defines the maximum diameter/length volume of a process vessel to avoid criticality if it were to hypothetically fill 100%. If this is a response to what I wrote, please reread. To be more succinct, lets restate: ?It is believed that the core of reactor #1 has breached its vessel. It?s a binary, either it has or it hasn?t, kinda like being ? a portion? pregnant. Actually the statement should be: ?Political and corporate leaders are not credible, having been shown for centuries to lie repeatedly whenever they think it is in their self interest?. Temco didn?t design the nuclear reactors at Fukushima, General Electric did. They are standard model light water reactors?exactly the same designs as are currently operating in the US. Of course siting them on a coastline behind an inadequate seawall in a tsunami-prone region was the proximate cause of the disaster, but the very design of the reactors themselves is critically flawed. Pressure water reactors depend upon a constant supply of cooling water held under extreme pressure to prevent boiling and subsequent hydrogen explosions. In order to operate they must have multiple levels of active and passive back-up safety systems that will hopefully contain an accident in progress as primary systems fail. How did the world end up using uranium fission to boil water and turn a simple steam turbine, with a nightmare of critical plumbing and massive concrete and steel structures to contain the toxic results? When the alternative of automatic cold shut down and non-critical cooling design existed at the same time? Simple: the safer design?Liquid Sodium Thorium Reactor?didn?t produce Plutonium for bombs. And Our Leaders valued nuclear bombs far more than cheap power. LFTR reactors may only produce 5% of the nuclear waste volume of conventional reactors, but they still produce waste products that must be managed by responsible adults. And I?m not convinced that the human race has demonstrated that it is capable of that responsibility. As some of the comments here clearly show, Tepco?s claims do not stand up to even casual analysis. One reasonable explanation that accounts for the facts is that Tepco has much more radioactive material that it was prepared to confess to, is dumping it into the ocean, and is lying about it. As if that?s never happened before. But other explanations are also reasonable. Years ago there was a hazardous chemical spill on the Rhine river. Every polluter in western Europe appears to have taken the opportunity to dump their own hazardous waste into the Rhine, expecting the known spill would provide cover for their own illegal dumping. So don?t be surprised if it comes out that the Tepco disaster is being used as a cover for other nuclear industry players to dump their own radioactive waste. In fact, given the present scope of political and economic corruption, it would be perfectly realistic to expect it. Any time a large and politically-connected institution admits to a problem, you can be certain that they?re minimizing the problem and that the reality is vastly worse. The truth is, you will never be told the truth. 		jfleni July 29, 2013 at 2:21 pm			 Your web site says ?Private sector human expeditions to the Moon are now feasible and profitable without government funding? Why not with government funding, funding they would beg you to take, while avoiding a potential catastrophe and saving themselves huge future amounts? This could be the start of a good long-term money-maker for Golden Spike or Russia or USA & Europe. Really the only safe place for the hot nuke detritus of Chernoble the sarcophagus is now at the end of its design life or Fukishima, the multiple tons of increasing nuke waste and fuel accumulating for a half-century in Japan, USA and Europe would be on the moon, where the recent GRAIL project has found many of the likely caves, caverns, craters and voids perfect and safe for this purpose. Expeditions to store this really dangerous and very acccident-prone stuff could take most of a century and really start serious space exploration and scientific research, and solve a pressing problem at the same time. For example, the needed research into radiation-resistant robotics could start a new boom, and the be foundation of a new industry. Don?t let Europeans tell you that they have never had problems; as a crew member on an a US container ship in the late-1980s, I clearly remember the panic and alarm caused by the near sinking of a shipload of French nuke waste in the English Channel in the middle of the night! British ships and commerce would have found themselves confined to their tight little island for a very long time, while the French would have had to travel very far out of the way to get anywhere. Launches from Florida or California would probably be too risky, but launches from the new VOSTOCHNY cosmodrome in NE Siberia being built right now, or Korou French Guiana, would probably work. Both places are next to vast stretches of open ocean. The USA high-tech sector could benefit greatly, if they act sensible and cooperate with the Russians and Europeans, and private concerns like Golden Spike. If they are too dumb inside the beltway, let the Russians, Europeans, and Golden Spike get the gold. Good luck and success with your billionaire tourism, but please think about the bigger picture too. I still think it?s a good idea. I recall seeing a science fact article in an old Analog Science Fiction Magazine from the 1980s, with numbers for high-level nuclear waste disposal on the moon by impacting it at a known spot. As I recall, the numbers weren?t too outrageous if it was done without the need for a soft landing. The theory was ? no biosphere, no settlements, known waste site, therefore hard impact would be OK. Cheaper and safer than putting in in a stable orbit somewhere, such as a Trojan orbit. We really wouldn?t want it at L-5, or one of the other lagrangian points in the Earth-Moon system. Something might perturb it out of a stable orbit. It?s a long time since I fired neutrons at stuff. The precautions we took at university were severe, though one or two experiments that failed might have killed us if they had worked. Radioactivity from nuclear plants has been overdone, Frankenstein-style. The real problem is that we have been lied to since the beginning. The piles were constructed to make bombs while we were told electricity would be as cheap as water. Fukushima was certified as tsunami threat free. The private sector and sub-contracting got in and safety became a cost to be hammered down. Big companies write extensive lies on risk assessment as they do in the oil and gas industry. Fukushima is now an unwanted cost and we have seen in the UK that the private sector wouldn?t touch our industry with a barge-pole due to decommissioning costs. The technology works and is the kind where you?d expect over-engineering on safety. But then, you?d expect a major gas producer like Britain to store gas in summer rather than buy it back from Europe in expensive winter markets. This is really about our sad business and economic practices. Rather than understanding more about radioactivity I?d ask people to try and damp-proof a wet cellar called tanking and then imagine the scale of tanking Fukushima with materials that not only stop water but also radioactivity. The technical details of the engineering needed are not in the public domain, nor the geology how far down and does the ?wall? have to be built underneath etc? . The corporate owner has been lying from the start. It?s like trying to guess how far a derivatives collapse will go! There is no technical full disclosure to work from. My family members have survived Chernobyl quite well and none of them have cancer. But the one thing I agree with is that people should read a book or two on nuclear physics and then would realize that there?s really not much to worry about but pressurized water reactors are the worst and most dumb way to do nuclear power and General Electrics PW 1000 reactor is the most godforsaken and beyond dumb design any human or half retard monkey could come up with especially that the control rods are pushed from the bottom. The very first commercial power reactor but not power producing in the world was the Soviet reactor at Obninsk and its control rods ware held by electro magnets at the top of the reactor so if something went wrong they would just drop in when the power was cut. The only reactors that I personally think are safe and can literally run on nuclear waste are the molten salt reactor which would solidify If the salt leaked from the moderator/reactor zone which is melt down proof and wont release particles and the fluoride salt doesn?t dissolve in water very well and the other is the molten lead cooled fast reactor which is almost fool proof and of a completely passive design as in needing no coolant pumps to operate but are used only to make power. TEPCO also needs to get off its collective butt and build a sheet- piling cofferdam around the reactor campus, Sheet piles are interlocking steel plates that are corrugated lengthwise to give them rigidity. They can be vibrated into the ground to the bedrock to keep water in the soil under the plant. The piles are caulked shortly before driving them to keep water from seeping between adjacent piles. Using these piles is a commonplace technique for building seawalls, revetments and bulkheads. A cofferdam could be built around Fukushima within weeks without exposing workers to radiation. A cofferdam should have been started once radiation was discovered in seawater outside the cooling outflows, once management knew water was leaking out of the reactors. It?s hard to understand why engineers can?t activate themselves to get this common- sense task underway. With a cofferdam in place there would be no water leaking from the site, no groundwater leaking into it. I also suggested for Tepco to pump solids into the reactors along with cooling water; solids such as sand, boron and Bentonite clay. The clay would plug fissures and keep water within the reactor buildings instead of it leaking into the ocean. Tepco planned to build a high-tech cofferdam but nothing came of the idea. Tepco now plans to inject liquid nitrogen into the ground to freeze the soil under the reactors. There are several ways to do this but with Tepco?s current management approach it will take decades for them to accomplish this fairly routine construction task. Tepco could also build a slurry wall cofferdam around the reactor complex. This is a deep trench dug with special machines that is filled with oil drilling mud as it is deepened. When the appropriate depth is reached, the trench is filled with reinforcing steel and concrete, which displaces the mud. Such a slurry wall was built around the WTC site in NYC in the early 1970s. A problem for Tepco is that they?ve steadily irradiated their workforce. They are running out of people who can work @ Fukushima Daiichi. Tepco does not know where three reactor cores are, + 500 tons of unmoderated fissile material. The Japanese establishment does not know the cores? configuration. A core or critical mass of core material under certain conditions can explode as has happened in different reactors both in Japan ex-Fukushima, in the USSR and in the United States. The cores are vulnerable for decades to come, as are thousands of tons of spent fuel that remain within the 6 reactors on the Fukushima site. The US, China, Mexico and Canada should put pressure on Japan to fix these reactors soon. A strategy would be to inform the Japanese, no cars sold in the US by Japanese companies as long as the reactors leak. Japan should hire Boots and Coots to come up with a plan to drill the reactor cores from the soil under the reactors. I remember your posts at the time. I was grateful for them then, and I am grateful for them now: Thank you. It was very hard for me to accept that the Japanese leadership would willingly destroy its own country. I still do not understand it, but I accept it for what it is. Even assuming they plan to finish their days in luxury villas on the French Riviera, it does not really make any sense. But I realize now that it won?t and is never going to. At least as hard to understand is the US government being willing to let the Japanese destroy our West Coast. By which I mean half the activities associated with the ocean will have to be abandoned and this is not negligible. One dark possibility is that the US has looked at the future of the oceans under overfishing and acidification, and has decided that since they are going over to slime, red tide, and jellyfish in a couple of decades anyway, that there is no point in worrying about a few radioneucleides now. On the other hand, that in turn implies coherent thought on their part, which is in itself no longer credible. Your point about bankruptcy may be a key. While it is clear our institutions no longer wish to carry out any constructive purposes, the deeper problem may be that they no longer can. I did not address you point that Fukushima might explode again. I think US leaders are trusting to luck, and if that fails, to villas in Paraguay. Gasland Part II follows on three years later, to continue documenting how the stakes have been raised on all sides in one of the most devastating environmental issues rapidly spreading the globe. This sequel further enriches the argument that the gas industry?s portrayal of natural gas as a clean and safe alternative to oil is a lie, where in fact fracked wells inevitably leak over time, and vent exuberantly more potent greenhouse gasses such as methane in cumulative effect, not to mention the continued string of cases of severe water contamination across the United States and even cases as far away as Australia. Gasland Part II follows deeper into these happenings, revealing yet more of an entrenched corporate collusion in the pursuit of exploiting dwindling ?natural resources?? I expect to get labelled a ?nuclear shrill? but all the same I?m not opposed to nuclear energy production in theory ? I?m quite opposed to how we have gone about generating energy from nuclear sources, the production of nuclear materials for weapons of mass destruction, and huge needless waste issues based on a desire to kill two birds with one stone, namely generate energy whilst producing said weapons grade materials ? so, by any means or measure, PWR?s are, and always were an accident waiting to happen. As many are aware, during the 50?s and 60?s a battle ensued as to which type of technology would be deployed to generate nuclear energy, be it Thorium, PWR or advanced gas cooled designs as advocated by the British. American knowhow and business clout won out, despite the fact that PWR were probably the least efficient and dangerous of all design options ? decisions to utilise these designs in areas with huge tectonic activity seem beyond the pale, never mind the waste issues associated with these blunders of design. So, there you have it, I?m not opposed to nuclear as such, but much of the history of nuclear makes uncomfortable reading ? what could have been a safe form of energy was bastardised and we are all paying for this. As for issues in Japan ? lets be blunt, all PWR?s should be closed and decommissioned ASAP ? as for Fukushima, the Japanese authorities need to get a firm handle on the crisis now, stop the release of waste into the environment and dump as much graphite material as possible on the entire plant before entombing it under millions of tons of sand and concrete ? an eyesore, but better than poisoning the ocean and our global environment. As a brit, I?m opposed to any further PWR-based construction in the UK ? its thorium all the way, or abandon it once and for all.