MOSCOW ? Russian authorities offered a teasing glimpse of liberation for U.S. fugitive Edward Snowden on Wednesday when they said he could leave the diplomatic no man's land of Moscow's main international airport and live in Russia while he waits to hear about his request for temporary asylum. No sooner had Russian news media reported that the undocumented American would be given papers to cross into Russia than his lawyer said Snowden's attempt to clear passport control had been thwarted by bureaucratic difficulties. The Kremlin-allied attorney, Anatoly Kucherena, said Snowden would have to stay in the airport transit zone for at least another day. It wasn't immediately clear whether the last-minute complication was of the nitpicking variety that typically causes Russian border guards to reject documents because of creases or smudged print, or a choreographed attempt to delay relief for Snowden and keep him on edge. The delay also bought time for Russian officials to reconsider whether granting Snowden entry while his asylum bid is weighed will damage relations with Washington. The National Security Agency leaker arrived at Sheremetyevo International Airport on June 23 on a flight from Hong Kong, reportedly en route to a Latin American country that was considering giving him asylum. But because U.S. authorities had revoked his passport, he was unable to enter Russian territory, nor was he able to buy air tickets to travel elsewhere. Russian President Vladimir Putin has said Snowden is welcome to stay in the country as he seeks to evade U.S. criminal charges of espionage and theft in connection with his absconding with sensitive National Security Agency data files. But Putin has said Snowden must refrain from further disclosures that could roil U.S.-Russian relations. Both the White House and the chairman of the Senate Foreign Relations Committee, Sen. Robert Menendez D-N.J. , warned the Kremlin against giving Snowden any refuge and demanded he be handed over to U.S. authorities. Kucherena met with Snowden on Wednesday afternoon to pass on the official papers that were supposed to get him through immigration and out of the airport. He told the mob of reporters anxiously awaiting the fugitive's emergence from the transit zone that new complications had arisen. We ran today into some bureaucratic difficulties, but it is not a big deal as everyone understands it is a unique case, Kucherena said in an interview with The Times. He declined to go into detail about the problems but said they were nothing serious to worry about. He said Snowden had to be fingerprinted and fill out a new form. Snowden's main concern is his security as he realizes full well that the safest place for him right now is the transit zone, the lawyer said, alluding to the possibility that Snowden could be snatched from the streets rendition-style and spirited back to the United States under diplomatic cover. The former government contractor plans to stay in the country for the time being, the lawyer said, and is already learning Russia's language and culture in hopes of getting a job while he waits to hear about his asylum request, a process that usually takes about three months. In addition to some clothes I brought him a book of stories by Anton Chekhov and 'Crime and Punishment' by [Fyodor] Dostoyevsky, Kucherena said. It was unclear where Snowden, 30, would stay once he leaves his airport limbo. Several Russian human rights groups have pledged to help the man they admire as a whistle-blower on excessive U.S. government surveillance.