* Former U.S. spy contractor seeks temporary asylum * Putin says U.S. ties more important than spy sagas * Snowden's fate poses dilemma for Putin Recasts with Putin comments on U.S. ties By Denis Dyomkin and Alexei Anishchuk MOSCOW, July 17 Reuters - President Vladimir Putin signalled clearly on Wednesday that he did not want a dispute over the fate of former U.S. spy agency contractor Edward Snowden to derail Russia's relations with the United States. Russia has ruled out extraditing Snowden, wanted by Washington for leaking details of U.S. surveillance programmes, and the U.S. citizen is currently stuck in the transit area of Moscow's Sheremetyevo airport. Allowing him to stay in Russia even temporarily would upset Washington. Putin does not want to jeopardise a planned Moscow summit with President Barack Obama in September, their first in Russia since he started a new term last year, or cloud the atmosphere at a subsequent G20 summit in St Petersburg. But a refusal would open Putin to criticism at home that he gave into Moscow's former Cold War enemy, even though he has refused to extradite Snowden to the United States to face espionage charges. Asked during a visit to the eastern Siberian town of Chita whether the affair would cast a shadow over a U.S.-Russia summit due in September in Moscow, Putin told reporters: Bilateral relations, in my opinion, are far more important than squabbles about the activities of the secret services. Putin did not say whether Russia would grant Snowden's temporary asylum request, filed on Tuesday after more than three weeks at Sheremetyevo, but reiterated that he must agree to do nothing to harm the United States. We warned Mr Snowden that any action by him that could cause damage to Russian-American relations is unacceptable for us, the former KGB spy said. Snowden's decisions were a matter for him, said Putin, and suggested that if Russia granted him temporary asylum it should not be seen as a challenge to the United States. We have our own objectives as a state, including in the area of the building of Russian-American relations, Putin said. Putin has used the case of Snowden, who fled to Hong Kong and then flew to Moscow on June 23, to accuse the United States of preaching to the world about rights and freedoms it does not uphold at home. But both countries have signalled they want to improve ties, strained by issues ranging from the Syrian conflict to Putin's treatment of opponents and Western-funded non-governmental organisations since he started a third term in 2012. UNWELCOME GUEST Anatoly Kucherena, the Russian lawyer assisting Snowden, said Snowden had no plans to leave soon for any of the three Latin American countries that are offering him refuge because of U.S. pressure on its allies to bar his way. Kucherena said he expected a positive response within a week to Snowden's request for temporary asylum in Russia. That would allow him to stay until he is sure of safe passage to another country. Bolivia, Nicaragua and Venezuela have offered him sanctuary. The grounds that he cited in the application ... hardly allow for a refusal of asylum, he told reporters. He has no plans to go elsewhere. He can't go anywhere, even if he gets a valid passport. Asked whether Snowden might apply for Russian citizenship, Kucherena said: He does not rule it out . He said he had given Snowden a children's Russian ABC book to get him started learning the language. Kucherena quoted Snowden as saying he had expected to be persecuted but had been surprised by the excessive, disproportionate response. The United States on Tuesday repeated its call for Russia to send Snowden back, saying he was not a human rights activist or dissident and was accused of leaking classified information. In Russia, temporary asylum is granted for a year and can be extended. Unlike political asylum, which would require a decree from Putin, the decision to grant temporary asylum is officially up to the Federal Migration Service FMS . The FMS has three months to decide but Kucherena told Reuters he expected Snowden to able to leave Sheremetyevo within a week and that Snowden had given him a verbal promise that he would stop anti-U.S. activities. Additional reporting by Anastasia Gorelova, Writing by Timothy Heritage and Steve Gutterman; Editing by Jon Boyle