CIA whistleblower Edward Snowden has applied for temporary asylum in Russia, his lawyer said today. Lawyer Anatoly Kucherena said the 30-year-old submitted his request to an official from Russia?s Federal Migration Service at the airport where he has been holed up for several weeks. The Migration Service later confirmed that it had received the 20-page application and that it would be processed within the ?statutory period?. ?He reached the conclusion that he needs to write an application for temporary asylum, and this procedure has just been done,? said Mr Kucherena, a lawyer with strong links with the Kremlin who helped Snowden with his application. ?For now he is not going to go anywhere. For now he plans to stay in Russia.? Mr Kucherena added the fugitive had stated in the application that he faced possible torture and execution if he returned to the US. If successful the Kremlin will be able to issue Snowden, who has had his American passport revoked, with temporary documentation to allow him to move freely around Russia once the application is processed. It can take up to five days for that preliminary review of the application to be completed. Snowden, who is being assisted by anti-secrecy website WikiLeaks, has been stuck in Sheremetyevo?s transit zone since he arrived on a flight from Hong Kong on June 23. He fled the US in May after exposing the National Security Agency?s PRISM program which gives officials easy access to data held by nine of the world?s top internet companies, including Google, Facebook, Microsoft and Skype. US authorities have charged him with theft, espionage and theft of government property, which could see him jailed for up to 30 years. If Snowden?s attempt proves successful it would place further strain on American and Russian relations. In less than two months Vladimir Putin and Barack Obama, are to meet in Moscow and again at the G20 summit in St Petersburg. President Putin has refused to hand over the fugitive to the US, but also said he could only stay in Russia if he stopped leaking secrets about US surveillance schemes. Snowden had sent requests for political asylum to at least 21 countries, most of which have turned down his request citing the application could only made on their own soil. However, Bolivia, Nicaragua and Venezuela have indicated they could take him in - but getting there from Moscow is not without its problems. Any plane carrying Snowden could be refused entry over America or its allies? airspace. Snowden has left behind ballerina girlfriend Lindsay Mills.