A US Senate panel approved its annual authorization of funding for intelligence operations, including measures to increase spy agencies' ability to prevent leaks of classified information like those by former National Security Agency contractor Edward Snowden. The American Civil Liberties Union urged a federal judge to halt the US government's sweeping collection of phone data, arguing that the controversial program goes beyond what Congress authorized and violates the constitutional rights of all Americans. British and US spies targeted a senior European Union official, German government buildings, and the office of an Israeli prime minister, according to the latest leaked documents from Edward Snowden published today. Israeli officials said they were not surprised by allegations the United States and Britain had spied on the country's leaders and played down the importance of any information its allies may have gleaned. A Norwegian member of parliament has nominated former US National Security Agency contractor Edward Snowden for the 2014 Nobel Peace Prize, arguing that his release of classified documents made the world a safer place. It was the first known direct contact between Putin and Snowden since Russia gave the American refuge after he disclosed monitoring data by the US. Former US spy agency contractor Edward Snowden, wanted by Washington on espionage charges for revealing the secret US electronic surveillance programme Prism, has applied for political asylum in more than a dozen countries. Spain said it had no reason to apologise after a plane carrying Bolivian President Evo Morales was diverted on suspicion that fugitive US spy agency contractor Edward Snowden was on board. Contracting firm Booz Allen Hamilton Holding Corp said today it has fired Edward Snowden, who admitted to releasing information on the US government's broad monitoring of American's phone and Internet data, for violating the firm's ethics and policies. The National Security Agency contractor who revealed the government's top-secret monitoring of phone and Internet data says he intends to stay in Hong Kong and fight any effort to bring him back to the United States to face charges. Roughly one in three Americans say the former security contractor who leaked details of top-secret U.S. surveillance activity is a patriot and should not be prosecuted, according to a Reuters/Ipsos poll released on Wednesday. FBI Director Robert Mueller said that the US government is doing everything it can to hold confessed leaker Edward Snowden accountable for splashing surveillance secrets across the pages of newspapers worldwide. A few hundred rights advocates and political activists marched through Hong Kong to demand protection for Edward Snowden, who leaked revelations of US electronic surveillance and is now believed to be holed up in the former British colony. A few hundred rights advocates and political activists marched through Hong Kong to demand protection for Edward Snowden, who leaked revelations of US electronic surveillance and is now believed to be holed up in the former British colony. An Icelandic businessman linked to WikiLeaks said he has readied a private plane to take Edward Snowden, the former National Security Agency contractor who exposed secret US surveillance programmes, to Iceland if the government grants him asylum. US prosecutors have filed a sealed criminal complaint charging Edward Snowden, who disclosed American telephone and internet surveillance programs, with espionage, theft and conversion of government property, the Washington Post reported. By meeting a privacy oversight board today, President Barack Obama sought to reassure Americans worried about losing their privacy after revelations that the US government engaged in a vast monitoring of phone and Internet data. The federal court in Virginia where the Justice Department has decided to charge Edward Snowden with leaking secrets about US surveillance programs has a long track record of hearing cases related not only to national security cases but also to cyber crime. A former US spy agency contractor sought by Washington on espionage charges appeared to be still in hiding at Moscow's Sheremetyevo airport and the national airline said he was not booked on any of its flights over the next three days. Ecuador today said the United States must submit its position regarding Edward Snowden to the Ecuadorian government in writing as it considers the former US spy agency contractor's request for asylum. A former US spy agency contractor facing charges of espionage remained in hiding at a Moscow airport while the prospect grew of a protracted wrangle over his fate. Venezuela said it had not had any contact with former US security contractor Edward Snowden, a day after President Nicolas Maduro offered him asylum in defiance of Washington. Former US spy agency contractor Edward Snowden is seeking temporary asylum in Russia and plans to go to Latin America eventually, an organization endorsed by anti-secrecy group Wikileaks said on Twitter today. The White House said that former US spy agency contractor Edward Snowden, who applied for temporary asylum in Russia, should be expelled and returned to the United States to face trial on espionage charges. The Russian media got a hold of former CIA analyst Edward Snowden's temporary political asylum request to Russia, which he wrote with a pen on a blank piece of paper while still at the Moscow airport hidden from the US authorities. The Kremlin is unaware of any plans by fugitive former NSA agent Edward Snowden to seek Russian citizenship, President Putin's spokesman said. Two US senators asked President Barack Obama to consider recommending a different location for the September G20 summit in St. Petersburg if Russia does not hand over fugitive former spy agency contractor Edward Snowden. Fugitive former US spy agency contractor Edward Snowden slipped quietly out of Moscow's Sheremetyevo airport after being granted a year's asylum in Russia, ending more than five weeks in limbo in the transit area. US President Barack Obama cancelled a meeting with Russian President Vladimir Putin planned for next month in Moscow over frustration with Russia's asylum for fugitive intelligence contractor Edward Snowden, the White House said. The US National Security Agency, hit by disclosures of classified data by former contractor Edward Snowden, said it intends to eliminate about 90 percent of its system administrators to reduce the number of people with access to secret information. President Barack Obama announced plans to limit sweeping US government surveillance programs that have come under criticism since leaks by a former spy agency contractor, saying the United States can and must be more transparent. WikiLeaks founder Julian Assange has called President Barack Obama's announcement of plans to limit sweeping US government surveillance programs a victory of sorts for fugitive former spy agency contractor Edward Snowden.  Former intelligence contractor Edward Snowden began downloading documents describing the US government's electronic spying programmes while he was working for Dell Inc in April 2012, almost a year earlier than previously reported, according to US officials and other sources familiar with the matter. The military judge who will determine how long US soldier Bradley Manning will spend in prison for the biggest breach of classified data in the nation's history said she found that his acts were wanton and reckless. The father of the ex US spy agency contractor said his son has more secrets to share and should stay in Russia to make sure the true story is told. Hundreds of protesters marched on Capitol Hill in Washington to protest the US government's online surveillance programs, whose vast scope was revealed this year by former spy agency contractor Edward Snowden. Germany's parliament will hold a special session on reports the United States tapped Chancellor Angela Merkel's phone and left-wing parties demanded a public inquiry calling in witnesses including former US intelligence operative Edward Snowden. A German lawmaker said he met Edward Snowden in Moscow and the fugitive former US spy agency contractor was willing to help German investigations into reports the United States tapped Chancellor Angela Merkel's mobile phone. Germany and Brazil circulated a draft resolution to a UN General Assembly committee that calls for an end to excessive electronic surveillance, data collection and other gross invasions of privacy. Retired US General James Cartwright is the target of a Justice Department investigation into the leaking of secret information about the Stuxnet virus attack on Iranian nuclear facilities in 2010, NBC News reported today, citing unidentified legal sources. Ecuador's President Rafael Correa said the United States asked him not to grant asylum for former US spy agency contractor Edward Snowden in a cordial telephone conversation he held with US Vice President Joe Biden. Venezuelan President Nicol?s Maduro said that Edward Snowden, the former US spy agency contractor, deserved the world's protection for divulging details of Washington's spy program. Ecuadorean President Rafael Correa said he had no plans to cut off commercial ties with any country as a result of pressures over potential asylum for former US security contractor Edward Snowden. Venezuela's President Nicol?s Maduro offered asylum to former US intelligence contractor Edward Snowden in defiance of Washington, which is demanding his arrest for divulging details of secret US spy programs. Bolivia is expected to call Spanish ambassador to the Andean country requiring a report over the diplomatic spat that ended with President Evo Morales stranded in Vienna when EU countries deny air permits on suspicions US Edward Snowden was on board.