NEW YORK/MIAMI Reuters -?Trayvon Martin's parents joined celebrities and hundreds of protesters on Saturday in rallies across the country to express anger over the acquittal of the man who shot and killed the unarmed black teenager. Singing the civil rights protest song We Shall Overcome, a crowd gathered around Trayvon's father, Tracy Martin, in Miami exactly one week after a Seminole County jury in?central Floridaacquitted?George Zimmerman?of second-degree murder and manslaughter in the incident, where the 17-year-old Martin was shot through the heart. In New York, about 200 people cheered as rapper?Jay-Z?and his wife, singer?Beyonce, took the stage where the victim's mother, was expected to speak later. Some hoisted signs reading BoycottFlorida and many wore T-shirts with a photo image of Martin wearing a hooded sweatshirt. I've got four beautiful daughters. I want them to look forward rather than behind their backs, said Harlem resident?Maria Lopez, 31, who attended the rally with her children. Visible above the neckline of her Trayvon T-shirt was a tattoo of a packet of Skittles, the candy the teen was carrying on a walk back from the store when he was shot dead by the neighborhood watchman. The protests, outside federal court buildings and police headquarters, were organized by the Reverend Al Sharpton, the veteran civil rights activist, days before President?Barack Obama?spoke extensively about the Martin case and highlighted its racial undertones. Sharpton has said protests were planned for more than 100 cities nationwide and organizers have voiced hopes they will be peaceful, with no further outbreaks of the violence that led to arrests in Los Angeles and the San Francisco Bay area earlier this week. Speaking at the?White House?on Friday, Obama also cautioned against violence, as he urged all Americans to try to understand the Martin case from the perspective of African-Americans. There is a history of racial disparities in the application of our criminal laws, the president said. A lot of African-American boys are painted with a broad brush, he said. If a white male teen was involved in the same kind of scenario ... both the outcome and the aftermath might have been different. Zimmerman remained free for more than six weeks after killing Martin because police in?Sanford,Florida, accepted that he had acted in self-defense. That ignited protests and cries of injustice across the?United States?as the case shone a spotlight on issues such as race, profiling and vigilantism. PARENTS JOIN PROTESTS Sharpton will lead one rally outside?New York police?headquarters on Saturday along with Martin's mother,?Sybrina Fulton. He has said he hopes that continued public pressure will force the Justice Department to bring a civil rights case against Zimmerman. A planned demonstration in Miami, near the home where the 17-year-old Martin lived, was due to be led by his father. Federal prosecutors have said they were pursuing an investigation into whether Zimmerman, who is part Hispanic, violated civil rights laws. But lawyers with expertise in civil rights have said they think new charges are unlikely. Public comments from one of the six jurors, citing?Florida's Stand Your Ground law as a factor in reaching her conclusion that Zimmerman acted in self-defense, has stepped up pressure on the state's Republican-dominated legislature to repeal or change the law. According to the instructions given to the jury, Zimmerman had no duty to retreat and right to stand his ground and meet force with force, including deadly force, if he reasonably believed it was necessary to do so to prevent death or great bodily harm to himself. Though the Stand Your Ground law was not specifically cited as part of the defense mounted by Zimmerman's lawyers, the jury instructions paving the way for his acquittal came from the 2005 statute. Florida?Governor?Rick Scott?met with sit-in demonstrators outside his office in the?Florida?capital Tallahassee on Thursday. He said he supports the Stand Your Ground law and has no intention of convening a special legislative session to change it. But Obama suggested that was the wrong course of action. I think it would be useful for us to examine some state and local laws to see if they are designed in such a way that they may encourage the kinds of altercations and confrontations and tragedies that we saw in the?Florida?case, he said. Editing by Dina Kyriakidou, Ken Wills and Gunna Dickson