Thousands of demonstrators gathered in dozens of cities nationwide on Saturday to continue protesting the acquittal of George Zimmerman in the shooting death of unarmed African-American teenager Trayvon Martin. On Friday, President Barack Obama surprised reporters in the White House briefing room by delivering his first public remarks on the death of Trayvon Martin since the acquittal of George Zimmerman. When Trayvon Martin was first shot, I said that this could have been my son. And another way of saying that is Trayvon Martin could have been me, 35 years ago, Obama said. There are very few African-American men in this country who haven?t had the experience of being followed when they were shopping in a department store. That includes me. We also air comments made by Martin?s mother, Sybrina Fulton, at a rally in New York City on Friday. SYBRINA FULTON: As I sat in the courtroom, it made me think that they were talking about another man. And it wasn?t. It was a child, who thought as a child, who acted as a child, who behaved as a child. And don?t take my word for it. He had a drink and candy. So, not only?not only do I vow to you to do what I can for Trayvon Martin, I promise you I?m going to work hard for your children, as well, because it?s important. PRESIDENT BARACK OBAMA: When Trayvon Martin was first shot, I said that this could have been my son. Another way of saying that is Trayvon Martin could have been me, 35 years ago. And when you think about why, in the African-American community at least, there?s a lot of pain around what happened here, I think it?s important to recognize that the African-American community is looking at this issue through a set of experiences and a history that?that doesn?t go away. There are very few African-American men in this country who haven?t had the experience of being followed when they were shopping in a department store. That includes me. There are very few African-American men who haven?t had the experience of walking across the street and hearing the locks click on the doors of cars. That happens to me?at least before I was a senator. There are very few African Americans who haven?t had the experience of getting on an elevator and a woman clutching her purse nervously and holding her breath until she had a chance to get off. That happens often. And I don?t want to exaggerate this, but those sets of experiences inform how the African-American community interprets what happened one night in Florida. And it?s inescapable for people to bring those experiences to bear. The African-American community is also knowledgeable that there is a history of racial disparities in the application of our criminal laws?everything from the death penalty to enforcement of our drug laws. And that ends up having an impact in terms of how people interpret the case. Now, this isn?t to say that the African-American community is na?ve about the fact that African-American young men are disproportionately involved in the criminal justice system, that they?re disproportionately both victims and perpetrators of violence. It?s not to make excuses for that fact, although black folks do interpret the reasons for that in a historical context. They understand that some of the violence that takes place in poor black neighborhoods around the country is born out of a very violent past in this country, and that the poverty and dysfunction that we see in those communities can be traced to a very difficult history. I think the African-American community is also not na?ve in understanding that, statistically, somebody like Trayvon Martin was probably statistically more likely to be shot by a peer than he was by somebody else. So folks understand the challenges that exist for African-American boys. But they get frustrated, I think, if they feel that there?s no context for it and that context is being denied. And that all contributes, I think, to a sense that if a white male teen was involved in the same kind of scenario, that, from top to bottom, both the outcome and the aftermath might have been different.