As protesters took to the streets Sunday to condemn George Zimmerman?s acquittal, the U.S. Department of Justice said it would review the case for possible violations of Trayvon Martin?s civil rights. 	Attorney General Eric Holder had begun the investigation last year into whether the deadly confrontation between Zimmerman, 29, and Trayvon, 17, was motivated by racial profiling, but he stepped aside to let the trial in a Florida court proceed. 	A six-member jury found Zimmerman not guilty on counts of second-degree murder and lesser charges Saturday, setting off widespread outrage. 	But the feds opened the door Sunday to reopening the case. 	?Experienced federal prosecutors will determine whether the evidence reveals a prosecutable violation of any of the limited federal criminal civil rights statutes within our jurisdiction, and whether federal prosecution is appropriate,? the Justice Department said. 	The announcement came as welcome news to civil rights leaders, who began calling for the federal charges almost immediately after the verdict was read in Seminole County court in Sanford, Fla. 	?We are outraged and heartbroken over today?s verdict,? NAACP President Benjamin Jealous said in a statement. ?We will pursue civil rights charges with the Department of Justice, we will continue to fight for the removal of Stand Your Ground laws in every state and we will not rest until racial profiling in all its forms is outlawed.? 	?Stand Your Ground? is the Florida law that gives a gunman the benefit of the doubt if he feels threatened. 	According to testimony, Zimmerman was well aware of the law when he, acting as a neighborhood watchman, confronted Trayvon. The teen was wearing a hoodie ? which later became the symbol of his tragic death ? and walking in his apartment complex with a bag of Skittles. The struggle concluded with the killing of the teen. But the jury said Zimmerman shot Trayvon in self-defense. 	Jealous started a petition calling on Holder to bring civil rights charges. 	?The most fundamental of civil rights ? the right to life ? was violated the night George Zimmerman stalked and then took the life of Trayvon Martin,? Jealous wrote. 	By 5 p.m. Sunday, the online petition had more than 160,000 signatures. A similar petition on WhiteHouse.gov was approaching 100,000 signatures. 	President Barack Obama called for calm ? and sought to diminish the growing outrage over a system that protesters said placed lesser value on the life of a 17-year-old black teenager returning from a simple trip to a store. 	?We are a nation of laws, and a jury has spoken. I now ask every American to respect the call for calm reflection from two parents who lost their young son,? Obama said. ?We should ask ourselves if we?re doing all we can to widen the circle of compassion and understanding in our own communities. We should ask ourselves if we?re doing all we can to stem the tide of gun violence that claims too many lives across this country on a daily basis. We should ask ourselves, as individuals and as a society, how we can prevent future tragedies like this. As citizens, that?s a job for all of us. That?s the way to honor Trayvon Martin.? 	Zimmerman, who was in hiding and fearing for his life after the verdict, will also likely face a civil suit brought by Trayvon?s parents. 	?There is still the potential for justice to be served through a civil suit brought about by Trayvon Martin?s surviving family members, and also through civil rights charges,? said Barbara Arnwine, president of the Lawyers? Committee for Civil Rights Under Law, who called the verdict ?a miscarriage of justice.? 	Rev. Al Sharpton insisted on NBC?s ?This Week? that the fight was far from over. 	?We now have a position on the books in the state of Florida where an unarmed teenager who committed no crime can be killed and the killer can say self-defense,? Sharpton said. ?Every American ought to be afraid that my child can do nothing wrong and can be killed.? 	But former New York Gov. Eliot Spitzer ? a candidate for city controller ? threw cold water on the likelihood that Zimmerman would be tried by the feds, saying the legal system was in his favor. 	?The Justice Department will step in, but it?s in a very dicey position because there has been a criminal case. Double jeopardy is a fundamental principle in our American judicial system, as it should be. And so it?s going to be hard for them to come back at the defendant,? Spitzer said. 	The former state attorney general added that in this case, the judicial system ?failed.? 	The Justice Department made it clear that part of its investigation would involve ?whether federal prosecution is appropriate in accordance with the department?s policy governing successive federal prosecution following a state trial.? 	Not everyone was eager for the case to continue. U.S. House Rep. Steve King R-Iowa said the killing never should have gone to trial in the first place. 	?The evidence didn?t support prosecution, and the Justice Department engaged in this, the President engaged in this and turned it into a political issue that should have been handled exclusively with law and order,? King said on ?Fox News Sunday.? 	Nationwide, people were honoring Trayvon through protests, which were held in Washington, Chicago, Los Angeles and San Francisco. In Oakland, vandals trashed a police car ? one of the few reported instances of trouble Sunday. More rallies were planned through the night. 	In New York, thousands of protesters gathered in Harlem, Times Square, Union Square and downtown Brooklyn. They chanted ?We are all Trayvon? and ?No justice, no peace!? Passersby signed a large yellow banner that read ?Justice for Trayvon.? Others held hands in a solemn circle. 	At least five people were arrested Sunday night in a clash between protesters and police at Park Ave. and E. 71st St. in the city. 	The possibility of civil rights charges amounted to a glimmer of hope among the protesters, who said the verdict had diminished their already-low opinion of the justice system. 	?Florida has been dirty for a long time. Trayvon shined a small light on a bigger problem,? said Leshonna Tyson, 42, who was one of about 100 people rallying in Sanford on Sunday. 	The verdict had led her to the conclusion that the only solution was to vote out the Florida lawmakers who support Stand Your Ground. 	?The laws don?t change, the people who make the laws have to change!? she hollered. 	Another protester worried about the message the verdict sent to young people. 	?I read on Twitter things from people who were so happy with this verdict. What kind of template of morality are we setting for our children? You can?t support vigilante killing!? said Faith Riley, who lives in Sanford. 	Nearby, at African Methodist Episcopal Church, pastor Valerie Houston said she needed spiritual guidance herself after delivering a sermon to 100 parishioners. 	?I cried myself to sleep last night and I didn?t want to get out of bed,? Houston said. 	Aside from the gathering of the relatively small group of protesters, an eerie calm had descended on the central Florida town in the eye of the storm. Authorities had barred protesters from gathering at the Seminole County Courthouse. 	At Willow Tree Cafe in downtown Sanford, waiter Chris Clenen said business had been slow because of the trial. 	?People are afraid to come out on the weekends ? actually, every weekend the last few weeks,? said Clenen, 22. ?They?re afraid of rioting.? 	Zimmerman faces more legitimate concerns regarding his safety. And since he was found not guilty, the neighborhood watchman can have his gun returned to him. 	?I don?t know if he?ll carry a gun now, but I would think he has more reasons to than before,? George?s brother, Robert Zimmerman, said on CNN Sunday morning. 	?He?s going to be looking around his shoulder for the rest of his life,? Robert Zimmerman added. 	Reuters reported George Zimmerman was even considering an unexpected career choice following his 16-month experience in the wheels of justice: lawyer. 	?Everybody said he was a cop wannabe, but he?s interested in law,? said Zimmerman?s wife, Leanne Benjamin. ?He sees it as a potential path forward to help other people like himself.? 	With Nina Golgowski 	SBrown@nydailynews.com 	On a mobile device? Watch the video here .