NEW YORK/MIAMI Reuters - Demonstrators took to the streets in dozens of U.S. cities on Saturday to vent their anger over the acquittal in Florida of the man who shot unarmed black teenager Trayvon Martin to death and to call for federal charges in the racially tinged case. Hundreds marched in the summer heat to rally at federal courthouses in Miami, Chicago, Los Angeles and other cities, demanding justice for Trayvon and an end to racial profiling that they said was at the heart of the case. The rallies came one week after a Seminole County, Florida, jury returned verdicts finding 29-year-old George Zimmerman not guilty of second-degree murder and manslaughter in the February 2012 death of Martin. Critics contend Zimmerman, who is white and Hispanic, wrongly suspected Martin, 17, of being a criminal because he was black. The neighborhood watch volunteer called police to report Martin, then left his car with a loaded handgun concealed in his waistband. A fight ensued in which Zimmerman suffered a bloody nose and head injuries before he shot Martin once in the heart. In New York, scene of one of the largest rallies, roughly 2,000 protesters, some carrying Boycott Florida signs or wearing T-shirts with Martin's picture, were led by an emotional Sybrina Fulton, the slain teenager's mother. Trayvon was a child, she said. I think sometimes it gets lost in the shuffle because as I sat in the courtroom, it made me think they were talking about another man. And it wasn't. It was a child. Fulton burst into tears as members of the crowd shouted: We love you! JAY Z, BEYONCE She was joined at the event by hip-hop mogul Jay Z and his wife, pop star Beyonce, along with New York City mayoral candidate Christine Quinn and civil rights activist Al Sharpton. Sharpton, who helped organize the nationwide rallies and who led the crowd in repeated chants of no justice, no peace and I am Trayvon Martin, said the celebrity couple didn't want to speak at the rally but wanted to stand with Martin's family. Civil rights leaders had voiced hopes for peaceful protests after outbreaks of violence that earlier this week led to arrests in Los Angeles and the San Francisco Bay area. Sharpton has said he hopes continued public pressure will force the U.S. Department of Justice to bring federal civil rights charges against Zimmerman. Federal prosecutors say they are investigating whether Zimmerman violated civil rights laws. But lawyers have said they think new charges are unlikely. At the White House on Friday, President Barack Obama sided with those who say the shooting need not have happened, expressing sympathy to the Martin family. He said the case was properly handled by the court in Florida but questioned stand your ground laws that have been adopted in 30 states. Although Florida's stand your ground law was not cited by Zimmerman's defense team, the jury was instructed that under the state's 2005 statute he had the right to use deadly force if he reasonably believed it was necessary to do so in self-defense. Following the main event in New York some 800 people made a boisterous but peaceful procession over the Brooklyn Bridge, pausing outside the federal courthouse in Brooklyn before moving on. 'NO JUSTICE, NO PEACE' Elsewhere, about 2,000 people endured a downpour in Atlanta to hear speakers talk of the need for justice for Trayvon Martin and other black youths. The Trayvon Martin Prayer Vigil and Rally, in downtown, began with chants of no justice, no peace, and Trayvon, Trayvon, Trayvon before speakers urged the crowd to register to vote and to seek repeal of Georgia's stand your ground law. Martin Luther King III urged the audience to go to Washington, D.C., on August 24 for the 50th anniversary of the March on Washington and his father's famous I Have a Dream speech. It's marching time, ladies and gentlemen, he said. At least several people in the crowd were treated for heat-related illness after fainting on the sweltering day. At a rally in Miami, Martin's father, Tracy, told supporters that after the acquittal he has come to realize George Zimmerman wasn't on trial - Trayvon was on trial. In Los Angeles, about 500 people converged on the federal courthouse in Los Angeles under gray skies, toting signs saying Open Season on the Black Man and This Should Not Be OK in 2013 America. In Chicago, some 500 people rallied across from the Everett McKinley Dirksen federal courthouse. We are standing up here today to say to our young people, 'we value your lives,' said Chicago Urban League Chief Executive Officer Andrea Zopp, who has a 17-year-old son. The civil rights movement is not over. Rapper MC Lyte told the crowd: When the verdict was read, I felt like we lost Trayvon Martin all over again. In Oakland, a crowd of up to 150 people demonstrated peacefully in the city's downtown, occasionally singing We Shall Overcome before dispersing in the late afternoon. And across the bay in San Francisco, about 100 people gathered in front of the Federal Building. Reverend Arnold Townsend, 70, vice president of the local NAACP chapter, vowed to bring to light this incident and let black children know the system has them under attack. Reporting by Edward Upright and Zachary Faginson; Additional reporting by Tom Brown in Miami, Steve Norder in Atlanta, Renita Young in Chicago, Emmett Berg in San Francisco, Laila Kearney in Oakland and Dana Feldman in Los Angeles; Writing by Chris Francescani and Dan Whitcomb; Editing by Dina Kyriakidou, Barbara Goldberg, Gunna Dickson and Eric Beech