By David Williams Published: 19:17 EST, 5 July 2013 | Updated: 05:21 EST, 6 July 2013 Three supporters of deposed Egyptian president Mohamed Morsi were shot dead by security forces yesterday as thousands marched on the military barracks where he is under house arrest. The BBC?s Middle East editor Jeremy Bowen was hit in the head by shotgun pellets as he covered the chaos following the shootings in Cairo. At least 30 have reportedly died and 210 injured in the violent clashes across Egypt today. The 53-year-old veteran of the Arab Spring tweeted that warning shots were being fired in the air when, within minutes, bullets were fired into the crowd and a bearded man was killed. Minutes later, a picture was posted online of Bowen with his head being bandaged and blood running down his cheek. He said he had been hit in the head with a ?couple of shotgun pellets? but he was ?fine?. Bowen warned that the situation was a ?recipe for more bloodshed? if the country?s military leaders failed to avoid street conflict. A BBC spokesman said last night: ?Jeremy was hit by birdshot or shrapnel from birdshot. He was treated at the scene for minor injuries and has gone back to his hotel for more treatment. We expect him to be reporting again soon.? When one supporter hung a sign of Morsi on the barrier around the military building, the troops tore it down and told the crowd to stay back.? A protester hung a second sign and the soldiers opened fire. Witnesses said several demonstrators were hit. Scroll down for videos Last night, as news of the deaths spread, tens of thousands more pro-Morsi supporters were said to be joining the demonstration against the Army coup. While many marches were peaceful, confrontations took place throughout Cairo with groups shouting, ?Down with military rule!? and throwing stones at troops, tanks and armoured vehicles. Soldiers responded with tear gas. Oil prices soared yesterday as violence erupted in Egypt. The price broke through the $107-a- barrel mark in London to reach its highest level since April.? It took gains for the week to nearly 5 per cent in the biggest weekly increase for more than a year. In New York, prices rose above $102 a barrel to the highest level for 14 months. Egypt controls the Suez Canal, one of the world?s busiest shipping lanes, giving it a crucial role in global energy supplies.?