Saad al-Katatni, who heads the Freedom and Justice Party - the political arm of the Muslim Brotherhood - and Rashad Bayoumi, the deputy head of the Islamist movement were detained. 00.08 US president Barack Obama has made his first comments since Mohamed Morsi was ousted. In a written statement, Mr Obama expressed deep concern about Egypt's removal of Mr Morsi and called for a swift return to a democratically elected civilian government. He urged the Egyptian military to avoid any arbitrary arrests of Mr Morsi and his supporters. During this uncertain period, we expect the military to ensure that the rights of all Egyptian men and women are protected, including the right to peaceful assembly, due process, and free and fair trials in civilian courts, he said. 23.53 A senior Brotherhood politician has said the group has no intention of using violence. Gamal Heshmat told Reuters: There is absolutely no direction towards violence. The Brotherhood are not raised on violence. Their cause is a peaceful one, defending their rights, which is stronger than a military coup. 23.51There are reports that two senior leaders of the Brotherhood have been arrested. Saad al-Katatni, who heads the Freedom and Justice Party - the political arm of the Muslim Brotherhood - and Rashad Bayoumi, the deputy head of the Islamist movement were detained, according to security officials. 23.31 What do we know about Adly Mansour, Egypt's new caretaker president. Ironically he was named by Morsi himself to Egypt's top judicial post, which, following the army's suspension of the constitution, catapulted him into political power. The 67-year-old father of three, who won a scholarship to France's most prestigious institute of higher education, the Ecole Nationale de l'Administration, was a long-serving judge under the regime of veteran strongman Hosni Mubarak. But he served in the state-sponsored religious courts which deliver fatwas, or edicts, on observance, as well as in the civil and criminal courts. Mansour helped draft the supervision law for the presidential elections that brought Morsi to power in 2012, which included setting a legal timeframe for electoral campaigning. He was deputy head of the Supreme Constitutional Court from 1992. Unlike the principal leaders of the opposition - among them Nobel peace laureate Mohamed ElBaradei and Amr Moussa - Mansour was never a household name, but that probably served the military's purposes in their search for a neutral figurehead for a potentially rollercoaster transition. Adly Mansour, left, has been declared interim President of Egypt by the military after mass protests 23.05 Amr Moussa, the Egyptian opposition leader and former Arab League chief, says that consultations start now for a new government. Consultations will start from now, for a government and reconciliation... This is the end of Morsi's regime. It's over. 23.03 There are reports that security forces have raided the Cairo offices of Al Jazeera's Egyptian TV channel, detaining at least five staff. 22.50 Richard Spencer aims to make sense of it all, asking what happens next and how does this change the dynamic of the Arab Spring. Egypt was the biggest scalp of the Arab Spring, and the restoration of military rule seems to bring it to a crashing halt. However, that will depend on whether elections are held soon. The coup could possibly burnish the Spring's reputation - its greatest critics said it was replacing military dictatorships with religious ones. 22.46 Although there is not said to be too much violence around the country, four supporters of Morsi have apparently been killed in the western city of Marsa Matruh. Another 10 were injured after the group of armed supporters stormed the city's security headquarters. 22.44 The US has ordered the mandatory evacuation of its embassy in Cairo. It comes only days after the State Department allowed non-essental diplomatic staff to leave the country. 22.38 William Hague, the Foreign Secretary, has reiterated that all British citizens avoid all non-essential travel to Egypt. He adds: The United Kingdom does not support military intervention as a way to resolve disputes in a democratic system. The chance of a democratic future was hard won for Egypt by the Egyptian people two and a half years ago. But looking forward, we call on all parties to show the leadership and vision needed to restore and renew Egypt?s democratic transition. It is vital for them to respond to the strong desire of the Egyptian people for faster economic and political progress for their country. In our view this must involve a political process that includes all groups on an equal footing leading to early and fair elections which all parties are able to contest, and civilian-led government. I urge Egypt?s leaders to show a real determination to work together to make this happen in a way that they have not done in recent months. In the long run only democratic processes and government by consent will bring the stability and prosperity that the people of Egypt seek.? 22.30 US Senator Patrick Leahy, chairman of the Senate subcommittee that oversees foreign aid, said on Wednesday that his panel would review the $1.3billion ?850 million in annual assistance the country sends to Egypt Egypt's military leaders say they have no intent or desire to govern, and I hope they make good on their promise, Leahy said in a statement. In the meantime, our law is clear: US aid is cut off when a democratically elected government is deposed by military coup or decree. 22.20 Telegraph TV has captured the celebrations around Egypt the moment the army announced Mohamed Morsi was ousted 22.00 Tim Stanley asks whych the US, when it expressed concern about Mohamed Morsi, gave him $1.3 billion in military aid. The aid was given in spite of the administration?s concerns about Morsi?s growing authoritarianism. In a May 9 memo, Secretary of State John Kerry wrote, ?We are not satisfied with the extent of Egypt's progress and are pressing for a more inclusive democratic process and the strengthening of key democratic institutions.? Despite this, the military aid went ahead. In another twist, it seems that US law insists that military aid be restricted to countries where a coup has just taken place. So what will happen to that $1.3 billion just one month after it was authorized? Given that it was presumably offered in order to buy influence within the Egyptian military, it would be odd now to retract it. The sorry saga in Egypt is another reminder of the danger to the West of getting too entwined in the bloody politics of the Arab region. President Obama, to his credit, has publicly stated that the US remains neutral in Egypt ? although at least one Egyptian opposition group accuses him of supporting Morsi. Either way, the complicated legacy of the Arab Spring suggests that it?s difficult to predict winners and unwise to back any. An Egyptian man stands next to a military armoured vehicle where Islamists supporting Mr Morsi gathered 21.47 Richard Spencer's main story this evening takes us through what happened today. The army's move will now put great pressure on President Barack Obama, who had urged a negotiated solution. His defence secretary, Chuck Hagel, spoke to Gen Sisi on Tuesday, it was confirmed. Under American law, international aid, currently worth $1.3 billion to Egypt annually, cannot be given to an army that has carried out a military coup. There will also be fears of violence, or even civil war, within Egypt. Muslim Brotherhood supporters said they would sacrifice their lives to defend Mr Morsi's legitimacy . One of his closest advisers, Essam el-Haddad, penned an angry statement on Facebook saying that Egypt had fallen victim to a military coup and warning that the decision to remove a democratically elected Islamist government would send shock-waves around the world. Today only one thing matters, he said. In this day and age no military coup can succeed in the face of sizeable popular force without considerable bloodshed. Who among you is ready to shoulder that blame? The audience that reads this page understands the price that the world continues to pay for the wars in Afghanistan and Iraq. Egypt is neither Afghanistan nor Iraq. Its symbolic weight and resulting impact is far more significant. 21.30 Tomorrow's Telegraph View says that the army has established a fragile peace ni Egypt. The Islamists will not take kindly to their government being removed by a military coup just a year after it was installed by a popular vote of more than 50 per cent ? a legitimacy that no government in this country has achieved for generations. Moreover, the message this sends out to people who were never particularly in thrall to democracy is a bad one. Why, the Islamists will ask, should they take the ballot box seriously when their victories are overturned by force? Fireworks in Tahrir Square 21.27 Richard Spencer has more on today's events, which unfolded rapidly. The way the day would turn out was set at midnight, when Mr Morsi finally addressed the nation, his first public response to the army?s threat to intervene ? an ambiguous threat surely now correctly interpreted as meaning it would kick him out. He looked defeated. All his virtues and vices were on display. On the one hand, there was a straightforwardness in the way he repeated over and over again his simple point that he was Egypt?s first elected leader ? he used the word ?legitimacy? scores of times in 45 minutes. He looked hurt, and though the form of address was remarkably similar to the late night speeches that former president Hosni Mubarak similarly employed when resisting removal, he lacked Mr Mubarak?s arrogant sneer. There were rumours that Mr Morsi would be charged with some crime: it is, in truth, hard to see what law he has broken, compared with the hundreds killed as Mr Mubarak clung on to power. On the other hand, as so often, he seemed not only to have no answer to his critics, no solution to put forward to the crisis, but no clear sense that one was needed. He did not seem to think that the millions of people who had taken to the streets this week were a significant obstacle to his vision of Egypt. 21.24 Worth reiterating, the Foreign Office updated its travel advice on Egypt earlier today. Thousands of British holidaymakers face having to cancel their trips to Egypt after the Foreign Office advised against all but essential travel to the vast majority of the country. In view of the continued unrest in Egypt, the Foreign Office recommends against all but essential travel to Egypt except for resorts on the Red Sea in South Sinai and those resorts on the Egyptian mainland in Red Sea governorate. 21.12 Syria's Bashar al-Assad, facing a two year uprising in his own country, has said the massive protests brought the fall of political Islam . What is happening in Egypt is the fall of what is known as political Islam. Anywhere in the world, whoever uses religion for political aims, or to benefit some and not others, will fall. You can't fool all the people all the time, let alone the Egyptian people who have a civilisation that is thousands of years old, and who espouse clear, Arab nationalist thought. After a whole year, reality has become clear to the Egyptian people. The Muslim Brotherhood's performance has helped them see the lies the movement used at the start of the popular revolution in Egypt. 20.46 More great pictures from Tahrir Square of people reacting to the announcement that Morsi has been ousted. Protesters react to General al-Sisi's announcement in Tahrir Square 20.44 The Islamist TV channels Al Hafez, Al Nas and Misr 25 have all stopped broadcasting following al-Sisi's address. 20.40 Two US officials say that Egyptian defence leaders have assured the US they are not interested in long-term rule. The official says the leaders, in calls with Defence Secretary Chuck Hagel and Gen. Martin Dempsey, chairman of the Joint Chiefs of Staff, pledged to put a civilian government in place quickly. 20.35 Sky News points out that there is no barbed wire or military presence on the ground at Tahrir Square, a silent message that the army will let the celebrate. Fireworks light the sky moments after Egypt's military chief says the president is replaced by chief justice of constitutional court outside the presidential palace in Cairo Fireworks are seen as army soldiers take their positions in front of protesters near the Republican Guard headquarters in Cairo 20.30 Mohamed ElBaradei, the former presidential candidate and opposition leader, says the transition period will move the country towards new elections, calling for social justice for every single Egyptian. Egypt's Coptic Pope Tawadros says the roadmap ensures security for all Egyptians, offering political vision. Mohammed Elbaradei was consulted in advance of the announcement The leader of Egypt's Coptic Christians Pope Tawadros II delivering a statement following coup 20.29 The crowds have been chanting: Hold your head up high, You're Egyptian , according to this Twitter user. Twitter: Jack Shenker - Hold your head up high, sings the crowd, you're Egyptian #Egypt #Tahrir http://t.co/hA7BPmU6hV 20.26 The now ex-President Morsi has apparently been moved to an undisclosed location. Twitter: Breaking News - Egyptian President Morsi's aide says Egyptian leader has been moved to an undisclosed location - @AP; follow more: http://t.co/AbTO1WJ3SP 20.25 The head of the Egyptian armed forces has announced that Adly Mahmoud, the head of the Constitutional Court, has been appointed the interim head of state. 20.24 Richard Spencer, our Middle East Correspondent in Cairo, has more of the extraordinary press conference seen less than half an hour ago. Gen Abdulfattah al-Sisi, the head of the army, made a televised address to the nation accusing Mr Morsi of rejecting calls for national dialogue. Backed by the country?s main religious leaders, Ahmed al-Tayyeb, the Grand Imam of Al-Azhar University, and Pope Tawadros II of the Coptic Church, he said the military was taking up its ?patriotic duty to the Egyptian masses?. He announced a political road-map suspending the constitution, forming an interim government, and leading to new elections. He appointed the chief justice of the constitutional court as interim president with ?full powers of decree?. 20.20 Mohamed Morsi has urged the Egyptian's to peacefully resist the coup , a top aide has told the AFP news agency. 20.15 The scenes from Tahrir Square are truly extraordinary. Flares, fireworks, flag waving as far as the eye can see. Protesters use flares while demonstrating against Egyptian President Mohamed Morsi in Tahrir Square 20.10 Sisi says that a transitional technocrat government will take charge in the country. Tahrir Square erupts in wild celebrations of flag waving and fireworks. The constitution has been suspended. Twitter: Paul Danahar - Al-Sisi tells #Egypt there will be new presidential elections Tens of thousands of Egyptian protesters celebrate in Tahrir Square 20.03 Abdul Fatah Khalil al-Sisi, head of the Egyptian armed forces is delivering his press conference, giving a statement on the country's future. He says that the army is only responding to the calls of the Egyptian people. Twitter: Ali Gharib - Sisi: The Armed forces, based on its decisiveness, felt that the Egyptian people was asking for help. 19.55 Reuters is citing a report in Egypt's state-run Al-Ahram newspaper that Morsi was told at 7pm local time that he was no longer president. Separately, an Egyptian appeals court has upheld a one-year prison sentence against prime minister Hisham Kandil and ordered him to be removed from his post. Army soldiers stand guard in front of anti-Mursi protesters near the Republican Guard headquarters 19.27 Not everyone shares the protesters' sense of euphoria that the army may now be taking control again Twitter: Tarek Shalaby - I'm shocked at activists cheering on the army's coup and the subsequent crackdown of Islamists like it's all part of #Ja 19.18 An army-backed plan for a new Egyptian political transition includes a short period of interim rule to be followed by presidential and parliamentary elections, Reuters is reporting Egypt's state news agency as saying 19.13 State media is reporting that a new political road map is to be announced imminently by Mohamed ElBaradei and Muslim and Christian religious leaders. They have just finished a meeting with the military, according to the Army's Facebook page. A victim of last night's violence in Cairo is placed in a coffin 18.53 The United States has said it is very concerned about developments in Egypt's political crisis, and urged President Mohamed Morsi to do more to address the concerns of protesters. 18.43 Various rumours of tanks now reaching Tahrir Square, although British journalist Jack Shenker , another old Cairo hand whose writing on Egypt is well worth reading, says he hasn't seen any. Twitter: Jack Shenker - Am in #Tahrir now and can't see any tanks or APCs, but don't have a sight line to every entrance 18.38 Army troops and armoured vehicles have deployed across much of Cairo, surrounding protests by the president's supporters, and at key facilities and major intersections, according to the Associated Press. It's not clear at this stage whether this is in preparation for a coup, or simply a precaution against widespread disorder, but it indicates that the army is taking things into its own hands. It has also prompted widespread cheering among opposition crowds. 18.29 The Syrian government has joined in the chorus of voices demanding President Morsi's resignation. This may seem somewhat hypocritical, but Damascus has been furious with Mr Morsi ever since he announced that he was closing Egypt's embassy in Syria in protest at Mr Assad's own acts of repression. 18.13 The Egyptian Army has erected barbed wire and barriers around the barracks where President Morsi is working, according to eye witnesses. It isn't clear whether they are to restrict his movements or to stop groups of his own supporters from forming a protective phalanx around him. The army has responded by saying it is simply securing the area and denied reports that it was attacking Mr Mursi's supporters, saying: The Egyptian army belongs to all Egyptians. Supporters of President Morsi are pictured here doing press-ups in preparation for what they believe may be a long few days ahead on the streets 18.07 The state-run Al-Ahram newspaper is saying that Mursi is expected to either step down or be removed from office, with the army then setting up a three-member presidential council to be chaired by the head of the Supreme Constitutional Court. 17.46 The military has yet to issue its much-anticipated statement on what it thinks should happen next in Egypt, but President Morsi's national security advisor has already made it pretty clear what he thinks is going on behind the scenes. For the sake of Egypt and for historical accuracy, let's call what is happening by its real name: Military coup, said Essam al-Haddad in comments posted on Facebook. As I write these lines I am fully aware that these may be the last lines I get to post on this page. Twitter: Gregg Carlstrom - Ittihadiya getting absolutely packed #egypt http://t.co/DfDk9T4AHb 17.40 The Associated Press is saying that the US defence secretary, Chuck Hagel, has spoken to the Egyptian defence minister twice in the past week. The Pentagon has declined to give details of the conversations. However, Pentagon spokesman George Little said the US had conveyed to Egyptian leaders that Washington supported the democratic process and did not back any particular side. 17.12 A quick update on President Morsi's whereabouts on this tumultuous day: he is apparently still working at the Republican Guard barracks in Cairo, although his aides have said it is unclear if he is free to leave. There has also been reports from the AFP news agency saying that Egyptian security forces have imposed a travel ban on Mr Morsi and various top aides, stopping them from leaving the country. This has apparently been done in relation to their involvement in a mass breakout during the 2011 revolution from a prison near Cairo, where Mr Morsi had been put in pre-emptive detention by Mr Mubarak. If these reports are true, the implication would seem to be that the military is considering sending Mr Morsi back to jail - which would amount to a coup indeed. A Morsi supporter on the Cairo University barricades carries a steel shield and a blood-stained shirt from Tuesday's fighting 17.04 Egyptians are still waiting for the armed forces to give their own statement on the crisis. It was originally due this afternoon, but a military spokesman has now said that no fixed time has been set for a statement, prompting the following Tweet from Egyptian blogger Su Zee Twitter: su zee - And in typical Egyptian fashion, #egypt is late for its own coup 16.47 Mr Morsi's National Security Adviser claims military coup underway, Reuters reports. 16.29 Mr Morsi reiterated his call for a national dialogue and the formation of a panel to amend the country's controversial Islamist-drafted constitution. But he insisted he would stay on as president. He said there was a clear roadmap which is based on constitutional legitimacy... and includes the formation of a temporary coalition government based on national participation to oversee the coming phase. There would be an agreement from all political trends over the choice of prime minister, his office said. Mr Morsi stressed again he was a president for all Egyptians amid fears of unrest as his supporters and opponents protested in Cairo. A protester throws a bottle of water to refresh his comrades during a protest against the President Mohamed Morsi in Tahrir Square 16.02 President Mohamed Morsi has said a coalition government should be part of a solution to the country's political standoff but appeared to offer no new compromises as a deadline set by the army for a powersharing agreement elapsed. A statement reiterated that Mr Morsi held opposition parties responsible for obstructing a political initiative that would also set up a panel to prepare amendments to the constitution passed into law last December: The presidency envisions the formation of a consensus coalition government to oversee the next parliamentary election. 15.31 Gehad El-Haddad, a spokesman for the Muslim Brotherhood, has just issued the following statement via Twitter Twitter: Gehad El-Haddad - #Egypt Military is not a political actor 2 negotiate anything. It belongs in the barracks under leadership of its commander in-chief. 15.13 Agence France Presse is reporting that Egypt's top judicial body has confirmed that it has reinstated public prosecutor Abdel Meguid Mahmud, whom Mr Morsi sacked in November. Mr Mahmud was a widely-reviled figure who was seen as one of the worst holdovers from Mubarak's regime. But Mr Morsi's dismissal of him by decree turned him into a sympathy figure for the opposition - an indication of how tribal Egypt's politics has become. 15.09 Ashraf Khalil, one of the best Egyptian journalists on the Cairo beat, has written a good piece on the latest crisis in Foreign Affairs journal. We learn how just as Mubarak was nicknamed the Laughing Cow because he was seen as rather dim, Morsi is now nickamed as al kharouf - ?the sheep? - by those who think he is still subservient to the Muslim Brotherhood?s Guidance Council. 14.58 Egypt's military has put officers in the newsroom of state TV in Cairo, while senior military commanders meet with opposition and religious leaders. All non-essential staff have been told to leave the state TV building, heightening the impression that an annoucement is imminent. A Muslim Brotherhood supporter shows cartridges from shotgun cases that he claims were used against demonstrators 14.24 Aleem Maqbool tweets: Twitter: Aleem Maqbool - At Egyptian TV building. Staff confirm military has taken over. Only retained essential staff, others gone http://t.co/WnKTTpPJ1s 13.51 reliable sources are telling our Cairo correspondent Richard Spencer that the Muslim Brotherhood is to make a statement at 3.30pm Egyptian 2.30pm UK time and the Army an hour later. 13.49 Our Cairo correspondent Richard Spencer has been speaking to Amr Amr al-Shaer, 22, an engineering student who was with a po-Morsi demonstration last night when it came under fire from plain-clothes gunmen in the Cairo suburb of Giza famous for its pyramids . We were in a peaceful march and they started shooting at us with rubber bullets. I saw one man in fall and then as we passed the University Metro station more people arrived to join the march and they started shooting again. I saw two more supporters of the president killed near me, there were police standing behind the thugs with machine guns. I also saw two police vehicles who joined in the attack. Mr Shaer added that he was not a supporter of Mr Morsi, but that he had joined the march because had no wish for a return to military rule. He also pointed out that if Morsi was toppled as an elected leader, no other president will be able to rule us again. 13.32 Mohamed Morsi's spokesman has said it would be better for the president to die in defence of democracy than be blamed by history in a statement reported by Reuters. Opponents of Egyptian President Mohamed Morsi listen to his televised speech outside the presidential palace in Cairo 13.16 American officials have broached the possibility of Mr Morsi's calling early elections, according to the New York Times 13.02 A prominent spokesman for the Muslim Brotherhood has just issued the following statement via Twitter Twitter: Gehad El-Haddad - The only plan that any ppl hv in face of an attempted coup is to stand in front of the tanks. Just like we did in #Jan25 Rev. 12.42 Mohamed ElBaradei, the former chief of the International Atomic Energy Agency, has been meeting army chief General Abdel Fattah al-Sisi today, according to Reuters. He has been nominated as the mouthpiece for various opposition groups, although among many Cairo demonstrators think he doesn't really have the 'streetfighting' capability. Also present at the meeting alongside Mr El ElBaradei are a top Muslim cleric and the Coptic Pope, the senior religious authority among Egyptian Christians 12.24 The Tamarod movement, the name for the movement representing the main cross-section of Egyptian opposition groups, has produced its own roadmap for Egypt's future. Details below, including a demand for fresh presidential elections. May be a hard sell to those who voted for Mr Morsi last year, who will argue that it is hardly fair to have a new election just because the opposition didn't like the original result. * To name a temporary president and prime minister. * To elect a constitutional council within 30 days. Results within 7 days. * A new constitution to be drafted within 90 days. * A referendum on the new constitution within 15 days of its writing. 7 days of voting, * Presidential elections 60 days after the constitution is agreed upon. Results within 7 days. * Whole process should take 231 days Opponents of President Morsi want a new election - but this will hardly seem fair to the millions who voted in favour of him 12.03 The Cairo-based journalist Alex Giles has been to the city's central morgue this morning, where the victims of violence that erupted last night are being cleansed, catalogued and put in their coffins for burial. Weeping relatives are sat amid discarded cigarette butts in the sandy yard outside. Others are hunched in stony silence. Most of those killed in the capital last night were caught up in the fierce gun battles which erupted close to Cairo University in Giza, west of Tahrir Square across the Nile. Throughout the night supporters of the Muslim Brotherhood had been fighting unknown assailants following a rally called to shore up President Morsi's position.Automatic rifles, shotguns and pistols were used; At least 12 people died, according to Egyptian officials. 11.58 Again on background reading, anyone who wants to know more about the Egyptian President, Mohamed Morsi, can read this Time magazine interview with him from last November. He talks about his time living in California, where he studied engineering, and his fondness for the US media. He also says that he is very keen on having true freedom of expression . 11.34 The Associated Press is quoting a Defense Ministry official as saying that army chief General Abdel-Fattah el-Sissi is meeting with his top commanders, hours before the military's deadline to the president and opposition is set to expire. Democracy Egyptian style - where everyone claims to speak for everyone else 11.09 While Cairo is still relatively quiet, here is some background reading. For those who haven't followed things very closely, a fairly concise primer on the recent troubles is available from this Guardian piece from last Thursday. It includes comments from Nathan Brown, a professor of Middle Eastern politics at George Washington University, who sums the problems up rather pithily: The number of actors who think they speak for the entire Egyptian people is a little bit troubling, he says. The presidency thinks it has been elected by the entire Egyptian people. The army think they are one hand with the people. The opposition think they are the entire society. 11.06 Bel Trew tweets: Twitter: Bel Trew - ???? ?????? - rt @adamakary Health ministry changes death toll to 23 dead and 600 injured at Cairo University gun battle. #Egypt 10.59 Egypt's military chiefs are reportedly holding crisis talks, AFP reports. Anti-Mohamed Morsi protesters hold up their shoes after a speech by the president 10.50 Egyptian cabbies, seldom short of a political opinion, are chipping into the nation's frenzied discourse. Morsi ciao, is the verdict of one of one driver who has just picked up a fare from the Telegraph's man in Cairo, Richard Spencer. 10.23 President Morsi's hardline Islamist allies in al-Gamaa al-Islamiya want him to call a referendum on early presidential elections to avoid bloodshed and a military coup, the group has just told Reuters. Gamaa al-Islamiyah is the Islamist group best known in the West for the Luxor massacre in 1997, in which 58 tourists, including six Britons, were killed as they toured the site of an ancient Egyptian temple. The group, which was banned under Mr Mubarak, has since embraced peaceful politics, but they have vowed to defend Mr Morsi's government physically against any attempted coup. Having friends like these, of course, has not endeared Mr Morsi to the secular opposition. 09.44 Here is a video dispatch from Richard Spencer sent overnight on the situation from the ground in Cairo: 09.38 Egypt's central bank has told banks to close their branches early and has advanced the time for a foreign currency auction, a banker has told Reuters, ahead of the army deadline this afternoon that could trigger a military takeover backed by protesters. Banks must close their branches by 2pm 1pm BST instead of the usual 5pm. The central bank will hold its currency auction at 10:30 instead of 11:00 and issue the result at 11:00 a.m. instead of 12:00 noon, the banker said. Army chief General Abdel Fattah al-Sisi 09.36 General Abdel Fattah al-Sisi, the army chief, is increasingly emerging as a key figure in the crisis sweeping the country. Here is a profile of the man who is desperate to end the crisis but without a return to the unpopular military rule of 2011 to 2012: Politicians and journalists who have met Sisi believe his main preoccupation is rebuilding the army's reputation, tarnished by its time in control of the country with the Supreme Council of the Armed Forces. After the short honeymoon period that followed the fall of Mubarak, the army found itself jeered with slogans such as Down with the military regime, similar to those chanted against Mubarak. Abdullah al-Sennaoui, journalist at the independent daily Al-Shorouk, who has met Sisi several times, stressed that the general had clearly been affected by the deterioration of the image and credibility of the army during its term in power. A girl with the colours of the Egyptian flag and the word leave painted on her face is seen during a demonstration against Egyptian President Mohamed Mursi in front of the Presidential Palace Qasr Al Quba in Cairo 09.06 Further strong words from the Muslim Brotherhood, as Essam el-Erian, deputy leader of the Brotherhood's Freedom and Justice Party, warns that the Egyptian people would not stay calm in the face of a military rebellion and said freedom was more valuable than life, Reuters reports. 08.52 Egypt's flagship state newspaper Al-Ahram says it expects that Mr Morsi would either step down or be removed from office later today: Al-Ahram learnt that with the end of the 48-hour period set by the armed forces ... it is expected in the hours that follow it, one of two things: either Morsi announces his resignation himself, or the declaration of his removal through the road map for the future set out by the armed forces. Egyptians waving their national flag as they protests against President Morsi in Tahrir square, Cairo 08.45 BST London 09.45 EET Cairo Good morning and welcome to our live coverage of the growing Egypt crisis, as President Mohamed Morsi refuses to step down despite mass protests and an army deadline of 16.30 EET 15.30 BST to find a solution.