By Steve Nolan Published: 07:14 EST, 3 July 2013 | Updated: 09:57 EST, 3 July 2013 Portugal's financial markets nosedived today amid fears that repayments on its ?64billion bailout could soon become unsustainable as the government looked set to collapse following a spat over the country's austerity programme. Share prices dropped by around six per cent in early trading alarming investors and reigniting concerns that the eurozone's strategy for dealing with the financial crisis is flawed. The market dip came as Portuguese Prime Minister Pedro Passos Coelho defied calls to resign last night after the resignations of key ministers in a spat over austerity. Portuguese Foreign Minister Paulo Portas, the leader of the junior party in the center-right coalition government, quit on Tuesday in protest against plans to continue with tax hikes and pay and pension cuts. The previous day, Finance Minister Vitor Gaspar walked out, saying he lacked political and public support for his austerity strategy. Portugal is locked into a program of tough budget cuts demanded by its fellow euro countries, the European Central Bank and the International Monetary Fund in return for a 78 billion euro ?66 billion bailout two years ago. Jose Manuel Barroso, the European Commission President, said he was following the situation 'with concern'. Leaders of the 17 European Union nations that share the euro currency, known as the eurozone, have insisted on cuts in countries like Portugal that have a heavy debt burden. But Portugal is now facing the likely prospect of austerity-inspired strife of the kind that has dogged Greece and compelled it to ask for a second bailout.? As well as drawing criticism from opposition parties, trade unions and business leaders, the austerity program has been a drag on Portugal's economy and unemployment is stuck at 17.6 percent. If Portugal doesn't abide by the austerity program, its bailout creditors could halt the disbursement of funds, potentially leaving it unable to pay what it owes. That development 'could trigger a sovereign default and potential removal from the eurozone, with contagion spreading across to Greece, a country that is currently struggling to secure its next tranche of aid money,' Ishaq Siddiqi of ETX Capital said today. Portugal's main PSI 20 stock index plunged 6.4 per cent to 5,177 in late morning trading Wednesday. Another indicator of investor confidence in a country, the interest rate on Portugal's benchmark 10-year bond, hit 7.39 per cent - up from 5.23 per cent in May but nonetheless lower than the 9.77 per cent it was at this time last year. Passos Coelho, the prime minister, said in a nationally televised address that he will fight to keep his Cabinet together, 'but resolving the problem doesn't only depend on me.' He said he will speak to Portas, head of the Popular Party, in an attempt to resolve their differences. Portas did not say whether he would pull his party out of the government - a step which would leave Passos Coelho without the majority in Parliament he needs to enact his policies. Antonio Seguro, leader of the main opposition Socialist Party who has called for new elections, was due to meet later Wednesday with President Anibal Cavaco Silva. The head of state has the power to dissolve Parliament and call a ballot, though he has expressed reluctance to take that course.