By Jill Reilly Published: 11:20 EST, 1 July 2013 | Updated: 11:40 EST, 1 July 2013 Bare-breasted members of the feminist group Femen staged a topless protest inside a Swedish mosque after sneaking in wearing 'burkas'.? The women, who strip off to highlight a range of issues, including women's rights, press freedom and domestic violence were dragged from the Stockholm mosque on Saturday by police. But once they were inside they took them off to bare their breasts, which were emblazoned with slogans such as 'No sharia in Egypt and the world' and 'My body is mine, not somebody?s honor'. Mosque employees called police who removed the women from the scene, reported AFP. The members of the women's rights group which has staged protests against Russia's detention of the feminist punk band Pussy Riot around Europe, did not explain why they wanted to protest inside the mosque. The women were reportedly from Egypt, Tunisia and Sweden, although police were not immediately able to confirm their identities or nationalities. Last week bare-breasted members of the feminist group Femen targeted the motorcade of Tunisian Prime Minister Ali Larayedh to protest the jailing of group members in Tunis. As the Tunisian motorcade left following a visit to European Union headquarters, two women climbed atop a diplomatic car and two others chanted slogans. Security officials dragged the women off the car, and all four ran away from the scene. Earlier this month three of the group's activists were sentenced to four months in prison last week after staging a topless protest in the country's capital demanding the release of a Tunisian FEMEN activist. Marguerite Stern and Pauline Hillier, from France, and Josephine Markmann, from Germany, were arrested on 29 May as they protested bare-chested in front of the Tunis Court building. The trio had approached the entrance to the ministry wearing coats which they took off, revealing naked torsos scrawled with 'Breasts Feed Revolution'. Wearing just jean shorts, the women chanted in English 'Free Amina' and 'Women's spring is coming' as people in the crowd attempted to cover them. The women then climbed up on the gates of the Justice Ministry until police pulled them down and hustled them shouting into the building as an angry crowd gathered. They were protesting in support of Amina Tyler, 19, who was arrested days earlier. She had sparked outrage in the conservative country by posting topless pictures of herself to Facebook wearing the slogan 'My body belongs to me' in Arabic across her bare chest. She was taken into hiding by her family after conservative preachers issued death threats against her, including one who called for her to be stoned to death. But she later attempted another protest on May 19 in the religious centre of Kairouan, where she was arrested. Amnesty International has condemned the convictions for public indecency, undermining public morals, and making noise disturbing peace as 'an unacceptable restriction on freedom of expression'.