The coalition that toppled ex-President Hosni Mubarak comprised Islamists he had persecuted, liberals who demanded personal freedoms, socialists who opposed his economic policies and ties to the United States, and even army officers who disliked his son, Gamal, and wanted to stop him inheriting the throne. Some were happy with the regime but opposed the corruption of the elite who surrounded the man himself. All paid lip service to the idea of free elections, but for some there were other important considerations. Some feared that Islamists, who seemed to command a natural majority or at least were by far the best organised political movement, might use their mandate to limit freedoms, others that economic reforms would continue to erode state services to the poor. Many just thought their personal finances would have improved by now, a forlorn hope. At the weekend, these groupings formed a new alliance. The army, just as it refused in the end to back Mr Mubarak, appears to be doing the same with Mr Morsi. It is harder this time to forecast the result. After Mr Mubarak fell, interim rule by the army council seemed inevitable. However, it made such a mess of it, overseeing parliamentary elections later ruled illegal, watching as the economy collapsed, and sullying its reputation with a series of spectacular human rights abuses, that it is unlikely to want a second go. Its statement on Monday said it would not be a party in politics or governance . That leaves unsaid what its promised road map might be. Most assume it will involve fresh elections, but that leaves unstated what will happen if the Brotherhood wins again ? or, conceivably, a more radical Islamist candidate. The emergence of a popular, energetic, and competent leader from the ranks of the opposition might well solve the crisis. But Egypt has been waiting for one of those since the revolution and the shortage of coherent policies from the main political parties suggest it will be waiting for longer still, during which time an immense and dangerous void looms.