Britain had to work with whoever is in authority in Egypt , he said, adding that for the safety of British nationals, we have to do that because there are so many British companies there . This is a military intervention in a democratic system, he continued. We have to understand it's a popular intervention, there's no doubt about that in the current state of opinion in Egypt. So while warning about the precedent that it sets for the future, of course we have to work with the Egyptians, with the majority will in Egypt, and that's what we will do. The Foreign Secretary said that the West needed to have the strategic patience to wait for the turbulence of the Arab Spring to die down. Washington also trod a careful line, with President Barack Obama stating that they were deeply concerned by the decision of the Egyptian armed forces to remove President Morsi and suspend the Egyptian constitution. I now call on the Egyptian military to move quickly and responsibly to return full authority back to a democratically elected civilian government as soon as possible through an inclusive and transparent process, and to avoid any arbitrary arrests of President Morsi and his supporters, he said. But to skirt accusations of American interference, he emphasised that this was an Egyptian-led process. We believe that ultimately the future of Egypt can only be determined by the Egyptian people. Other countries were stronger in their criticism. Guido Westerwelle, the German foreign minister, described the events in Cairo last night as a major setback for democracy in Egypt, while his Turkish counterpart ? perhaps reflecting the atmosphere in Turkey following weeks of anti-government protests ? was more forceful. It is unacceptable for a government, which has come to power through democratic elections, to be toppled through illicit means and even more, a military coup, said Ahmet Davutoglu. Yet others welcomed the overthrow of Mr Morsi. Sheikh Tamim bin Hamad Al Thani, the emir of Qatar, sent a cable of congratulations to the head of Egypt's Supreme Constitutional Court on the occasion of his taking the oath as an interim president. And President Bashar Assad of Syria was positively gleeful about the fall of a ruler seen, in his eyes, as being a religious extremist. Mr Assad has consistently stated that his own removal from power in Damascus would bring about the chaotic scenes witnessed in Cairo. Whoever brings religion to use for political or factional interests will fall anywhere in the world, he said.