By Jessica Jerreat Published: 15:55 EST, 5 July 2013 | Updated: 23:45 EST, 5 July 2013 John Kerry's spokesman has admitted that the Secretary of State did go sailing off Nantucket as the Egyptian President was ousted from power, after pictures emerged of him out on the water on July 4. The Secretary of State had been criticized for taking a vacation with his family at his holiday home in Nantucket, as Egypt plunged into crisis. New pictures of Mr Kerry on a kayak and a boat in Nantucket Sound on July 4 have now surfaced after his spokesman forcefully denied he went sailing after an earlier photo was posted to Twitter. Scroll down for video: 'It doesn?t look good, and I think it sends the wrong message,' Republican strategist Brad Marston told the Boston Herald . 'If I were advising him, I?d already have him on a plane.' Mr Kerry had already been spotted near July 4 festivities in the center of town earlier in the day, but the latest pictures showed him loading bags into a boat near his holiday home. The State Department was forced to retract its denial that he had been sailing on Friday, conceding that Mr Kerry had taken his grandson out on the yacht for an hour on Wednesday.? 'While he was briefly on his boat on Wednesday, Secretary Kerry worked around the clock all day including participating in the president?s meeting with his national security council,' spokesman Jen Psaki said. It is a reversal of her original statement, when Ms Psaki had said: 'Any report or tweet that he was on a boat is completely inaccurate.' His aides even denied Mr Kerry was on a boat when CBS sent them a photo of the Secretary of State on board his yacht. With the Egyptian military ousting President Morsi and violent deaths being reported in the country, many people in Nantucket were surprised to see Mr Kerry at his holiday home rather than in Washington. 'I would think the Secretary of State would interrupt his vacation and at least send a very clear signal - even by flying back to Washington for a day or two - that on our Independence Day we are very concerned about the freedom and democracy that we hope is instilled for some period of time in the Arab World,' Patrick Griffin, Republican strategist, said. Mr Kerry's unexpected vacation has been charted on Twitter after residents started noting his moves around the town, which could have gone unnoticed if it wasn't for a video allegedly showing his motorcade getting stuck in traffic as he arrived earlier in the week. Despite admitting that he had gone sailing, his aides insisted that Mr Kerry had been in regular phone contact with world leaders and had taken part in White House meetings after the first democratically elected Egyptian president was ousted. An aide to the Secretary of State, who had just returned from a 12-day tour of the Middle East, told the Boston Globe the earlier denial had been a result of 'confusion', and confirmed Mr Kerry had gone sailing with his grandson. According to Ms Psaki he had spoken to leaders and diplomats in Egypt, Israel, Norway, Qatar and the United Arab Emirates - all while on vacation in Nantucket. However, an aide said none of the phone calls were made while he was on his yacht, according to ABC News . Mr Kerry has been criticized previously for taking to the water during difficult political times. During his 2004 presidential election campaign he drew derision after being pictured wind surfing as his campaign fell apart. When the first claims that he was relaxing in Nantucket were made, Miss Psaki had said: 'Since his plane touched down in Washington at 4am, Secretary Kerry was working all day and on the phone dealing with the crisis in Egypt.' Criticism of the Secretary of State began after a CBS producer refused to retract a tweet saying that he had seen Mr Kerry on his yacht, Isabel. Mosheh Oinounou tweeted a photo of Isabel on Wednesday, and reported seeing Mr Kerry on board, according to CBS Boston . Another tweet posted by another person in Nantucket, and allegedly sent at about 11.30am on Thursday, said: 'Watergun fight about to take place. John Kerry is apparently here ...' Mr Kerry had been working closely with President Morsi and in May had authorized $1.3 billion in military aid to the country. All U.S. Embassy staff and diplomats have since been ordered to leave Egypt as violent protests and clashes take place. Since the head of Egypt's armed forces issued a declaration suspending the constitution and appointing the head of the constitutional court as interim head of state, the country has descended into chaos. Thousands of Morsi supporters demonstrated in what his Muslim Brotherhood called a 'Friday of rage' against what they described as a military coup. In Cairo, a crowd of Islamists surged across a bridge over the Nile River after nightfall and clashed with Morsi opponents near Tahrir Square and outside the state TV building.