As a mass of protesters on Cairo's Tahrir Square feted the army for saving the revolutionary democracy won there two years ago, supporters of the president's Muslim Brotherhood denounced a military coup . Some clashed with security forces at Cairo University, where 16 people died and about 200 were wounded. Military sources told Reuters the army had drafted a plan to sideline Morsi and suspend the constitution after a 5pm 1500 GMT deadline passes. Coordinated with political leaders, an interim council would rule pending new elections. The sources would not say what was planned for an uncooperative president. Facing the expiry of a 48-hour ultimatum set by the head of the armed forces that he should agree a power-sharing deal with his rivals, Morsi broadcast a defiant, if somewhat rambling, address to the nation to defend his legitimacy ? a word he used repeatedly in the course of 45 minutes. Liberal opposition leaders, who have vowed not to negotiate with Morsi since the ultimatum was issued, immediately denounced his refusal to go as a declaration of civil war . The youth movement that organised the mass protests urged the Republican Guard to arrest Morsi immediately and present him for trial. Three hours after his midnight television appearance, the military high command responded with a post on its Facebook page. The post said they, too, were willing to lay down their lives to defend their position ? one which they described as defending the Egyptian people from terrorists, radicals and fools . A military source said the message came from General Abdel Fattah al-Sisi, the armed forces commander appointed by Morsi last year, who issued the ultimatum to politicians on Monday. It is an honour for us to die rather than that anyone should terrorise or threaten the Egyptian people, it said. We swear to God, we will sacrifice even our blood for Egypt and its people to defend them against any terrorist, radical or fool. Long live Egypt and its people. The United States has urged compromise. It has funded the army for decades, since long before the fall of Mubarak in 2011, as a key part of helping secure Washington's ally Israel. Morsi aides have said they believe a coup would need U.S. support. Washington has also defended the legitimacy of Morsi's election to lead the biggest Arab nation, as part of a strategy of promoting democracy in the Middle East since the Arab Spring. President Barack Obama told Morsi by telephone that talks with opponents were needed. Morsi said on Twitter that he would not be dictated to internally or internationally . In his television address, Morsi warned that any deviation from the democratic order approved in a series of votes last year would lead Egypt down a dangerous path. It was unclear who fired at whom or who started the violence at Cairo University. Muslim Brotherhood supporters angrily held up rifle and shotgun cartridges after scenes of mayhem, shrouded in tear gas. State television quoted a health ministry official as saying 16 people died and about 200 were hurt. That made it by some way the bloodiest incident in several weeks of street fighting. Eight people were killed the previous day during a siege of the Brotherhood's national headquarters and the movement has said it is under attack from hired thugs left over from the days of Mubarak's secret police.