Royal expert Christopher Warwick said some Norwegian kings, including the late Olav V who was actually called Alexander, switched to names that were not even among their other given names. But in the UK, those who decided to rule under a different name picked one of their middle names. Mr Warwick said of William and Kate's newborn son: ''There's a chance that if and when he becomes King he might choose one of his other names - it depends on the name he's given.'' He added: ''George VI chose George first of all as a definite tribute to his father. But with the abdication, George VI said he had to 'save this rocking throne'. With George V and George VI, it created a terrific continuity.'' Victoria's eldest son and second child King Edward VII, who ruled from 1901 to 1910, was christened Albert Edward. Named after his father Prince Albert, he was, like George VI, known to his family as ''Bertie''. Mr Warwick said: ''There was that uneasy relationship between Edward VII and his parents. He was always perceived as being told off for doing things he shouldn't be doing.'' Queen Victoria blamed Edward VII, then the Prince of Wales, for causing his father's death when Prince Albert died from typhoid two weeks after a visit to Cambridge to reprimand his playboy son. Mr Warwick suggested that Edward VII wanted to separate himself from his father's memory by choosing Edward, not Albert. There has been speculation that the present Prince of Wales will one day rule as George VII instead of Charles III, as the name Charles has been considered unlucky for Kings. George is one of his middle names. Charles I was executed and Charles II's reign featured the plague and the Great Fire of London. However when the present Queen was asked what she would be called as monarch, she is said to have replied: ''My own name, of course - what else?'' Royal princes have, now and in the past, been known by names other than their first given name. Prince Harry's first name is actually Henry, followed by Charles Albert David, but other than in the Court Circular, he is usually referred to as Prince Harry. Buckingham Palace confirmed at the time when his name was announced that he would be known as Harry. King Edward VIII, who abdicated the throne, had seven names - Edward Albert Christian George Andrew Patrick David - but was always known to his family as David. Edward's VII first son Albert Victor, who died in 1892 before he could become King, was called ''Eddy'' by the royals in a nod to his fourth name Edward. A new report by the leading drug watchdog, Drugscope, has revealed the average cost of illegal drugs on the streets of Britain. The annual snapshot survey involved consulting those working on the frontline in 17 towns and cities across Britain and has revealed a significant rise in street drug purities. The charity says the price of some drugs, such as heroin and ecstasy, has halved since the 1990s.