The last time you kind-of-sort-of mattered was in 1909-1911, during the premiership of the Liberal H. H. Asquith. When the House of Lords was giving him trouble when he was trying to pass the People?s Budget, Asquith went to the King to ask if he would agree, upon Asquith?s request, to appoint enough Liberal life peers ? a kind of noble rank in Britain that only lasts for the holder?s life; those who hold it get to sit in the House of Lords ? for the budget to pass the House of Lords. The King?s adviser, Lord Knollys, stated that ?the King regards the policy of the Government as tantamount to the destruction of the House of Lords.? He refused to agree to create the peers unless the Asquith government were dissolved again, and reelected, and the House of Lords still refused to pass its budget. But he did concede that he?d create them if that happened. It didn?t have to, as the Lords allowed the budget to take effect in April 1910 without any action by the King. One month later, Edward died, and George V took the throne. In November, Asquith asked George to make the same promise his father had, this time about the passage of the Parliament Act, which permanently enshrined the House of Commons as the dominant house. It said that bills certified as ?money bills? those dealing with taxes, spending, debt, etc. could only be delayed by the Lords for one month, not blocked entirely. Other bills introduced by the government could only be delayed for two years. The Lords, unsurprisingly, didn?t much care for this development. So Asquith wanted to know that George would have his back when stuff got real. George agreed, reluctantly. In July 1911, Asquith informed the King that the Lords were insisting on unacceptable amendments to the Parliament Act, and so the King agreed to appoint the peers. However, the threat was enough to cow the Lords into passing the bill, so the peers didn?t have to be appointed after all. Since Asquith used your great-great-great-grandfather as a pawn, the Crown hasn?t even been that involved. When your great-great-granduncle abdicated the throne, your great-great-grandfather couldn?t take over until the parliament passed a law letting him. The last time the Crown actually interacted with the Prime Minister in a real way was in 1997, when Tony Blair impressed upon your great-grandmother the importance of not being a jerk in the wake of your grandmother?s tragic death. There was a pretty good movie about the whole thing. As things stand now, the vast majority of the current monarchs are male. So are their heirs; so are the heirs to their heirs. Unless something dramatic and unforeseen happens, the world?s 25 monarchies will continue to be overwhelmingly male for at least the next several decades. Most monarchies forbid women outright from taking the throne; this includes all eight Arab monarchies as well as Cambodia, Lesotho and Brunei. Three countries allow female succession but only if there are no men available, which makes a queen very unlikely: Thailand, Bhutan and Tonga. If there is a new queen in the world, she will almost certainly be European or possibly Japanese. Four European monarchies allow equal female succession, meaning that the crown passes to the oldest heir regardless of gender. The other three European monarchies are in the process of changing their laws to allow equal female succession; Japan is considering this change as well. With the birth of Middleton and William?s son, it looks like most of the coming European monarchs will still be male. There are a few princesses in line, but most are still a ways off from the throne, some by half a century. Right now, there are two queens in the world and 21 kings. It looks like that ratio is going to hold for the foreseeable decades. Facebook released data saying that global mentions of the royal infant in posts and comments broke the 1 million mark within the first hour of the birth announcement. The United Kingdom, of course, was the top source of chatter about the new little prince, followed by the United States, Canada, Italy and France. Mentions of the baby were most prevalent among women between the ages of 25 and 34, followed by women between 18 and 24, women between 35 and 44, men ages 18 to 24 and, finally, women between 45 and 54. A look at Facebook?s network using its new hashtags shows that brands were also quick to jump on the news ? particularly after Buckingham Palace confirmed that Catherine, the Duchess of Cambridge, had delivered a healthy baby boy. Brands and organizations ranging from AARP to Nintendo to Domino?s Pizza ? which quipped ?another great delivery? ? joined the flurry of chatter about the happy event. On Twitter, the network reported a peak of around 25,300 messages per minute within minutes of the official birth announcement, and several celebrities and world figures tweeted their congratulations. And, for the first time, the royal family used social media as an official channel of communication throughout a royal labor and delivery. Clarence House, the residence of new grandfather Prince Charles and wife Camilla, tweeted posts throughout the day, from the announcement that Catherine had gone into the ?early stages of labour? to news about the baby and updates on the family?s reactions.