Prince George of Cambridge may be a royal baby. But the noble newborn has nothing on Jay Z & Beyonc??s little princess, Blue Ivy Carter. 	Not only is her mom known as Queen Bey, but she already owns a crown and may one day be worth more than her royal rival. 	While Blue Ivy reigns as top tot here in the States, she?d better watch the throne. Other powerhouse parents ? like Kourtney Kardashian & Scott Disick ? are pampering their own little princes and princesses with luxuries like Prada diaper bags. 	These bougie babies were born to rule. 	BLUE IVY CARTER 	Age: 18 months 	Parents: Shawn Jay Z Carter & Beyonc? Knowles 	Estimated Net Worth: $800 million $500 million from dad & $300 million from mom 	Swag: An $80,000 diamond-encrusted Barbie doll, $5,200 Swarovski crystal-studded Baby Diamond Bathtub from Kelly Rowland, $1,029 Bugaboo Cameleon stroller from Gwyneth Paltrow, and a priceless pair of custom-made pink Tom Ford heels. 	Baby Talk: With parents like Jay and Bey, we expect the hip-hop heiress to run the world. She?s already making history by becoming the youngest artist to make the Billboard charts when her pop recorded the seven-pound, 2-day-old newborn?s cries on his hit track ?Glory.?? 	PRINCE GEORGE OF CAMBRIDGE 	Age: 6 days 	Parents: Prince William Wales & Kate Middleton, Duke & Duchess of Cambridge 	Estimated Net Worth: $41 million $40 million from dad & $1 million from mom 	Swag: A ruby-encrusted 18-karat white gold Theo Fennell charm bracelet that doubles as a diaper-rash cream holder. An official pint-sized soccer jersey from the Village Chiefs dad?s favorite team with ?HRH? and the number ?1? on the back, and a Harrods? teddy bear about $54 from daddy. Plus, he?s third in line for the Crown Jewels. 	Baby Talk: George Alexander Louis, born at a healthy eight pounds, six ounces, is already being reprimanded for his lateness. The Queen herself was impatient for the royal baby to arrive before her holiday. Dad William joked, ?I?ll remind him of his tardiness when he?s a bit older! o ? o 	THE CRUZ-BARDEM BABY GIRL 	Age: 6 days 	Parents: Penelope Cruz & Javier Bardem 	Estimated Net Worth: $75 million $55 million from mom & $20 million from dad . 	Swag: Cruz has been spotted carrying the $275 Storksak Unisex Jamie leather diaper bag also a favorite of Brad Pitt for big brother Leonardo, now 17 months old. 	Baby Talk: The ?Vicky Cristina Barcelona? couple are fiercely private, so giving birth on the same day as Kate Middleton posed the perfect coverup for their bundle of joy, whose name and weight still remain secret. Their son Leo?s name wasn?t leaked to the press until a month after he was born. 	WINNIE ROSE FALLON 	Age: 5 days 	Parents: Jimmy Fallon & Nancy Juvonen 	Estimated Net Worth: $16 million from dad 	Swag: The new parents are playing things close to the vest, but surely daddy can get the Roots to play her first o birthday party? Questlove already crowned himself the baby?s uncle on Twitter. 	Baby Talk: Funnyman Fallon devoted his Wednesday night monologue to talking about daddy?s little girl. ?She?s so cute. She?s five pounds, nine ounces,? he gushed, before joking, ?Yes, William and Kate, we will definitely set up a play date.? 	NORTH NORI WEST 	Age: 6 weeks 	Parents: Kim Kardashian & Kanye West 	Estimated Net Worth: $140 million $100 million from dad & $40 million from mom 	Swag: A $13,700 Swarovski crystal-studded highchair designed by Carla Monchen, Christian Dior baby booties and a sterling silver Elsa Peretti Padova fork, spoon and cup set from Jay Z and Beyonc?. 	Baby Talk: Just like mom, little Nori couldn?t wait for her moment in the spotlight ? she arrived five weeks early at just 4 pounds, 15 ounces. She also reportedly shares Kim?s dark hair and good looks. 	EVERLY TATUM 	Age: 2 months 	Parents: Channing & Jenna Dewan Tatum 	Estimated Net Worth: $56 million $50 million from dad & $6 million from mom 	Swag: A $140 organic Dolcino woven baby carrier from Moby Wraps, Aden + Anais Princess Posie muslin cotton swaddles $49.95 for four plus a gift basket from daddy?s ?Magic Mike? co-star Matthew McConaughey featuring Banana Boat Infant Tanning Oil, a custom-made People?s Sexiest Baby Alive baby book, and a Build-a-Bear with tear-away leather pants. 	Baby Talk: The Tatums are keeping most details about their second baby under wraps ? literally, with Channing swaddling his daughter at LAX. The little lady must?ve been tiny, as her mom has already been seen in tight jeans with barely a post-baby bump. 	ACE KNUTE JOHNSON 	Age:?1 month 	Parents:?Jessica Simpson & Eric Johnson 	Estimated Net Worth:?$100 million from mom 	Swag:?Big sister Maxwell now 15 months got a $117 Junior Gaultier bathing suit and a $40 Abbey Hill pink and crystal pacifier, so expect similarly cute but affordable gifts for the baby boy. 	Baby Talk:?Ace has some big booties to fill ? his older sister Maxwell was born a whopping 9 pounds, 13 ounces. Maybe their former NFL father is trying to field his own team of linebackers? 	VIVIAN LAKE BRADY 	Age: 7 months 	Parents: Tom Brady & Gisele Bundchen 	Estimated Net Worth: $390 million $270 million from mom & $120 million from dad 	Swag: Cybex Aton infant car seat $270 , the Callisto stroller travel system $370 , and the $145 Ergobaby Organic Collection Baby Carrier. 	Baby Talk: The model moppet is already mugging for the cameras. Bundchen?s posted precious pix of the beautiful babe doing yoga and cuddling with mommy. 	LORENZO DOMINIC LAVALLE 	Age: 11 months 	Parents: Nicole Snooki Polizzi & Jionni LaValle 	Estimated Net Worth: $4.2 million $4 million from mom & $200,000 from dad 	Swag: The Fisher-Price Power Wheels Cadillac Escalade EXT $420 , Dazzle Diva Italian Flag Bling Baby Booties $125 , plus a a zebra-print monogrammed diaper bag. 	Baby Talk: Snooki?s little meatball was born 6 pounds, 5 ounces, and he?s already flashing his mom?s feisty temper. This week, the ?Jersey Shore? star posted a clip of her tot smacking her, griping, ?My son likes to beat me up.?? 	PENELOPE SCOTLAND DISICK 	Age: 1 year 	Parents: Kourtney Kardashian & Scott Disick 	Estimated Net Worth: $14 million $12 million from mom & $2 million from dad 	Swag: A $1,500 Bugaboo donkey stroller, $1,140 black nylon Prada diaper bag, plus a $345 tiny Balenciaga bag from Kim Kardashian. 	Baby Talk: Penelope, who was born 7 pounds, 14 ounces last summer, is already keeping up with the Kardashians? style. The little lady hit Miami with mom last week wearing a flashy leopard print bikini. Oh, baby! o 	 All estimates according to CelebrityNetWorth.com