In an echo of those murmurs that he will be put down for Eton just like his father and grandfather, and of that ghastly scramble to sneak Prince Edward into Cambridge despite the fact he only achieved a B and a C in his A-levels, it is blithely assumed that our third-in-line cannot possibly navigate a path in life that excludes masterful horsemanship. Granted, the strength of the royal preoccupation with all things hoofed ought not to be downplayed. The Queen has been described as an ?out-and-out horse addict? and learnt to ride with sister Margaret aboard a Shetland named Peggy by father King George VI. These animals are enmeshed in our regal iconography. After all, what would Van Dyck have done to accentuate the masculinity of Charles I, had he not depicted the frail-looking monarch on a mighty charger? But if the Duke and Duchess of Cambridge are truly ?modern? in outlook, and we have heard enough crawling Sky News obsequies to that effect to last our lifetimes and the baby?s, they ought at least to countenance an alternative route. William claims to be an ardent Aston Villa fan, even though he has eaten about as many pies in the Holte End as I have cucumber sandwiches at Clarence House. And, auspiciously, the club are already on the case. This week Villa took trouble to courier across some special-issue, claret-and-blue junior kit, emblazoned ?HRH 1?, just to sew an idea in William?s mind of a first heir-to-heir kickabout on the Kensington Palace lawns. ?Let?s hope he dribbles for Villa in the weeks and months ahead,? said a club spokesman, displaying punning abilities of which even the most ingratiating courtier would be ashamed. Quite when or how they acquired such an august base of supporters, who also include Tom Hanks and the Prime Minister, is difficult to say. But William, even if he chose not to name his firstborn in honour of Christian Benteke ? purely protocol, you understand ? could at least deign to take him to the Villa Park citadel for a paternal outing. ?See that Darren Bent, son? He would never even have got into the Eton thirds.? A more probable destination for William?s progeny is, of course, the old ruffians? game for gentlemen. We have been denied the spectacle of a royal competing at Twickenham ever since Prince Alexander Obolensky, the Russian harboured here in the wake of the Bolshevik Revolution, scored his length-of-the-field try against the All Blacks in 1936. William has been steeped in rugby since his school days and would surely impart the same raw enthusiasm, but a more thorny question is which international team his young son would feel comfortable supporting. His patronage of the Welsh Rugby Union hints at a non-negotiable allegiance to Sam Warburton et al, but the Princess Royal?s ties to the Scotland team muddy matters somewhat. Perhaps a quick father-and-son dash to Rosslyn Park, on the Upper Richmond Road, would be safest. Neglecting the rule of primogeniture for a second, though, we might like to consider what sports guise the Duchess might envisage for her child. Judging by the alacrity with which auntie Pippa clops along to Wimbledon and Roland Garros, even writing on the subject for Vanity Fair, tennis would seem eminently suitable. As mere Kate Middleton she competed in the first pair at Marlborough, and has seldom missed an invitation to the All England Club since. Maybe, however, we ought at least to wait until George opens his eyes before making a firm projection. Hold fire on that pony, and cancel that first Sandringham ride. For this baby is saddled with quite enough expectations before he ever has to be placed in the saddle itself.