By Rebecca English Royal Correspondent Published: 11:42 EST, 25 July 2013 | Updated: 09:37 EST, 26 July 2013 Less than 24 hours after he was officially named, so-called ?cybersquatters? are already trying to cash in on HRH Prince George of Cambridge. More than 178 ?domain names? connected to the new royal baby were seized by opportunists within hours of the announcement by Kensington Palace on Wednesday evening. In simplistic terms, a domain name is the name for a website and it is what users will type into an internet search engine to get to your website. According to names.co.uk, one of the UK?s top domain name registrars, the first was by a Portuguese domain-name broker who registered the web address GeorgeAlexanderLouis.com moments after Prince William and Kate revealed the name of their new-born son. Others website registered include princegeorgecambridge.co.uk, Hrhprincegeorge.co.uk, hisroyalhighnessprincegeorgeofcambridge co.uk, princegeorgeofcambridge.com and kinggeorge.com. Several website names are already up for sale including http://royalprincegeorgealexanderlouis.co.uk/ which has been registered by a Florida-based businesswoman. Sally Tomkotowicz, Customer Acquisition Manager for names.co.uk explained: ?The announcement of the Royal baby?s name caused an absolute gold rush of people registering domain names associated with the future King. 'We've not seen cybersquatting on this scale since the announcement of the new Pope in March. ?No sooner had the announcement been made by the Palace, opportunistic cybersquatters from around the world began registering key domain names connected to HRH Prince George Alexander Louis. 'With a number of websites and twitter feeds already set up for George, he is likely to be Britain?s first truly digital prince.? Miss Tomkotowicz added: ?Cybersquatting can involve registering, trafficking or using a domain name in bad faith and with intent to profit from the goodwill of a trademark belonging to someone else. 'Cybersquatters sometimes offer to sell the domain to the person or company who owns a trademark at an inflated price.?