By Meghan Keneally Published: 20:46 EST, 15 July 2013 | Updated: 07:44 EST, 16 July 2013 Trayvon Martin?s friend Rachel Jeantel, revealed last night that she ?had a feeling? that the largely white-female jury would find George Zimmerman not guilty because of their race. 'If Trayvon was white and he had a hoodie on, would that have happened?' said Miss Jeantel, who was the last person to speak to the teen. Meanwhile protests continued throughout the U.S. as thousands of people gathered in Atlanta, Georgia, and Birmingham, Alabama, as well as smaller crowds in New York City and Washington D.C. Miss Jeantel, who seemed much more confident on the CNN set next to her lawyer than she did on the witness stand, touched on a number of the criticisms that she faced both in the courtroom and on social media, including her attitude, choice of words, and her decision not to attend her friend's funeral. 'I didn't put Trayvon in that casket... I did not plan for that week to be at a funeral,' she said. Juror B37 said that the way Miss Jeantel spoke and the phrases that she used caused some of her testimony to get lost in translation. 'I didn't think it was very credible but I felt very sorry for her... I think she felt inadequate in front of everyone because of her education and communication skills,' the juror told Mr Cooper. When that quote was played for Miss Jeantel she said that she felt angry about the juror's comments, offering instead that generational differences caused bigger problems in terms of getting the point across. 'Well, the jury, they see their facts. My thoughts of the jury, they old, that's old school people. We in a new school, our generation, my generation.' Miss Jeantel also used her CNN interview as a time to paint a different picture of her slain friend than the one that defense built, bringing up the fact that his bloodstream showed low amounts of marijuana. She said that while she doesn't smoke marijuana, Martin did about twice a week- a practice that she feels is common in their area. In the third part of Pier Morgan asked his guest if there was anything she wished she?d said on the stand. Miss Jeante answered with one word: 'Ni***.' She told Morgan that 'the whole world say it?s a racist word' but the version of the word that she testified Martin had used in reference to Zimmerman which has an 'a' instead of an 'er' does not have a racist meaning. When Morgan asked if it meant a 'black male,' Miss Jeantel said it meant any type of make including a 'Chinese' man. 'But n*****,'? Jeantel said, stressing the 'er' part? is a 'racist word.' She told Morgan 'I?d advise you not to be by black people... because they?re not going to have it like that.' The first juror to speak out following the acquittal of Zimmerman revealed that half of the jury wanted to convict him for killing Martin. Three of the six female jurors believed he was innocent from the beginning of their deliberations, while one wanted to convict the neighborhood watchman of second degree murder and the other two wanted to find him guilty of manslaughter. In the end they all found him innocent, but that did not make them feel any better, as all six of the women reportedly broke down in tears after submitting their final votes to the foreman on Saturday. ?It's just hard thinking that somebody lost their life and there's nothing else that can be done about it,' the juror told Anderson Cooper. 'It's a tragedy this happened, but it happened. I think both were responsible for the situation they had gotten themselves into. I think both of them could have walked away it just didn't happen.'