NASHVILLE, Tenn. - Beyonce called in a concert for a moment of silence for Trayvon Martin, rapper Young Jeezy released a song in Martin's memory and Russell Simmons called for peace after George Zimmerman was acquitted by a Florida jury in the death of the teenager. 	There was a wide range of reactions by celebrities after jurors cleared Zimmerman late Saturday of all charges in the 2012 shooting death of the unarmed 17-year-old Martin. 	Beyonce took a moment to honor Martin during her Mrs. Carter Show World Tour concert at Bridgestone Arena in Nashville, Tenn. Her concert started about 30 minutes after the Zimmerman verdict began to circulate. 	 I'd like to have a moment of silence for Trayvon, the pop star said as the stage grew dark with just a few key lights shining. 	Beyonce then sang the chorus of I Will Always Love You, a song, fittingly given the location, written by country music star Dolly Parton and brought to a global audience by the late Whitney Houston, before transitioning into her hit Halo. 	It was just one of several reactions from celebrities and artists following Zimmerman's acquittal by a six-woman jury. Much of it focused on the perceived outrage of the situation. But others had more poignant responses. 	Young Jeezy posted a new song, It's a Cold World A Tribute to Trayvon Martin , to his Facebook page with a comment: I am in no way shape, form, or fashion ... trying to capitalize off of the latest series of events. These are my true feelings and my form of expression about it. 	Simmons, a producer and entrepreneur, posted a blog entry that said he'd be supporting the Trayvon Martin Foundation in helping to repeal laws like Florida's Stand Your Ground law. He signed off, God bless you little brother. Rest in peace. 	He also called for those upset with the verdict to channel their energy away from violence on Twitter, telling followers we must remain peaceful. No matter what, remain peaceful. 	For the most part, it appeared protesters did with few reports of damage late Saturday and early Sunday in Tallahassee, Fla., Atlanta and California. 	 If u have any anger this evening, Simmons wrote on Twitter, put that energy into challenging these horrible laws that allow overly-anxious neighborhood watchmen to carry guns and shoot innocent people.