In footage of the jury selection broadcast on US television, the female juror, identified as B-37, was asked what she knew of the death of Mr Martin. She characterised it as an unfortunate incident that happened , mistakenly claiming that it had provoked rioting in Sanford, Florida, where the killing took place. Initially, We had three not guilties, one second degree murder and two manslaughters, the juror said, adding she was one of the ones who voted not guilty. Mr Zimmerman - who has a white father and a Peruvian mother - said he acted in self-defence when he shot Martin during an altercation on the rainy night of February 26, 2012. But prosecutors said he profiled and stalked Martin, provoking the altercation that led to Martin's death. The juror said ultimately it became a question of whether the events leading up the shooting were legally relevant or if, for self-defence, it is the moment before pulling the trigger that counts. It was just so confusing with what and what we could apply to what. Because I mean, there was a couple of them in there that wanted to find him guilty of something, the juror said. But after hours and hours and hours of deliberating over the law and reading it over and over and over again, we decided there's just no way. The juror explained her understanding of what happened that night: I think George got in a little bit too deep.... He shouldn't have been there. But Trayvon decided that he wasn't going to let him scare him and get the one up on him or something. And I think Trayvon got mad and attacked him, the juror said. I had no doubt George feared for his life in the situation he was in at the time. But she broke into tears as she described the mental anguish she and the other jurors felt as they weighed their decision. It's a tragedy this happened, but it happened. And I think both were responsible for the situation they had gotten themselves in to. I think both of them could have walked away. In the aftermath of the verdict, race again came to the fore, with angry protesters asking if the result would have been the same had Martin been white and Zimmerman black. We are all Trayvon, some cried. But the juror said the panel of five white and one Hispanic women didn't discuss race and she did not believe it was a factor in the shooting. Judge Debra Nelson ruled at the outset that prosecutors could not say that Mr Zimmerman had profiled Martin on the basis of race, and the topic was rarely discussed in the trial.