The pledge to review the case came after the jury ruled that Mr Zimmerman had acted in self-defence when he shot and killed 17-year-old Martin as the teenager walked home from a sweet shop to his father?s house in a gated community in Sanford, near Orlando. Mr Zimmerman had called the police after he spotted Trayvon at night wearing a hoodie, but ignored orders not to confront the teenager, who he believed was ?up to no good?. A fight ensued during which he shot Trayvon dead. Mr Zimmerman, a mortgage underwriter described during the trial as a ?wannabe cop?, smiled briefly after the verdict was read out and was hugged by his mother and father. Trayvon?s parents, Sybrina Fulton and Tracy Martin, who were at the heart of the campaign for justice for their son, chose not to be in court on Saturday evening and spent Sunday morning in church, praying for Trayvon. Police did not initially file charges against Mr Zimmerman. He was arrested 44 days after the shooting following nationwide outrage and the intervention of Rick Scott, the governor of Florida. In the weeks after the shooting, large protests took place in Sandford, Miami, New York and elsewhere, many wearing hoodies like the one Trayvon had on the night he died. They claimed that Mr Zimmerman had racially profiled the unarmed black teenager ? a view shared by Ms Fulton and Mr Martin. The shooting of Trayvon ? and the allegation that police had initially failed to investigate Mr Zimmerman adequately because he was white ? turned the case into one of the most closely watched since the trials of Rodney King and OJ Simpson, unleashing debate across the country over racial profiling, self-defence and equal justice. President Barack Obama raised the stakes still higher by weighing into the controversy, citing his own experience as a black parent. ?When I think about this boy, I think about my own kids,? Mr Obama said ?If I had a son he?d look like Trayvon.? On Sunday night the president said in a White House statement that Trayvon?s death was a tragedy, ?not just for his family, or for any one community, but for America?, but called for calm amid fears that ?passions may be running even higher? following the verdict. ?We are a nation of laws, and a jury has spoken. I now ask every American to respect the call for calm reflection from two parents who lost their young son. And as we do, we should ask ourselves if we?re doing all we can to widen the circle of compassion and understanding in our own communities,? it said. Even as details have emerged about Mr Zimmerman suggesting that the case was less clear-cut than many first presumed, Trayvon supporters continue to question whether ? had the roles and skin colours been reversed ? the result would have been the same. ?This is a slap in the face to those that believe in justice in this country,? said Al Sharpton, the Baptist minister and civil rights activist who help to draw attention to the case after police initially released Mr Zimmerman without charge. ?What this jury has done is establish a precedent that when you are young and fit a certain profile, you can be committing no crime, just bringing some Skittles and iced tea home to your brother, and be killed and someone can claim self-defence. I think that this is an atrocity.? Ms Fulton, who is separated from Mr Martin, wrote on Twitter an hour after the verdict: ?Lord during my darkest hour I lean on you. You are all that I have. At the end of the day, God is still in control. Thank you all for your prayers and support. I will love you forever Trayvon!!! In the name of Jesus!!!? Mr Martin wrote: ? ... even in his death I know my baby proud of the fight we along with all of you put up for him God bless.? Trayvon?s brother, Jahvaris Fulton, wrote: ?Et tu America?? Benjamin Crump, the family?s lawyer, said of the family: ?They are still in disbelief about his death and now they?re in disbelief about this verdict. ?They?re praying and turning to God, a higher authority, to make sense of it all.? Mr Zimmerman has largely lived in hiding since the shooting. His defence attorney Mark O'Mara told Reuters that Zimmerman might want now go to law school ? to be come a prosecutor. He wanted to be a cop for awhile, but he's talked about going to law school, O?Mara said. He has a real interest in the law and ... prosecuting appropriately - not like what he got - is something he's very interested in. I will not be surprised if he ends up in criminal law. His dad was a judge, and he wants to be a prosecutor or a lawyer. Zimmerman's older brother Robert wrote: ?Message from Dad: ?Our whole family is relieved?. Today ... I?m proud to be an American. God Bless America! Thank you for your prayers!? He expressed fears for his brother?s safety. ?He?s going to be looking over his shoulder the rest of his life,? he told CNN. ?There are people that would want to take the law into their own hands ... they will always present a threat to George.? Mr Sharpton and the National Association for the Advancement of Coloured People called on the government to consider prosecuting Mr Zimmerman under federal race relations laws following his acquittal under Florida state law. ?When you look at comments made by young black men who lived in that neighbourhood about how they felt especially targeted by [Zimmerman], there is reason to be concerned that race was a factor in why he targeted young Trayvon,? said Benjamin Jealous, the president of the NAACP. Jesse Jackson, the civil rights leader, said: ?I remain stunned at the decision. The Department of Justice must intervene to take this to another level.? Members of the dead teenager?s family gave no indication whether they supported calls for a federal race case or would be filing a civil suit against Mr Zimmerman for financial damages. ?Both families, lawyers and the police had appealed for calm after the verdict. The call was largely heeded yesterday as supporters of the Martin family held peaceful demonstration across America. The three-week trial of Mr Zimmerman riveted a nation divided over a story that was initially framed in starkly racist terms but grew more nuanced as it emerged that Mr Zimmerman?s mother was Hispanic and he had once taken a black girl to his high-school prom and mentored black children in the community. The trial turned on several key defence witnesses who supported Mr Zimmerman?s claims that he had acted in self-defence and shot Trayvon as an act of last resort after the teenager banged his head repeatedly into the concrete pavement, a claim consistent with his head injuries. Also pivotal was a taped 911 emergency call in which either Mr Zimmerman or Trayvon was heard screaming ?Help! Help!? moments before the fatal shot was fired. Neither side was able to prove who was screaming. In the end the prosecution failed to make its case that Mr Zimmerman had maliciously ?profiled? the black teenager and made racist assumptions when he confronted him that night. ?Fundamentally the problem was that the prosecution didn?t have a witness, they didn?t have someone who could describe who took the first swing, who was the aggressor,? said Jeffrey Toobin, the senior legal analyst for CNN.