SANFORD, Fla. ? George Zimmerman is a relieved man in hiding. Those convinced of his guilt in the death of Trayvon Martin continue to protest his acquittal and other perceived injustices. Now that the trial is over, some people are counseling that it's time to heal and move on. But protests were being held across the country Sunday by people who say they can't move on while they feel that the case and the bigger issues of race and justice that it represents are unresolved. MORE: Zimmerman's business with the court may not be over OBAMA: 'A jury has spoken' in Zimmerman case When a jury of six women found Zimmerman not guilty of murder or manslaughter, the conflicting feelings of all those involved hung in the air of the courtroom like heavy fog. Now the question is what those feelings mean for the future. Last year, people were very angry, and they came to Sanford to protest because George Zimmerman had not been arrested, said Norton Bonaparte, Sanford's city manager. Now he has been arrested. He's been through the trial and a jury has found him not guilty. That's the American judicial system, and from that we move forward. This central Florida city of more than 50,000 people drew little national attention before Feb. 26, 2012 ? the night Hispanic neighborhood watch volunteer George Zimmerman encountered black teen Trayvon Martin on a quiet street in a gated community here, some 20 miles northeast of Orlando. Minutes later, Trayvon, 17, was dead of a gunshot wound. Months later, Sanford and Zimmerman, 29, remained the focus of national protests. Saturday night and Sunday, there were more demonstrators in Sanford. Most condemned the verdict. Some praised it. In a statement issued Sunday, President Obama called Trayvon's death a tragedy for America but made no mention of race. I know this case has elicited strong passions. And in the wake of the verdict, I know those passions may be running even higher, Obama said. But we are a nation of laws, and a jury has spoken. He called for calm and national introspection. We should ask ourselves if we're doing all we can to widen the circle of compassion and understanding in our own communities, he said. We should ask ourselves if we're doing all we can to stem the tide of gun violence that claims too many lives across this country on a daily basis. We should ask ourselves, as individuals and as a society, how we can prevent future tragedies like this. Hours after the verdict, Fort Mellon Park, the scene of protests calling for Zimmerman's arrest, was quiet. In Goldsboro, a black neighborhood in Sanford, people stood outside well past midnight discussing what to do next. Francis OIiver, curator of the Goldsboro Museum, had begun pushing for Trayvon's killer to be arrested the day after the shooting. In her office, she has photos of other young black men killed in Sanford. She plans to talk to young men about their safety and the danger of being profiled. We can't depend on the system to protect our children, she said. When they found Zimmerman not guilty, they also found profiling of black boys not guilty, stereotyping of young black men not guilty, stand your ground against young black men not guilty. We as mothers are going to have to tell them you put on a hoodie, you could be profiled. Oliver noted that citizen action has had results in Sanford: Zimmerman was arrested. Police Chief Bill Lee was fired. The new chief, Cecil Smith, has begun sending officers to meet people in their neighborhoods to build trust. She hopes people will continue to attend community meetings and hold leaders accountable. For some area pastors, preaching love and helping people deal with their feelings is important. The Rev. Venitta Robinson delivered a sermon about God's love at Allen Chapel AME Church in Sanford shortly after her pastor, the Rev. Valarie Houston, spoke about being hurt by the verdict. The service helped you not to hold onto the anguish, not to hold onto the hurt and the pain, Robinson said. You were able to release it knowing that God is in control of everything. We are hoping to continue the dialogue, continue the conversation and continue the direct action against the system that killed Trayvon Martin, said Dave Schneider, an organizer with the Coalition for Justice for Trayvon Martin. In the long run, oppressed communities in the United States need to look at different models of community organizing to build a 21st century civil rights movement. On Sunday, outside the courthouse where the verdict was read, about 25 demonstrators held signs in support of Trayvon. Alex Landau, 24, of Denver, was one of them. Landau, who said he is a social justice advocate, public speaker and poet, said he and others will continue rallies across the country to help people remember Trayvon and what Landau said was a miscarriage of justice in the teen's death. The way we prevent future occurrences is raising awareness and getting people more involved, he said. There is too much voice and there's not enough action. Trayvon may become a modern touchstone for lingering racial discord in the United States nearly 50 years after Martin Luther King delivered his I Have a Dream speech at the March on Washington on Aug. 28, 1963. Benjamin Crump, a lawyer for Trayvon's family, said the teen's death and his killer's acquittal will go down in history with the assassination in 1963 of civil rights leader Medgar Evers, whose murder trial twice ended in a hung jury, and the murder of 14-year-old Emmett Till, who was killed in 1955 after reportedly whistling at a white woman, as symbols for the fight for equal justice for all. We've gone back to a time that we had hoped that our country had gotten past, said Judith Browne Dianis, co-director of the Advancement Project, a non-profit organization that advocates for racial equity. Stanford University professor Claybourne Carson, who is teaching a course this summer on Martin Luther King, said the case has nothing to do with civil rights. It is an important case in terms of how we view the right of citizens to police their neighborhoods in a way that can lead to wrongful death but less clear is whether we should be seeing the verdict as a major setback in race relations, Carson said. Zimmerman's acquittal is a wake-up call for African-American youth, said Roslyn Brock, chairwoman of the NAACP, who said she spent Sunday trying to calm the fear and anxieties and the hurt and the pain of more than 1,000 black youth gathered in Orlando for the organization's annual convention. It's a pivotal moment in the life of this generation, she said. They can't process how can you be walking home from a store and end up dead, and how six women, five mothers, can't find it within the justice system to see that a life has been taken, that Trayvon Martin's life had value. Trayvon's death exposed the entrenched nature of racial prejudice in our country and reflects the unfinished struggle to fulfill this country's promise of racial equality and justice for all, said Sherrilyn Ifill, president of the NAACP Legal Defense and Educational Fund. Ifill said she hoped this painful episode will inspire a much-needed and long-overdue dialogue around race and criminal justice in America. It may be difficult to predict whether the energy after the trial will be sustained beyond the outrage, whether it becomes an inspirational moment for a generation of African American young people. The Zimmerman verdict came just weeks after the Supreme Court struck down a key provision of the Voting Rights Act. In a recent interview with USA TODAY, the Rev. Bernice King, Martin Luther King's daughter and head of the King Center in Atlanta, said that ruling presents a critical moment ? and an opportunity ? for young African Americans. This is the generation that is dangerously close to not making their contribution to the freedom struggle, she said. In Atlanta, protesters who would argue they are ready to contribute said the message of the verdict was simple: Young African Americans are not safe in their native land. It reconfirms everything I already knew, but we wanted to think that there was at least a little bit of an improvement, said Shan Holder, 22. But when we saw 'not guilty' come across the television screen, we were like, 'Really? Really?' This is a social moment when we have the responsibility and the opportunity to take a stand and make an impact. We want to direct this energy. We want to impact legislation. We don't want this to just stop, said Brandon Lorencio Connor, 22. We're getting people in other states to continue organizing and working. We want to mobilize people everywhere, so it's not just here. Andrew Kimble, 21, said, The 'Where do we go from here' question ? that's Dr. King's question, he said. I'm not sure. What we're doing now is raising awareness. We need people to ask that question. We don't need emotional reaction, we want intelligent and logical reactions. He paused and looked around the parking lot. You know what the most disturbing thing is about this rally? There aren't any white people here. This is an issue that we all need to pay attention to, and all need to be concerned about. Copeland reported from Atlanta. Contributing: Mary Beth Marklein in McLean, Va., and Donna Leinwand Leger in Washington, D.C..