By Jill Reilly Published: 03:15 EST, 1 July 2013 | Updated: 15:52 EST, 1 July 2013 A Dutch journalist has been raped by several men in Cairo's Tahrir Square as millions of protestors took to the streets to demand President Mohammed Morsi to step down. The news of the attack came as the Egyptian army issued a 48-hour deadline for the deadly clashes to be resolved - so far eight people have been killed and hundreds injured. The woman was allegedly raped 'by men who dub themselves revolutionists,' according to Egypt 25?s reporter Dina Zakaria.? The horrifying rape is reminiscent of the violence at Tahrir Square in 2011 when CBS foreign correspondent Lara Logan was beaten and sexually assaulted by a 200-strong mob. According to Ynetnews , the state hospital issued a statement saying the women was admitted after being raped by five men several days ago. Scroll down for video The six-storey Cairo building was set alight overnight, and this morning looters ransacked its contents and removed the Brotherhood's sign - it is thought eight people have been killed outside in the last 24 hours. Egyptian security forces arrested 15 armed bodyguards of the number two in the ruling Muslim Brotherhood, Khairat El-Shater, on Monday after an exchange of fire, security sources said. And the headquarters of the moderate Egyptian Islamist party Wasat was set on fire today, in an expansion of attacks on Islamist organisations across the country. Unidentified assailants threw petrol bombs at the building. It followed overnight clashes between armed Morsi supporters barricaded inside the building and young protesters pelting it with firebombs and rocks. The unrest has led the U.S. State Department and UK Foreign and Commonwealth Office have urged citizens to cancel travel plans to or within Egypt. An aide to Morsi said he was 'encouraged' that events had unfolded mostly peacefully: 'This is another day of democratic practice that we all cherish,' he said in a statement. He accused the opposition of being vague in its demands and outlined three ways forward: first, parliamentary elections, which he called 'the most obvious'; second, national dialogue, which he said opponents had repeatedly rejected; and third, early presidential elections, as demanded by protesters. But that, he said, 'simply destroys our democracy'. The massive protests showed that the ruling Muslim Brotherhood has not only alienated liberals and secularists by seeking to entrench Islamic rule but has also angered millions of ordinary Egyptians with economic mismanagement. Tourism and investment have dried up, inflation is rampant and fuel supplies are running short, with power cuts lengthening in the summer heat. Dozens of militants attacked the Brotherhood's national headquarters in Cairo with shotguns, petrol bombs and rocks, setting it on fire, and targeted offices of its political party across the country. There was no sign of police or fire service protection for the Brotherhood's head office, where witnesses said guards inside the building fired on the attackers. Two people died and 11 were injured in that clash, hospital sources said. Protest organisers called on Egyptians to keep occupying central squares across the country in a campaign of peaceful civil disobedience until Mursi quits. Tens of thousands of demonstrators stayed in Tahrir Square long after midnight, appearing to heed the call for a sit-in. But as the working day began, only hundreds remained. If protesters maintain their camps, however, and return in the evenings, the spotlight will be on the army. It displayed its neutrality on Sunday, making goodwill gestures to the protesters after urging feuding politicians last week to cooperate to solve the nation's problems. Some uniformed policemen marched among protesters in Cairo and Alexandria, chanting 'the police and the people are one', and several senior officers addressed the Tahrir Square crowd. That cast doubt on whether Morsi could rely on the security forces to clear the streets if he gave the order. Diplomats said the army, which ruled uneasily during the transition from Mubarak's fall to Morsi's election, had signalled it was deeply reluctant to step in again, unless violence got out of hand and national security was at stake. While the main demonstrations were peaceful and festive in atmosphere, seven people were shot dead in clashes in the central cities of Assiut, Beni Suef and Fayoum and outside the Brotherhood's Cairo headquarters. The Health Ministry said 613 people were wounded in street fighting around the country. The opposition National Salvation Front coalition of liberal, secular and left-wing parties declared victory, saying the masses had 'confirmed the downfall of the regime of Mohamed Morsi and the Muslim Brotherhood'. Opposition leaders, who have seen previous protest waves fizzle after a few days in December and January, were to meet on Monday afternoon to plot their next move. Influential Qatar-based Muslim cleric Sheikh Youssef Qaradawi, visiting Cairo, appealed to fellow Egyptians to show more patience with Morsi, while saying the president had made errors. 'How long has Mohamed Morsi ruled? One year,' Qaradawi said in a television address. 'Is one year enough to solve the problems of 60 years? That's impossible ... We must give the man a chance and help him. Everyone must cooperate.' The United States and the European Union have urged Morsi to share power with the opposition, saying only a national consensus can help Egypt overcome a severe economic crisis and build democratic institutions. Morsi and his Brotherhood supporters have so far rebuffed such pressure, arguing that he has democratic legitimacy and the opposition is merely seeking to achieve on the streets what it failed to secure at the ballot box.