CAIRO -- Egyptians welcomed a new president Thursday while military leaders pressed their crackdown on ousted president Mohammed Morsi's Muslim Brotherhood party. And questions remained about where the country goes from here. Most stores opened, sidewalk cafes hummed with chatter and all was almost business as usual in the crowded capital. Thousands gathered to salute the new president, Adly Mansour, in iconic Tahrir Square. And the Egyptian stock market liked what it saw, rising more than 7% in one day. Still, some people here are not sure whether four days of massive protests resulted in a young democracy being preserved by the military, or democracy being lost in a military coup. I'm confused, said resident Mohamed Abu Khair, 36. I don't know whether to be happy or sad. Mohammed Morsi was a good person. He did not find support from anyone, and Egypt did not give him a chance. But local jewelry shop owner Essam Abdel Karim, 60, is convinced that the events of Thursday are a step toward getting another president who cares about all Egyptians. I did not go onto the streets before this week's uprising but I did this time because I did not like the way Morsi ruled Egypt. Mansour, chief of Egypt's High Constitutional Court, was sworn in as the nation's interim president under a transitional plan devised by military leaders. It's Mansour's job until an election is held on a date yet to be set. In his first remarks as president, Mansour, 67, praised the massive street demonstrations that led to Morsi's ouster after just a year in office. He also hailed the youth behind the protests that began on June 30, saying they embodied the nation's conscience, its ambitions and hopes. The most glorious thing about June 30 is that it brought together everyone without discrimination or division, he said. I offer my greetings to the revolutionary people of Egypt. But the arrest of Morsi -- Egypt's first democratically elected president -- and other Brotherhood leaders by the military has raised concerns about the military, said Firas Abi Ali, a Middle East and North Africa analyst at IHS in London. After autocrat President Hosni Mubarak was ousted in 2011, a small group of generals ruled for more than a year before Morsi's election. After taking office in June 2012, Morsi moved to curtail the power of the military with deep public approval. His popularity soon waned, however, as he granted himself extended powers and pressed for Islamic law. That was seen as an extremely worrying sign of his disregard for the rule of law and fear that he would hoard power for himself, said Shashank Joshi, research fellow at the Royal United Services Institute in London. The result was waves of violent protests in November and discontent that simmered until June. The one-year anniversary of his administration drew millions of protesters calling for Morsi's resignation and new elections. STORY: Both sides critical of U.S. STORY: Egyptians celebrate in the streets, but instability remains Morsi's administration ended up in a situation where the economy was rapidly deteriorating and their relationship with all the political actors was terrible, said Abi. Morsi's backers are crying military coup. Brotherhood spokesman Gehad El-Haddad said the events signify old regime retaliation. We denounce repressive practices of the police state which have already included killings, arrests, restrictions on freedom of the media, the Brotherhood said in a statement. On Thursday, thousands of their supporters staged rallies in cities including Damanhour and in Beni Suef, chanting against what they called a military takeover. Cairo remained relatively quiet, with security stepped up in only a few areas. President Obama expressed concern over Morsi's overthrow. Protests have billowed for days, with both sides blaming the U.S. -- either for failing to more strongly support an elected president or for condoning his power grab. The State Department has ordered all non-essential U.S. diplomats and the families of all American embassy personnel to leave Egypt. Mansour has pledged inclusiveness, saying that the Brotherhood and their supporters are also part of Egypt and welcome to participate in the building of the country, according to Egyptian media. Analysts believe Islamists are here to stay in spite of this setback. They still have a strong grass-roots organization and there are still many pro-Morsi parts of Egypt who were protesting in large numbers, said Joshi. It was these people who the coup was intended to neutralize and who will feel very embittered. Right now there are too many unknowns, he added, of what is expected for Egypt's democratic development. While some analysts say the military will control the new president, others said the military was not eager to be involved in the day-to-day politics of Egypt. They know what a thankless task it is, said Abi Ali of IHS. I think the military is doing its best not to present itself as governing directly but to put forward a civilian face. The objective is not to present this as a military takeover of power. Still, despite the uncertainty now, many Egyptians said they were happy to see Morsi gone. The newspapers reflected this sentiment on their front pages Thursday: Welcome back, Egypt, wrote Al-Masry Al-Youm. Even state newspapers that had backed Morsi were jubilant: Egypt returns to the arms of Egyptians, wrote Al-Akhbar. Contributing: Catherine Featherston and Louise Osborne from Berlin, and John Bacon in McLean, Va.