The institution also condemned ?criminal gangs? for attacking mosques and called on the opposition to accept the president?s offer of a national dialogue, made in a televised address on Wednesday evening. The renewed upheaval follows increased discontent from Mr Morsi?s liberal and secular opponents, who accuse the president and his Muslim Brotherhood organisation of hijacking the 2011 revolution that toppled the dictator Hosni Mubarak. Opponents of Egypt's Islamist President Mohammed Morsi protest outside the ministry of defense in Cairo. Photo: KHALIL HAMRA/AP Opposition forces have vowed to stage a huge rally in Cairo?s Tahrir Square on Sunday ? a year to the day since Mr Morsi?s election - which they vow will be a precursor for driving him from office. Organisers claim to have collected a 15 million signature petition calling for the end of Mr Morsi?s rule. In Cairo on Friday, several thousands of the president?s supporters gathered outside the main mosque in the Nasr district while demonstrations against Mr Morsi were staged in Tahrir Square, the crucible of the 2011 rebellion. Pro-government protesters in Nasr gathered under the banner ?legitimacy is a red line? to reinforce the message that Mr Morsi was democratically elected in a poll widely seen as free and fair. Mohamed Goda, a pro-Morsi demonstrator, said the Muslim Brotherhood would go all-out to protect the president. ?The Brotherhood will protect the legitimacy of Dr Morsi. If the others act irresponsibly, we are ready to protect our president,? he said. ?We are building our state here. If Morsi falls, what else can follow but a new president every month?? Carrying Egyptian flags and red cards, anti-Morsi protesters in Tahrir Square accused the president of squandering his electoral legitimacy by ruling solely for his Islamist support base. The polarised atmosphere has fuelled fears that Sunday?s mass demonstration will end in violence. ?The situation is very dangerous now,? said Dr Khalil al-Anani, a senior fellow at the Middle East Institute in Washington. ?It?s a game of time: both the Muslim Brotherhood and its opponents are counting on their ability to maintain coherence and stay in the street. But as long as they concentrate on the streets and not on politics, you can expect more blood and confrontation.? Growing opposition to Mr Morsi has been fed by political instability, constitutional battles and a badly sliding economy. Speculation has grown that the army ? which has stayed on the political sidelines since Mr Morsi?s election ? could intervene if street unrest gets out of hand. Senior military figures have said they are ready to prevent the country from going down the ?dark tunnel? of internal conflict. Tanks were deployed in several cities on Wednesday to secure state institutions as the protests grew. An atmosphere of corrosive anxiety has gripped the capital in recent days. Thousands have been affected by food and fuel shortages over the past few days as Egyptians stockpile supplies ahead of Sunday?s demonstrations.