00.39 UN Secretary General Ban Ki-moon has warned Egyptians against adopting retribution tactics in the country's worsening political crisis and called on security forces to prevent clashes. For Egypt's troubles to be settled peacefully there is no place for retribution or for the exclusion of any major party or community, Mr Ban was quoted as saying by UN spokesman Farhan Haq. Mr Ban is following with growing concern the latest developments in the unfolding crisis in Egypt including detentions and worrying reports about restrictions on free speech and deadly clashes between protesters. There are horrifying reports of sexual violence, Mr Ban was quoted as saying. He called on Egyptian security forces to protect demonstrators and prevent violent clashes, and said demonstrations should be exclusively by peaceful means. 00.28 A coalition of Islamist groups including Mohamed Morsi's Muslim Brotherhood has vowed further peaceful protests after a day of deadly clashes across the country following the president's overthrow by the military. The masses will continue their civilised protests and peaceful sit ins in Cairo until the military coup is reversed and the legitimate president is restored, the coalition said in a statement. 23.53 Here is some more detail on the deaths in Alexandria from AP: Emergency services official Amr Salama said the 12 died when hundreds of Islamists descended on a rally by opponents of ousted President Mohammed Morsi in the city, opening fire with guns. He says clashes erupted, and police joined on the side of the Morsi opponents. Mr Salama said he saw one man die when he went to the roof of a building, raised an Egyptian flag and shouted insults against Mr Morsi. Backers of Mr Morsi went to the roof and stabbed him and threw him off the building. 23.34 Twelve people have been killed in clashes in the Egyptian city of Alexandria, taking the nationwide death toll to 29. Amr Nasr, head of emergency services in the city told the state news agency MENA that around 200 were injured. Most of the fatalities were from gunshot wounds. 23.33 The state news agency is reporting that police have arrested the Muslim Brotherhood?s deputy leader Khairat el-Shater. Security sources said Mr Shater, a wealthy businessman seen as the movement's main political strategist, was taken into custody on suspicion of incitement to violence. He was arrested at his apartment in Cairo. Among the Brotherhood's best known public figures, Mr Shater was the latest of several of its leaders to be taken in since President Mohamed Morsi was overthrown by the army. 22.43 After intervening in clashes near Tahrir Square, in which two people were killed, the military has denied it is supporting either group. We are not taking sides. Our mission is to secure the lives of protesters, military spokesman Colonel Ahmed Ali told AFP. The military is going to intervene to separate the protesters. 22.33 CNN's Mitra Mobasherat tweeted that the army had confiscated a camera from one of their journalists. The Egyptian military have stopped and taken @bencnn 's camera while he was reporting on Oct 6th bridge 22.30 There are several reports emerging of the army interfering with journalists covering the unrest in Egypt. BBC correspondent Mohamed Gade was apparently detained by the military for several hours. Rana Kazbak tweeted: got a message from BBC correspondant in #Cairo @MohamedGade n his crew r held at a detention centre in NasrCity since 4pm 22.19 Armed supporters of Mr Morsi have stormed North Sinai's provincial headquarters in the town of El-Arish after a gunfight and raised the black banner of Islamist militants, according to AFP. Armed protesters entered the building after it was finally abandoned by security forces, as supporters of the president overthrown on Wednesday in a military coup also clashed with opponents elsewhere in the country. 21.56 State television has reported that the death toll from the clashes has risen to 17, according to the health ministry. Clashes at the October 6 bridge AP 21.52 Egypt's army has denied a report that curfews had been imposed in two North Sinai towns on the border with Israel and the Gaza Strip. Nothing has been issued, an army spokesman told Reuters when asked about the report on state television that a curfew had been imposed in the towns of Sheikh Zuweid and Rafah. An Egyptian military convoy arrives at the site of the clashes on the 6th October Bridge AP 21.25 Our correspondent Robert Tait reports: The 6th October Bridge and the area below have a post-battleground look - rocks and stones strewn everywhere from earlier clashes. He says of the army deployment: Raucous cheers for a convoy of army tanks as it crossed a flyover bridge off Tahrir Square. Total contrast to the pro-Morsi gathering in Nasr City, where overhead helicopters and fighter jets drew loud whistles and jeers. Morsi supporters gather next to the headquarters of the Republican Guards EPA 21.32 Our correspondent Richard Spencer reports that the pro-Morsi protesters have now retreated from the area of the October 6 bridge and appear to be returning to the main Muslim Brotherhood rally at the Rabaa al-Adawiya mosque. Anti-Morsi protesters are in victorious mood after clearing the area around the nearby state television station. F**k you Morsi! demonstrators are chanting, as well as: When you come back, it will be nighttime for you. 21.14 Medical sources cited by Reuters have reported the deaths of five Egyptian police officers in separate shootings in the North Sinai town of El Arish. The killings came after Islamist gunmen killed a soldier in a separate attack in a nearby town last night. State TV says that curfews have been imposed in two North Sinai towns bordering Israel and the Gaza Strip, Sheikh Zuweid and Rafah. 21.09 State television reports that the clashes near Tahrir Square have left at least two people dead and around 70 others injured. The Health Ministry has updated the total death toll to 10, with 210 injured. Watch our video from the Cairo clashes: 21.07 Our correspondent Richard Spencer reports that armoured personnel carriers have just rolled over the October 6 bridge and an overpass north of Tahrir Square, met with cheers from anti-Morsi protesters have beaten back pro-Morsi demonstrators from the square's entrances. The scene is now calming as anti-Morsi protesters and troops secure the area between Tahrir Square and the Ramses Hilton. One recovering anti-Morsi demonstrator, 37-year-old Hossam Sami Ali, told our correspondent: Morsi and a whole bunch of sheep tried to divide the Egyptian people. They attacked immediately after Muslim Brotherhood leader Mohammed Badie spoke and incited them. They are all related to America and to Israel, but they wil enter over our dead bodies. Tanks roll towards Tahrir Square AP 20.50 This still image taken from Sky News footage shows protesters clashing at the October 6 bridge in Cairo. 20.39 Our correspondent Richard Spencer is at the scene of the clashes at the October 6 bridge. He reports that the army is not attempting to curb the fighting, which at present appears limited to small groups. There is however a large army presence on the nearby Qasr el-Nil bridge, with forces making no apparent effort to interfere at the October 6 flashpoint. Our correspondent reports that the reason for this strategy is unclear, but may be an attempt to keep Islamists engaged and away from the Qasr el-Nil bridge, which provides a direct route into Tahrir Square. Anti-Morsi protesters remain camped out in Tahrir Square 20.22 This video, which has been circulating widely on Twitter in recent hours, appears to show a protester being shot in today's clashes. Please note that the Daily Telegraph has not confirmed its authenticity, and that readers may find the images disturbing. 20.03 Security sources cited by Reuters say that a hardline Islamist presidential candidate has been arrested and accused of inciting violence. Salafi presidential candidate Hazen Salah Abu Ismail - who was disqualified from the presidential race won by Mr Morsi after questions over his mother's nationality - was reportedly arrested at his home. 20.00 Running clashes have broken out near Tahrir Square, with the gunfire heard as the two sides bombard each other with rocks at the October 6 bridge, according to AFP correspondents in the area. Ambulances are taking the injured away from the scene. 19.48 Khaled el-Khatib, a health ministry official, said that four people have been killed in Cairo and two elsewhere, with 180 wounded, according to the Associated Press. 19.43 Egypt's Health Ministry has reported that 6 people have been killed in clashes nationwide. 19.38 Our correspondent Robert Tait has been with Muslim Brotherhood supporters and talked to one who'd been shot and injured. Here's a taste of what Hassan Ahmed told him: ?I saw two people dying in front of my eyes and many others lying injured. The shooting was done by a lot of guards. They were definitely military people. They were shooting at everyone. Meanwhile, according to AP, the White House has been briefing on how it tried to push for a rapid return to a democratically elected civilian government in calls to leaders of Egypt's neighbours. Secretary of State John Kerry, Defense Secretary Chuck Hagel and national security adviser Susan Rice were among those who briefed President Barack Obama on their calls to counterparts in Egypt, Israel, Turkey and other U.S. partners in the region, AP says. 19.30 The United States' top military officer has spoken to his Egyptian counterpart, a spokesman has said. General Martin Dempsey spoke to Lieutenant General Sedki Sobhi, chief of staff of the Egyptian armed forces. No details of the conversation have been given. 19.26 Egypt's chief prosecutor has freed two senior leaders of the Muslim Brotherhood after they were detained in a clampdown on the Islamist movement, according to the state news agency. Saad al-Katatni, who heads the Freedom and Justice Party - the Brotherhood's political wing - and Brotherhood deputy chief Rashad Bayoumi, were released after two days in detention.