Egyptian President Mohammed Morsi?s rocky one-year reign ended Wednesday in a swift military coup as fireworks exploded over Cairo and millions cheered his ouster. 	The Third of July celebration began as word spread through Tahrir Square that the army had efficiently enforced its promise to depose Egypt?s first democratically elected leader. 	?Long live Egypt!? came the joyous shouts from ecstatic anti-Morsi protesters, as Egyptian flags waved in the Cairo night. ?God is great!? 	Morsi?s political demise came after four raucous days of demonstrations demanding his resignation ? and just hours after the end of the army?s deadline that gave the Islamist president 48 hours to appease his opponents. 	Army troops and tanks were dispatched across Cairo as the president?s truncated term reached its abrupt end, with the armed forces controlling bridges spanning the Nile. And Morsi was under house arrest, his Muslim Brotherhood movement said. 	The Egyptian military immediately suspended the country?s Islamic-oriented constitution and announced an upcoming presidential election to find a replacement. 	President Obama responded to the power play by urging the military to hand control back to civilian leaders and said the United States would reassess its $1.5 billion a year in foreign aid to Egypt. 	He said he was ?deeply concerned? by the takeover but stopped short of calling Morsi?s dramatic ouster a coup and said the U.S. wasn?t taking sides. 	?I now call on the Egyptian military to move quickly and responsibly to return full authority back to a democratically elected civilian government as soon as possible,? Obama said in a statement. 	?The voices of all those who have protested peacefully must be heard, including those who welcomed today?s developments, and those who have supported President Morsi,? Obama added. 	Morsi, via the official presidential Twitter account, had condemned the end of his administration as ?a full coup categorically rejected by all the free men of our nation.? 	Defense Minister Abdel Fattah el-Sissi, in a nationally televised announcement, confirmed the change as delirious anti-Morsi forces filled the streets of Cairo and other cities. 	The embattled president had responded to the military?s 48-hour demand with a vow Tuesday night to keep his position. 	?The president?s speech last night failed to meet and confirm with the demands? of the Egyptian people, Sissi said in his announcement. 	Military officials met with other political and religious leaders to create a procedure for replacing Morsi before informing him that his administration was done. 	The coalition agreed on a process ?that includes initial steps that realize the building of a strong and coherent Egyptian society that doesn?t exclude any of its sons,? Sissi declared. 	The defense minister was flanked by Nobel Peace Prize winner Mohamed ElBaradei and the nation?s preeminent Muslim and Christian clerics. 	The military said its aim was to enforce the will of the people for a new government, rather than to seize control itself. 	Troops and tanks descended on the presidential palace in the Egyptian capital, and a spokesman for the Muslim Brotherhood said the deposed president and 12 aides were under house arrest. 	?It is a full-fledged coup and it is turning into a bloody one, too. They are arresting everybody,? the spokesman, Gehad el-Haddad, told The Associated Press.? 	The temporary president, pending new elections, will be Adly Mansour, the head of the Supreme Constitutional Court. No timetable for a vote was laid out by Sissi. 	Critics complained that Morsi couldn?t turn around his nation?s tanking economy ? and that his rule reflected too much influence from the hard-line Brotherhood, the top Islamic group in Egypt. 	The change in leadership could lead to an immediate economic blow. 	Sen. Patrick Leahy D-Vt. noted that U.S. law requires termination of economic and military aid to Egypt in the event of a coup. 	Morsi became Egypt?s first democratically elected president in June 2012, besting a dozen other candidates to win a runoff election with 51.7% of the vote. 	There were concerns that Morsi?s tens of thousands of Islamic supporters would make good on their promise to fight to the end for the Egyptian leader. 	Sissi cautioned that the military would deal ?decisively? with violence. In an effort to keep the peace, the military shut down the Brotherhood?s television station, and security forces stormed the studio of Al Jazeera Misr Mubasher, a branch of Al Jazeera TV that has maintained a generally pro-Morsi line, and detained the staffers. 	Egyptian officials promised increased protection for Americans in the country. 	The United States nevertheless ordered all nonessential diplomats and the families of all embassy personnel to leave Egypt amid the leadership change. 	Morsi?s ouster marks the latest chapter in the political upheaval that started 2 1/2 years ago, leading to the end of predecessor Hosni Mubarak?s regime. 	With News Wire Services