Scientifically speaking, Prince William and his wife Kate could have come up with a better name for their newborn, suggests a respected U.S. psychologist who's studied how people react to different names. 	 I definitely would not have selected the name George, said Albert Mehrabian of the University of California in Los Angeles UCLA , the author of several books on names and other forms of non-verbal communication. 	Based on Mehrabian's research into how names influence the way people treat and think about others, George has a overall attractiveness percentile score of 36 -- compared, for instance, with James, which scores a perfect 100. 	Broken down into categories, George did OK in terms of conveying an impression of being ethical and caring, but it was weaker in terms of projecting masculinity, success and fun. 	Mehrabian, professor emeritus of psychology at UCLA, told AFP by email Wednesday he personally doesn't think George was a stuffy name, and he believed the British royal family had its own good reasons for going with it. 	The child's great-great-grandfather was King George VI, who father was King George V. 	 I only wish, for the little boy's sake, they could have picked a far more attractive name, he said. 	 There are plenty of excellent names with fabulous connotations that would have been fitting nicely to a prince of the United Kingdom. 	For generations George was a popular name in the United States, where George Washington is celebrated as the father of our nation for leading the War of Independence against Britain, then ruled by King George III. 	Since the 1940s, however, George has slipped out of American favor, falling to 166th place on the US Social Security Administration's latest annual list of the most popular baby names. 	The most popular names in 2012 were Jacob, Mason and Ethan for boys, and Sophia, Emma and Isabella for girls. 	Scholarly research notwithstanding, George was the most popular name of the day Wednesday among visitors to Nameberry.com. 	 We actually love George and see it as a classic that's due for a comeback, and the royal baby should push it toward the top in a big way, said Pam Satran, a co-founder of the baby-naming website. 	 George is actually back as a baby name in England, where it's in the top 100, she told AFP by email. 	 But it has been slower to catch on in the United States, where it is more closely identified with the middle-aged George Bush than with the dashing George Clooney or a procession of King Georges.