By Rebecca English, Royal Correspondent and Martin Robinson Published: 04:05 EST, 24 July 2013 | Updated: 11:42 EST, 24 July 2013 Baby Cambridge was taken to see his grandparents on his first afternoon out today as it was revealed the Queen and Prince Harry have now met the royal baby for the first time. Kate and William smiled broadly and waved from their car as they were driven away from Kensington Palace by security, where they had spent their first night together as a family. Both the Duke and Duchess looked happy and fresh-faced, with William sat in the front passenger seat and Kate in the back with their child in his baby seat. They left their west London home shortly after the Queen had visited her new great-grandson and potentially discussed names with the parents, as the guessing game over what he will be called continues. Kensington Palace officials would not confirm where the young family were going this afternoon, but their black Land Rover was later seen arriving at grandparents Carole and Michael Middleton's mansion in Bucklebury, Berkshire. Her Majesty, who will travel to Balmoral for her summer holiday on Friday, spent 30 minutes with the Duke, Duchess and Baby Cambridge from 11am. It has also emerged that Prince Harry, who is said to be thrilled to have become an uncle, may have been there last night after the trio left hospital, having raced back to London from Wattisham airbase in Suffolk where he is on duty with the RAF. It is understood that James Middleton and Pippa Middleton were also at Kensington Palace yesterday evening. Prince Philip has yet to meet the child, but he and his wife will be heading to Balmoral on Friday and it is understood that Kate and William may take the new prince there for a long weekend this summer. Scroll down for videos Their were clear hints that Kate and William were off to Bucklebury after heightened police presence was in evidence around the ?5million home of the Duchess of Cambridge's parents this morning. Yellow police cones with a 'no waiting' symbols lined both sides of the road every few yards for around a mile either side of majestic Bucklebury Manor, West Berkshire. A bright yellow sign stuck to a road sign confirmed an 'emergency' three-week bylaw prohibited any form of waiting in the road while a pair of police officers stood at both entrances to the Grade II listed Georgian pile, while marked police cars swept past the entrances every couple of minutes. A large police horsebox marked 'Mounted section' arrived in the picturesque village at lunchtime and a small marquee surrounded by marked and unmarked police cars was visible in a nearby field. It was not possible to tell whether the Duchess' parents or her siblings, Pippa and James, were at the vast estate, set in 18 acres of land and boasting its own tennis court, swimming pool and library. Last night The Queen told guests at a Buckingham Palace reception she was 'thrilled' at the birth of her great-grandson, and today William and Kate may have discussed potential names with her. On the eve of the baby's birth, the Queen famously told a ten-year-old schoolgirl that she didn't mind if it was a boy or a girl, adding: 'I would very much like it to arrive. I?m going on holiday'. Dressed in a turquoise floral outfit she looked relaxed and happy as she left, having travelled the short distance from Buckingham Palace without the Duke of Edinburgh, who is still convalescing at Windsor Castle following exploratory abdominal surgery last month. Baby Cambridge has spent his first night at home after a dramatic evening where the waiting world had its first wonderful glimpse of him. Prince William said yesterday they were 'still working on a name' for the future king, reportedly because he and Kate wanted to see their baby?s 'little face' and get to know him before choosing one. After he left hospital at around 7pm his aunt Pippa and brother James were waiting for him at Kensington Palace for a cuddle as the little boy is introduced to his family.. The Cambridges were safely tucked away in a small cottage in Kensington Palace's grounds today, with the only sign of movement this morning being a royal protection officer walking their dog Ludo nearby. The couple then returned to the hospital as William held his son, swaddled in a blanket, before bringing him out again in his car seat. The Prince was heard to affectionately call Kate 'Poppet' as he ushered her back to the Lindo Wing. William then visibly breathed a sigh of relief when he successfully installed his baby on the back seat with his wife, before driving them home to Kensington Palace cheered on by a huge crowd. ? As soon as William returns to work following his two weeks? statutory paternity leave, Kate plans to depart the palace for her parents? mansion in Berkshire. She will reside there - on and off -? for the next six weeks, while her husband completes his present tour of duty with the RAF in Anglesey, North Wales. The prince will finish his posting as a Search and Rescue pilot at RAF Valley in early September, relocating to London while waiting for his next assignment, meaning the couple can enjoy some quality time together as a new family. Within weeks ? by October at the latest - it is hoped that they will finally be able to move into their new official London residence, Apartment 1A at Kensington Palace Apartment 1A is actually a spacious four-storey, 20-room property with its own large south-facing walled garden, which takes up half the Clock Tower wing originally designed by Sir Christopher Wren for King William and Queen Mary. Their child is now third in the line of succession, displacing Prince Harry to fourth and the Duke of York to fifth, although he may not become sovereign for half a century or more. Warm welcome: The ecstatic crowd sang 'Congratulations' as the new parents stepped out of the London hospital Soon afterwards Kensington Palace confirmed: 'Her Royal Highness The Duchess of Cambridge will be discharged this evening. 'The Duke and Duchess of Cambridge and their son will travel home to Kensington Palace. 'Their Royal Highnesses would like to reiterate their thanks to the hospital for the care and treatment they have all received'. Earlier doting grandmother Carole Middleton described her grandson, the future king, as 'absolutely beautiful' after she and her husband visited him. The Duchess of Cambridge's parents said their first grandchild is 'absolutely beautiful' and his parents are coping 'fabulously'. The Middletons spent just over an hour with their daughter Kate and son-in-law William, and a smiling Mrs Middleton, speaking about mother and baby, said: 'They are both doing really well, and we are so thrilled.' When asked by the world's media, who have been camped outside for nearly three weeks, how the proud parents were doing, she replied: 'Fabulously.' Asked what the first cuddle with her grandson was like, Mrs Middleton, who had been ushered forward by her husband to speak to the press, said: 'Amazing, It's all coming back.' Strapped in: The newborn baby was strapped into a car seat as Prince William carried him out of the hospital and into the awaiting car Kate looked incredibly fresh despite going into labour and giving birth less than two days ago Parenthood: The proud parents drive away from the public spotlight - for the time being, at least - making their way back to Prince George's new home, Kensington Palace Carole was also asked if she and Michael had suggested any names for the third in line to the throne, and she replied laughing: 'Absolutely not!'. Adding to speculation the world will soon get its first glimpse of the new prince, a member of the royal household also arrived carrying a car seat for the future king and fresh clothes for Kate and William. The Duchess's hairdresser Amanda Cook Tucker, who has been her stylist since last year, also entered the Lindo Wing via its private rear entrance, adding to speculation that mother and child were soon to be discharged. Mrs Cook Tucker has been cutting William and Harry's hair for years, attended the royal wedding and was even flown in on their trip to the Far East in 2012 because Kate's hair started to droop in the 36 degree temperatures. Earlier it was revealed that the family were 'all doing well' and William and Kate expressed their gratitude to the St Mary's medical team for their 'tremendous care', after their son was born there at 4.24pm on Monday, weighing 8lb 6oz. 'We would like to thank the staff at the Lindo Wing and the whole hospital for the tremendous care the three of us have received. 'We know it has been a very busy period for the hospital and we would like to thank everyone - staff, patients and visitors - for their understanding during this time,' a joint statement from the couple said yesterday afternoon. Nursing staff are said to have helped Kate begin to breast-feed her son yesterday morning. A Kensington Palace spokesman added: 'Mother, son and father are all doing well this morning.' The overjoyed couple have started their first full day as proud parents of a ?beautiful? baby boy, as Britain continues to celebrate the prince's birth. On Monday night William slept at the hospital in a separate room so he could be near his wife and their little boy. The Queen?s Surgeon-Gynaecologist Marcus Setchell came to assess Kate yesterday morning and decided when the Duchess and baby can be discharged. Their prince could be named today, with the bookies' favourite currently being James, followed by George and Henry, but he has already been given the title His Royal Highness and will be known as Prince Name of Cambridge. On Monday night, great-grandmother the Queen said she was 'delighted' at the news while an overwhelmed Prince Charles exclaimed he was 'overjoyed' and 'enormously proud and happy to be a grandfather for the first time'. The Prince of Wales told crowds in Yorkshire that he and his wife the Duchess of Cornwall were still 'thrilled and excited' and celebrated with champagne last night, but added they have 'no idea' what their grandson's name would be.? The Evening Standard said that the Duke and Duchess of Cambridge wanted to see their baby?s 'little face' and get to know him before choosing a name. The young prince's first night in the world was an eventful one, because London was hit with a number of violent thunderstorms after what had been the hottest day of the year so far. Meanwhile well-wishers partied late into the night outside Buckingham Palace, even in the thunder, lightening and torrential rain. Prime Minister David Cameron said it was 'a historic moment in the life of our nation' but 'above all, it's a wonderful moment for a warm and loving couple who have got a brand new baby boy'. U.S. President Barack Obama led tributes from world leaders and said that the new baby's birth was a 'joyous occasion'. The Prince of Wales had resisted heading back to London to meet the child and stuck to his royal duties in Yorkshire, where his wife Camilla described the arrival of the Prince of Cambridge as 'a wonderfully uplifting moment for the country'. Charles and Camilla were met by cheering crowds of well-wishers on a visit to East Yorkshire where villager after villager offered the couple their congratulations as the royal couple walked around the green in Bugthorpe. 'I'm thrilled and very excited,' the Prince of Wales said, while the Duchess said her husband would make a 'brilliant' grandfather. 'I think it's wonderful news. I think mother, son and father are all well,' she told the BBC. 'And I think it's a wonderfully uplifting moment for the country. It's very exciting and it's wonderful for the grandfather - he's brilliant with children.' The village was decked out with Union flags and bunting for the visit. One member of the crowd, local resident Robert Barrett, was one of the first to greet the Prince, saying 'Morning Grandad', which raised a chuckle from Charles. 'He obviously likes being a grandad,' Mr Barrett added. And a little boy asked the Prince: 'When's the little baby coming?' to which Charles replied: 'We haven't been able to bring him yet.' Isla Lister, eight, said both Charles and Camilla told her they could not wait to see the new baby. She said: 'She was really nice and she said was really excited. I spoke to Prince Charles too and he said he couldn't wait to see him too.' Dozens of world leaders have been sending best wishes to the Cambridges and their new child. Australian prime minister Kevin Rudd wished the 'royal bub' all the best on behalf of all Australians. 'This is a day of great joy,' he said. 'When a new bub comes into the world, any old day, any part of the world, it is frankly a time for rejoicing. 'To Prince Charles and Camilla, they have the delight of being grandparents, all I can say is, this is probably one of the best experiences of your life and I'm sure they're going to have a wonderful time with the royal baby'. Stephen Harper, prime minister of Canada - where William and Kate carried out their first Royal tour together - said Canadians were 'delighted' to learn of the birth of their son and sent 'heartfelt congratulations'. 'This new beginning reminds us of the remarkable and enduring relationship our country has enjoyed with generations of the royal family. 'We recall with fondness the years of unfailing service by Her Majesty Queen Elizabeth II and His Royal Highness The Duke of Edinburgh and their deep affection for and loyalty to this country.' The Royal Canadian Mint also announced that it will issue special commemorative coins to mark the historic occasion. New Zealand's prime minister John Key said the nation's official gift to the royal couple is a hand-spun, hand-knitted fine lace shawl, similar to the one given when Prince William was born, and there was a 21-gun salute fired from Point Jerningham, Wellington, to mark the occasion. 'This is wonderful news for Prince William and Catherine,' he said. 'The birth of a child is a time of great joy and excitement, and I know they will make excellent parents.' He added: 'New Zealanders remember with fondness the visit of Prince William when he was just a toddler, playing on the lawn of Government House with a Buzzy Bee. It would be a great pleasure to welcome Prince William's son to New Zealand as well. 'On behalf of the people of New Zealand, I wish Prince William, Catherine and the royal family all the very best.' Many people asked whether the new baby had a name, but Charles gave little away. Alec Dale told Charles: 'We popped a bottle of bubbly last night at our house. I hope you did too.' The Prince replied: 'Yes. But just a little bit.' Debbie Lister, asked Camilla about the baby's name. Mrs Lister said: 'She said they had no clue whatsoever. She wasn't giving anything away. I thought she might tell me something, but no.' And Isla's grandmother, Judy Willis, said Charles told her: 'Grannies are getting younger, you know.' Gun salutes sounded across London yesterday to mark the birth of the royal baby as the armed forces join in the celebrations. The King's Troop Royal Horse Artillery and the Honourable Artillery Company carried out the ceremonial royal salutes in honour of the new addition to the Royal Family. Gun salutes are fired for the birth of every prince or princess, no matter where their place is in the line of succession, the Ministry of Defence said. The last royal salute for a birth was for Princess Eugenie in 1990. The King's Troop Royal Horse Artillery, wearing full dress uniform, paraded past Buckingham Palace to Green Park where they staged a 41-gun royal salute. They went from their forward mounting base in Wellington Barracks into Green Park, where 71 horses pulled six First World War-era 13-pounder field guns into position for the royal salute at 2pm. Each of the six guns fired blank artillery rounds at 10-second intervals until 41 shots were fired. The horses and riders then collected the guns and escorted them back to Wellington Barracks. Major Mark Edward, commanding officer of the King's Troop Royal Horse Artillery, said: 'The opportunity to mark the birth of the child of the Duke and Duchess of Cambridge by firing a 41-gun royal salute, comes as a huge honour for the King's Troop Royal Horse Artillery.' The Honourable Artillery Company HAC , the City of London's Army Reserve Regiment, also fired a 62-gun salute from Gun Wharf at the Tower of London at 2pm. Whilst a royal gun salute normally comprises 21 guns, this is increased to 41 if fired from a royal park or residence. Uniquely, at the Tower of London, which is a royal residence, 62 rounds are fired as this also includes an additional 21 guns for the citizens of the City of London to show their loyalty to the monarch.