It's a George! 	Kate Middleton and Prince William settled on the name George Alexander Louis for their new baby, making the tiny tot His Royal Highness Prince George of Cambridge. 	There's a long tradition of Georges on the British throne, most recently King George VI, who reigned from 1936 until 1952. But there are, of course, many other Georges besides the new member of the royal family. The Daily News rounded up some of the most famous Georges: 	George Clooney: Dapper actor George Clooney is perhaps the most famous George in Hollywood these days, thanks to star turns in films like Ocean's Eleven and a tumultuous love life. 	George W. Bush: For those of us across the pond, the first Georges that pop to mind are former presidents: George W. Bush and father George H.W. Bush both bore the name into the White House. 	Boy George: Culture Club leader and androgynous fashion icon Boy George, born George Alan O'Down, took the name George up the charts with songs like Do You Really Want to Hurt Me? and Karma Chameleon. 	Curious George: The adorable, rascally star of H.A. and Margret Rey's illustrated children's books was originally called Zozo in the United Kingdom in order to avoid using the name of the reigning King George for a monkey. 	George Washington: Then there is the original American George, the first President of the United States George Washington. 	George Costanza: The bungling Seinfeld character actually shares two names with the new prince: The full name of Jason Alexander's role is George Louis Costanza. 	George Harrison: The Beatles' guitarist is another worthy pop culture George, and a fellow Brit. 	George Lucas: Star Wars director George Lucas is one of the most financially secure Georges, with an estimated net worth of $3.9 billion. 	George Takei: Actor George Takei is best known for his role as Hikaru Sulu on Star Trek. 	George McFly: Michael J. Fox's character Marty McFly helps his father George stick up to the bully Biff Tannen in Back to the Future.