By Daily Mail Reporter and James Nye Published: 12:27 EST, 17 July 2013 | Updated: 15:27 EST, 17 July 2013 NSA whistleblower Edward Snowden has been described as 'distrusting, confused, emotional and desperate' as he sweats on the verdict of his application for temporary asylum to Russia. That is the verdict of a handwriting expert who has anaylsed the 30-year-old's official handwritten request exclusively for the MailOnline. Believing Snowden to tired, 'drained' paranoid and low on confidence and options, expert Linda Lauren feels that Snowden has a 'lack of understanding of the big picture and his role in it.' And on the former technical contractor's intelligence, the MailOnline's dissection of his writing reveals him to 'not as intellectual as he is analytical'. Scroll down for video Psychic profiler and handwriting expert Lauren was provided with a picture of Snowden's July 15th application to Russia, which he filed three weeks after arriving at a Moscow airport from Hong Kong. Over those past few weeks he has been holed up trying to avoid prosecution in the United States on espionage charges. Snowden is seeking refuge in Latin America after leaking details of U.S. government surveillance programmes, but has not risked taking any flight that might be intercepted by the United States since flying to Russia from Hong Kong on June 23. Russia's state RIA Novosti news agency quoted lawyer Anatoly Kucherena as saying that Snowden submitted the asylum request to Russia's Federal Migration Service. The service had no immediate comment. The lawyer said Snowden made the move to request temporary asylum after a meeting at Moscow's Sheremetyevo airport. 'He reached the conclusion that he needs to write an application for temporary asylum in Russia , and this procedure has just been done,' Anatoly Kucherena, a lawyer who met Snowden on Friday along with human rights activists. 'For now he is not going to go anywhere. For now he plans to stay in Russia,' he said, adding that if Snowden were granted temporary asylum, he should have the same rights as other citizens and be free to work and travel in Russia. The asylum application could end his time in limbo but risks deepening tension between the United States and Russia, which has refused to expel him to his homeland for prosecution. The head of Russia's Federal Migration Service FMS confirmed the agency had received Snowden's application. Anti-secrecy group Wikileaks, which has been helping Snowden, said on Twitter that he had applied for 'a temporary protection visa'. Snowden, 30, is trapped in the transit zone of Moscow's Sheremetyevo airport, an area between the runway and passport control which Russia regards as neutral territory. He said on Friday he would seek refuge in Russia only until he can travel to one of the three Latin American countries ready to give him political asylum - Bolivia, Venezuela and Nicaragua. He said the United States and its allies were preventing him from reaching those countries. Washington has revoked Snowden's passport and urged other nations not to help him reach an asylum destination. Kucherena said he expected a decision on Snowden's asylum request 'soon', though the Federal Migration Service has up to three months to decide on the application. The process for seeking temporary asylum is different from that for political asylum, which Kucherena said would require a decree from President Vladimir Putin. 'If we are talking about temporary asylum, then this is an issue not for the president but for the Federal Migration Service,' Putin's spokesman, Dmitry Peskov. Putin has rejected repeated U.S. calls to send Snowden to the United States, but has said he does not want the fugitive to harm already strained relations with Washington. Mr Putin yesterday described Snowden's arrival as an unwelcome present foisted on Russia by the United States. He said Snowden flew to Moscow intending only to travel on to another country, but the U.S. intimidated other countries into refusing to accept him, effectively blocking the fugitive from flying further. Snowden previously sought Russian asylum, which Mr Putin said would be granted only if he agreed not to leak more information. Snowden then withdrew the bid, the Kremlin said. During Friday's meeting in Sheremetyevo's transit zone, Snowden argued that he had not hurt U.S. interests in the past and has no intention of doing that. Mr Putin did not say if that would be sufficient grounds for asylum, adding that Snowden apparently did not want to stay in Russia permanently. Snowden is useful as a propaganda tool for Putin, who accuses the U.S. government of preaching to the world about rights and freedoms it does not uphold at home. But Putin has invited President Barack Obama for a summit in Moscow in September and both countries have signalled they want to improve ties. Putin has said twice that Snowden must stop all activities 'aimed at harming our American partners' if he wants political asylum in Russia, but he has not made clear whether the condition applies to temporary asylum as well. Temporary asylum is granted by the FMS, but Putin would be expected to make the final decision himself, even though he has tried to distance himself from Snowden's predicament. Putin said on Monday he hoped Snowden would leave as soon as he could, but left the door open for granting him asylum, saying there were signs the American fugitive was moving towards meeting the conditions he has set. Temporary asylum can be granted for up to a year, with the possibility of extension. The escape route is fraught with problems for Snowden, and would mean him having to gain access to Russia and then taking a huge detour