Edward Snowden, the former National Security Agency contractor who gave journalists secret documents describing U.S. digital surveillance activities, might soon leave the airport in Moscow where he has been living for the past month. The United States is seeking Snowden, who recently applied for temporary political asylum in Russia, for prosecution on charges of espionage. Since arriving at Sheremetyevo Airport, Snowden has remained in the diplomatically neutral transit zone, but Russia could soon allow him to enter the country officially: Vladimir Volokh, the head of the public council of the Russian Federal Migration Service, said Snowden would be handed a certificate stating that he had applied for political asylum. Snowden will ?only be allowed to stay in places designated by Russian law enforcement agencies,? Volokh told the Ekho Moskvy radio station Wednesday afternoon. If Snowden?s request for temporary asylum is granted, a process that would probably take at least three months, he would, in theory, be able to get a job and move freely around the country. Snowden?s attorney, Anatoly Kucherena, told reporters that his client, who has been charged in the United States with leaking classified information, is ?very grateful to Russia for not banishing him and not betraying him.? In a televised interview from the airport, Kucherena said he had delivered some spare clothing on Wednesday, as well as writings by Dostoevsky and Chekhov, so that his client could familiarize himself with classic Russian literature. Snowden has been stranded in diplomatic limbo at the airport ? without permission or documentation to officially enter Russia or travel to another country ? since flying there from Hong Kong on June 23. A new Washington Post-ABC News poll shows that a majority of Americans ? 53 percent ? now say the Snowden should be charged with a crime for his leaks. That?s up from 43 percent less than a month ago. Over that same span, the percentage saying Snowden should not be charged has dropped from 48 percent to 36 percent. Much of the movement comes from conservatives and moderates, who are now more likely to say Snowden should be charged with a crime. Among conservatives, 56 percent believe he should be charged, and 40 percent feel ?strongly? about it. Previously, there was no significant difference among the three groups. At the same time, survey subjects have become more likely to say that they are concerned about their privacy as a result of the documents that Snowden made public: Nearly three-quarters of Americans say the NSA programs are infringing on some Americans? privacy rights, and about half see those programs as encroaching on their own privacy. Most of those who see the programs as compromising privacy say the intrusions are unjustified. The percentage of Americans who put a higher priority on privacy protections than the investigation of terrorist threats has more than doubled in a decade and has hit the highest point in any Post-ABC News poll dating back to summer 2002. Today, about four in 10 say it is more important to protect privacy even if that limits the government?s ability to investigate possible terrorist threats. Some of the discomfort stems from doubts that the programs are making the United States safer. Only 42 percent say the programs make the country safer. More, 47 percent, see the programs as making little difference in the country?s security. And 5 percent say they actually make the nation less safe. .?.?. When it comes to allowing infringements on personal privacy to investigate terrorist threats, Americans now divide 57 percent for unfettered investigations and 39 percent on the side of sacrosanct privacy. That?s the closest split in 11 years of polling. Peak support for putting a higher priority on unfettered investigations, even if that infringes on personal privacy, came in June 2002, when 79 percent held this view. Only three years ago, as many as 68 percent took this position. Politically, the biggest change on this question has been among self-identified independents. Independents now split about evenly between prioritizing investigating threats or protecting privacy, 50 to 45 percent. Democrats and Republicans both remain about 2 to 1 supportive of investigations, even at the risk of privacy intrusions. Young adults, those ages 18 to 29, also now divide evenly on the question 49 to 48 percent , making them the only age group that doesn?t clearly prioritize investigations. The general agreement among Republicans and Democrats on the trade-off between investigating terrorist threats and protecting personal privacy is notable in a time when there are often wide partisan divisions on most issues. On most questions in the new survey, Republicans and Democrats respond in almost identical ways. For example, on the broad question of whether the NSA surveillance programs intrude on privacy rights, 70 percent of Democrats and 77 percent of Republicans say they do. Russia?s apparent decision to grant Snowden permission to enter the country ? though not yet asylum ? would seem to contradict earlier statements from Russian President Vladimir Putin urging the American fugitive to leave the country soon. Putin, however, had also said that Snowden could theoretically stay in Russia if he stopped leaking information that damaged the United States. Glenn Greenwald, a Guardian journalist who has worked with Snowden, has said that Snowden has information that could cause more ?harm to the U.S. government in a single minute than any other person has ever had.?.?.?. After an attention-grabbing flight from Hong Kong to Moscow on June 23, Snowden?s options seemed to have dwindled. While several Latin American countries had earlier declared their interest in sheltering the leaker, getting him there proved problematic. When Bolivian President Evo Morales took a recent flight home from Moscow, his plane was forced to make an unscheduled stop in Vienna, where it was searched. Though fellow Latin American heads of state railed against the search, they have since made fewer and fewer public statements about Snowden. His hopes of reaching Latin America appear to be fading. If Snowden does leave the transit zone, the next question will be whether or not he stays in Russia and for how long. If he?s looking for a job, that certainly doesn?t sound like he?s planning a short-term stay. As I wrote earlier, Russia has seemed like the safest option for Snowden, as its unique foreign policy and ideology make it perhaps the least likely to turn him over to the United States. Russia also has a long history of sheltering Western defectors and dissidents, although few appear to have found much success or happiness in exile there.