By Ashley Collman Published: 13:06 EST, 14 July 2013 | Updated: 13:17 EST, 14 July 2013 A sociology professor in Sweden has recommended NSA whistleblower Edward Snowden for the Nobel Peace Prize. In a letter addressed to the Norwegian Nobel Committee and published in Swedish newspaper V?sterbottens-Kuriren , Professor Stefan Svallfors nominated Snowden for his 'heroic effort at great personal cost' shedding light on the expansive cyber-spying conducted by the U.S. National Security Agency. Because of his bravery, Snowden 'helped to make the world a little bit better and safer,' Svallfors wrote. Scroll down for full letter A nomination for Snowden would be symbolic because it shows 'that individuals can stand up for fundamental rights and freedoms.' Svallfors compares Snowden's act to the rulings in the Nuremberg trials of 1945 because 'I was just following orders' was not held as a viable excuse for the Nazis who carried out human rights atrocities. Svallfors also believes this will help the Peace Prize regain some of respect it lost after prematurely awarding Barack Obama the award in 2009.? 'It would show its willingness to stand up in defense of civil liberties and human rights, even when such a defense [could] be viewed with disfavor by the world's dominant military power.' But it may be too late for Snowden to receive the award this year. Nominations for laureates must be postmarked no later than February 1 for consideration in the following December's prizes. ? Between the months of March and August the advisers review the short list of candidates. However, Svallfors' nomination should be taken seriously by the committee for next year's prize. As a sociology professor at Ume? University, he counts as one of the 'qualified' people who can send their nominations to the committee. These qualified people include: members of national assemblies and governments of states; members of international courts; university rectors; professors of social sciences, history, philosophy, law and theology; directors of peace research institutes and foreign policy institutes; recipients of the prize; board members of organizations that have been awarded the prize; active members of the Norwegian Nobel Committee; former advisers of the Norwegian Nobel Committee. The Nobel Peace Prize was started in 1901 and has been awarded to 100 individuals and 24 organizations. It was the last prize described in Alfred Nobel's will, which left most of his fortune to the creation of the prizes. Other Nobel Prizes are awarded in the areas of physics, chemistry, medicine and literature. The peace prize is awarded each year to 'the person who shall have done the most or the best work for fraternity between nations, for the abolition or reduction of standing armies and for the holding and promotion of peace congresses.' Though Snowden is eligible for nomination for the December 2014 prize, it's unlikely he'd be able to travel to Oslo for the award ceremony. Snowden applied for asylum in Norway on July 2, but the country then planned to reject it according to their national law. 'According to Norwegian law, one can't seek asylum abroad and the normal procedures stipulate that the asylum application from Edward Snowden will be rejected,' Paal Loenseth, Northwegian state secretary told news agency NTB. If Snowden is awarded the prize in 2014, he would be the youngest Nobel Peace Laureate in the history of the prize.?