By Associated Press Published: 01:02 EST, 15 July 2013 | Updated: 03:50 EST, 15 July 2013 Edward Snowden has highly sensitive documents on how the National Security Agency is structured and operates that could harm the U.S. government, but has insisted that they not be made public, a journalist close to the NSA leaker said. Glenn Greenwald, a columnist with The Guardian newspaper who first reported on the intelligence leaks, told The Associated Press that disclosure of the information in the documents 'would allow somebody who read them to know exactly how the NSA does what it does, which would in turn allow them to evade that surveillance or replicate it.' He said the 'literally thousands of documents' taken by Snowden constitute 'basically the instruction manual for how the NSA is built.' 'I think it would be harmful to the U.S. government, as they perceive their own interests, if the details of those programs were revealed,' he said. He has previously said the documents have been encrypted to help ensure their safekeeping. Snowden emerged from weeks of hiding in a Moscow airport Friday, and said he was willing to meet President Vladimir Putin's condition that he stop leaking U.S. secrets if it means Russia would give him asylum until he can move on to Latin America. Greenwald told The AP that he deliberately avoids talking to Snowden about issues related to where the former analyst might seek asylum in order to avoid possible legal problems for himself He said the U.S. has shown it's 'willing to take even the most extreme steps if they think doing so is necessary to neutralize a national security threat,' Greenwald said. 'He's aware of all those things, he's concerned about them but he's not going to be in any way paralyzed or constrained in what he thinks he can do as a result of that.' Asked about a so-called dead man's pact, which Greenwald has said would allow several people to access Snowden's trove of documents were anything to happen to him, Greenwald replied that 'media descriptions of it have been overly simplistic. 'It's not just a matter of, if he dies, things get released, it's more nuanced than that,' he said. 'It's really just a way to protect himself against extremely rogue behavior on the part of the United States, by which I mean violent actions toward him, designed to end his life, and it's just a way to ensure that nobody feels incentivized to do that.' He declined to provide any more details about the pact or how it would work. Greenwald said he himself has beefed up his own security, particularly since a laptop went missing from his Rio home.