Russia?s state news agency had reported the former US security contractor had been given permission to leave the transit zone at Sheremetyevo Airport, where he has been waiting since late June, prompting an expectation that he would finally appear on Russian soil. Back in Washington, the White House succeeded in heading off attempts by libertarian and liberal members of Congress to outlaw the blanket collection and trawling of phone data by US intelligence agencies, after warning the move would damage American security. The amendment was the first serious attempt in Congress to curb the powers of the NSA following leaks by Mr Snowden. The White House had reacted strongly against the amendment from Justin Amash, a libertarian Republican from Michigan, and co-sponsored by a Democrat warning in a statement that it would ?dismantle one of our Intelligence Community's counterterrorism tools?. Mr Snowden has applied for a year-long temporary asylum in Russia but needs a short-term pass to leave the airport while his application is considered. Edward Snowden has applied for asylum in Russia Photo: AP Anatoly Kucherena, a lawyer with ties to Vladimir Putin's political party, said Mr Snowden intended to stay in the country for now and was beginning to learn Russian. Mr Kucherena said he had brought his client fresh clothes and a copy of the Crime and Punishment - the dark Russian novel about a murderer's guilty conscience - to help him pass the time. I must say he is of course anxious about it and I hope that this situation will be resolved in the nearest future, Mr Kucherena. He said the current situation is a truly unique one for Russia and that the documents were still being considered by immigration authorities. Mr Snowden has been offered asylum by the Left-wing leaders of Bolivia, Nicaragua and Venezuela but has not attempted to reach any of them out of fear of being intercepted by the US en route. Jay Carney, the White House press secretary, yesterday repeated US demands that Russia should hand him over to American authorities. Mr Snowden should be expelled and returned to the United States, he said.