SANFORD, Fla. ? It?s over. But it?s not really done. The not-guilty verdict that sounded so final, so utterly unequivocal, in Courtroom 5D of the Seminole County courthouse Saturday night has quickly given way to a kaleidoscope of demonstrations across the country, debate about wrongful-death lawsuits and Web-site-crashing demands for the filing of federal civil rights charges. On Saturday night, George Zimmerman was able to shed the GPS device that had monitored his movements before he was acquitted of manslaughter and second-degree murder charges in the death of teenager Trayvon Martin. But the drama over the case persists, and it promises to go on and on. Such is the cramped and rolling nature of this spectacle that Attorney General Eric H. Holder Jr. is scheduled to speak Tuesday in Orlando, just a short drive from the courthouse where the verdict was read. He will address the annual convention of an organization ? the NAACP ? whose leader, Benjamin Jealous, launched a petition late Saturday asking that the Justice Department file civil rights charges against Zimmerman. The petition received such a massive response that it crashed the NAACP Web site. From church pews to the broadcast airwaves, to tweets and hastily organized protests, Americans have reacted strongly to the news that George Zimmerman has been acquitted of all charges in the killing of teenager Trayvon Martin. Within hours of the petition?s debut, the Justice Department released a statement saying its civil rights division still had an open investigation into Martin?s death, launched more than a year ago. Working with the FBI, federal prosecutors are reviewing evidence gathered during a Justice Department investigation ? and revealed during the Seminole County trial ? to see whether the case fits within ?the limited federal criminal civil rights statutes,? the statement said. Zimmerman, who has a white father and a Peruvian mother, claimed self-defense in the death of Martin, an unarmed African American teenager he saw walking through his modest gated community in February 2012. Zimmerman said he shot Martin after the teenager sucker-punched him and started pounding his head into a concrete walkway. Zimmerman had a ?concealed-carry permit for the handgun he used that night. ?I think it was racial profiling,? Barbara Arnwine, executive director of the Lawyers? Committee for Civil Rights Under Law, said in an interview Sunday shortly after arriving in the Orlando area. Arnwine said that she met with Justice Department officials before Zimmerman?s arrest in hopes of persuading them to file civil rights charges and that she would renew the push now that Zimmerman has been acquitted by a six-woman jury with no African American members. But doubts have been expressed by at least one Martin family attorney about the viability of a civil rights charge. In an interview with the Washington Post during the trial, lawyer Daryl Parks said: ?There was not enough evidence to say that [Zimmerman] made this decision based on race. .?.?. On the facts of this case, you can?t say it was based on race.? In closing arguments and in a news conference after the verdict, prosecutors insisted that the trial was not about race. Arnwine criticized prosecutors, including State Attorney Angela Corey, who was appointed by Gov. Rick Scott R , for taking that approach. ?What did she think it was about?? Arnwine said. ?I do think that the case did show that the prosecutors did not have a good strategy for dealing with the racial element.? Florida defense lawyer Diana Tennis argued in an interview that ?if anybody has a civil rights action, it?s George Zimmerman.? Tennis said that ?black leaders and black lawyers got him maliciously prosecuted? by pressuring local politicians during the month and a half between the shooting and Zimmerman?s arrest. Zimmerman, she said, is ?the one who might end up in federal court asking a lot of embarrassing questions to a lot of shame-faced politicians.? Rallies ? including a large demonstration organized by the Rev. Al Sharpton in Sanford ? were held nationwide to protest the initial decision of Sanford police not to charge Zimmerman. And the Martin family?s lead attorney, Benjamin Crump, who is African American, mounted a successful campaign to generate media interest in the case, with the help of a public relations firm and other lawyers. Zimmerman?s attorneys are poised for the possibility of civil lawsuits against their client. Defense attorney Mark O?Mara has said he will seek immunity for Zimmerman if civil suits ?spawned by this fiasco? are filed. Tennis said the defense pursued a pretrial strategy that seemed designed, at least in part, to avoid any risk of not being able to claim immunity in future civil lawsuits. The defense opted against asking the judge to dismiss the case based on Florida?s ?stand your ground? law, which in many cases justifies the use of deadly force, without the obligation to flee, when a person feels threatened. If the judge had refused a dismissal on those grounds, Zimmerman might not have been able to claim immunity later, Tennis said. ?They took a gambit,? she said. ?I think they were looking forward.? She noted that even though Zimmerman is not wealthy now, he may be able to strike lucrative book deals, generating income that could be at risk in a civil suit. The legal standard in a civil lawsuit is lower ? a preponderance of the evidence, rather than proof beyond a reasonable doubt. Zimmerman chose not to testify in his criminal trial, but it is likely he would have to testify and be deposed in a civil lawsuit, said Daniel Petrocelli, who led the legal team that won $33.5?million in damages in a civil wrongful-death trial against O.J. Simpson after his murder acquittal. ?In that sense, civil trials are a more pure search for the truth,? Petrocelli, a partner in the O?Melveny & Myers law firm, said in an interview Sunday. Petrocelli said that his deposition of Simpson lasted 14 days and that he received suggestions from around the world ? all of which he ignored ? about what questions to ask. Arnwine said she has met frequently with Martin?s family members since they began trying to persuade journalists and public officials to press for an arrest of Zimmerman. She said she expects them to explore ?all their options,? including possible civil litigation and a push for a civil rights charge, now that Zimmerman has been acquitted. The verdict, she said, is likely to spur more people to attend events in the District related to next month?s 50th anniversary of the March on Washington. And she knows what many of them will be wearing: hoodies. Sari Horwitz in Washington contributed to this report.