The not-guilty verdict in the trial of George Zimmerman has produced dramatically different reactions among blacks and whites, with African Americans overwhelmingly disapproving of the jury?s decision and a bare majority of whites saying they approve of the outcome, according to a new Washington Post-ABC News poll. The jury?s decision in the case that involved the killing of black teenager Trayvon Martin continues to roil the country, with protests, demonstrations, calls for federal intervention and a nonstop debate about the degree to which race played a role in the shooting and in the trial. The new survey underscores not only the gap between whites and blacks, but also how passionate many African Americans are about the case. Among African Americans, 86 percent say they disapprove of the verdict ? with almost all of them saying they strongly disapprove ? and 87 percent saying the shooting was unjustified. In contrast, 51 percent of whites say they approve of the verdict while just 31 percent disapprove. There is also a partisan overlay to the reaction among whites: 70 percent of white Republicans but only 30 percent of white Democrats approve of the verdict. Among all whites, one-third say the shooting was unjustified, one-third say it was justified and the other third say they didn?t know enough to have an opinion. The shooting, which occurred last year in a gated community in Sanford, Fla., drew national attention. Zimmerman claimed he shot Martin in self-defense. Much of the trial was carried live on the major cable news television networks. Ultimately the jury of six women found Zimmerman not guilty of both second-degree murder and manslaughter on July 13. Trayvon Martin shooting and verdict: Huge racial gaps The verdict prompted renewed discussion about why black and white Americans often see events through separate prisms and whether the country can bridge the racial divisions that continue despite progress on civil rights matters over many decades. In the Post-ABC News poll, 86 percent of African Americans say blacks and other minorities do not get equal treatment under the law. The number of whites saying so is less than half as large, at 41 percent. A majority of whites, 54 percent, say there is equal treatment for minority groups. Those differing perspectives highlight a racial gap that prompted President Obama to speak out last week. In his surprise appearance on Friday, the president offered some of the most personal comments of his presidency about racial issues as he sought to explain to white Americans the experiences that have led so many African Americans to feel that the verdict was unfair and unjustified. Obama said African Americans understand that young black males are sometimes followed when they shop in a department store or hear the locks of car doors click as they walk along a street and said those kinds of experiences ?inform? how African Americans interpret the Martin killing. ?It?s inescapable for people to bring those experiences to bear,? he said. He added: ?The African American community is also knowledgeable that there is a history of racial disparities in the application of our criminal laws ? everything from the death penalty to enforcement of our drug laws. And that ends up having an impact in terms of how people interpret the case.? Civil rights leaders have called on Attorney General Eric H. Holder Jr. to file federal charges against Zimmerman. Holder, who last week called for a review of states? ?stand your ground? laws, earlier launched a federal investigation into the shooting, but the legal bar remains high. Despite that legal hurdle, more than eight in 10 African Americans said Zimmerman should be charged in federal courts with violating Martin?s civil rights. Among whites, just 27 percent hold that view, while 59 percent said he should not be charged. Some 60 percent of Hispanics say blacks and other minorities do not receive treatment equal to that of whites in the criminal justice system, and by a two-to-one ratio, they disapprove of the verdict in the Zimmerman trial. Obama said it was time for the nation to do some soul-searching in the wake of the verdict, although he said he was skeptical of calling for a ?national conversation? on race. Blacks and whites have different perspectives on the implications of the case as a pretext for continuing to talk about its racial implications. A Pew Research Center poll released Monday found black and white Americans sharply divided on the question of whether the verdict raises important issues that should be discussed or whether race is receiving too much attention. Almost eight in 10 African Americans said it was useful to have such a discussion, while six in 10 whites said race is getting too much attention. The Post-ABC poll was conducted July 18 to 21 among a random national sample of 1,002 adults. The margin of sampling error is plus or minus 3.5 percentage points. It is 4.5 points for the sample of white respondents and 11 points among African Americans and Hispanics. Cohen is director of polling at Capital Insight, the independent polling group of Washington Post Media. Capital Insight pollsters Scott Clement and Kimberly N. Hines contributed to this report.