The weapon used in February 2012 to take the life of Trayvon Martin can now be returned to George Zimmerman, who needs it even more since the wannabe cop walked free Saturday out of a Sanford, Fla., courtroom, his defense attorney says. 	The 29-year-old Zimmerman, who has gone underground since Saturday night's verdict, will most certainly rearm himself and is entitled to the 9mm Kel-Tec pistol he used to kill Martin, attorney Mark O'Mara told ABC News. The gun has been in police evidence since the night of the shooting, and the unloaded weapon was presented as an exhibit during the two-week trial. 	 [There's] even more reason now, isn't there? O'Mara said Sunday. There are a lot of people out there who actually hate him, though they shouldn't. 	Thousands across the nation took to the streets to protest the verdict and express distaste for Zimmerman, the jury and the controversial Florida law that allowed Zimmerman to kill the unarmed 17-year-old. Demonstrations in Manhattan and Los Angeles ended in some arrests as protesters clashed with riot-ready police. 	Martin's family plans to take civil action against their son's killer now that the criminal trial, which captivated and stirred emotions worldwide, has ended. 	Reports indicate Zimmerman, who ballooned more than 100 pounds between his arrest last year and his trial, has taken to wearing disguises and a bulletproof vest as he tries to avoid vigilante justice. 	 If I was him, I would go somewhere else, O'Mara said of his client. 	 I don't think he can work, he added. I don't think anyone can hire him. ... George is a pariah. 	Zimmerman's concealed-carry permit could be in jeopardy but his right to own a gun is not, O'Mara said. But if the U.S. Department of Justice, which has an open investigation into the shooting, pursues charges and convicts Zimmerman, his status as a convicted felon would preclude his right to own a gun, NBC News reported. 	Speculation has mounted about the future for the neighborhood-watch volunteer, who gunned down Martin on Feb. 26, 2012, as the hoodie-wearing teen returned to a home in the gated Sanford community from a trip to a convenience store. 	Only Zimmerman, who armed himself and left his truck that rainy night to track the black teenager, knows exactly what happened. 	 I think that [Zimmerman] feels truly in his heart that if he did not have that weapon that night he might not be here. ... [he] would have continued to get beat even though he was screaming for help, O'Mara told ABC. 	sgoldstein@nydailynews.com or follow on Twitter 	On a mobile device? Click here to watch