In Los Angeles, police clashed with protesters who blocked a major highway, reporting that they had suffered a barrage of rocks and batteries. Police said they responded with bean bag rounds though demonstrators claimed they had fired rubber bullets. As night fell, riot police deployed as a crowd of demonstrators reached Hollywood Boulevard, blocking a main junction, although there were no reports of violence in that area. Demonstrators are blocked by police as they march to Times Square in New York AP In New York, several thousand demonstrators gathered in Times Square carrying signs with portraits of Mr Martin, while others donned hooded sweatshirts as the 17-year-old did the night he was killed. The man was armed, the kid was not, and the man with the gun got away, protester Carli VanVoorhis, 21, told AFP. If we say it was not a racial issue, we would be lying. Boston, San Francisco and Chicago also saw large protests, while spontaneous marches sprang up in Washington, Philadelphia, Atlanta and the Florida state capital, Tallahassee. Many Americans have been enraged by the acquittal of Mr Zimmerman for a killing which they believe was racially motivated, and by the apparent reluctance of police in Florida to take action against the 29-year-old neighbourhood watch volunteer. AFP/Getty Images Mr Zimmerman admitted to shooting Mr Martin dead but claimed he had acted in self-defence after a violent struggle while he was patrolling the gated community in Sanford. He had been accused of pursuing the unarmed teenager because of racial bias and deliberately gunning him down following an altercation. However the all-female six-person jury - five of whom were white - accepted his defence that he had been forced to shoot Mr Martin after the teenager wrestled him to the ground and repeatedly slammed his head into the pavement. Celebrities took to social media to air their dismay at the verdict. Nicki Minaj tweeted: We just paid to see a murderer walk free after killing an innocent unarmed little boy. #GodBlessAmerica. Trayvon Martin Rihanna said Mr Martin was my little brother, adding: A child was gunned down for no reason! And nothing about that sounds like murder? Mia Farrow said: This sucks. Beyonce held a silence at a concert in Nashville. Sanford pastor Valerie Houston used a sermon to rail against what she called white supremacy. Dr Martin Luther King Jr stated, the daily life of the Negro is still in the basement of the Great Society, she said. And today I state, the daily life of my people is still enslaved to a white supremacist society. Reuters Mr Obama urged Americans to accept the trial verdict. We are a nation of laws, and a jury has spoken, he said in a statement. I now ask every American to respect the call for calm reflection from two parents who lost their young son. Mr Obama last year spoke emotionally about the case, saying amid widespread public anger that if he had a son he would look like Trayvon . The case drew massive protests in several cities after Florida police initially failed to act against Mr Zimmerman. According to the state's controversial Stand Your Ground law, people who fear for their lives can use deadly force to defend themselves without having to flee a confrontation. Mr Zimmerman smiled briefly after the verdict was read out Getty Images He was eventually arrested in April 2012 and charged with second-degree murder and manslaughter. Community leaders called for non-violent protests after the verdict. There will be protests, but they must be carried out with dignity and discipline and let no act discredit the legacy of Trayvon Martin on the appeal of his family, civil rights leader Reverend Jesse Jackson said on CNN. The Martin family's attorney Benjamin Crump said they were going to look at the possibility of a civil lawsuit against their son's killer. They deeply want a sense of justice. They deeply don't want their son's death to be in vain, he told ABC News's This Week. The NAACP, the largest US civil rights group, urged supporters to sign a letter asking Attorney General Eric Holder to file civil rights charges against Zimmerman. The most fundamental of civil rights - the right to life - was violated the night George Zimmerman stalked and then took the life of Trayvon Martin, the NAACP letter said. The US Justice Department said on Sunday that it would examine whether hate crime charges can be brought against Mr Zimmerman.