The LA Times said the LAPD had declared a tactical alert about 9pm, which means that off-duty officers can be kept on duty when their shifts end and may respond only to high-priority calls. Shortly later, the police force designated the protest an unlawful assembly meaning they could arrest anyone involved. Footage of the area taken from helicopters showed young protesters facing off with officers wearing helmets and holding batons along Crenshaw Boulevard, a major thoroughfare. A man is detained by Los Angeles police during the march Reuters LAPD Lt. Andy Neiman told the news station that some people were engaging in lawless activity and that one person had been arrested. We got a tough job on our hands tonight, he said. Lt Neiman asked parents to send text messages to their children that might be involved in the unrest asking them to go home, otherwise things will not end well . Protesters begin their march up Crenshaw Avenue in Los Angeles after attending a prayer rally EPA He said there had been scuffles, which appeared to be among people within the group, and there had also been rubbish bins set on fire and cars climbed on as well as other low level criminality. He said: It's hard to tell if there is any leader here, it just seems to be lawless activity. People jumping on cars can be a very frightening experience for any civilian driving through the city, and you never know how they're going to react. He added: It's almost like herding kittens and cats, keeping a large group running in various directions with reports of crime along the way. People jump on a car on Crenshaw Boulevard in Los Angeles during the protest Reuters Earlier, CBS News LA reported that 200 people holding signs calling for Justice had blocked a major freeway in Crenshaw. Mr Zimmerman, 29, was acquitted on Saturday in Florida of second-degree murder and manslaughter in the 2012 shooting death of Trayvon, 17. The verdict has sparked protests across the county, despite calls from community leaders for calm.