A day of peaceful protests gave way to arrests and bottle throwing Sunday night as thousands took to the streets of New York to vent outrage over the verdict in the Trayvon Martin case. 	From a rally at Union Square, thousands of demonstrators marched to Time Square and uptown chanting, ?No Justice, No Peace!? 	For the most part, cops stood by. But at E. 79th St. and Second Ave. police in riot gear moved in to arrest two people for disorderly conduct. 	?Move back or I will mace you,? one police officer shouted at protesters. 	Cops had arrested at least more five protesters in a clash at Park Ave. and E. 71st St. around 10 p.m. 	?It got chaotic,? said one protester, adding that bottles were thrown. 	Some demonstrators said the police grew more forceful as the march got closer to Mayor Bloomberg?s E. 79th St. townhouse. 	?They don?t want us near Bloomberg?s house,? a protester griped. 	Early Monday, about 200 remaining protesters crossed from Harlem to the Bronx, where they assembled peacefully on the steps of the Bronx County Courthouse in a moment of silence for Trayvon. 	A day after George Zimmerman was found not guilty of killing 17-year-old Trayvon, politicians, preachers and protesters seemed united in the belief that justice was denied. 	?I really want this to be about Trayvon,? Solange Knowles, sister of Beyonc?, told demonstrators at a peaceful rally she organized at Brooklyn Borough Hall Sunday afternoon. 	?I believe the verdict was a travesty of justice,? former federal prosecutor Ken Thompson, who is running for Brooklyn District Attorney, said at the Borough Hall rally. 	At Union Square, City Councilman Jumaane Williams D-Brooklyn said the verdict sends a message that it?s ?difficult to be a black man in 2013.? 	?People think what happened on Florida is isolated. It?s a systematic problem that affects the same people over and over again,? said Williams, drawing connections to the NYPD?s stop-and-frisk program. 	The Union Square rally drew Democratic mayoral hopefuls John Liu and Bill de Blasio, who both condemned the verdict. De Blasio called on the federal Department of Justice to bring civil rights charges against Zimmerman. 	?The verdict was a slap in the face to justice,? de Blasio said. ?A young man was killed. Unarmed. It's not an acceptable verdict. The Department of Justice needs to intervene in Florida immediately.? 	In a Sunday morning sermon, the Rev. Nicholas Richards took to the pulpit at Abyssinian Baptist Church in Harlem to denounce the verdict. 	?Every generation has its own evil. But our evil is a different kind of evil ? our systems are evil,? Richards said. ?If it happened to Trayvon, God knows it can happen to me.? 	With Jennifer H. Cunningham 	On a mobile device? Click here for video.