President Obama implored Americans on Friday to ?do some soul-searching? in the aftermath of the shooting death of an unarmed black teenager in Florida, speaking expansively and introspectively about the nation?s painful history of race and his own place in it. Directly wading into the polarizing debate over last weekend?s acquittal of George Zimmerman in the killing of Trayvon Martin, Obama tried to explain the case through the lens of past discrimination that still weighs heavily on African Americans. The nation?s first black president, recognizing the disconnect between how whites and blacks were reacting to the Zimmerman verdict, sought to explain why the acquittal had upset so many African Americans. ?I think it?s important to recognize that the African American community is looking at this issue through a set of experiences and a history that doesn?t go away,? Obama said. Obama first inserted himself into the controversy surrounding Martin?s killing in March 2012, when he said from the White House Rose Garden, ?If I had a son, he?d look like Trayvon.? On Friday, he recalled that statement and added, ?Another way of saying that is Trayvon Martin could have been me 35 years ago.? As Trayvon Martin?s parents addressed George Zimmerman?s acquittal on television, protesters continued in a show of support for the slain teenager. Zimmerman says he shot and killed the unarmed Martin last year in self-defense; a jury found him not guilty of second-degree murder and manslaughter. Obama?s 18-minute remarks, delivered extemporaneously during a surprise afternoon appearance in the White House briefing room, was the most extended discussion of race in his presidency. He has generally avoided talking about race relations, although he delivered a memorable speech on the topic during the 2008 campaign and wrote about his own experience of discrimination in his memoir, ?Dreams From My Father.? A Florida jury?s verdict last Saturday that Zimmerman was not guilty of second-degree murder or manslaughter in the killing of Martin has inspired protests and a heated national debate over racial profiling and gun laws. With the Justice Department reviewing the case and weighing federal civil rights charges against Zimmerman, Obama offered no opinion on the verdict itself. Obama followed reaction to the trial all week, talking about it with family and friends, a senior administration official said. He summoned his top aides on Thursday to tell them that he wanted to comment publicly on the shooting death of Martin as well as the discrimination he has felt personally. Obama wanted to ?speak from the heart,? the official said, explaining why he opted against reading from a prepared script. He spoke in a hushed and at times halting voice, pausing periodically to compose his thoughts. ?There are very few African American men in this country who haven?t had the experience of being followed when they were shopping in a department store,? Obama said. ?That includes me.? He continued, ?There are very few African American men who haven?t had the experience of walking across the street and hearing the locks click on the doors of cars. That happens to me, at least before I was a senator. There are very few African Americans who haven?t had the experience of getting on an elevator and a woman clutching her purse nervously and holding her breath until she had a chance to get off. That happens often.? Obama?s remarks came ahead of a weekend of remembrance for Martin. The Rev. Al Sharpton is organizing ?Justice for Trayvon? events in 130 cities on Saturday. In Florida, Gov. Rick Scott R has declared Sunday a ?Statewide Day of Prayer for Unity,? while protesters hunkered down to spend the weekend in the state Capitol in Tallahassee. Martin?s parents, Sybrina Fulton and Tracy Martin, said Friday that they were ?deeply honored and moved? by Obama?s remarks. ?President Obama sees himself in Trayvon and identifies with him,? they said in a joint statement. ?This is a beautiful tribute to our boy. Trayvon?s life was cut short, but we hope that his legacy will make our communities a better place for generations to come.? Robert Zimmerman Jr., the brother of the defendant in the case, said on Fox News that he was glad Obama ?spoke out today. .?.?. I think he was very sincere in his remarks.? In his initial response to the acquittal, Obama issued a short written statement on Sunday afternoon asking people to reflect calmly and ?ask ourselves if we?re doing all we can to widen the circle of compassion and understanding in our communities.? White House officials said earlier this week that although the case stirred emotions, the option of Obama addressing the nation on camera was never discussed. Throughout the week, press secretary Jay Carney sidestepped questions about the president?s personal reaction. Still, officials said, Obama was prepared to answer questions about the verdict when he sat for interviews with four Spanish- language television stations on Wednesday. Aides said they were surprised when he was not asked about the Zimmerman case in the interviews, which focused primarily on immigration. On Thursday, Obama informed his senior staff that he wanted to share his thoughts, leading to his appearance at the podium Friday during Carney?s scheduled daily briefing. Civil rights leaders have been communicating with White House officials about the Zimmerman case, including a conference call Tuesday with senior adviser Valerie Jarrett. But officials said they did not press Obama to speak publicly about the case. Sharpton said he discussed the issue with Jarrett over breakfast Friday. ?It was definitely his choice,? Sharpton said, adding that Obama?s comments ?made us feel like at least we matter.? Hilary Shelton, Washington bureau director for the NAACP, noted that Obama ?doesn?t come to this issue new,? having worked on anti-racial-profiling legislation in Illinois and the U.S. Senate. But he added that Obama has the ability ?to bring his very unique perspective to the issue so Americans can debate and discuss it? in a way they wouldn?t otherwise. In his remarks, Obama ruminated aloud about how the country could continue to overcome discrimination. ?Where do we take this?? he asked. ?How do we learn some lessons from this and move in a positive direction? .?.?. Beyond protests or vigils, the question is, are there some concrete things that we might be able to do?? Obama said he and his wife, Michelle, have talked a lot about ways to ?bolster and reinforce our African American boys.? There is more that can be done, he said, to give black children a sense that they are a ?full part of this society? and that the country is willing to invest in helping them succeed. The president called for an examination of ?stand your ground? laws like the one in Florida that allows individuals to use deadly force to defend themselves. ?For those who resist that idea that we should think about something like these ?stand your ground? laws, I just ask people to consider if Trayvon Martin was of age and armed, could he have stood his ground on that sidewalk?? Obama said. ?And do we actually think that he would have been justified in shooting Mr. Zimmerman, who had followed him in a car, because he felt threatened?? Obama also sounded some hopeful notes, pointing to his two young daughters as evidence that successive generations have made progress in changing racial attitudes. ?It doesn?t mean that we?re in a post-racial society,? Obama said. ?It doesn?t mean that racism is eliminated. But you know, when I talk to Malia and Sasha and I listen to their friends and I see them interact ? they?re better than we are. They?re better than we were on these issues. And that?s true in every community that I?ve visited all across the country.?