Fireworks were let off in Tahrir Square, packed with hundreds of thousands of anti-Morsi protesters, as the army delivered a televised address announcing its road map for Egypt's future. The army statement said that Egypt's constitution would be dissolved on a temporary basis , and then new elections to form a technocratic government would take place. The army's general command said that for months it had been calling for reconciliation. It said it had hoped for a road map to be put in place, but that President Morsi's speech last night, in which he had talked of his legitimacy as president, was against the aspirations of the people. Egypt's people were also warned to steer clear of violent demonstrations. The armed forces swears it will face up forcibly against anyone who acts outside peaceful means, the statement said. Earlier, state media agency MENA reported that the army had told Morsi at 7pm 5pm GMT that he was no longer president. MENA also reported that the army's political roadmap would see a period of transitional rule, and then new parliamentary and presidential elections. Across the country the military has been deployed to pro-Morsi rallies, media organisations have been secured , and barbed wire barriers have been set up around the Republican Guard barracks, where Morsi iwas located. It has been reported that Morsi has been taken to a safe location by the military. 'Coup' Earlier on Wednesday a spokesman for the Muslim Brotherhood said: I think the military coup is indeed underway. I think that we are seeing many signs of that at the moment and I don't think that the Egyptian people will tolerate another resurface of the old regime under any banner, and not by bullying of the military machine. The comments followed military chiefs saying that they were willing to shed blood against terrorists and fools after President Morsi refused to give up his elected office. A witness told news agency Reuters that several hundred soldiers, accompanied by five armoured vehicles, were parading on the main road near the presidential palace. A Morsi aide said he was still working within the Republican Guard barracks, but it was unclear whether or not he was allowed to leave. Late on Wednesday the army erected barbed wire barriers around the Republican Guard headquarters. Armoured vehicles and personnel carriers were also deployed to a pro-Morsi rally in Cairo. Al-Ahram reported that the 20 armoured vehicles and personnel carriers had also been deployed in Suez, where Morsi's supporters were said to be rallying. Security sources also said that a travel ban had been placed on Mr Morsi as well as several other top members of the Muslim Brotherhood. There was also reported to be an army presence at the Muslim Brotherhood offices in Cairo. Earlier, State-run Al-Ahram newspaper, which has been secured by the military, said it expected the president would either step down or be removed from office today when a deadline set by the army for resolving the country's political crisis expires. Egypt's flagship state daily said an army road map for the future would set up a three-member presidential council to be chaired by the head of the supreme constitutional court. Al-Ahram learnt that with the end of the 48-hour period set by the armed forces... it is expected in the hours that follow it, one of two things: either Morsi announces his resignation himself or the declaration of his removal through the roadmap for the future set out by the armed forces, it said. Al-Ahram said the road map would set up a neutral transitional government to be headed by a military leader. The transitional period would last nine to 12 months, in which a new constitution would be drafted to set out a path to presidential elections. According to reports coordinated with political leaders, an interim council would rule pending new elections. The sources would not say what was planned for an uncooperative president. Facing the expiry of a 48-hour ultimatum set by the head of the armed forces that he should agree a power-sharing deal with his rivals, President Morsi broadcast a defiant address to the nation to defend his legitimacy - a word he used repeatedly in the course of 45 minutes. However Gehad al-Haddad, the Muslim Brotherhood spokesman, said the miltary had no right to impose a roadmap for Egypt. A road map is something that the constitution outlines and the president directs. It's not the role of the military, he said. He added that the Muslim Brotherhood would stand between the tanks and the president to protect the legitimacy of the will of the Egyptian people . Military leaders held a crisis meeting on Wednesday. Two political sources said that opposition leader Mohamed ElBaradei met army chief General Abdel Fattah al-Sisi. One opposition source said that ElBaradei would be urging the military to intervene to prevent bloodshed. The protests and rioting have led to 39 people being killed with hundreds injured in clashes between Mursi's supporters and opponents. Protesters also clashed with security forces at Cairo University, where 16 people died and about 200 were wounded. Liberal opposition leaders, who have vowed not to negotiate with President Morsi since the ultimatum was issued, immediately denounced his refusal to go as a declaration of civil war . The youth movement that organised the mass protests urged the Republican Guard to arrest President Morsi immediately and present him for trial. Three hours after his midnight television appearance, the military high command responded with a post on its Facebook page. The post said they, too, were willing to lay down their lives to defend their position - one which they described as defending the Egyptian people from terrorists, radicals and fools . A military source said the message came from General Abdel Fattah al-Sisi, the armed forces commander appointed by President Morsi last year, who issued the ultimatum to politicians on Monday. It was posted on the official Facebook page of the Supreme Council of the Armed Forces, or Scaf. It entered history books as Egypt's ruling institution after the army pushed aside Hosni Mubarak in the Arab Spring uprising of early 2011. It is an honour for us to die rather than that anyone should terrorise or threaten the Egyptian people, it said. We swear to God, we will sacrifice even our blood for Egypt and its people to defend them against any terrorist, radical or fool. Long live Egypt and its people.