Egypt crisis: What next for the Muslim Brotherhood? Just a few days ago, senior Muslim Brotherhood leaders were frequent speakers on Egyptian TV talk shows and radio stations. Now journalists and media people can hardly find any of them. They are either in custody or have gone into hiding, as the arrest campaign by the military and police is widening by the day. Prosecutors have already started questioning some of the detainees on charges of inciting the murder of protesters opposing ousted President Mohammed Morsi in recent clashes near Cairo University. It is a serious setback to the group's well-organised hierarchy, says Mostafa al-Khatib, editor of the Justice and Development newspaper, the mouthpiece of the Brotherhood. Arrest warrants go non-stop, he said. The Mubarak-era oppressive tactics are back once again in a more ferocious form. They are arresting anyone carrying the group's identification cards. No existential threat 	 On 30 June, millions of Egyptians poured into the streets of Cairo and many other cities to demand the resignation of Mr Morsi, whom they accuse of failing to address the country's worsening economic and social problems. They once again converged on Tahrir square, the same place that witnessed massive demonstrations in 2011 that removed former long-time President Hosni Mubarak. Backed by widespread popular support, the military stepped in to topple Mr Morsi, Egypt's first democratically elected leader. Expecting arrest at any time, Mr Khatib says the crackdown does not, however, pose an existential threat to the group. Because we represent an ideology. We are not just a group of people. Founded in 1928 by Hassan al-Banna, the Muslim Brotherhood is the country's largest and oldest Islamist organisation. The movement's ideology has evolved from daawa - or preaching for good morals and Islamic teachings - into a belief based on political Islam. One of the group's stated aims is to create a state ruled by Islamic law, or sharia. Its most famous slogan is: Islam is the solution . The group was subject to oppression under successive military rulers from the 1950s, until they made big parliamentary and presidential wins after the 2011 revolution. For many years, its leaders were forced to go underground. They are likely to do the same again now. If the Egyptians accept the military coup and its moves - which I'm sure proud and free Egyptians wouldn't - the Muslim Brotherhood might have to go underground again, as it would face more oppressive acts, said Mr Khatib. 'Jihad and martyrdom' 	 He has been among thousands taking part in an open sit-in outside a mosque in east Cairo that has become a rallying point for the supporters of Mr Morsi. They say they will not end their protest unless Mr Morsi is reinstated as the country's first democratically elected civilian president. The generals say they were morally bound to intervene to prevent the country from spiralling into civil war, as Mr Morsi had proved to be a divisive leader who pitted Egyptians against one another. The military handed power immediately to the head of the Supreme Constitutional Court, Adly Mansour. He was sworn in 4 July as interim president setting the stage for presidential elections. The National Salvation Front NSF , a coalition of leftist and liberal parties that is the main opposition force against Mr Morsi, justifies the crackdown. The country is going through exceptional circumstances and legal procedures have been followed in these arrests, said NSF spokesman Khalid Dawood. He added that the Muslim Brotherhood leaders have incited violence by calling for jihad and martyrdom after the removal of the president . Time for change? 	 The rhetoric used by Muslim Brotherhood members and clerics in recent month has alarmed many Egyptians, including some of those who brought Mr Morsi to power. The group has not lived up to the people's expectations and alienated many of the Egyptians by their power-grabbing approach and turning a blind eye to the rise of hardliners, who jumped on its cloak in an atmosphere of free politics, said Hosameldin Elsayed, author of several books on political Islam. Mr Elsayed believes that the Brotherhood has committed a series of strategic mistakes that triggered a military-backed public uprising and the removal of Mr Morsi after just one year in office. To survive, Mr Elsayed adds, the Brotherhood needs a radical transformation. The young generation has lost faith in the group's leaders, who have become synonymous with failure, he notes. The young should take over and adopt a heard-headed approach. The group under the current leaders is rushing to its own death.