At least 16 people are killed and over 200 injured in clashes near Cairo University. Ahram Online Mohamed Kamel Amr resigns as the Foreign Minister of Egypt along with five other ministers who also submit their resignations after Sunday protests. Reuters via MSN The President of Egypt Mohammed Morsi vows to stay in office despite the protests. The Telegraph Naxalite-Maoist insurgency: Six policemen in the eastern India state of Jharkhand are killed in an attack by Naxalites. NDTV Militants attack NATO headquarters in the north of Kabul resulting in at least two deaths. Reuters , AP via Newsday A wave of market bomb attacks mostly targeting Shi'ite Muslims kills 46 people Herald Sun At least seven people are killed in Pakistan after an American drone strike targets a militant compound near the border with Afghanistan. IBN Live Pending approval from Pope Francis, reports that Pope John Paul II may be canonized at the end of the year are confirmed after approval by the Vatican Congregation for the Causes of Saints of an alleged second miracle. CBS News At least eleven have been killed and dozens of people are injured in Indonesia's Aceh Province after a 6.2 magnitude earthquake. Xinhua The Obama administration postpones enforcement of a major requirement of the Patient Protection and Affordable Care Act healthcare law - that pertaining to employers offering coverage to their workers - for a full year after its planned January 1, 2014 implementation. Washington Post 68 Islamists accused of conspiring against the United Arab Emirates federal government, sentenced to 15 years. BBC Two Russian married couples are found guilty by a German court of espionage for Russia BBC Court proceedings against former Chadian President Hiss?ne Habr? commence in Senegal, with charges including war crimes, crimes against humanity, and torture. BBC , Euro news , Deutsche Welle France and Portugal refuse to allow the plane of Bolivian President Evo Morales to land on their respective territories after suspicions that Edward Snowden was on board. The Washington Post Wales becomes the first country in the UK to adopt a presumed consent system of organ donation after members of its legislative assembly vote in favour of the system. BBC Portuguese Minister of Foreign Affairs Paulo Portas quits after disagreeing with the prime minister's choice for Finance Minister, Maria Lu?s Albuquerque. The Minister for the Environment and Agriculture and the Minister of Social Security are also set to resign. Euro news , BBC The Communist Party of Cuba announces a shakeup of its leadership with former President of the National Assembly of People's Power Ricardo Alarc?n and several others losing roles on the Central Committee. AP A Russian Proton-M rocket carrying three GLONASS navigation satellites loses control and crashes shortly after launch from Baikonur Cosmodrome in Kazakhstan. Spaceflightnow.com The International Astronomical Union names Pluto's fourth and fifth moons, Kerberos and Styx. Sydney Morning Herald This page was last modified on 15 July 2014, at 16:20.