JEFFREY BROWN: And next to Japan, where the ruined Fukushima Daiichi nuclear plant has been leaking contaminated underground water into the sea more than two years after the earthquake and tsunami. Today, officials at Tokyo Electric Power admitted they delayed releasing that information, saying they didn?t want to worry the public. Meanwhile, the area around the plant remains deserted. But Alex Thomson of Independent Television News got brief and rare access. ALEX THOMSON: Few people ever get in to the Fukushima exclusion zone. Nobody gets in without protective equipment and screening. Here?s the radio to keep in contact, she?s telling us. Monitoring equipment for radioactivity comes next, then off, out to the final police checkpoint. And we pull in just inside the exclusion zone to suit up. It?s becoming a way of life around here. TEPCO, the company that runs the stricken plant, have given us five hours in the zone with a radio to keep in contact with us, let us know when our time?s up. The regalia in which I?m now standing, including this, a dosimeter which will give my accumulated radiation dose across the time that we?re inside the exclusion zone. We have come here with Anthony Ballard, who used to live in Futaba, the town which houses the giant nuclear plant, as did his friend and fellow English teacher Philip Jellyman. Rubble from the quake stays just where it fell, fringed now with weeds. The clock on the main street stopped at 2:46, the second the first tremors shattered this region on March the 11th, 2011. The town shrine lurches after the quake. Someone?s been back at some point to try and save it with ropes. Good luck messages to the gods for the unluckiest of towns after a quake, a tsunami, and radiation. MAN: The students who were at the school that day have never seen their houses. ALEX THOMSON: Never seen it since the disaster? MAN: Never seen it. They were evacuated very early on March 12, and they have never seen their houses since. ALEX THOMSON: Right. Phil, why is that? Why can?t the kids come back? What?s the reason for that? PHILIP JELLYMAN, teacher: It?s to do with absorption rates of radiation. Children are more vulnerable to it. ALEX THOMSON: Initially, Philip and Anthony were only allowed back here for an hour a month. Now we have five, and in that time, we will accumulate about one microcubit of radiation for every hour we?re here. MAN: Point-six-seven. ALEX THOMSON: Our contamination adviser says that?s a safe amount for a few hours, but living here would vastly increase the likelihood of cancers. MAN: Returning to Futaba stirs painful memories of a life brutally halted. This is the main street, basically, and just down there on the left is the butcher shop. ALEX THOMSON: They don?t know what became of the butcher or his family. Actually revisiting his house is not comfortable. MAN: OK, so this is my house here. ALEX THOMSON: But both Englishmen are now on something of a mission for their Japanese friends. ANTHONY BALLARD, teacher: I like to chronicle the town. I like to record it. And some of the people from Futaba have said keep taking pictures. ALEX THOMSON: In here, you see why the authorities offered us rat poison, as well as radiation protection equipment, rat, dog, cat and bird feces all over the place. Animals moved in as people moved out. Nature is taking over here, the empty railway tracks turning green. At the ticket office, a polite notice: ?Sorry we?re away. We will be back here soon.? That was two-and-a-half years ago. Arriving from this platform and, indeed, departing, absolutely no trains, of course, for well over two years now, this place, this station, like the whole town, weirdly frozen in time, right down to the newspapers on the stand on that fateful day. And outside the station, the unnerving silence of a radioactive town. What do you think, Philip? You think you will ever come back and live here? PHILIP JELLYMAN: In this house? No. ALEX THOMSON: In this town? PHILIP JELLYMAN: In this town? I?m still a young man. I might be able to do it at some point. ALEX THOMSON: Would you like to? PHILIP JELLYMAN: I would like to. I would like to stay with the town as long as possible, and if one day they were to come back here, I would like to come with them. ALEX THOMSON: You have a great attachment, haven?t you, to the place and its people? Which is why they visit radiation hot spots in the town to gather data. MAN: So the last time I was here, it was a little higher than this, actually. And I walked over there and it shot up. So over there should be a hot spot if we walk up here. ALEX THOMSON: So literally a few yards make a difference then? MAN: A few yards, yes. ALEX THOMSON: That?s extraordinary, right. OK, well, go and see what happens. MAN: So, up here, we?re getting eight. MAN: Yes. MAN: Close to the vegetation. We?re getting 16 now. Can you get that, Stuart? Right. So showing 24. Got 24 over here, Richard, 24. ALEX THOMSON: So the other dial is showing 24? Twenty-four what? MAN: That would be microsieverts, which is ? it?s the reading. It?s nothing frankly. So these dosimeters here are programmed to first alarm at 100 microsieverts. And that?s a warning to get out. And if we stood there for an hour, that?s the dosage you would receive. ALEX THOMSON: Right. So if you live here, and you ? what would happen? MAN: You wouldn?t want to live here. ALEX THOMSON: But what if you did? MAN: Well, there?s a chance ? there?s obviously the chance of cancers, you have got to think, over time from the exposure to the radiation. ALEX THOMSON: It would be dangerous over time, but it?s not dangerous for a few minutes? MAN: No, not for a few minutes. No, we?re fine for a few minutes. ALEX THOMSON: But, even so, I think we had better maybe move somewhere else. MAN: Indeed. ALEX THOMSON: All right. Yards away, another alarm goes off, 69 microsieverts, the highest reading we?d encounter in our five hours here. A mile or so from town, screened off by thick forests and with armed guards, Fukushima-Daiichi looms, broken. Over 300,000 tons of contaminated water are already here. Tons more need storing everyday as they struggle to keep the reactors cool. The damage to the building is obvious, the plant owners dragged kicking and screaming to tell the truth of what?s still going on here. We stand a few hundred yards up the coast from the stricken plant. And in the past few days, the company that runs it has been forced to admit that radioactivity is now leaking into the Pacific. They don?t know where it?s coming from. Not only that. Inspectors in the past few days have found hot spots of radioactive cesium, the levels of which were the highest recorded since the disaster happened more than two years ago. Drive past the slip road to the plant itself and the alarms go off again. So we head back through town under the archway of hope, which still reads, ?Nuclear Power, Our Bright Future.??