Tokyo Electric Power Company TEPCO has found itself thrust into the spotlight again over the last two weeks as a series of events at and around the damaged Fukushima Daiichi nuclear station have triggered a large volume of negative press, government commentary, and regulatory backlash. The embattled utility clearly has its hands full on more than one front. Contamination Detected at Sea On Monday, July 22, after a number of reports had circulated for some time, TEPCO?admitted that it believed that highly contaminated water was again being admitted into the sea?specifically, the inner harbor area just outside the nuclear plant. In fact, elevated contamination levels had been detected in onsite sampling wells since May; TEPCO said that leakage into the ocean may have begun as early as April. The revelations expanded to include the fact that as early as January, it had been noted that the water level in sampling wells on the site was fluctuating in concert with the rising and lowering tide?meaning that the ground water was in communication with the sea. Of course, similar events had happened before?and triggered a plan, still underway, to construct impermeable walls in front of the station outside the present temporary silt fences and inside the harbor. Completion of this steel barrier wall was originally not planned until mid 2014; until that time, the temporary adsorbent?towers the ?circulating sea water purification system? as well as absorbent material placed inside the silt fences would have to suffice to reduce contamination levels outside the plant. Continuing with the same plan is not nearly enough for officials who expressed anger on Monday after the revelations by TEPCO. On Monday, Chief Cabinet Secretary Yoshihide?Suga?was quoted by NHK?as saying that the Japanese government ?would instruct [TEPCO] to do a quick and secure job in preventing ? further leaks,? adding that the government views this development as a ?grave matter.? Hideki Moremoto, of the Nuclear Regulation Authority, was quoted on Japanese television saying ?it is extremely regrettable that TEPCO?was slow in announcing this problem.? On a site tour on Monday, Senior Vice Minister of the Industry Ministry Kazuyoshi?Akaba described the plant site conditions as deplorable, and said that ?TEPCO?always seems to be one step behind the problems,? according to NHK. That same day, government officials of Fukushima Prefecture called TEPCO?representatives to their offices and rebuked them for having not publicly released the information as soon as it was discovered, and for not having done more to stop leakage into the sea in the interim. According to the Asahi Shimbun, prefectural official Tetsuya?Hasegawa?told TEPCO?s?personnel that ?the people of Fukushima become more anxious every time they hear of more safety failures; please put that thought at the center of your mind as you try to fix this situation.? Representatives of the local fishermen, who have been both vocal and important in local decision-making, also expressed shock and disappointment at the revelation, according to both NHK?and AJW Japan. In response to the immediate backlash, TEPCO?invited reporters to the site to see the work being done between the damaged nuclear reactors and the sea on Monday evening. It was reported that completion of the inner barrier walls and cement improved solidified soil might be completed as early as the middle of next month; this providing an inner barrier between the nuclear plants and the sea, while the aforementioned steel beam and plate barrier will essentially wall off the inner harbor area. TEPCO?revealed that this work was stepped up in May, after the first detection of increased levels in onsite sampling wells. The source of the contaminated water is of course fairly obvious; TEPCO?is presently injecting a total of roughly 364 cubic meters of water each and every day into the three damaged reactors altogether?or about 96,000 gallons. Some, but not all, is cleaned and recovered after having cooled the reactors or if some theories are correct, bypassed the reactors and then leaked into the reactor building, and then the turbine building basements. The water has long been known to have pathways into what the Japanese call ?trenches,? which are the piping and cable runs at and below ground level that criss-cross the entire site relaying power, control and monitoring signals and water in normal plant operations all over the site for many functions. It was determined long ago that these tunnels were a prime conduit for movement of highly contaminated water, and some were sealed off with concrete relatively early within months after the accident. It seems clear, given recent events, that two things are occurring at once:? First, that water from the reactor buildings or the turbine buildings is in communication with ground water and/or water in the tunnel systems; and second, that the tunnel systems have communication with sea water. In fact, water level in at least one of the turbine buildings is also following tidal variations as is water in some of the trenches/tunnels TEPCO?July 11 handout . This makes the completion of the multiple barriers ?cement improved soil,? steel inner barriers, steel outer harbor barrier a top priority, in addition to further sealing?of the tunnels, since TEPCO has continuously attempted to reduce the cooling water injected to the three damaged reactors to as low a volumetric flow rate as possible in order to maintain effective cooling. In other words, the amount of water being injected to the reactors and thus essentially supplying the driving force for contamination of water and one of the driving forces for its movement to various other areas can?t be reduced further; the effluent must be blocked, and the contaminated water either stored or treated. TEPCO?has stated at a number of times that at some point it believes that it will have no choice but to discharge very low-level??treated? water to the sea; the total amount of water on site in tankage will only increase more rapidly as the sources of leakage to the sea are found and capped. Discharge of the low-level?contaminated water to the sea may be the lesser of two evils and a better option?a choice that TEPCO and Japan may have to make sooner rather than later. Steam Emissions from Unit 3 Reactor Building Less than a week before the news of the contaminated water leakage broke, TEPCO had already found itself the focus of scrutiny after a contractor investigating debris removal on the top of the Unit 3 reactor building filmed what was referred to at the time as steam actually, vapor would be the correct term coming from openings in the structure; the initial discovery occurred on July 18. Since that time, the company has spotted this emission multiple times?most recently as early as the morning of July 24. The Japanese press quickly published and republished pieces about these events. TEPCO?has repeatedly sampled the air around the plant, assuring the Japanese people that?no increased emissions of any sort gaseous or particulate are concurrent with this discovery. In addition, TEPCO performed radiation monitoring over the top of the building, and while it did find that there was a slight increase in dose rate near the area of the vaporous emissions, the dose rate, although high, was roughly 1/4 that found at some other areas on the same roof level during the survey. The working assumption after having found no radioactive emissions increase and no zone increase in rad level has been stated by TEPCO as follows: ?Given the result and the status of the plant, we assume that the steam was generated as a result of rain having leaked through gaps near the cover and has heated at the head of the primary containment vessel.? Press on this issue has fallen off given that no outward effect is occurring, and given that the story of the actual contamination discovered in the trenches and seawater is far more significant in terms of impact. What?s important to understand about both of these events?even given the extremely difficult situation on site there are still wrecked vehicles and smashed equipment that have never been touched ?is that both of these events tend to violate important rules developed by NISA? now NRA and TEPCO?in the ?Road Map to Recovery? of the site. The halting of any further spread of contamination was, and is, a major part of this plan; as readers following the story for any period of time will know, massive effort and many millions of yen have gone into various provisions toward this end, including covering of the No. 1 reactor building with a new structure, the closure of the blowout panel in the No. 2 reactor building, the installation of silt fences at the harbor, installation of active and passive filtration at the harbor, sealing of tunnels and trenches, provision of massive amounts of onsite?added tankage, and more. At this stage of the recovery from the accident, both are setbacks?one simply a sort of thing that generates good news video and bad press the vaporous emissions but the other a very serious blow to the overall plan. And, it must be said, another serious blow to TEPCO?s image with the Japanese people. Two lesser events have also made the news in Japan. First, it is being reported by several media outlets that plant site workers whose thyroid gland dose exceeds 100 millisieverts?number almost 2000 people; second, that radioactively contaminated materials with a high dose rate have been discovered 15 kilometers away from the plant site?most probably having been blown there after the explosion in either the No. 1 or the No. 3 reactor buildings while the accident?s active phase was in progress. While these events have not made large news outside of Japan, they are becoming well known inside Japan this week. TEPCO?was unable to capitalize on a positive announcement it made during this same time frame?on July 20, the spent fuel removal structure for Unit 4?s spent fuel pool was officially declared completed. An illustration of this structure opens this article. The internal working parts, which constitute mainly a crane structure and fuel bundle handling equipment, began assembly even before the structure was completed. TEPCO now believes it will begin to remove the fuel from Unit 4?s spent fuel pool in November of this year. While this is probably the easiest task on site involving nuclear fuel in any way, the rapid and in fact ahead-of-original-schedule completion is itself notable, and is proof that at least some of the projects on site are being managed successfully. Recovery work continues steadily outside the plant site as well. July 20 marks the start of the summer vacation for children in Minami-Soma, a city whose name became known world-wide after the Fukushima Daiichi accident. On that day, a new water attraction was opened for the children to play in, within a park that has been completely decontaminated. Photos of children playing in the new, modern fountain look for all the world as if nothing had ever happened. It?s clearly the prefecture and national government plan that this kind of experience will spread until all of the region has been decontaminated?and reoccupied and life returned to normalcy. It?s also clearly obvious that positive news items such as this will continue to be ignored while it still appears to the Japanese that TEPCO?and the Japanese government do not have the Fukushima Daiichi site under complete control. It remains to be seen in the critical upcoming weeks how TEPCO?responds to the primary problem of contaminated seawater, and further how the new nuclear regulator responds to this first very serious test after its formation. Indeed, NRA must act aggressively to ensure that further spread of contamination is halted as quickly as possible both to protect the environment and to ensure that the regulator earns the public trust. For more information: Click here to see a video from TEPCO?showing ?ground improvement? on the Fukushima Daiichi site on July 7, 2013. Click here for a second video on ?ground improvement? from July 17. Click here to see a TEPCO press handout describing and mapping the recent findings of contaminated water on site, including mention of the fluctuation of water levels in trenches and buildings with the tide. Click here for the most recent TEPCO report on the storage and treatment of accumulated water on the site, including water treatment system diagrams. Click here for the latest NHK?report on leakage of contaminated water to sea. Will Davis is a consultant to, and writer for, the American Nuclear Society; an active ANS member, he is serving on the ANS Communications Committee 2013-2016.? In addition, he is a contributing author for Fuel Cycle Week, is Secretary of the Board of Directors of PopAtomic Studios, and writes his own popular blog Atomic Power Review. Davis is a former US Navy Reactor Operator, qualified on S8G?and S5W plants.? He?s also an avid typewriter collector in his spare time. The point of the article isn?t to get bogged down in the measurements. Rather, the point is that TEPCO could ? and should ? get right to the public immediately when such things as these events become known to it. Waiting only makes for a ?double whammy? when the news comes out, when TEPCO takes a hit for the event and a much more major hit in the field of credibility and the public perception of openness and honesty. This is why I?ve deliberately avoided getting into the exact measurements in the article which really is a lot more about people than figures; should you wish to find the measurements, I?d suggest use of the links provided at the end of the piece.