Click here to download and review the PowerPoint that Stephen Hosea showed at our UN Day gathering. It is a large 17.5MB file, which may take ~2 minutes to download. Be patient! Monday, March 3, 2014, at 5:30 ? 7:30 pm. Location: University Club of Santa Barbara, 1332 Santa Barbara St., Santa Barbara.?Free and open to the public! Complementary wine & beverages, crudit??& cheese? platters. Cash bar available. When: Sunday March 23, 2014, 2:00 pm. Doors open at 1:30 pm. Where: High Street Arts Center: 45 E. High Street, Moorpark, CA 93021 Fee: $10 for adults, $5 for students, sold at the door. For more information, please refer to the?FEMME PDF. ?How Can Fukushima Teach us to Collaborate as Global Citizens to Heal the World?? The United Nations Association of the United States of America UNA-USA is a membership organization of individuals and organizations dedicated to inform, inspire, and mobilize the American people to support the ideals and vital work of the United Nations. For 70 years UNA-USA has worked to accomplish its mission through its national network of Chapters, youth engagement, advocacy efforts, education programs, and public events. On UN Day 2013, we plan to look at the unfolding catastrophe at Fukushima, which is now posing direct risks to the health and well being of people along the central coast of California and far more broadly across all the U.S. western states extending into Canada. The UN Association of Santa Barbara has asked Mr. Julian Gresser to facilitate a day long discovery process on generating breakthrough innovations and preparing an effective emergency response based on his latest book,?Piloting Through Chaos?and his invention, an ?Explorer?s Wheel.? We plan to hold a town meeting on October 24, UN Day, and invite members of the 1200 local non-profit organizations along with many other concerned companies and civic groups. That evening we will have a public forum with a panel of experts and a speaker. Fukushima presents an immediate set of concerns: To participate, please send an e-mail message with your name, e-mail, affiliation, and phone contact to?info@unasb.org, and kindly put ?UN Day? in the subject line. Giving up? US ?citizenship and a passport, which many of the refugees in? Paris ?would have wanted at any price, was widely reported in the press and brought him many visitors.??Among the visitors was Robert Sarrazac, who had been active in the French resistance. He shared the same view of the destructive nature of narrow nationalism and the need to develop a?world citizen?ideology.??Garry was also joined by the young Guy Marchand, who would later play an important role in structuring the world citizen movement. Despite the French police?s official displeasure with people not having ?valid? identity papers,?they tolerated Garry Davis? camping out on the terraces of the Palais de Chaillot, which had become ?world territory? for the duration of the UN General Assembly?s meeting there. He set up a tent and waited to see what the UN would do to promote world citizenship.?In the meantime, Robert Sarrazac, who had many contacts from his resistance activities, set up a ?Conseil de Solidarite,? formed of people admired for their independence of thought and not linked to a particular political party.??The Conseil was led by Albert Camus, novelist and writer for newspapers, Andre Breton, the Surrealist poet, l?Abb? Pierre and Emmanuel Mounier, editor of ?Esprit, ?both Catholics of highly independent spirit, as well as Henri Roser, a Protestant minister and secretary for French-speaking countries of the International Fellowship of Reconciliation. For additional information about Garry Davis, please see this article in the?New York Times: ?Garry Davis, Man of No Nation Who Saw One World of No War, Dies at 91.? The foregoing paragraphs were excerpted from the essay??Garry? Davis: And Now the People Have The Floor,? by Rene Wadlow.