Radiation leaks, steam releases, disease and death continue to spew from Fukushima and a disaster which is far from over. Its most profound threat to the global ecology -- a spent fuel fire -- is still very much with us. The latest steam leak has raised fears around the planet. A worst-case scenario of an on-going out-of-control fission reaction was dismissed by the owners, Tokyo Electric, because they didn?t find xenon in the plume. The company says the steam likely came from rain water being vaporized by residual heat in one of? the plant?s stricken reactors. But independent experts tend to disbelieve anything Tepco says, for good reason. Reactor Units One, Two and Three have exploded at Fukushima despite decades of official assurances that commercial atomic power plants could not explode at all. The company has been unable to clear out enough radioactive debris to allow it to put a cover over the site that might contain further airborne emissions. Tepco has also been forced to admit that it has been leaking radioactive water into the ocean ever since the disaster began on March 11, 2011. In one instance it admitted to a 90-fold increase of Cesium in a nearby test well over a period of just three days. Earlier this year a rat ate through electrical cables, shorting out a critical cooling system. When Tepco workers were dispatched to install metal guards to protect the cabling, they managed to short out the system yet again. Early this month Fukushima?s former chief operator, Masao Yoshida, died of esophogeal cancer at the age of 58. Masao became a hero during the worst of the disaster by standing firm at his on-site command post as multiple explosions rocked the reactor complex. Tepco claimed his ensuing cancer and death were ?unlikely? to have been caused by Fukushima?s radiation. The impact of work in and near the reactors has become a rising concern. Critics have warned that there are not enough skilled technicians willing to sacrifice themselves at the plant. Tepco has worsened the situation by applying to open a number of its shut reactors elsewhere in Japan, straining its already depleted skilled workforce even further. Meanwhile, a staggering 40 percent rise in thyroid irregularities among young children in the area has caused a deepening concern about widespread health impacts from Fukushima?s fallout within the general public. Because these numbers have come in just two years after the disaster, the percentage of affected children is expected to continue to rise. And the worst fear of all remains unabated. At Unit Four, which apparently did not actually explode, the building?s structural integrity has been seriously undermined. Debate continues to rage over exactly how this happened. But there?s no doubt that a pool containing many tons of highly radioactive used fuel is suspended 100 feet in the air, with little left to support the structure. Should an earthquake or other trauma knock the pool to the ground, there?s a high likelihood the fuel rods could catch fire. In such an event, the radioactive emissions could be catastrophic. Intensely lethal emissions could spew for a very long time, eventually circling the globe many times, wrecking untold havoc. So while a depleted, discredited, and disorganized nuclear utility moves to restart its other reactors, its stricken units at Fukushima continue to hold the rest of us at the brink of apocalyptic terror. Tom Hayden : Progressive Dems See Opening for New Politics by Tom Hayden / The Rag Blog. The sight of progressive Democrats shaming and exposing the Wall Street-funded Third Way Democrats is a sign of a powerful new opening for progressives on the American political spectrum. Jack A. Smith : Climate Change Confab Brings Too Little Too Late by Jack A. Smith / The Rag Blog. The sharply increasing scientific indicators of impending disastrous global climate change have failed to motivate the principal developed countries to accelerate the lackluster pace of their efforts to reduce greenhouse gas emissions. Lamar W. Hankins : Opportunist Narvaiz Takes On Doggett Again in Gerrymandered 35th by Lamar W. Hankins / The Rag Blog. Former San Marcos mayor Susan Narvaiz, who is again challenging U.S. Rep. Lloyd Doggett in Texas' gerrymandered 35th district, is a political chameleon who says what she needs to say to protect herself from political accountability. Steve Horn : Keystone XL's Houston 'Fork in the Road' by Steve Horn / DeSmogBlog. The southern half of TransCanada's Keystone XL tar sands pipeline includes a Houston Lateral Pipeline that is leading the LyondellBasell refinery to retool itself for the looming feast of tar sands crude and fracked oil bounty. RAG RADIO / Thorne Dreyer : November Guests Include Spiritual Counselor, Citizens' Advocate, Singer-Songwriter by Rag Radio / The Rag Blog. Thorne Dreyer's guests in November included a Methodist minister and longtime social activist, a noted citizens' advocate, two staffers from the original Rag, the author of a book about the 'movement that started the civil rights movement,' and an acclaimed singer-songwriter. Listen to the podcasts here. BOOKS / Alan Wieder : Paul Buhle's 'Radical Jesus: A Graphic History of Faith' by Alan Wieder / The Rag Blog. Noted historian Paul Buhle, who has published an acclaimed series of nonfiction comics, is one of the most prolific and insightful critics from the American left. Radical Jesus, which communicates the social message of Jesus Christ in comic format, investigates the inequalities that exist in the world through a theological lens. Rabbi Arthur Waskow : Israel, Hillel, and Idolatry by Rabbi Arthur Waskow / The Rag Blog. Hillel International, the home for many Jewish college students of diverse backgrounds and beliefs, has been beset with controversy about when uncritical support among American Jews for Israel becomes idolatry of the State. Paul Krassner : Is There a Doctor in the House? by Paul Krassner / The Rag Blog. The Coachella Valley in Southern California hosted a massive four-day health clinic that helped more than 2,500 uninsured patients. Krassner points out that California leads the nation in people without health insurance and says that the insurance industry has a preexisting condition known in technical terminology as greed. Kate Braun : Winter Solstice Falls on Saturn's Day by Kate Braun / The Rag Blog. Our celebrations during the Winter Solstice take from many traditions, including the Roman Saturnalia, Druid customs, the German Yule, and the birth of Jesus; and it was Queen Victoria who popularized the lighted Christmas tree. Allen Young : Ralph Dungan, the 'Good Liberal' by Allen Young / The Rag Blog. A recent obituary of Ralph Dungan, one of President John F. Kennedy's top aides who later served as ambassador to Chile, reminds Allen of a revealing experience he had with the man referred to by a historian as a good liberal. Ed Felien : A Good [Angry White] Man With a Gun by Ed Felien / The Rag Blog. Paul Anthony Ciancia considered himself a good man with a gun -- a warrior against the traitors who were taking over our government, bankrupting our currency, and trying to establish a New World Order -- when he walked into the Los Angeles airport and opened fire with an assault rifle. BOOKS / Ron Jacobs : Matt Hern Writes With Bravado That Sports Do Matter by Ron Jacobs / The Rag Blog. Engagingly written, Matt Hern's One Game at a Time is motivated by the belief that sports do matter as much as sports fans think they do. Hern, like leftist sportswriter Dave Zirin, walks into the terrain where sports and politics mesh. Lamar W. Hankins : Right-Wing Rants and the Abominable Straw Man by Lamar W. Hankins / The Rag Blog. The Internet is a marvelous tool when used honestly and correctly, and with recognition of its limitations. But it is also home to angry rants, often from the far right, that make ridiculous claims -- like the one that actually originated on a satirical site saying that the Obama administration was setting up gasoline stations to provide free gas to low-income [read: black] people. HISTORY / Bob Feldman : A People's History of Egypt, Part 12, Section 1, 1947-1948 by Bob Feldman / The Rag Blog. More in Bob's series on the continuing movement to democratize Egypt, this time covering the period from 1947-48 when an anti-imperialist left made experienced growth -- and the Muslim Brotherhood collaborated with the Egyptian regime. Harry Targ : My Nelson Mandela by Harry Targ / The Rag Blog. An irony of 21st century historical discourse is how real historic figures -- like the late Nelson Mandela -- get lionized, sanitized, and redefined as defenders of the ongoing order rather than activists who committed their lives to revolutionary change. Michael James : Back to Uptown, 1965-1966 by Michael James / The Rag Blog. Mike continues his remarkable memoir, accompanied -- and inspired by -- photos from his upcoming book. His adventures -- and the making of an activist -- continue as he heads back to Uptown Chicago, progressing along my path with another left turn and a big step into America. Alan Waldman : ?Last of the Summer Wine? Has Kept Millions Laughing for 37 Years by Alan Waldman / The Rag Blog. British national treasure, Roy Clarke, created and wrote all 295 episodes of this droll Britcom about three elderly Yorkshiremen with too much time on their hands. Alice Embree : Chile and the Politics of Memory by Alice Embree / The Rag Blog. Chileans went to the polls Sunday and appear to be reelecting Socialist president Michelle Bachelet on the 40th anniversary of the bloody U.S.-supported coup against Socialist president Salvador Allende. Alice writes about the dramatic contradictions in Chilean politics and history. Paul Krassner : A Tale of Two Alternative Media Conferences by Paul Krassner / The Rag Blog. Paul remembers the original Alternative Media Conference in June 1970 at Goddard College in Vermont -- and it was a wild and wooly affair headlined by the likes of Ram Dass, Harvey Kurtzman, and Art Spiegelman -- as the college hosts another conference keynoted by progressive radio host Thom Hartmann. RAG RADIO / Thorne Dreyer : Singer-Songwriter Slaid Cleaves in Interview and Performance Interview by Thorne Dreyer / Rag Radio. Acclaimed musician Cleaves talks about Woody Guthrie's influence on his work, reflects on his time as a busker on the streets of Ireland, and spins some yarns. He also performs live for our audience. Read the story and listen to the podcast. Harry Targ : STEM and the Tyranny of the Meme by Harry Targ / The Rag Blog. From the fear of falling behind the Soviets to the missile gap and, more recently the wars on drugs and terrorism, the fear of falling behind some fictional adversaries is an ongoing meme used by economic, political, and military elites. The latest? Now it's the STEM crisis and the fear that we're falling behind other nations in science and technology . Alice Embree : Anne Lewis' New Website Brings Austin Movement History to Life by Alice Embree / The Rag Blog. Noted documentary filmmaker Anne Lewis has created a website called Austin Beloved Community that uses audio, film, photos, maps, and personal recollections to create a digital collage about the struggle for social and economic justice in Austin from the 1880s to the present. Alice interviews Lewis about the unique project. BOOKS / Ron Jacobs : Marc Myers Tells Us 'Why Jazz Happened' by Ron Jacobs / The Rag Blog. Ron reviews a new book on America's own music in which Marc Myers provides the reader with a deep, rich, and broad perspective on the confluence of jazz and U.S. history in the decades following World War Two. INTERVIEW / Jonah Raskin : Novelist Beverly Gologorsky Was Shaped by Sixties, Feminism, and The Bronx by Jonah Raskin / The Rag Blog. Another unique interview from Jonah with novelist Beverly Gologorsky, whose latest book, Stop Here, the title of which nearly shouts its presence. Gologorsky, a novelist shaped by the New Left, edited anti-war publications Viet-Report and Leviathan in the '60s and '70s. Bob Feldman : A People's History of Egypt, Part 11, Section 2 by Bob Feldman / The Rag Blog. The latest in Feldman's series on the movement to democratize Egypt covers the period of 1945-6 when Egyptian communist and labor grew and faced government retaliation. David McReynolds : We Are All Wounded Veterans by David McReynolds / The Rag Blog. Long-time pacifist writer and activist McReynolds says there's something infinitely sad about the recent celebration of Veterans Day. In the bad wars -- which are the only wars we have fought for some time now -- there is the terrible knowledge that the enemy was never really the enemy, he says. RAG RADIO / Thorne Dreyer : October Interviews with Poppy Northcutt, Maneesha James, Seth Holmes, and Thomas Zigal Interviews by Thorne Dreyer / Rag Radio. In October Rag Radio guests addressed Texas feminist history, issues involving death and dying, the plight of migrant farmworkers, and the post-Katrina craziness captured in fiction. Read about our guests and listen to the podcasts here. Michael James : Going Off Campus, 1965 by Michael James / The Rag Blog. Mike continues to share experiences and images from his rich history as an activist and adventurer -- that will be published in an upcoming book, Michael Gaylord James' Pictures from the Long Haul. Here Mike reports on the Free Speech Movement at Berkeley, community organizing in Oakland, and his travels across the country in a 1957 Plymouth station wagon drive-away. Alan Waldman: 'Keeping Up Appearances' Tops Second Tier of My Favorite Britcoms by Alan Waldman / The Rag Blog. Waldman has been reviewing vintage, mostly-British television series now available on DVD, Netflix, and YouTube. Keeping Up Appearances is a very funny sitcom with a brilliant cast, starring Patricia Routledge as social-climbing snob Hyacinth Bucket. 2008 Elections 16 2010 Elections 20 2012 Elections 61 Abortion Rights 39 Activism 26 Advertising 14 Afghanistan 166 African-American 60 Agriculture 66 Alan Waldman 51 Alaska 19 Alice Embree 43 Alternative Energy 64 Alternative Health Care 14 Alternative Media 25 American History 224 American Indians 14 American Society 276 Anarchism 15 Anti-War GIs 41 Anti-War Vets 17 Arizona 16 Art 23 Artists 23 Arts 20 Astrology 47 Austin 236 Austin Musicians 14 Authors 100 Automobile Bailout 14 Automobile Industry 17 Bank Bailouts 84 Banking 85 Bankruptcy 19 Barack Obama 132 Bernardine Dohrn 18 Bigotry 27 Bill Meacham 22 Black Liberation Movement 15 Black Panthers 17 Bob Feldman 64 Books 217 British Petroleum 24 British Television 36 Broadcast Media 44 Bruce Melton 22 Bush 124 Bush Administration 75 Bush Legacy 26 Bush Presidency 22 California 31 Campaign Finance 22 Campaign Tactics 46 Campuses 40 Canada 26 Cannabis 25 Capitalism 145 Carl Davidson 28 Cartoon 68 Catholic Church 20 Censorship 46 Central America 20 Ceremony 43 Cheney 37 Chicago 23 China 16 Christian Right 16 Christianity 22 Christmas 20 CIA 44 Civil Disobedience 16 Civil Liberties 102 Civil Rights 37 Civil Rights Movement 46 Climate Change 76 Climate Science 19 CodePink 23 COINTELPRO 17 Colombia 22 Comics 15 Community Organizing 30 Congress 191 Conservative Politics 34 Conservatives 40 Conspiracy 18 Conspiracy Theories 14 Corporate Corruption 39 Corporate Media 20 Corporate Power 45 Corruption 41 Counterculture 28 Coups d'etat 22 Criminal Justice 258 Criticism 62 Cuba 34 Dallas 14 Danny Schechter 29 Dave Zirin 29 David P. Hamilton 28 Death Penalty 14 Deaths 78 Democracy 28 Democratic Convention 22 Democratic Party 71 Dick J. Reavis 14 Direct Action 68 Dissent 22 Documentary Film 15 Domestic Spying 32 Dr. Stephen R. Keister 41 Drug Law Reform 37 Drug Legalization 15 Drug War 41 Drugs 38 Ecology 82 Economic Collapse 65 Economic Crisis 72 Economic Recovery 52 Economic Stimulus 19 Economics 76 Economy 256 Ed Felien 16 Education 68 Educational Reform 23 Egypt 16 El Salvador 15 Election Fraud 18 Electoral politics 110 Energy 98 Entertainers 18 Environment 260 Environmental Activists 18 Espionage 19 Ethics 17 Europe 30 Evangelical Christians 19 Existential Angst 37 Fascism 28 FBI 30 FDR 14 Federal Reserve 17 Feminism 24 Fiction 16 Film 88 Filmmakers 28 Finance 46 Financial Crisis 46 Folk Music 17 Food Production 14 Foreign Policy 54 Fort Hood 21 Fossil Fuels 34 Fox News 26 France 27 Free Trade 17 Freedom of Expression 20 Freedom of Press 16 Freedom of Speech 17 Fundamentalism 17 Gay 15 Gay Marriage 25 Gay Movement 17 Gay Rights 23 Gaza 33 Gaza War 38 George W. Bush 21 GI's 47 Global Economy 57 Global Warming 105 Globalization 21 Government Regulation 14 Graphics 32 Great Britain 17 Greg Moses 25 Guantanamo 45 Gulf Coast 22 Gun Laws 15 Haiti 19 Harry Targ 119 Harvey Wasserman 68 Health 27 Health Care 81 Health Care Reform 166 Health Insurance 55 Higher Education 17 Hillary 50 History 81 Homeland Security 20 Homeless 18 Homophobia 24 Honduras 25 Houston 49 Human Rights 112 Humor 200 Hunger 15 Image 26 Immigration 57 Imperialism 139 Independent Film 15 Indigenous People 24 International Law 16 Internet 68 Interview 98 Investments 17 Iran 84 Iranian Elections 14 Iraq 235 Iraq Occupation 89 Iraq Veterans 15 Iraq War 92 Iraq Withdrawal 19 Islam 28 Israel 146 IVAW 18 Jack A. Smith 23 Jay D. Jurie 16 Jazz 15 Jim Hightower 16 Jobs 18 John Ross 32 Jonah Raskin 76 Jordan Flaherty 24 Journalism 101 Journalists 36 Judaism 18 Justice 14 Karl Rove 14 Kate Braun 44 Katrina 24 Labor 43 Labor History 14 Labor Unions 71 Lamar W. Hankins 112 Larry Piltz 15 Larry Ray 30 Latin America 164 LBJ 18 Leftists 17 Literature 49 Lobbyists 17 Mainstream Media 44 Marc Estrin 61 Mariann G. Wizard 35 Marijuana 51 Marilyn Buck 14 Marion Delgado 17 Marketing 20 Martin Luther King 18 McCain 115 McCain Campaign 16 MDS 18 Media 111 Media Bias 14 Medical Marijuana 25 Medicine 75 Memoir 32 Mental Health 16 Metaphysics 48 Mexican History 14 Mexico 80 Mexico City 19 Michael James 24 Middle East 159 Militarism 17 Military 137 Military Contractors 15 Music 127 Music History 14 Music Video 14 Musicians 71 Mythology 14 National Security Agency 17 Native Americans 39 NATO 19 Natural Disasters 23 Nature 45 Neocons 15 New Left 58 New Orleans 26 New York City 15 nostalgia 17 November Election 31 Nuclear Power 48 Nuclear Weapons 19 Obama 175 Obama Administration 137 Obama Foreign Policy 34 Obama Inauguration 17 Obama Presidency 57 Obama Smear Campaign 37 Occupy Movement 25 Occupy Wall Street 52 Official Repression 16 Oil Companies 25 Oil Prices 15 Oil Spill 30 Pakistan 30 Palestine 93 Palestinian Blockade 26 Palestinian Occupation 52 Patriotism 14 Paul Krassner 20 Peace 27 Peace Activists 23 Peace Movement 264 Peak Oil 39 Pentagon 19 People 38 Personal Freedom 14 Pharmaceutical Companies 15 Philosophy 50 Photography 15 Pictures from the Long Haul 24 Podcast 51 Poetry 89 Poets 32 Police Brutality 25 Police State 25 Police Tactics 16 Political Activists 27 Political Cartoon 27 Political Corruption 46 Political Opinion 23 Political Philosophy 24 Political Prisoners 26 Political Protest 50 Political Satire 56 Political Scandal 22 Politics 63 pollution 33 Popular Culture 37 Populism 32 Poverty 54 Presidential Campaign 257 Prison Reform 15 Privacy 38 Progressive Democrats 24 Progressive Movement 65 Progressives 58 Prohibition 16 Propaganda 20 Proposition 8 14 Protest 25 Psychology 21 PTSD 15 Public Health 27 Public Opinion 22 Public Schools 22 Rabbi Arthur Waskow 27 Racism 156 Rag Bloggers 2853 Rag Radio 117 Religion 83 Religious Fanaticism 15 Religious Freedom 18 Religious Right 32 Republican Convention 15 Republican Party 175 Revolutionary Movements 23 Rick Perry 43 Right Wing 80 Right Wing Extremists 59 Right Wing Media 38 Right Wing Politics 24 Ritual 53 Robert Jensen 49 Rock 'n Roll 51 Roger Baker 33 Ron Jacobs 50 Russia 19 Sarah Palin 85 Satire 53 Science 58 SDS 90 Separation of Church and State 20 Sexism 17 Sexual Abuse 18 Sexuality 19 Sherman DeBrosse 27 Singer-Songwriters 14 Single Payer 19 Sixties 254 Slavery 19 Social Action 155 Social Activism 48 Social Change 71 Social Justice 17 Social Movements 22 Social Protest 76 Socialism 59 South America 21 South Asia 16 Spirituality 41 Sports 57 Steve Russell 16 Student Activism 14 Supreme Court 32 Surveillance 36 Sustainability 67 Taliban 16 Tea Baggers 46 Tea Party 20 Technology 64 Ted McLaughlin 81 Television 17 Terrorism 90 Texas 288 Texas History 51 Texas Legislature 22 Texas Politics 50 The Left 90 The Rag 35 The Rag Blog 44 The World 49 Theater 14 Theology 16 Thomas Cleaver 15 Thorne Dreyer 124 Tom Hayden 65 Torture 93 Transportation 41 Travel 27 U.S. Aggression 15 U.S. Foreign Policy 154 U.S. Government 142 U.S. Military 144 U.S. Senate 15 Underground Press 27 Unemployment 17 Union Busting 17 United Nations 37 Universal Health Care 64 UT Austin 20 UT-Austin 18 Veterans 27 Video 105 Vietnam 79 Vintage Television 38 Wall Street 40 Wall Street Bailout 17 War 40 War Crimes 101 War on Drugs 15 War on Terror 90 War Resisters 17 Warfare 15 Weather Underground 23 White House 14 WikiLeaks 17 Women 80 Women's Movement 19 World Economy 32 World History 82 World Opinion 16 Writers 22 Yippies 21