The French like to make fun of the British, joking about their repressed ways in matters of the heart. But when it came time to debate same-sex marriage, it was France that betrayed a deep conservative streak in sometimes violent protests - while the British showed themselves to be modern and tolerant. Putin signalled clearly on Wednesday that he did not want a dispute over the fate of former US spy agency contractor Edward Snowden to derail Russia's relations with the United States. Russia has no legal grounds to extradite fugitive US intelligence whistleblower Edward Snowden, said a lawyer on Wednesday. The relationship between Russia and the United States is more important than any intelligence scandal, President Vladimir Putin said Wednesday. Snowden has no plans to leave Russia soon-lawyer Former US spy agency contractor Edward Snowden has no plans to leave Russia soon and does not rule out eventually applying for citizenship, a lawyer helping the American with his bid for temporary asylum in Russia said on Wednesday. Members of Britain's royal family were waiting by the telephone for word of the imminent birth of Prince William and his wife Kate's first child. Chancellor Angela Merkel's center-left rivals have gone on the attack over reports of sweeping US online surveillance and German cooperation, sparked by fugitive intelligence analyst Edward Snowden. Gay marriage is to become legal in UK after the lower house of the British parliament approved the final changes to a law that had Cameron's backing but split his ruling Conservative party. China and Belarus established signed a dozen cooperation papers, including the offer of loans for Belarus' first nuclear power plant. Fugitive US intelligence whistleblower Edward Snowden has filed an official request for temporary asylum in Russia. Spain apologized on Monday for its part in the events that led Bolivian President Evo Morales'plane to be delayed earlier this month during an international search for US fugitive Edward Snowden. Each degree of global warming is likely to raise sea level by more than 2 meters in the future, the Germany-based Potsdam Institute for Climate Impact Research PIK said in a statement.