The United States Olympic Committee USOC has dismissed U.S. Senator Lindsey Graham?s suggestion of a boycott of the Sochi 2014 Olympics if Russia grants whistleblower Edward Snowden asylum. The U.S. led a boycott of the Summer Olympic Games in Moscow to protest the late 1979 Soviet invasion of Afghanistan. In response to a question about whether he would support a boycott, Graham said he would ?send the Russians the most unequivocal signal? he could send them, but the USOC has insisted that ?boycotts do not work?. ?If there are any lessons to be learned from the American boycott of 1980, it is that Olympic boycotts do not work,? USOC spokesman Patrick Sandusky said in a statement. ?Our boycott of the 1980 Olympic Games did not contribute to a successful resolution of the underlying conflict. ?It did, however, deprive hundreds of American athletes, all whom had completely dedicated themselves to representing our nation at the Olympic Games, of the opportunity of a lifetime. ?It also deprived millions of Americans of the opportunity to take pride in the achievements of our athletes, and in their dedication and commitment, at a time when we needed it most. ?While we acknowledge the seriousness of the issues at hand, we strongly oppose the notion that a boycott of the Olympic and Paralympic Games is in our country?s best interests.? The U.S. boycotted the Moscow 1980 Olympics in protest to the Soviet Union?s invasion of Afghanistan but the Soviet Union subsequently reacted by leading Eastern Bloc countries to a boycott of the Los Angeles 1984 Olympics. House Speaker John Boehner also slammed Graham?s suggestion as ?dead wrong.? ?Why would we want to punish U.S. athletes who?ve been training for three years to compete in the Olympics over a traitor who can?t find a place to call home?? Boehner said. Fugitive U.S. intelligence leaker Snowden has applied for temporary asylum in Russia three weeks after arriving at a Moscow airport from Hong Kong. The U.S. wants Snowden sent home to face prosecution for espionage. Contact the writer of this story at emily.goddard@insidethegames.biz