An attorney for a 28-year-old Nigerian man facing deportation will try to persuade immigration officials? on Monday to release his client from a Wisconsin detention center following his arrest last week. The lawyer and the man's American wife contend the arrest was unnecessary. Eugene Peba, who has been seeking political asylum in the U.S. since 2005, was picked up on Thursday while working as a nursing assistant at a North Side nursing home and transported to a detention... It's not surprising that Republicans are blaming Barack Obama's immigration policy for the high number of unaccompanied Central American kids showing up at our southern border. Unlike in Ronald Reagan's day, the modern Republican Party is generally hostile to immigration, legal or illegal. But it is a bit surprising to hear Texas Sen. Ted Cruz demand action to curb the surge of immigrants who are illegally arriving each day. Why? Because many of these children are asking for asylum... For 15 years, Aruna Vallabhaneni lived under the threat that she may be forced to return home to an abusive marriage. Vallabhaneni, 48, came to Chicago in March 1997 from her native Hyderabad, India, to escape her spouse, Koteswara Rao, who she said routinely beat her and threatened to kill her. But partly due to unclear federal regulations recognizing domestic violence as a basis for political asylum, she was always in danger of being sent... Russian President Vladimir Putin is normally trolling the global media at this time of year by posing shirtless and engaging in various camera-friendly summer sports like swimming and fishing. But this summer, he's being out-trolled and is stuck answering questions about an entitled American twerp living in Moscow's Sheremetyevo airport. Secret-leaking former NSA contractor Edward Snowden recently attended a press conference inside the airport's transit zone and... An attorney for a 28-year-old Nigerian man facing deportation will try to persuade immigration officials Monday to release his client from a Wisconsin detention center after his arrest last week. The lawyer and the man's American wife contend the arrest was unnecessary. Eugene Peba, who has been seeking political asylum in the U.S. since 2005, was picked up Thursday while working as a nursing assistant at a North Side nursing home and transported to a detention... GOGLAND ISLAND, Russia Reuters - President Vladimir Putin said on Monday he wanted Edward Snowden to leave after three weeks holed up at a Moscow airport, but also signaled that the former U.S. spy agency contractor was moving towards meeting Russia's asylum conditions. Snowden flew to Moscow's Sheremetyevo airport from Hong Kong on June 23 in the hope of travelling on to a country that would offer him protection from the United States after he divulged details of... The Kurds who were abandoned near the French Riviera pressed their case for political asylum Monday, even holding a sit-down strike in the military camp where they are being held. Apparently none of the 900 Kurds has any identification, which is not uncommon among people transported by smuggling networks. They may be anxious to establish that they came from Iraq to strengthen their pleas. A public argument has developed over whether to welcome the Kurds or just... LONDON Reuters - Former U.S. spy agency contractor Edward Snowden, wanted by Washington on espionage charges for revealing the secret U.S. electronic surveillance program Prism, has applied for political asylum in more than a dozen countries. The 30-year-old American remains in legal limbo in the transit area at Moscow's Sheremetyevo Airport. He has no legal travel documents and has made his asylum applications through a legal representative. Here is a list of... Luba doesn't fit the popular perception of a political refugee. Before arriving in Chicago two years ago, the 44-year-old lawyer was abused by her husband, an unsavory character with political clout in her native Ukraine. For years, Luba suffered insults, humiliation and beatings at the hands of her spouse. Once, he tried to lock her up in an insane asylum. On another occasion he almost ran her down with his car. The police were useless; he controlled them. I tried to escape, but he would track me down using... WASHINGTON, June 26 Reuters - The chairman of the Senate Foreign Relations Committee said on Wednesday he would lead an effort to end preferential trade access now provided to goods from Ecuador if the South American nation offers political asylum to fugitive former NSA contractor Edward Snowden. Senator Robert Menendez also called on Russia to stop sheltering Snowden and immediately turn him over to the United States. Reporting by Patricia Zengerle; Editing by... When Alina Kopiec and her boyfriend left Poland in 1987, after receiving threats from the Communist goverment because of their support for the then-outlawed Solidarity trade union, they hoped they would soon be granted refugee status by the United States and allowed to settle in this country. They lived in West Germany for almost two years before Kopiec, a factory worker from a small town near Krakow, received permission to move to Chicago last February. But her boyfriend,... QUITO Reuters - Ecuadorean Foreign Minister Ricardo Patino said on Sunday that former U.S. National Security Agency contractor Edward Snowden had asked Ecuador for asylum. The Government of Ecuador has received an asylum request from Edward J. #Snowden, Patino, who is on an official visit to Vietnam, said on Twitter. Patino did not give additional details. WikiLeaks spokesman Kristinn Hrafnsson confirmed that Snowden had requested asylum in Ecuador. The... A hijacked Sudan Airways plane carrying 199 passengers and crew members was flying early Tuesday morning toward London, where its armed hijackers intend to surrender and seek political asylum, police said. The Airbus 310 Flight 150 was hijacked Monday evening on its way from Khartoum to the Jordanian capital Amman. It landed at Larnaca airport in Cyprus after it ran low on fuel. One hijacker apparently was armed with grenades and TNT and had threatened to blow up the plane unless... AMSTERDAM Reuters - A Russian opposition activist has been found dead in the Netherlands after being refused political asylum, the Dutch justice ministry said on Thursday. Alexander Dolmatov fled Russia in June after police raided his parents' apartment last year. He was under investigation for alleged involvement in violence at a protest against Vladimir Putin on the eve of his inauguration as president. Dolmatov was found dead in a Dutch detention center... A business leader who served as Venezuela's president during last month's brief coup against President Hugo Chavez asked Colombia for political asylum on Thursday after fleeing from house arrest in his Caracas apartment. Pedro Carmona, 61, a businessman and leading opponent of Chavez, had been in the custody of state security police since April after heading a short-lived transition government during the April 11-14 ouster of the leftist leader. Carmona has not been formally... The recent military coup has shown Haiti exactly who she can depend upon in times of need; or better yet, who she cannot depend upon. Imagine being cooped up in a U.S. Coast Guard cutter waiting to hear whether any Caribbean, South American, Central American or North American government will even listen to your request for political asylum. When Haitian refugees sought political asylum after a Sept. 30 military overthrow of its first democratically elected president, Jean-Bertrand... A Russian reporter who wrote a book critical of the Kremlin and later escaped injury in a bomb explosion said Wednesday that Britain has granted her political asylum. Yelena Tregubova, 34, said her life was in grave danger in Russia. I don't have a single doubt that returning home would mean putting my life in mortal danger, she said in a phone interview from London. The book: Tregubova's 2003 book Tales of a Kremlin Digger accused President Vladimir Putin of stifling freedom of...