Saturday night, the Rev. Otis Moss III's 12-year-old son asked him a question that he said pierced his heart and soul. Moss and religious leaders throughout Chicago urged their members Sunday to channel their anger into constructive social change. Many are disappointed today, we are devastated from what we like to call a punch in the mouth by the judicial system, said Ira Acree, a pastor who hosted a gathering of religious leaders Sunday at Greater St. John Bible Church in the North Austin neighborhood. We will fight back. Not with violence but with our voice. With discipline, with dignity and with restraint. Officials across the country had braced for riots and other protests like the ones that raged in the immediate aftermath of Martin's death. Aside from a small, peaceful demonstration downtown, most public reaction to the verdict in Chicago was expressed on stoops and in church pews. At least 150 people gathered outside the Daley Center on Sunday to protest. I have a Trayvon, said Linda Daniel, who is black and a teacher from Hyde Park. My granddaughter lives in a completely white community. She could be another Trayvon Martin. I'm appalled. I'm disgusted to be an American at this moment, she said. The verdict was a travesty, said the Rev. Michael Pfleger, pastor at St. Sabina Catholic Church in the Gresham neighborhood. But, he said, we must not let injustice pull us to the low ground of violence ever. People are tremendously angry, said Marshall Hatch, pastor at New Mount Pilgrim Missionary Baptist Church in West Garfield Park. But even more, what we found in our churches today: fear. Many in the African-American community said Martin's killing seemed to excuse killing a black man just because he looks suspicious. That's really what gets people upset: The message that it sends that our lives are not being valued, said Bernard Jakes, a pastor at West Point Missionary Baptist Church on the South Side who was among about a dozen religious leaders who gathered at Acree's church to discuss the verdict. It is of course just beyond belief to many that an unarmed teenager somehow ends up being the one on trial and having to prove that he himself is no threat to anyone, Hatch said at a news conference at the church. Ministers and civil rights leaders from more than 100 cities planned to hold a conference call Sunday night to discuss ways to mobilize around the Zimmerman verdict, Acree said. One idea is to hold prayer vigils outside federal courthouses. It wasn't just pastors who were worried that the verdict could spark violence in Chicago. Rep. Danny Davis, a Chicago Democrat, stopped by the church to endorse the pastors' message. Look, let's be cool, Davis said. Tearing up the neighborhood doesn't bring Trayvon Martin back. The Rev. Moss began his comments about the Martin case Sunday by citing Jeremiah 31:15: A voice is heard in Ramah / lamentation and bitter weeping. / Rachel is weeping for her children; / she refuses to be comforted for her children / because they are no more. He then paraphrased it to talk about the Martin family's loss, praising members of the family for carrying themselves with the utmost dignity. Moss also said the Zimmerman trial was about more than race and murder. He criticized gun laws supported and funded by NRA lobbyists and criticized Florida's stand your ground law. After Moss' son asked him about Martin's fate, the two discussed injustice. As they talked, the 12-year-old began drawing pictures he'd seen on the Internet of Martin with his arms around civil rights icon Emmett Till, of Chicago, to whom some have compared Martin. There might be a great lesson in the child's artwork for everyone, Moss told the congregation. Maybe we are called to draw. Not to get angry but to draw, Moss said. Create a new world.