Updated 8:51 a.m. ET MIAMI Three jurors in George Zimmerman's second-degree murder trial initially favored convicting him of that offense or manslaughter, but the six-woman jury ultimately voted to acquit him after more closely examining the law, a juror in the case said Monday. Zimmerman was charged with second-degree murder in the fatal shooting of 17-year-old Trayvon Martin last year, but the jury also was allowed to consider manslaughter. The woman, known as Juror B37, told CNN's Anderson Cooper that when the jury began deliberations Friday, they took an initial vote. Three jurors -- including B37 -- were in favor of acquittal, two supported manslaughter and one backed second-degree murder. She said the jury started going through all the evidence, listening to tapes multiple times. That's why it took us so long, said B37, who said she planned to write a book about the trial but later had a change of heart. When they started looking at the law, the person who initially wanted second-degree murder changed her vote to manslaughter, the juror said. Then they asked for clarification from the judge and went over it again and again. B37 said some jurors wanted to find Zimmerman guilty of something, but there was just no place to go based on the law. CBS News legal analyst Jack Ford said Florida's rules on finding someone guilty of manslaughter are confusing. He also stated that the Zimmerman jury's initial split vote is quite normal. All jurors approach things differently, Ford said. B37 said jurors cried when they gave their final vote to the bailiff. I want people to know that we put everything into everything to get this verdict, said the juror, whose face was blacked out during the televised interview but who appeared to become choked up. Juror B37 also claimed that the jury did not believe race played a factor in the situation, something Ford said could have wider implications for Zimmerman. If the Department of Justice is going to jump in here and charge him, it's not going to be for murder or manslaughter, Ford said. It's going to be for a criminal civil rights violation, and what they have to prove then is that indeed George Zimmerman attacked Trayvon Martin and it was all done as a consequence of racial animosity. Ford said earlier investigations into the case concluded as well that race did not play a factor, something activists across the country disagree with. Either way, the jurors admission on race could give potential prosecutors pause. The interview came two days after the jury acquitted Zimmerman, a former neighborhood watch activist, of second-degree murder in the shooting death of Martin in a gated community in Sanford, Fla. Martin was black, and Zimmerman identifies himself as Hispanic. Zimmerman was not arrested for 44 days, and the delay in charging him led to protests from those who believed race was a factor in the handling of the case. While prosecutors accused Zimmerman of profiling Martin, Zimmerman maintained he acted in self-defense. Juror B37, the only juror to speak publicly about the case so far, said Monday that the actions of Zimmerman and Martin both led to the teenager's fatal shooting, but that Zimmerman didn't actually break the law. While Zimmerman made some poor decisions leading up to the shooting, including leaving his car when police told him not to, Martin wasn't innocent either, the juror said. I think both were responsible for the situation they had gotten themselves into, said the juror. I think they both could have walked away. The juror said Sanford Police Detective Chris Serino made a big impression on her, because he would have been accustomed to dealing with murders and similar cases. He would have known how to spot a liar, and yet he testified that he believed Zimmerman, the juror said. Legal analysts agreed that Serino's testimony was a blow to the state's case. The Sanford police were criticized last year for not arresting Zimmerman, and Gov. Rick Scott later appointed a special prosecutor, who brought charges against the neighborhood watch volunteer. The juror said she didn't think Martin's race was the reason that Zimmerman followed him on a dark, rainy night. She said she also believed Martin threw the first punch and that Zimmerman, whom she referred to as George, had a right to defend himself. I have no doubt George feared for his life in the situation he was in at the time, the juror said. The juror said she was not impressed by the testimony of Rachel Jeantel, who was talking with Martin by cell phone moments before he was fatally shot by Zimmerman. I didn't think it was very credible, but I felt very sorry for her, the juror said. She didn't want to be there. The juror also commented on defense attorney Don West's knock-knock joke about knowing who Zimmerman was during opening statements. The joke was horrible. Nobody got it, she said. Juror B37 outlined to CNN the process she and the other five jurors went through in their deliberations. She said they spent the first day electing a foreman and getting organized. She said the jury instructions weren't immediately clear and the evidence was in no order whatsoever. She said it was a difficult process. We thought about it for hours and cried over it afterwards, she said. I don't think any of us could ever do anything like that ever again. Martin Literary Management announced Monday that it was representing B37 and her husband, who is an attorney. The names of the jurors have not been released, but during jury selection it was disclosed that B37 works in an unspecified management position and has two adult children. But agency head Sharlene Martin released a statement late Monday saying she was no longer representing the juror and that the juror had dropped the book idea. It included a statement that she said was crafted in conjunction with the agency in which the juror explained that being sequestered had kept her shielded from the depth of pain that exists among the general public over every aspect of the case. The juror said that the book was meant to show that our justice system can get so complicated that it creates a conflict with our 'spirit' of justice. The Associated Press was unable to reach the juror. Jeantel told CBS Miami station WFOR-TV it wasn't until she walked into the courtroom to take the stand and was face-to-face with Zimmerman that the loss of her friend began to seep in along with the possibility Zimmerman might not be convicted. He looked like someone who didn't really care, like, 'Yep, I did it, ' Jeantel said. In another interview, Jeantel was asked by CNN's Piers Morgan whether she thought race was a factor in Zimmerman's decision to follow Martin prior to their fight. It was racial, she said. Let's be honest. Racial. If he were white, if Trayvon was white and he had a hoodie on, what would happen? She noted that the altercation happened in the early evening, when many people are out walking their dogs or doing other things. Morgan played back a recording of the juror's comments to CNN about Jeantel's education level and speech, and the witness said it made her sad and angry. Jeantel, who is black, said she also had a feeling that the jury would return a not-guilty verdict. They're white, she said of the jury at one point. Well, one Hispanic. But she's stuck in the middle. I had a feeling it was going to be a 'not guilty. ' While the court did not release the racial makeup of the jury, the panel appeared to reporters covering jury selection to be made up of five white women and a sixth who may be Hispanic.