As chants of Leave! rang out around Cairo on Sunday, the presidency insisted dialogue was the only way out of the crisis. Despite the peaceful atmosphere of the day, as night fell, isolated acts of violence left two people dead. It is the biggest protest in Egypt's history, a military source told AFP on condition of anonymity, adding that millions of people were on the streets across the country. One person was killed in the central province of Assiut when gunmen on a motorbike opened fire on protesters, a security official said. Another person died and 40 others were injured when clashes broke out between supporters and opponents of Morsi in Beni Sueif province, south of Cairo. Both incidents took place outside offices of the Freedom and Justice Party, the political arm of Morsi's Muslim Brotherhood. Dozens of thugs also attacked the Brotherhood headquarters in Cairo with petrol bombs, birdshot and stones, Gehad al-Haddad, a spokesman for the Islamist movement said. Morsi's spokesman Ehab Fahmy, meanwhile, insisted on the need for a national dialogue. Dialogue is the only way through which we can reach an understanding.... The presidency is open to a real and serious national dialogue, Fahmy told a news conference. The call fell on deaf ears as the main opposition coalition called for a campaign of civil disobedience and urged Egyptians to stay on the streets until Morsi stepped down. The National Salvation Front urged all the revolutionary forces and all citizens to maintain their peaceful rallies in all the squares and streets and villages and hamlets of the country, and not to deal with the Brotherhood government until the last of this dictatorial regime falls . Australian Foreign Minister Bob Carr has warned Australians travelling to Egypt to exercise a high degree of caution due to the risk of civil unrest . ?Large protests are reportedly planned or are under way in Cairo, Alexandria and other cities, Senator Carr said. ?Australians planning to travel to Egypt should remain alert, register their travel with our Embassy in Cairo and monitor any travel advice issued by authorities or consular staff. Anti-Morsi protests were also held in the coastal city of Alexandria, the Nile Delta cities of Mansura, Menuf, Tanta and Mahalla, the canal cities of Suez and Port Said and in the president's hometown of Zagazig. In Cairo's iconic Tahrir Square, protesters waved red cards and Egyptian flags as patriotic songs boomed from large speakers. This is the second revolution and Tahrir is the symbol of the revolution. The revolution will be launched from here, said Ibrahim Hammouda, a carpenter who had came from the northern city of Damietta to join the protests. In 2011, when hundreds of thousands of people took to the streets to end Mubarak's authoritarian three-decade rule, they held up posters of regime figures with their faces crossed out. This time, protesters are holding pictures of senior leaders of the Muslim Brotherhood, from which Morsi hails. Morsi was elected a year ago in Egypt's first ever free vote. But today, his critics accuse him of betraying the revolution by concentrating power in the hands of Islamist groups. They accuse him of breaking his promise to be a president for all Egyptians and letting the economy dive into free fall. I'm here because Morsi, who I voted for, betrayed me and did not keep his promises. Egypt will be liberated again from Tahrir Square, said Mohammed Samir who travelled from the Nile Delta city of Mansura. The Tahrir protest began hours before scheduled rallies and marches, with several hundred people having spent the night in the square. Street vendors sold flags and patriotic songs boomed from loudspeakers. On the outskirts of the square, security checkpoints were manned by protesters in fluorescent vests under signs reading: No entry to the Brotherhood . We are protecting the revolution from those who are against the revolution, said protester Essam Ahmed. Egypt is deeply divided between Morsi's mainly Islamist supporters and a broad-based opposition that also includes many deeply religious Muslims. Morsi, you hypocrite, you have split the people in two! the protesters chanted in Tahrir. The Muslim Brotherhood was long banned under Mubarak's regime, but since the revolution they have dominated parliament, drafted a controversial constitution and been given key cabinet and local government positions. The Brotherhood did not continue our revolution and insisted on monopolising the state, said Mohammed Abdel Wahab, a marketing manager from Cairo who came to Tahrir with his family. Morsi supporters have been holding counter rallies for days to defend his legitimacy and have vowed to stay on the streets as well, raising fears of confrontations. But Sunday's anti-government protests eclipsed their gathering in Cairo's Nasr City neighbourhood, which the army estimated to number around 25,000 people. Police and troops have deployed at key buildings nationwide, including the vital Suez Canal waterway, security officials said, and hospitals were put on high alert. Banks and most offices closed on Sunday, a working day in Egypt. The grassroots movement Tamarod - Arabic for rebellion - said it collected more than 22 million signatures to a petition demanding Morsi's resignation and new elections. The figure, which compares with the 13.2 million votes to 12.3 million by which Morsi won election last year, cannot be verified.