Home Topics Columns Stations Espa?ol Donate Democracy Now! correspondent Sharif Abdel Kouddous reports from Cairo six days after the Egyptian army ousted President Mohamed Morsi. I think the only way forward is for all sides to come to the table and for the Muslim Brotherhood to hopefully be invited in a real way to take part in this process, because if they?re excluded, I think we?ll see instability for a long time, Kouddous said. Watch Democracy Now! Thursday for a new interview with Sharif Abdel Kouddous about the latest developments in Egypt. See all of our Egypt coverage. AMY GOODMAN: This is Democracy Now!, democracynow.org, The War and Peace Report. I?m Amy Goodman. We turn now to Egypt, where members of the Muslim Brotherhood have called for an uprising one day after Egyptian armed forces shot dead more than 50 supporters of ousted President Mohamed Morsi during a protest outside Cairo?s Republican Guard barracks where the deposed leader is believed to be held. Over 400 people were injured in the clashes. The army claims it acted in self-defense. Members of the Muslim Brotherhood have vowed to continue protesting Morsi?s removal from office. AMY GOODMAN: As tension rises, the military-backed interim government announced Egypt will hold new parliamentary elections once amendments to its suspended constitution are approved in a referendum. Meanwhile, in Washington, D.C., the White House has said it?s not about to halt aid to Egypt, including the $1.3 billion it gives the military. During a press conference, White House spokesperson Jay Carney struggled to explain how Washington could avoid calling the ouster of Morsi a coup. AMY GOODMAN: That?s the White House spokesperson, Jay Carney, in Washington. We go now to Cairo, where we?re joined by Democracy Now! correspondent Sharif Abdel Kouddous. Sharif, can you describe what has happened over the last 24 hours since we last spoke? SHARIF ABDEL KOUDDOUS: Well, as you mentioned, there was that bloodbath at the Republican Guard, 51 people killed?at least 51 killed, over 450 injured. And since we last spoke, the army has held a press conference, with the army spokesman, of course, defending its use of force, as the army has done for the past two-and-a-half years. And it claimed that the Muslim Brotherhood or the pro-Morsi protesters had attacked it first, although they gave no conclusive evidence to back this up. They did say that two policemen and two soldiers were killed. But, I mean, the army spokesperson went so far as to say to the Associated Press that they used no excessive force and that it would? It would have been excessive only if we killed 300. And that?s a quote that he gave to the AP. So, you know, this fits a pattern of the army trying to legitimize its brutality, and we?ve seen this before in Maspero in October 2011, when the army killed 27 unarmed protesters. They killed 16 protesters a month later in?I?m sorry, two months later, in December of 2011. So, you know, this does fit a pattern of army excessive use of force, of army brutality and of trying to whitewash its crimes. We?ve also seen since Morsi?s ouster, you know, an increase in the polarization in the media that has been steadily growing since Morsi came into office, and it has really gone into a very vicious two sides. And if you watched state TV or private TV channels like CBC, which is, you know, funded by businessmen tied to the former regime, they really practiced an extreme form of bias, of partisanship, really just parroting the military?s version of events, calling the pro-Morsi supporters terrorists, replaying the videos that the army provided to them that show Morsi supporters throwing rocks at the army and once in a while firing, as well, at the army, so?and not really showing any sympathy or empathy or reporting even on the deaths?I mean, these were dozens of people that were killed, that were shot and killed?not showing, you know, the?their footage of the casualties. So, you know, this is a big problem. And it?s also?the army has closed down the pro?well, the Brotherhood?s official channel, Misr 25. It has closed down three other pro-Morsi channels. So there?s really reduced coverage for the other side. And they?ve been trying to put things up on the Internet, on YouTube and so forth. I mean, the media outlets of the Muslim Brotherhood haven?t been any better in the past in practicing this kind of partisanship and demonization. You know, they?ve often used very sectarian language. The group?s official website claimed that the military-appointed president, Adly Mansour, was secretly a Jew, and, you know, so these kinds of just outrageous claims that we see. But it really speaks to a growing divide, I think, in Egyptian society, and both sides playing, you know, to their constituencies, but using this demonization that?s only making things worse, actually. AMY GOODMAN: What is the feeling? I mean, the number of people who were in the streets last Sunday, as you said, these are the largest protests even beyond what happened in 2011 during the Egyptian revolution in Tahrir. What is the response of the pro-democracy forces, who also wanted?who wanted Morsi out, to what has taken place? SHARIF ABDEL KOUDDOUS: Well, I think many people who started protesting when this revolution began and have consistently rejected authoritarian regimes, whether it be Mubarak, whether it be the Supreme Council of the Armed Forces that replaced him, or whether it be the Muslim Brotherhood, have consistently called for participation in government, you know, a rejection of this kind of state policy. And I think many of them blame Mohamed Morsi for driving the country to this point where the military found that it could step in and initiate this coup. You know, Morsi, his government, they didn?t fulfill hardly any of the campaign promises that they did. I know that?s not new to politicians, but it was?I mean, this was an extreme version of this. He sought, I think, in many ways, to?instead of address people?s grievances, he sought to co-opt the state that Mubarak left behind. So we saw him, you know, trying to?giving promotions and praise to the police, and even in the wake of killing?the police killed 50 citizens or over 50 citizens in Port Said just this past January. He showered them with praise and thanked them for their role in the revolution. We saw no real meaningful discussion with activists or NGOs or civil society on any kind of state policy. We saw no?we saw really just an isolation and an alienation and not giving any real negotiation with the political opposition, pushing through a slipshod constitution that was very, very divisive, and really not dealing with the economy or any of these things. So all of these things come together, you know. I think in the final days of Morsi?s rule, there was a chance for him to offer some real concessions and avoid this military stepping in and initiating this coup. He could have offered a referendum on his rule. He could have stepped down and resigned and offered to be part of a new government. But he?they declined to do that. They were very stubborn and headstrong and refused to see that the popular anger in the country had grown to such an extent that it brought millions of people into the streets. And really, there was no way he could have governed the country in any real way. He had a very tenuous hold on power. So he needed some negotiation, and I think the fact that he didn?t gave the military this window to come in and take charge. And, you know, people who opposed Morsi, many of them did welcome the military?s intervention, but I think many didn?t. And we?re seeing what the effect of having the military at the helm of power is in, you know, the killing of 50 people on the streets of Egypt. AMY GOODMAN: Sharif, Agence France-Presse just tweeted a few minutes ago, Egypt?s Tamarod slams interim charter as 'dictatorial.' Explain what Tamarod is and the significance of this. SHARIF ABDEL KOUDDOUS: Well, Tamarod is a?it started out as a grassroots campaign to, on May 1st, Labor Day, in Tahrir Square, to collect signatures on a petition that was calling for withdrawal of confidence from Mohamed Morsi and for early presidential elections. It was the first group to call for these June 30 protests. The simplicity, I think, of their idea, which was just hand it out in streets and government offices and universities, this petition, really gained traction, and it gained millions of signatures?by their count, 22 million, although that?s not verified. But so, they?ve been a significant force here. They?ve had a seat at the table in the post-Mubarak army-backed interim government and have a say. So, what they?re referring to is that the interim president, Adly Mansour, made a constitutional declaration last night. And as with all governance in Egypt, this happened at midnight. It was very late. And it was a?and it sets a very speedy timetable for this army-led transition that we?re supposedly going to go through. And the first thing would be to amend the 2012 constitution, that was really pushed through by the Brotherhood, and have a referendum on that in about four months. And then parliamentary elections would be called a couple of weeks after that, possibly within six months from now, so maybe in February we?d have parliamentary elections, followed by presidential elections, and the possibility of all of this being concluded within one year. Some critics are saying that this declaration repeats a lot of the same mistakes that the first army-led transition did when?following Mubarak?s ouster. It was drawn up by an anonymous committee. It promises inclusiveness, but it gives no procedural guidelines of how to organize inclusiveness or go about that. And the timetable is very rushed. It also very clearly is one that gives the military?you know, defends military powers. It allows for military trials of civilians and so forth. I think it?s also noteworthy that they seem to have given an olive branch to Islamist groups, because the decree includes the same controversial language of the suspended constitution that defines the principles of Islamic sharia in?sharia law in a very?in a precise way that, I think, placates groups like the Nour Party, which is the largest Salafi party and the only Islamist group that is participating in these?in this post-Morsi transition. However, having said that, they have suspended participation temporarily following yesterday?s killing of 51 people. AMY GOODMAN: We also just read a tweet from Egypt Independent that Egypt will open Rafah border crossing on Wednesday, according to state TV. The significance of this, Sharif? SHARIF ABDEL KOUDDOUS: Well, that would be very encouraging, because the Rafah border crossing, as we know, is the only border in Gaza not controlled by Israel, and it?s really its gateway to the outside world because of Israeli security restrictions. And since the crisis began, the Rafah border crossing has been closed completely, as?and they?ve also closed a lot of the underground tunnels where a lot of trade happens, as well. And this is causing a severe fuel crisis that is threatening to close a lot of stations that collect sewage, halt water treatment plants, restrict the transportation of rubbish by dump trucks. And it?s also stranded thousands of Gazans from going in and out of the territory, so people trying to get into Gaza and people trying to leave. And this is?you know, as with so many other situations in the Arab world, the Palestinians are usually forgotten. But this political crisis and unrest in Egypt has really had a strong effect on Gaza. So news that the Rafah border crossing will be opened, I?m sure, will be heartily welcomed. AMY GOODMAN: On Monday, Sharif, the head of Egypt?s leading Islamic institution called for an end to Egypt?s violence. In a televised statement, Ahmed al-Tayeb, the grand sheikh of Al-Azhar, said he would be forced to go into seclusion at home if the bloodshed doesn?t end. AMY GOODMAN: Who is Ahmed al-Tayeb? And the significance of this statement, Sharif? SHARIF ABDEL KOUDDOUS: Well, Al-Azhar is, you know, a thousand-year-old university, one of the world?s oldest, and it is the most important seat of Sunni jurisprudence and learning. And the grand sheikh of Al-Azhar is a very important voice and is seen as a moderate face?or the face of moderate Islam. And his speech yesterday, where he called on, you know, an independent committee to investigate the violence and called for the transition to be very quickly to get the army out of politics, was significant. And, you know, I think that the problem is, is that we?re seeing both sides?you know, the army and people who support them and the Muslim Brotherhood see everything as a zero-sum game. The stakes for everybody are existential. And this is precipitating a lot of violence. And, you know, after the killing of dozens of people like that, that harken?for the Muslim Brotherhood really recalls their oppression under so many successive autocratic regimes. Really, there hasn?t been this kind of brutality against them by the army since 1954 under Gamal Abdel Nasser. So, this may really radicalize elements of their movement, which has been peaceful for a number of decades now, and drive also supporters outside of the Muslim Brotherhood to take violent action, which could really, you know, send Egypt into a spiral of violence, but almost more dangerously, bring back the security state of Mubarak in an even more entrenched way. And, you know, as one senior Muslim Brotherhood member told me, he said, Look, they?re clamping down on us. But as soon as they are firmly in power, they?re going to clamp down on all of you, as soon as you start speaking out. So, this is the danger of a retrenched authoritarianism in Egypt, that there?s a lot of nationalism with the army and, you know, all these patriotic songs, and we keep seeing jets fly over painting the Egyptian flag and colors and all of this. And for the first time?yesterday, before the army gave that press conference, the person who spoke before was a police chief, and it was the first time I saw something like this. The police has also ridden this wave of popular anger against Morsi to seek to re-establish itself and whitewash all of its crimes. And the police spokesperson was saying some ridiculous things, like, We protected protesters in Mohamed Mahmoud, you know, while people were rioting, when in fact they killed 45 protesters in Mohamed Mahmoud, which is the street leading off of Tahrir. So, we have?and for the first time we see the police in Tahrir being hugged by protesters. And so, it?s this kind of embracing and embrace of the state security apparatuses that is very worrying and can allow the authoritarian nature of the regime to really grow and use that to clamp down on the Islamist opposition, and who have now become opposition. And, you know, I think the only way forward is for all sides to come to the table and for the Muslim Brotherhood to hopefully be invited in a real way to take part in this process, because if they?re excluded, I think we?ll see instability for a long time. AMY GOODMAN: I want to ask you about press freedom in Egypt right now. One of Al Jazeera?s correspondents was kicked out of a government news conference by other reporters, who later applauded the spokesman. AMY GOODMAN: That was the reporter being kicked out of the news conference by other reporters, and the reporter was from Al Jazeera. Well, last week, authorities detained dozens of Al Jazeera?s reporters, and a spokesperson for Al Jazeera has spoken out against the intimidation, saying, quote, We?ve always given all sides of opinion airtime on Al Jazeera, it?s our mantra. As we saw at today?s astonishing press conference though, large sections of the Egyptian media object to this open-minded ethos, the spokesperson says. This comes as about 22 Al Jazeera employees of Al Jazeera Egypt have reportedly resigned because they say they disagree with the outlet?s editorial perspective supporting the Muslim Brotherhood, saying it favors Islamists. Can you explain what the different Al Jazeera outlets are and what is actually happening with the press? SHARIF ABDEL KOUDDOUS: Right. Well, I mean, I think, you know, everyone?s familiar with Al Jazeera, founded in 1996, and it was really a groundbreaking news channel in the Arab world that brought debate and criticism of Arab regimes and was criticized by autocratic despots across the region, as well as the United States, as well as Israel, and really kind of shook up the media landscape in the Arab world. And since then, it has spawned a lot of affiliates, including Al Jazeera English, which many people in the United States would know, but also a lot of local affiliates. So, in Egypt we have Al Jazeer Mubasher Misr, which just covers Egyptian issues and Egypt?s politics. And they?you know, they have this all around the world. Since the Arab Spring, or so-called Arab Spring, I think, you know, many analysts see a deterioration in Al Jazeera and a growing bias, especially?I?m talking mostly about the Arabic channel here?towards Qatar?s foreign policy, so, in Syria, a kind of a complete support for the rebels and a lack of criticism of, you know, the many human rights abuses that opposition rebels have committed and the complexity of the situation, and in Egypt, the backing of the Muslim Brotherhood. Qatar itself has funded the Muslim Brotherhood?s government, or helped it support it by injecting billions of dollars in cash over the past year to help prop up the Egyptian economy. So, we?ve seen in this coverage quite one-sided coverage that is favorable to the Muslim Brotherhood and Mohamed Morsi over the span of the past two years. And this has been noticed by, you know, people who watch the media here. So it?s seen as a pro-Brotherhood channel. Having said that, you know, in the wake of Morsi?s ouster, we see this very troubling crackdown on pro-Morsi channels. And as I mentioned before, they closed down a few of them. And as you mentioned, they stormed Al Jazeera Mubasher Misr, the one that covers Egypt. They arrested a couple dozen of their workers. They kept the director?and they subsequently released them, then they kept their director general overnight, and he had to pay a 10,000 Egyptian pound fine, which is about $1,500, on charges of illegally operating a channel and also a charge of, I think incitement to violence, but I?m not sure. So, you know, that?s very worrying. And it was very worrying yesterday when we saw these journalists, or so-called journalists, at this army press conference chant and kick out this Al Jazeera reporter and, you know, refuse to allow the press conference to start until the crew left the building. And then, at the end of the army press conference, they applauded, you know, the army?the army spokesperson and applauded Egypt in this very nationalistic way. So that was?that?s also very troubling. And also, Al Jazeera English has come under threat, as well. There?s been leaflets passed out that are very intimidating?picture of a bloodied hand?that are outside their offices also. So, you know, it?s a troubling?it?s a troubling successive nature of?sequence of events against media freedom here in Egypt. And we know the history of the army and the Mubarak regime, and the police are not very open to criticism of their rule. AMY GOODMAN: And the 22 Al Jazeera Egypt staff who quit yesterday? SHARIF ABDEL KOUDDOUS: Right, they quit and have told the press or released a statement saying that they were quitting because of bias from the channel and of editorial?you know, people getting involved in editorial decisions to skew the coverage towards Morsi and the Brotherhood. And I?m not sure more about what happened with that, but I think it?s quite significant. AMY GOODMAN: Sharif, you mentioned that Qatar has given the Muslim Brotherhood government, you know, billions of dollars. Now, the U.S. government also in the last year has continued the tradition of giving Egypt something?well, well over $1.3 billion. And I wanted to ask about this issue. You see what?s happening in Washington, the U.S. government not wanting to call what happened a coup, because, I presume, that would jeopardize the ability of the U.S. to continue to support the Egyptian government, right? That it would go against U.S. law if they then gave money to the coup, so they?re just not calling it a coup. SHARIF ABDEL KOUDDOUS: Right. I think they?re in a difficult position. They?re trying to figure out what exactly to do, who to back. And I think you?re right, if they do call it a coup, that that triggers certain implications legally for this foreign military financing that the United States has backed Egypt with for decades now. But if you look at it from a broader point of view, you know, has?the United States has backed Egypt through the authoritarian regime of Hosni Mubarak, an undemocratic autocracy that engaged in widespread police brutality, for three decades. They then backed the?or continued their funding of the Supreme Council of the Armed Forces, that took over from Hosni Mubarak. They then backed the Muslim Brotherhood, while not wholly embracing them, but certainly seeing a partner that they could work with that would fulfill their national security objectives. So I think, you know, the U.S. policy has not changed much, right? And it?s just?it has always trumped national security over rule of law. And even Secretary of State John Kerry in April bypassed restrictions in Congress that required the State Department to certify that Egypt is moving towards the rule of law. And in the letter that was leaked to The Daily Beast, he outlines those objectives, which are access to the Suez Canal for oil, overflight rights for warplanes, a prevention of attacks, he said, from Gaza into Israel, and so forth. And just a couple weeks later, 45 NGO workers, 15 of them Americans, were convicted, but they were in absentia, to between one and five years in prison, including the son of the transportation secretary, Ray LaHood. And this enraged people in Congress. And yet, the United States has continued this policy. So I think it?s trying to find where?where it goes in terms of policy here. But I also have to mention, I?ve never seen the level of anti-Americanism and xenophobia in Egypt as in the past few weeks. Both sides are demonizing the United States. The Muslim Brotherhood and the pro-Morsi camp are saying that this coup could not have gone forward without a green light from the United States, by this military that is, you know, totally backed by the United States, with the tune of $1.3 billion. And so, its supporters are very angry. And the anti-Morsi camp is extremely angry at?if you go to Tahrir, you see the pictures of Obama, you know, with like a beard and a turban, as if he?s Osama bin Laden, and pictures of the ambassador with her face crossed out, Anne Patterson. And they see this as?the U.S. as having backed Mohamed Morsi and the Muslim Brotherhood, and not spoken out despite repeated transgressions and repeated protests and repeated police abuse over the past year. So, you know, the U.S.?and I have friends here who are American citizens who say they haven?t felt this level of xenophobia against them in a while. AMY GOODMAN: Sharif, interestingly, on Monday night Associated Press editors advised staff that, quote, Coup now seems to be an accurate term for what transpired, unquote, this according to a staff memo that was obtained by The Huffington Post. Editors urged reporters to make clear that the military?s toppling of the elected Egyptian president was, quote, spurred by a popular revolt against the Islamist-dominated government, whose adherents resisted the coup, unquote. SHARIF ABDEL KOUDDOUS: I mean, that?s interesting. Look, technically, this was a coup. There?s no question. The person who, you know, got on television was an army general, and he said, Mohamed Morsi?s tenure is over. There was APCs, army APCs, and soldiers surrounding the pro-Morsi demonstrators. There?s no question that the military overthrew this government. The question?I mean, you know, so?but I call it a coup when I do interviews and when I write articles. But it?s?you have to give context. You know, there?s been a lot of debate over this argument: Is it a coup, or is it a revolution? It?s very important to give the context, and I think, as I mentioned before, it was?I think Mohamed Morsi was not going to rule, or he would not have finished his term, regardless. Whether?if the army didn?t step in, the popular uprising against him was getting to be so much that he may have been forced out of office a different way. That he had engendered so much anger against him, that different parts of the country were mobilizing in different ways. You know, Muslim Brotherhood offices were being attacked and looted. There was just a complete standstill in the country. Politics was nonexistent. There was no real political realm even happening. It was just the Brotherhood and Mohamed Morsi trying to push forward their way and being increasingly isolated. So, yes, it?s a coup, but, you know, there was a massive, unprecedented uprising on the back of it. And I think?I very much doubt that Morsi would have completed his term, had the military not stepped in, regardless. AMY GOODMAN: We look forward to speaking to you tomorrow, Sharif. Sharif Abdel Kouddous is Democracy Now! correspondent in Cairo. We?ll link to his latest piece in The Nation magazine called What Led to Morsi?s Fall?and What Comes Next? We?re also featuring his tweets at democracynow.org for the latest. This is Democracy Now! I?m Amy Goodman. Thanks for joining us.