Lots of people feel they're drowning in email, with swollen inboxes that make it hard to pinpoint important messages in a sea of annoying marketing mail and unwanted newsletters. Q: Is there a laptop or an Internet-capable Wi-Fi tablet sold in the U.S. that has compatibility with the European electrical system?A: In my experience, most major brands of laptops and tablets sold in the U.S. also work on the standard ... LONDON?The Bank of England Wednesday told banks and other financial firms to ensure they can cope with any sudden rise in interest rates, following a week of market turmoil triggered by investor jitters that an era of ultralow rates and ... As immigration reform grinds its way through the U.S. Senate, the main focus has rightly been on the legislation's policy consequences. But there are important political implications, especially for the GOP, that are worth examining. Tens of thousands of married gay couples stand to be treated just like their heterosexual counterparts when it comes to federal taxes, immigration, bankruptcy, student aid and other matters, a direct result of the Supreme Court ruling ... Cerberus Capital Management LP has made a bid for Harris Teeter Supermarkets Inc. and is considering a structure in which a part of the East Coast grocery chain would remain publicly traded, according to a person familiar with the matter. Some New Yorkers will stop at nothing to be seen rubbing shoulders with the it crowd. And now, there's, yes, an app for that.Founded in February by Manhattan-native Joshua Stern, I Know the Chef is a mobile application and website that ... The new Big East on Wednesday named former WNBA executive Val Ackerman as the first commissioner of the conference that will launch Monday. The 10-team, basketball-centered conference also announced that it will be based in New York City. The Supreme Court's decisions Wednesday offered neither side in the debate over same-sex marriage a sweeping resolution. With the justices' ruling on the Proposition 8 gay-marriage ban concerning only California, the path forward nationally ... Even as Barnes & Noble Inc. scales back on the tablet front, it faces a struggle to compete in its core business of selling print books. One question is whether a change in merchandising mix is helping or hurting. If I tell the story of my fifth-grade Field Day triumph here, will I still be eligible to tell it at the Moth, the 16-year-old nonprofit dedicated to the art of storytelling? It's probably a moot question, because I'd never have the courage ... NEW DELHI?Wal-Mart Stores Inc. said Wednesday its president for Indian operations, Raj Jain, has left the company, at a time when the retailer is facing headwinds in its efforts to expand in the country. State regulators are warning virtual-currency exchanges and other companies that deal with bitcoin that they could be closed down if their activities run afoul of state money-transmission laws, according to people familiar with the matter. DAKAR, Senegal?President Barack Obama made a widely anticipated return to Africa on Wednesday, a visit he hopes will spotlight opportunities for boosting economic development and buttressing democratic institutions. One Connecticut gun manufacturer is making good on its promise to move in response to the state's new firearm regulations, and others say they may follow as dozens of states recruit them with reduced taxes, cheaper living costs and loans on ... Square Inc., the payments company known for its quarter-sized credit-card readers, is taking its business online.The company is making its first foray into payments over the Web, pitting it against heavyweight PayPal, even as the unit of ... LONDON?In another example of big drug companies pooling resources to improve research and development, Roche Holding AG and AstraZeneca PLC agreed to share data on early-stage drug design to try to speed up development of effective ... The Obama administration's climate-action plan will create winners and losers in the electricity industry, boosting the prospects for nuclear power, natural gas and renewable energy while dimming the future of many coal-fired power plants. MOSCOW?National Security Agency leaker and U.S. fugitive Edward Snowden appeared to be stuck Tuesday in a bleak airport terminal here, with Russian President Vladimir Putin urging him to get on his way. European television networks often find creative inspiration in the U.S. Now, they also want to cash in on TV the American way.A lucrative strategy among U.S. free-to-air broadcasters has been to charge retransmission fees to pay-TV ... BEIJING?China's central bank signaled it was trying to bring an end to a cash squeeze aimed at deflating what was widely deemed a dangerous credit bubble, after slumping markets in China and overseas suggested its policies could backfire ... WASHINGTON?The Central Intelligence Agency has begun moving weapons to Jordan from a network of secret warehouses and plans to start arming small groups of vetted Syrian rebels within a month, expanding U.S. support of moderate forces ... LONDON?A trader who Japanese regulators allege is connected to the global interest-rate-rigging scandal resigned last week from hedge fund Brevan Howard Asset Management LLP, according to a spokesman for the firm. LONDON?A top executive at brokerage firm ICAP PLC knew of an arrangement with UBS AG that U.S. and British regulators allege was part of a scheme to rig benchmark interest rates, according to people familiar with the matter. DETROIT?Daimler AG will turn over all software development for its electronic driver-assistance features to Finland-based Elektrobit Corp., underscoring a growing acceptance by auto makers that they can no longer handle this increasingly ... General Motors Co. Chief Executive Dan Akerson signaled discontent with the auto maker's inability to put the Chevrolet brand on equal footing with the company's larger Adam Opel brand in continental Europe, appointing on Wednesday a new ... Members of the Republican Party, which has long officially opposed same-sex marriage, gave mixed and sometimes muted reactions to Wednesday's Supreme Court decisions so loudly cheered by gay-marriage supporters. Australian accident investigators this week are expected to urge a review of the computer-generated system of emergency alerts used in the cockpits of Airbus superjumbo jets, according to industry officials, as part of the final report ... As an Emirates Airline widebody jet carrying 431 people took off from Dubai in February, it came within 3.5 seconds of colliding with a fighter jet maneuvering at high speed and low altitude near the airport, according to a preliminary ... SHANGHAI?Chinese telecommunications-equipment supplier ZTE Corp. expects to return to profit this year after a hefty loss last year, thanks in part to the country's shift to fourth-generation high-speed wireless networks, a company ... The battered $11.9 trillion U.S. Treasury bond market showed some signs of life from the months-long selloff.Bond prices strengthened, breaking a seven-day losing streak despite relatively soft demand on a sale of $35 billion of five-year ... Bond king Bill Gross is one of the hardest hit from the broad credit market selloff.Pacific Investment Management Co.'s $285.2 billion Total Return Bond Fund has lost 3.65% in June alone, making it the 12th-worst performer among 177 similar ... SYDNEY?Conventional wisdom says a nation's house prices swing with its economy. In Australia, economists are paying increasing attention to another factor: Chinese immigration. The euro fell to its lowest level against the dollar in three weeks after the European Central Bank said it would continue its easy money policies into the foreseeable future, while warning of risks to euro-zone growth. WASHINGTON?President Barack Obama's nominees for the Securities and Exchange Commission are expected to sail through a Senate confirmation hearing on Thursday thanks in part to a key line on their r?sum?s: Senate aide. Outside of world wars and market cataclysms, the relative trajectories of major powers usually trace gradual curves rather than abruptly rising or falling. After the 2008 financial crisis, however, commentators in China and to a lesser ... If you are a well-informed observer of the U.S. Supreme Court, here's what you probably know about yesterday's ruling in Shelby County v. Holder: Section 2 of the Voting Rights Act, which prohibits discriminatory voting practices and ... NEW DELHI?Google Inc. and Bharti Airtel Ltd. said they would jointly launch Free zone, or free Internet, for first time mobile Internet users in the world's second largest telecom market. Research In Motion Ltd. will give investors Friday their first real insight into how the company's all-or-nothing bet on a new breed of BlackBerry devices is faring. Below its signature red steps, the TKTS booth that sells discounted day-of tickets to plays, musicals and dance performances celebrates a milestone on Wednesday: 40 years in Times Square. New Delhi is finally shedding light on one of the darkest industries in India?power. Recent reforms should bring power prices closer to market levels and help the broader economy too. Aaron Hernandez, a former star tight end for the New England Patriots, was charged Wednesday with murder in the fatal shooting earlier this month of an acquaintance, which a prosecutor said occurred after the man talked to people at a ... Having the latest technology can help a small company stand out against the competition. And that is perhaps the biggest reason Bitcoin, a nascent system using virtual currency to make payments online, has drawn a strong following among ... As the American people, the world and official Washington continue to unravel the mystery named Barack Obama, a key clue may be found in the booing of Nancy Pelosi?from the Left. With LeBron, Tiger and Federer on the payroll, clutch performances should be business as usual for Nike Inc.Looking back at a decade of quarterly earnings reports, that has been the case with 36 beats of the analyst consensus out of 40 ... Gold prices slumped to their lowest level in nearly three years Wednesday after a selloff at the start of Asian trading reverberated through trading floors in London and New York. CAIRO?Egypt's President Mohammed Morsi warned his nation that political polarization threatened to bring paralysis and chaos, as Egyptians braced for potentially explosive protests on Sunday marking a year since he took office. Asian investors are pumping money into U.S. commercial real estate at a record pace, pushing real-estate values higher and helping get stalled projects off the ground. BAMcinemaFestMultiple venues. www.bam.org/bamcinemafestThrough FridayThere are six screenings to go in the Brooklyn Academy of Music's fifth annual survey of the best in recent American independent film. The Friday finale is Short Term ... Zipper up.That's what a number of designers hope shoppers will be doing in the coming seasons. Designer labels, including Altuzarra, Calvin Klein Collection, Dior, Elie Tahari, Giambattista Valli, Michael Kors and the Row are putting bold ... BEIJING?China's largest Internet companies vowed to share information and cooperate to fight online fraud, highlighting a developmental difficulty facing China's fast-growing e-commerce market. BRAS?LIA?Under pressure to act after weeks of mass street protests and an impassioned call to action by President Dilma Rousseff, Brazil's normally glacial Congress voted on a flurry of legislation designed to respond to a broad expression ... Dish Network Corp. said Wednesday it has withdrawn its offer for Clearwire Corp., after a rival bid from Sprint Nextel Corp. won support from Clearwire shareholders. In the 3? years since Kate McGarrigle's death at age 63, the children of the Montreal folk music legend?Rufus and Martha Wainwright?have taken big steps in their own lives and careers. Mr. Wainwright, 39, wrote his first opera, married ... SEOUL?South Korean President Park Geun-hye arrives in Beijing on Thursday for a summit meeting with Chinese President Xi Jinping that will be closely watched for their policy coordination on North Korea. BRUSSELS?Negotiators for the European Parliament and national governments tentatively agreed Wednesday on a long-awaited overhaul to the European Union's agricultural policy, after scaling back proposals intended to support small farmers ... LONDON?Some of Europe's largest economies face a growing risk of fuel-supply disruptions, as commercial problems that have already driven a swath of the region's oil refineries out of business look set to intensify. MADRID?Spanish lender Bankia SA said Wednesday it had hired an advisor to help sell its 12.09% stake in International Airlines Group, part of a wider plan to pay back taxpayer money that was used to bail out the loss-making bank last year. General Mills Inc. is trying to catch up with its Greek yogurt competitors by making its Yoplait Greek with the traditional straining method used by rivals like Chobani Inc., and ditching a thickening ingredient that rivals have criticized ... European Union lawmakers have reached a compromise that falls short of barring ships from being recycled on South Asian beaches, three people involved with the matter said. The disconnect between U.S. defense cuts and President Obama's strategic pivot toward Asia has raised doubts about whether the policy can live up to its billing. Amid this uncertainty, however, one part of the military is eager to expand ... Democratic Rep. Ed Markey cruised to victory in Tuesday's Massachusetts special Senate election, defeating Republican Gabriel Gomez in a race defined by a low voter turnout. PARIS?Dominique Strauss-Kahn returned to the French political arena on Wednesday, testifying at an obscure parliamentary committee on the role of banks in facilitating tax evasion. HONG KONG?Nissan Motor Co.'s Infiniti brand is looking for a do-over.Nearly a quarter century after its debut, Nissan wants to remake one of the luxury vehicle market's perpetual underdogs into a global contender on par with the German ... Former U.S. Rep. Anthony Weiner captured the frontrunner's mantle in the race for the Democratic mayoral nomination, leading City Council Speaker Christine Quinn for the first time and running neck-and-neck with her in a potential runoff, ... LONDON?Sotheby's contemporary art auction Wednesday evening proved that the art market is out of recession, but collectors are still wary of overpriced works by high-profile names that would have been easy sales in the heady days of the ... A few notable?and mainly U.S.?programs aside, the car has remained stubbornly resistant to the impact of the Internet.Early connected car services allowed drivers to call emergency services or helped police track stolen vehicles, but ... Natural gas really ought to be doing better.The front-month futures price is down 7% so far this month and 16% off April's high point. Yet this week, President Obama re-emphasized plans to cut U.S. carbon emissions that, despite some ... How quickly a prime asset can become a potential liability. Prudential PLC has?unusually?underperformed peers in recent weeks, falling 12% as emerging-market jitters hit sentiment around the U.K. insurer's prized Asian business. PARIS?The French banking regulator Wednesday slapped the local unit of Swiss bank UBS AG with a record fine of ?10 million saying UBS France had been slow in reacting to warnings that its employees were allegedly illegally helping recruit ... TAIPEI?Hon Hai Precision Industry Co. Chairman Terry Gou said on Wednesday that the company isn't in a rush to reach an investment deal with struggling Japanese consumer electronics maker Sharp Corp. MADRID?The board of Spanish oil firm Repsol SA on Wednesday unanimously rejected a $5 billion proposal from Argentina to compensate it for last year's expropriation of most of Repsol's stake in YPF SA, saying the offer was unsatisfactory. HURON, Calif.?Two years of dry weather and regulatory water cuts are taking a mounting toll on California's giant farm belt, forcing farmers to idle more fields and workers even as much of the rest of the Golden State continues to recover ... BRUSSELS?European Union finance ministers sought Wednesday to agree on rules for dealing with failing banks amid divisions over when governments should be allowed to bail them out. HONG KONG?Hong Kong Express Airways Ltd., controlled by Hainan-based HNA Group Co., seeks to tap booming demand for cheap fares in Asia with the launch of budget flights in October. The Supreme Court did itself proud on Tuesday when it struck down Section 4 of the Voting Rights Act. That is the provision of the law containing the formula that determined which jurisdictions should be kept in the penalty box for ... Wal-Mart Stores Inc., Gap Inc. and other large U.S. retailers are nearing an agreement to establish a $50 million, five-year fund to improve safety conditions in Bangladesh garment factories, a person familiar with the ... St. LouisFrom some angles, Stone Sea, Andy Goldsworthy's new installation at the Saint Louis Art Museum, does indeed look like a series of roiling waves made from arching chunks of limestone. If one walks through the narrow courtyard that ... In The Supermale 1902 , the surreal, carnivalesque novel by French playwright Alfred Jarry, a team of five American cyclists, welded together in a line and fueled by Perpetual-Motion-Food, compete in a 10,000-mile race against a train. ... Q: I am 5 foot 3 and age 48. I have been dating someone who is almost 6 foot 4. He says I'm the shortest woman he has ever dated. He doesn't hold it against me, but he likes me to wear high heels all the time, which I do. But when we are ... In a week of consequential Supreme Court decisions, one of the more important is the case it decided to hear next year?a review of the constitutionality of President Obama's non-recess recess appointments. This is a chance to rein in a ... A penthouse atop a new condominium skyscraper that resembles a pile of haphazardly stacked boxes has gone into contract for $47 million, a record for a condo sale below Midtown Manhattan. Bankers will soon step into a mortgage minefield?a no-win landscape in which every move will be fraught with peril, and in which the ultimate casualties will be the nascent housing recovery and the American home buyer. The American Psychiatric Association released a revision of its diagnostic bible in May, the first major rewrite in two decades. The Fifth Edition of the Diagnostic and Statistical Manual of Mental Disorders, or DSM-5, is the official ... From Justice Anthony Kennedy's dissent in Hollingsworth v. Perry, June 26, holding that citizen advocates did not have standing to defend California's Proposition 8, which restored the traditional definition of marriage. Fading fears about a pullback in central-bank support helped push stocks higher.The Dow Jones Industrial Average advanced 149.83 points, or 1%, to 14910.14. On Tuesday, the Dow gained 101 points. Bed Bath & Beyond Inc. on Wednesday reported higher revenue for its latest quarter, though the home-furnishings retailer's earnings slipped as expenses increased. Federal regulators are expected to issue new rules in the next few months that could jump-start the market for cars that communicate with other cars and road infrastructure. SECURITY FORCES: A former Taliban fighter joined Afghan government forces in Herat, Afghanistan, Wednesday. NATO formally transferred responsibility for nationwide security to Afghan forces a week ago. WIMBLEDON, England?A day of chaos at Wimbledon saved the biggest shock for last. Defending champion Roger Federer was knocked out in the second round Wednesday evening by the unseeded Ukrainian Sergiy Stakhovsky, who recorded an upset for ... The selloff in China's stock market abated on Tuesday, but a key issue for investors remains: The country's financial system puts state-owned companies ahead of private businesses. Historic monuments and sites in Kaesong: Remains of a North Korean fortress that once surrounded Kaesong, the ancient capital of Korea's Koryo Dynasty, which ruled Korea from 918 to 1392. Emerging economies have lost nearly $2 trillion in stock-market value since the global financial crisis hit in late 2007. The full blame for this meltdown, and then some, can be placed at the door of their state-owned companies, which ... June 27,2013June 25, 2013June 24, 2013 SAO PAULO?Brazil's real jumped against the dollar Wednesday after the central bank lifted reserve requirements on short-dollar positions, in a move to support the local currency. TORONTO--The Canadian dollar is ending higher Wednesday after a softer-than-expected revision of U.S. growth data for the first quarter incited some selling of the U.S. dollar. Streaming CoverageRainbow flags flew in front of San Francisco City Hall on Wednesday, shortly after the U.S. Supreme Court rulings.Edith Windsor, center, arrived for a news conference in New York after the ruling overturning the Defense of ... Wealth managers are putting more client money into mutual funds that use hedge-fund strategies, seeing a potential shelter in a storm. We think [they] will hold up the best when the markets get skittish, says Mark Wilson, chief investment ... KNOXVILLE, Tenn.? Big Jim Haslam never imagined the wealth that would be generated from a company he founded with a single gas station bought for $6,000 in 1958. NEW YORK--Crude-oil futures edged higher Wednesday after the U.S. Energy Information Administration said domestic oil inventories were flat last week and gasoline inventories surged to the highest level for this time of the year in two ... PARIS?The Eiffel Tower was set to reopen Thursday after a two-day strike over working conditions that left thousands of visitors locked out of one of the world's most-visited tourist attractions. TOKYO?Six months after taking office, Japanese Prime Minister Shinzo Abe closed out his first session of parliament on Wednesday, vowing to stick to his economic expansionist policies as he aims to strengthen his grip on power in next ... QUITO?President Rafael Correa on Wednesday lashed out against the international media over its coverage of the plight of Edward Snowden, as Ecuador's leader considers the request for political asylum from the fugitive former security ... YANGON, Myanmar?Myanmar's parliament Wednesday voted to delay awarding two coveted telecommunications licenses, agreeing to wait until a new telecommunications law governing the industry is passed, according to a lawmaker. LONDON?U.K.-listed Indonesian coal miner Bumi PLC has signed an agreement with the former chief executive of its majority-owned unit PT Berau Coal Energy TBk to recover most of the $201 million in costs at the unit, which it says had no ... Monsanto Co. on Wednesday reported slightly lower earnings for its latest quarter amid weaker seed sales and higher input costs.For its fiscal third quarter ended May 31, the world's largest seed company reported a profit of $909 million, ... General Mills Inc. said earnings rose in its latest quarter and that it expects more advertising and new products to help get two of its U.S. cereal and yogurt businesses growing again. NEW DELHI?All 20 people on board an Indian Air Force helicopter were killed Tuesday when the aircraft crashed during a rescue mission for flood victims in the northern state of Uttarakhand, India's Air Force Chief said Wednesday. WASHINGTON?Interest rates on some new federal student loans appear increasingly likely to double next week, according to senators who say their chamber remains divided over how to prevent the jump before the July 1 deadline. MOSCOW--A string of new Russian deals with Asian customers marks the beginning of a major shift away from the country's traditional markets in Europe, where it is facing competition and regulatory pressure, said one of Russia's top energy ... WASHINGTON?The U.S. has underground capacity sufficient to store 500 years of energy-sector carbon-dioxide emissions, the U.S. Geological Survey found in a study released Wednesday. LONDON?Standard Chartered PLC said Wednesday that cheap money flowing into Asia and a rise in bad loans in South Korea will put a brake on first-half profit growth, but gave an upbeat outlook for the rest of the year despite the recent rout ... For sheer political drama, it's hard to beat the recent happenings in Australia, where on Wednesday former Prime Minister Kevin Rudd unseated Julia Gillard in a leadership spill. It's the second such political coup in three years and ... President Obama's climate speech on Tuesday was supposed to be the first stage of a political recovery after weeks of nonstop White House scandal. But Republicans immediately seized on the regulatory blitz as a political winner?for them. Top administrators at the city's Department of Education haven't been subject to formal evaluations during the Bloomberg administration, a break from past practice and an unusual occurrence among school districts across the U.S. Gee, as if Democrats in California needed any more power. The Supreme Court's punt on Proposition 8?a state ballot initiative banning same-sex marriage that voters approved in 2008?effectively gives Gov. Jerry Brown and Attorney General ... Voices is an occasional column that allows wealth managers to address issues of interest to the advisory community. Jeannie Holliday is a financial adviser and co-owner of Independent Financial Services in Land O'Lakes, Fla. TokyoIf there's one reform that's symbolic of Prime Minister Shinzo Abe's eponymous program to rejuvenate the Japanese economy, it's immigration. European stocks rallied Wednesday, helped by gains in Spain's banking sector, while assurances from the European Central Bank that it wasn't looking to tighten its policy stance helped bolster sentiment. The NCAA put Oregon's football program on probation Wednesday for three years and took away a scholarship for recruiting violations under former coach Chip Kelly. Wall Street's self-regulator has fined StateTrust Investments Inc. more than $1 million and sanctioned the firm's head trader for charging customers unfair prices in bond transactions. MADRID?The Spanish lawyer who has been working with WikiLeaks founder Julian Assange said Wednesday that he had turned down a request by the U.S. fugitive Edward Snowden to undertake his legal defense as well. About a half-dozen times a year, financial adviser John Smith's wealthy clients raise the issue of offshore banking.His clients who broach the subject usually have more than $20 million in assets, and they see sticking their cash in, say, ... A public transportation advocacy group alleges in a federal lawsuit that so-called patent trolls are squeezing cash out of the nation's largest transit agencies by suing over schedule alerts, a common passenger convenience. CANBERRA, Australia?The new chief executive of Anglo American PLC said he fears a cash crunch in China will curb investment in the world's second-largest economy, hurting commodities demand at a time when mining companies are grappling with ... ISLAMABAD?The Pakistani Taliban on Wednesday set off a bomb targeting a senior antiterrorism judge in the southern city of Karachi, injuring him and killing at least nine people. Calvin Ford, 29, knew as a child where he would probably wind up working as an adult. But he took his time getting there.He spent his first few years after college in jobs in the Northeast and in Asheville, N.C. Then his wife landed a job ... Two casino companies became the latest IPOs to fall victim to the recent stock-market rout in Asia.On Wednesday, Resorts World Manila, the Philippine casino business owned by Malaysian gambling tycoon Lim Kok Thay and Filipino partner ... TORONTO--Bombardier Inc.'s aerospace unit said Wednesday that it has pushed back the timeline for the first flight of its CSeries aircraft to allow for additional software upgrades, and now expects the maiden flight to occur by the end of ... MUMBAI?India's securities regulator announced changes Tuesday to rules that it said would make investing into Indian assets less cumbersome for foreigners. TORONTO?Enbridge Inc. said Wednesday it has returned to service the second of three pipelines it shut down over the weekend, but a 100,000 barrel-a-day line that leaked crude oil remains shut to allow further work to be completed. There's a scenario in sports that's wilder than a buzzer-beating shot, more crushing than a walk-off home run and so downright preposterous it seldom happens?let alone when there's a major championship on the line. But this week has been ... BANGKOK?The International Monetary Fund's recent call for Thai economic growth of just 4.75% this year is a reasonable figure, the Bank of Thailand's governor said, with the central bank's own updated forecast next month likely to be in ... In a 5-4 ruling on June 26, the Supreme Court struck down the 1996 Defense of Marriage Act, which denied federal benefits to lawfully married same-sex couples. Read the full ruling for United States v. Windsor. As boomers draw up their wills, more are ruling out immediate inheritances for heirs in their teens, 20's or even their 30's.Marriage and other such life events are happening later in life now, Reuters notes, and parents want to make sure ... WARSAW?The Polish government, looking to shore up public finances, said it plans to reduce the role private funds play in the country's mandatory pension system in a move that may put large stockholdings of listed companies in the state's ... An arbitration panel has ordered a financial adviser serving jail time for stealing money from his clients to pay Charles Schwab & Co. $2.8 million. Once left for dead in the political wilderness, U.S. Rep. Anthony Weiner appears to be making a real comeback in his race for New York City mayor by winning forgiveness and outshining a low-wattage primary field. Pope Francis, who became head of the Roman Catholic church three months ago, has set up a special commission to review the work of the Vatican bank, which has been plagued by scandals for decades. WASHINGTON?When David Frankel didn't win the contest, his first response was to ask for his score.Then he filed a Freedom of Information Act request. After dragging into the fray five federal attorneys, at least one Google Inc. employee and ... GJILAN, KOSOVO?On the main road winding through the wooded hills rolling out from Gjilan in eastern Kosovo, police and customs officials from Serbia and Kosovo work side-by-side at Europe's newest international border. TORONTO--The Canadian dollar is higher Wednesday morning, building on earlier gains after the U.S. dollar wilted in the aftermath of a weaker-than-expected revision of first-quarter growth data for the U.S. Brazil's real strengthened Wednesday morning following the central bank's decision to lift reserve requirements on short-dollar positions.The real was trading at 2.2050 to the dollar in the morning after exiting active trading Tuesday at ... MUMBAI?The Indian rupee fell to a new all-time low against the U.S. dollar Wednesday, with selling exacerbating after it crossed a key psychological level of 60 for one dollar. For the first time since 2001, the U.S. knocked China out of first place in an annual survey of executives rating favorable places for foreign direct investment. The FX Global Call covers the main news events affecting foreign-exchange markets in Asian and European trading hours, as selected by DJ FX Trader editors in New York, London and Singapore, as well as other hot spots when warranted. Stocks in Hong Kong and Australia rallied Wednesday on signs that China's central bank is working to halt the country's cash squeeze, while Shanghai remained under pressure. MUMBAI?Reliance Capital Ltd, the financial services arm of billionaire Anil Ambani's Reliance Group, will apply for a banking license to the central bank, it said Wednesday in a statement. SHANGHAI--China's yuan fell against the U.S. dollar Wednesday, tracking the guidance set by the Chinese central bank via its daily reference rate, which has been stable so far this week. Wimbledon, EnglandWhen Maria Sharapova plays her second-round match at Wimbledon this week, people will marvel at her power, gawk at her good looks and perhaps crack a few jokes about her shrieks. But they'll ignore the real Sharapova ... 'One of the things I intend to do as President is restore America's standing in the world. We are less respected now than we were eight years ago or even four years ago. The re-entry capsule China's Shenzhou 10 spacecraft appears in the sky over the main landing site in Siziwang county in north China's Inner Mongolia Autonomous Region. LONDON?Direct Line Group PLC on Wednesday said it would cut 2,000 jobs in the U.K., or around 14% of its workforce, as competition in the country's car-insurance market remains intense. LONDON?Christie's post-war and contemporary-art sale on Tuesday proved that the world's wealthy collectors are confident that the art market is solidly out of its slump, regardless of the economy in Europe. Dallas and Fort Worth, TexasThe human need to name and categorize the things we look at is as prevalent in art as in the rest of life. We are too easily confounded when confronted by unfamiliar works that do not easily fit our expectations ... The defining moment in the second half of Bob Dylan's long career came in early June 1988. The scene was the hills above Berkeley, Calif. It was a gorgeous evening; the sun had just set over the Golden Gate Bridge. The singer, in a dark ... New York'The silent pictures were the purest form of cinema, Alfred Hitchcock once remarked to Fran?ois Truffaut. In Hitchcock's early thrillers, comedies and dramas, he mastered visual storytelling and ... SEOUL?The South Korean government is trying a new approach to complete the long-delayed $3.9 billion sale of the nation's largest financial company: breaking the deal into three batches. WELLINGTON--The New Zealand dollar remained firmly rangebound late Wednesday as fears about the health of China's banks eased.A statement from the People's Bank of China's on Tuesday, in which the central bank said it had introduced funds ... The Yankees and their highest-paid player, third baseman Alex Rodriguez, are at loggerheads once again.On Tuesday, Rodriguez's newly active Twitter account @AROD posted a picture of Rodriguez with Yankees medical staff, and stated that ... Don Rickles has built a career out of making fun of people.So it shouldn't have come as a surprise to us that after he finished taking photos on the red carpet of a fundraiser in his honor for the Friars Club, he hobbled in to the ... Combining the operations of SoftBank Corp. and Sprint Nextel Corp. would create the world's third-largest mobile carrier in terms of revenue. A Corporate News article on Saturday incorrectly said that the combined entity would be the ... The Mets traded Collin Cowgill, their opening-day center fielder, to the Angels on Tuesday in exchange for minor-league outfielder Kyle Johnson. They designated Cowgill for assignment last week. HartfordNonunion State Managers Cleared for Pay RaiseAbout 1,500 nonunion state managers and about 90 appointees will soon get a pay raise.In a memo obtained Tuesday by the Associated Press, Connecticut Office of Policy and Management ... Os MutantesProspect Park BandshellProspect Park West and Ninth Street, Brooklyn, www.bricartsmedia.orgSaturdayOs Mutantes were ringleaders in the gloriously bizarre and artful pageant that accompanied the musical movement known as ... If you think the Mets play like a bunch of minor leaguers, there is a good reason for it: They have the most players who spent part of 2013 there. NEW DELHI?India's Trade Ministry Tuesday said it has been told by the United Kingdom that a pilot proposal to collect cash bonds from Indians for issuing a visit visa hasn't been considered by the British government. SOUTHAMPTON, N.Y.?Given the many storied courses around here, Sebonack Golf Club, a mere seven years old, wouldn't seem to be the obvious choice to host this week's U.S. Women's Open, the first ever on Long Island. Ehsanullah Amiri is an Afghan reporter working for The Wall Street Journal. This is his eyewitness account of Tuesday's Taliban attack in Kabul. NEW DELHI?India's government will announce a revamped foreign direct investment policy that seeks to attract more overseas capital in the economy by the third week of July, Finance Minister P. Chidambaram said Tuesday. Prize4Life, a nonprofit that seeks to discover treatments and a cure for ALS, also known as Lou Gehrig's disease, on Monday held its annual gala at Sotheby's in Manhattan. The event honored board member Cynthia Mazareas and her husband ... CHICAGO?For Zack Wheeler, figuring out the key to a successful major-league career doesn't require much analysis. It ultimately comes down to one basic question: Will he throw enough strikes? Ichiro Suzuki, a most unlikely power source, drove a two-out, two-strike pitch from Texas reliever Tanner Scheppers into the right-field seats in the bottom of the ninth inning to lift the Yankees to a 4-3 victory Tuesday over the Rangers. Joe Girardi, the Yankees' manager, was asked a pretty grim question Tuesday afternoon. It was about?what else??injuries.The question: Did he really think any player on the disabled list was capable of returning before the All-Star break? The Knicks readied themselves for free agency Tuesday, a day in which sixth man J.R. Smith opted out of the final year of his contract to become a free agent. He is known in American soccer circles as the one that got away. But for a moment Tuesday afternoon, Giuseppe Rossi was back where it began?playing pickup soccer in his hometown of Clifton, N.J. The U.S. Supreme Court's decision overturning parts of the federal Voting Rights Act drew mixed reactions in New York City, where local election officials have long had to clear the drawing of political boundaries with Washington to ensure ... Author Mary Higgins Clark believes that some people are born to write. With a gift of $2 million to her alma mater Fordham University, Ms. Clark hopes to guide a new generation of writers. Soccer Managers Take Speedy Shuttle Around EuropeThe annual reshuffle of European soccer managers delivered a double-switch on Tuesday when Real Madrid confirmed Carlo Ancelotti before his former club, Paris Saint-Germain, announced that it ... The Supreme Court has a splendid Brown v. Board and sordid Plessy v. Ferguson history in dealing with race, and on Monday it came down firmly in the muddle on racial preferences in education. A 7-1 majority in Fisher v. University of ... Eileen McManus insists on holding her 6-year-old son's hand whenever they cross the intersection near P.S. 81.The 49-year-old?who was involved in a crash there six month ago with a vehicle making a fast U-turn?says it isn't uncommon to see ... Men's Wearhouse Inc.'s board on Tuesday offered more insight into the firing of George Zimmer as executive chairman, saying its co-founder and former chief executive wanted full control of the company and had reversed his ... Nerai offers upscale Greek dining with an emphasis on seafood in a refined nautical-themed space.Co-owner Constantine Youssis said the restaurant takes Greek recipes and composes dishes in modern ways. The soutzoukakia, meatballs baked in ... ATLANTA?A conspiracy case stemming from one of the largest school-cheating scandals in U.S. history could be scuttled or drastically diminished if a judge rules that investigators coerced some educators into talking. UNCASVILLE, Conn.?The Mohegan Sun casino announced its first major expansion in five years with a $50 million project calling for more retail space, featuring a New England food market, a multiplex movie theater, bowling and clothing ... Tall Tower, Low PriceThe saga of Chicago's John Hancock Center has taken another turn, with a group buying a chunk of the property for a low price of about $140 million, according to a person familiar with the deal. Anyone who's been following Wimbledon this week may have been tempted, at one point or another, to have a laugh at the enormous volume of attention being lavished on the host nation's best player, Andy Murray. Poorly sealed natural-gas wells?not hydraulic fracturing of shale-rock formations?are likely to blame for dissolved gas found in private water wells in Pennsylvania, according to a new study by Duke University. In striking down the heart of the 1965 Voting Rights Act, the Supreme Court essentially threw down a challenge to Congress to come up with a new rationale for singling out states for special federal scrutiny. Short selling rose at the New York Stock Exchange and Nasdaq Stock Market during the first half of June.In the exchanges' latest twice-a-month statistics, this time for the period ended June 14, the number of short-selling positions at the ... Buildings slipped toward this gorge at Srinigar in northern India as monsoon flooding continued to claim lives Tuesday. Eight people died when a rescue helicopter crashed. Photo: Associated Press