Egypt's embattled President Mohamed Morsi has proposed a consensus government as a way out of the country's crisis, as an army deadline urging him to meet the?protesters' demands expired. The presidency envisions the formation of a consensus coalition government to oversee the next parliamentary election, his office said on Wednesday in a statement on Facebook. The statement reiterated that Morsi held opposition parties responsible for obstructing a political?initiative that would also set up a panel to prepare amendments to the constitution passed into law last December. Egypt is bracing for a showdown between the military and Morsi, who has rejected the army ultimatum to end a political crisis with his opponents, who have called for his resignation. Troops, backed by armoured personnel carriers and in full combat gear, deployed on strategic bridges and near protest sites by supporters of Morsi after the deadline expired.? 'Military coup' A top aide to Morsi, Essam al-Haddad, slammed what he called a military coup on Wednesday after the army reportedly slapped a travel ban on the president and his Islamist allies. The list of names that was sent to airport security included Muslim Brotherhood leaders Khairat el-Shater, Essam el-Erian and at least 40 other Islamists,?security sources told Reuters news agency.. For the sake of Egypt and for historical accuracy, let's call what is happening by its real name: Military coup, Haddad, Morsi's national security adviser, said in a statement on Facebook. As tensions mounted and crowds poured into the streets to demand Morsi's resignation, Haddad said: As I write these lines I am fully aware that these may be the last lines I get to post on this page. Earlier in the day, the army said on its official Facebook page that it had set no times for issuing statements or speeches, as the?general command of the Egyptian armed forces was meeting with religious, national, political and youth figures. The General Command of the Armed Forces is currently meeting with a number of religious, national, political and youth icons ... There will be a statement issued from the General Command as soon as they are done, the army said. The political wing of the ruling Muslim Brotherhood refused an invitation to meet the armed forces commander on Wednesday. We do not go to invitations meetings with anyone. We have a president and that is it, said Waleed al-Haddad, a senior leader of the Freedom and Justice Party told Reuters news agency. Egyptian political sources also said that liberal opposition leader Mohamed ElBaradei met army chief General Abdel Fattah al-Sisi on Wednesday. ElBaradei was chosen to represent the opposition National Salvation Front coalition and youth groups leading anti-Morsi street protests to negotiate with the army on their behalf. Roadmap Earlier, the army leaked details of a roadmap that includes overthrowing Morsi, scrapping a draft constitution and forming a government of independents headed by an army general. The army has said it had to intervene after unprecedented rallies by million of Egyptians at the weekend to demand Morsi step down. In a seperate development, the governor of Giza resigned after 18 people died there on Tuesday night. Supporters of the president were protesting outside Cairo University when security forces shot at them. Morsi, who belongs to the Muslim Brotherhood group,?in a televised address late on Tuesday vowed to stay in office at any cost. Egyptians across the country and even Egyptians outside the country watching from afar are incredibly worried about the situation in their country, said Al Jazeera's Sherine Tadros, reporting from Cairo's Tahrir Square. This is probably the most critical point in Egypt since former President Hosni Mubarak was ousted in February 2011.