Here?s the latest of our news bulletins from the ongoing crisis at Japan?s Fukushima Daiichi nuclear power plant. State of the Fukushima Reactors TEPCO admitted this week that it should have released information about water leaking into the ocean earlier, but ?didn?t want to worry the public? in making a ?major announcement? until it had confirmed that there was a problem. Company President Naomi Hirose later said that he was concerned about the ramifications of such an announcement on the utility, which has been struggling financially since the Fukushima disaster first began in March 2011, and apologized for the decision. ?It?s an extreme shame?we had the data but were unable to put it to use. Rather than proactively inform the public of potential risks, we became too fearful and concerned over the effect such a major announcement would have. If you asked whether we have adequately learned the lessons of the disaster, the answer would be that we haven?t. We?ve been trying to reform, but we repeated the same mistake. Obviously, our effort is not enough. We are really sorry.? Experts, including Greenpeace, have long suspected that the plant was leaking contaminated water into the sea, based on radiation levels in ocean water samples, but TEPCO continuously denied those assertions. Even when groundwater samples were found to have large concentrations of radioactive materials in May, the company which did not release that information until June 19 insisted that it did not have enough information to confirm ocean contamination. However, executives finally acknowledged last week that in January, engineers realized that the levels in nearby wells were fluctuating in accordance with oceanic tidal patterns, as well as rainfall, leading them to believe that highly radioactive water was flowing directly into the sea. The utility continues to blame poor interdepartmental communication for the cover-up. ?Our civil engineering department has confirmed water level variations in monitoring wells as early as January, but that information was not shared [with] the department responsible for monitoring radiation levels,? said an official from TEPCO?s Fukushima Revitalization Headquarters. In response to the most recent scandal, Hirose and TEPCO Executive Vice President Zengo Aizawa each said that they would take a 10% pay cut?but only for one month. The incident has garnered sharp words from members of TEPCO?s own external reform committee, including from Dale Klein, former head of the US Nuclear Regulatory Commission. ?These actions indicate that you do not know what you?re doing, and that you do not have a plan, and you?re not doing all you can to protect the environment and people,? Klein said. Lady Barbara Judge, former Chair of the British Atomic Energy Authority and Deputy Chair of the panel, agreed: ?I?d like to say myself how disappointed and distressed I was when I arrived in Japan. To find that communications with respect to the leak problem have been so difficult and so late was very devastating.? The panel members? criticism echoed that of Japan?s Nuclear Regulation Authority NRA Chairman Shunichi Tanaka, who said last week that TEPCO is unable to handle the situation on its own, and that the government needs to intervene. ?It is simply too big for one company to handle. Placing all the burden on [TEPCO] won?t solve the problem...The difficulties we face at Fukushima Daiichi are on par with the difficulties we faced in the wake of World War II. TEPCO needs more assistance from others in Japan, me included. We cannot force [all responsibility for fixing the situation] on TEPCO.? Adding to the ongoing crisis, officials were forced to announce yet more discoveries of highly radioactive water, some of it very close to the edge of the sea, in a cable trench near reactor #2. That trench runs beneath the reactor?s turbine building and stretches down to ?the seashore, just 50 meters from the ocean. On July 26, workers measured 2.35 million Bq/liter of radioactive cesium, as well as 750 million Bq/liter of other radioactive substances, including strontium. Both cesium and strontium have been shown to cause cancer if they enter the food chain for instance, through fish and are ingested by humans. The contamination levels are the highest since some measured immediately following the beginning of the disaster in March 2011. In addition, on July 28, workers discovered that the same trench contained 8.7 million Bq/liter of radioactive tritium, approximately 145 times the government standard. An estimated 5,000 tons of highly radioactive water?presumably far more radioactive that the samples collected this week?remain in the trench. Groundwater radiation levels in the area are also rising, and TEPCO still has no idea where the leaks are originating. Some analysts are now saying that the water crisis has become so dire that TEPCO needs to stop efforts to remove spent fuel from the crippled reactors, and instead, focus all of its efforts on stopping the leaks. Tamotsu Kozaki, an expert on nuclear decommissioning at Hokkaido University, noted, ?Now is the time to put their focus on contaminated water management. Given that [TEPCO] has not yet decided where to dispose of the nuclear waste, there is no point in working on the reactors themselves in haste.? Local fishermen are furious about the most recent news, and are concerned that their livelihoods, which were already decimated by the nuclear disaster, may have been permanently destroyed. On July 25, members of the National Federation of Fisheries Cooperative Associations delivered a formal letter of complaint to President Naomi Hirose. ?We are exasperated at the development, which is an act of treason to all fishing industry workers and to all members of the public in Japan,? the letter said. To complicate matters further, a system designed to filter a majority of radioactive nuclides?although not tritium?from water being used to cool reactors has been halted in trial runs. Engineers said this week that leaks in the Advanced Liquid Processing System ALPS were the result of holes in welds of the system?s tanks, caused by corrosion. The most recent setback is expected to further delay the schedule for installing the new decontamination system?which is already far behind schedule--by at least four months, while workers coat the tanks with a liquid rubber lining.That means that for six weeks, TEPCO will have no means of filtering radioactive water, and it will continue to build up at the plant. Nuclear Regulation Authority In response to TEPCO?s recent water woes and concerns about ocean contamination, as well as numerous other missteps at the Fukushima nuclear plant, the NRA announced on Monday that for the first time, it will begin to monitor radiation data at the Daiichi compound, directing agency-appointed geologists to collect water and soil data. NRA Commissioner Toyoshi Fuketa said, ?The priority is to collect data thoroughly to gauge the extent of the diffusion of water,? so that TEPCO can figure out how to prevent the highly toxic water from poisoning nearby soil and the sea. Nevertheless, the announcement may have less impact than some critics hope: TEPCO will still be in charge of planning and implementing anti-contamination efforts. So far, it has not been successful in doing so. NRA-appointed seismic experts, led by Commissioner Kunihiko Shimazaki, have concluded yet another on-site investigation of reactors #3 and #4 at the Oi nuclear power plant in Fukui Prefecture, in an effort to determine whether or not they sit on active fault lines. This is the third time that inspectors have visited the plant, home to the only two online reactors in Japan. Experts so far have been split on whether or not the fault is active. Plant operator Kansai Electric Power Company KEPCO , which has a lot of money riding on the decision, has vigorously denied the claim. Shimazaki has cautioned that the team?s report will likely not be released any time soon; in the meantime, the Oi reactors are scheduled to go offline in September for routine maintenance. If the faults are found to be active, the reactors will not be allowed to restart. TEPCO and Worker Safety TEPCO has admitted that out of 647 of its workers who were required by law to get an annual eye examination, nearly 40% failed to do so?and this number does not include contract and subcontract workers. Exposure to radiation can lead to cataracts, and as of October 2011, the Japanese government required all Fukushima Daiichi workers who have been exposed to more than 50 millisieverts of radiation per year to get a yearly check-up. However, analysts believe that the number of workers who have not received adequate eye care is probably far higher. TEPCO reportedly did not stress the importance of the examinations or the risks of radiation to workers? eyes. Including contractors and subcontractors, approximately 20,000 people were employed in emergency clean up efforts at the plant, and nearly two and half years after the disaster first began to unfold, Japan?s Ministry of Health, Labour, and Welfare still has no idea of how many have not received tests. Many workers are no longer employed by the contracting and subcontracting firms that hired them, and in a further complication, a government database of those who have worked at the plant was found to have 8,000 errors in names or dates of birth. Ministry officials say that they soon hope to have an estimate of how many people still need health assessments.