Sybrina Fulton: As I sat in the courtroom, it made me think that they were talking about another man. And it wasn?t. It was a child, who thought as a child, who acted as a child, who behaved as a child. And don?t take my word for it. He had a drink and candy. So, not only ? not only do I vow to you to do what I can for Trayvon Martin, I promise you I?m going to work hard for your children, as well, because it?s important. On Friday, President Barack Obama surprised reporters in the White House briefing room by delivering his first public remarks on the death of Trayvon Martin since Zimmerman?s acquittal. In comments that touched not only on the racial elements of the shooting, but on the broader issue of racial profiling, Obama said Trayvon Martin could have been him as a young man. Obama announced no policy changes or actions in response to Zimmerman?s acquittal. But he questioned the Stand Your Ground laws that delayed Zimmerman?s arrest and were included in jury instructions. President Obama: For those who resist that idea that we should think about something like these Stand Your Ground laws, I just ask people to consider if Trayvon Martin was of age and armed, could he have stood his ground on that sidewalk? And do we actually think that he would have been justified in shooting Mr. Zimmerman, who had followed him in a car, because he felt threatened? And if the answer to that question is at least ambiguous, then it seems to me that we might want to examine those kinds of laws. The Pentagon has announced 71 Guant?namo Bay prisoners will face parole-style hearings at an undetermined date. The six-member, all-military boards will not rule on whether prisoners are being lawfully held, but if their imprisonment is needed to protect the United States from major threats. In addition to having no timetable, the military has yet to disclose which prisoners will go first and whether the media will be allowed to observe. President Obama first ordered the reviews two years ago. The 71 prisoners do not include the 86 others who have already been cleared for release but remain behind bars. The news comes amidst a prolonged hunger strike by Guant?namo prisoners, with at least 46 being force-fed. A former CIA officer arrested in Panama in connection with an Italian conviction has returned to the United States. Robert Seldon Lady, who ran the CIA?s station in Milan, was convicted in Italy and sentenced to nine years in prison for the kidnapping of a cleric known as Abu Omar in 2003. Omar was snatched from the streets of Milan and taken to U.S. bases in Italy and Germany before being sent to Egypt, where he says he was tortured. Lady was detained in Panama last Thursday at the Italian government?s request. But just one day later, he was released and put on a U.S.-bound plane. It is rumored the Obama administration applied pressure on Panama behind the scenes, but details have yet to emerge. Italy says its request for Lady?s extradition was disregarded without plausible explanations. The incident comes just as the United States is seeking Edward Snowden?s extradition from Russia and the thwarting of his potential asylum in Latin America. The U.S. military has sparked criticism in Australia after dropping four unarmed bombs on a protected natural park. Two U.S. jets were forced to dump the explosives when their training mission was canceled and they needed to lose the extra weight to conserve fuel. The inert bombs were dropped on the Great Barrier Reef Marine Park, a highly sensitive environmental area. The U.S. Navy says it is planning a mission to recover the bombs. Environmentalists and antiwar activists had already been protesting the training missions, which come as part of annual U.S.-Australian war games. Larissa Waters, an Australian senator, said: Have we gone completely mad? Is this how we look after our World Heritage area now ? letting a foreign power drop bombs on it? A federal appeals court has ordered a New York Times correspondent to testify in the criminal trial of an ex-CIA officer accused of being his source. Prosecutors believe Jeffrey Sterling gave The New York Times? James Risen information on the CIA?s role in disrupting Iran?s nuclear program. A federal judge previously threw out a similar subpoena leveled at Risen, but the Obama administration appealed. In a divided two-to-one opinion, the Court of Appeals for the Fourth Circuit ruled Friday that Risen must testify because the First Amendment does not protect reporters who receive unauthorized leaks from testifying against their sources. In a dissent, Judge Roger Gregory said: The majority exalts the interests of the government while unduly trampling those of the press, and in doing so, severely impinges on the press and the free flow of information in our society. Risen has vowed to go to prison rather than testify and to bring his appeal before the U.S. Supreme Court.