?So where?s your sushi from?? I asked politely, still sweating the effects of Fukushima on fish from the Pacific Ocean. ?From Japan,? said the waiter. Well, duh, what should I have expected? We were in a Japanese restaurant. For more than a year now, scientists studying the effects of the March 2011 deadly earthquake and tsunami that triggered the disastrous breakdown of the Fukushima Daiichi nuclear plant have suspected that the plant may still be leaking. Levels of radioactivity in the waters and fish around the plant have not been declining, as would be expected. Recently, amid reports of surging radiation levels, Japan finally owned up: The plant has probably been leaking for the past two years, acknowledged Japan?s chief nuclear regulator. So should we, sitting comfortably across the Pacific, be worried about consuming Pacific fish? Nicholas Fisher, a State University of New York at Stony Brook professor, has been studying radioactivity and metals in marine life for more than three decades. He?s part of the research team examining Fukushima?s effects on the seas. Last year he reported small amounts of Fukushima?s cesium in Pacific bluefin tuna caught off California?s coast in summer 2011. Those tuna had spent their early days during that momentous spring off Japan?s Pacific shores, then migrated across the ocean, as some species do. Last month he published?another study?saying the amounts of cesium are nothing to worry about. ?The biological effects of any contaminant are generally dependent on the dose received,? he wrote. And the dosages of cesium in those 2011 tuna and attendant risks are extremely low, he said ? too low to detect any damage and declining in fish caught in 2012. In fact, he?s more concerned about mercury in tuna than radioactivity. Fisher compares the dosage of cesium you?d get from eating a 200-gram portion of that tuna to the naturally occurring radioactive potassium in one banana: The banana would give you a dose 20 times higher. When?s the last time you had a CT scan? That dosage is at least 1,000 times more ? depending on the scan, up to 10,000 times more ? than the amount an average American seafood consumer would get eating that contaminated tuna for an entire year, he said. But what about the fish being exported from Japan? To its credit, Japan lowered its levels of acceptable cesium in the wake of the disaster from 500 to 100 becquerels per kilogram. The U.S. limit is 1,200 becquerels per kilogram, and the Canadian limit is 1,000 becquerels per kilogram. Japan has been testing fish and posting results on the Internet. Some clear patterns are emerging: ? Some freshwater fish landlocked salmon, for example have higher levels of cesium, which is not surprising. Cesium mimics sodium and potassium. both of which are abundant and naturally occurring in the sea, meaning they would displace cesium uptake. ? And some of the ocean?s bottom feeders are showing levels above limits, which again is not surprising. Contaminants are getting trapped in sediments near the Fukushima nuclear plant, experts say, providing a continuous source of food for marine life that feed along the bottom near the shoreline. The fish that feed in this area include many familiar species: cod, haddock, grouper, bass, halibut, flounder, sole, snapper, shellfish, monkfish, turbot, sturgeon, shark, eel and greenling, which was once a delicacy in Japanese cuisine. Last February, a greenling caught near the plant registered the highest level of contamination yet, which is 7,400 times the amount of radioactive cesium that Japan deems acceptable. Meanwhile, Japan is working to keep contaminated fish off the market. Immediately after the incident, its fishermen voluntarily agreed to a ban on most commercial fishing off Fukushima prefecture. The ban did not include fishing for skipjack tuna and some mackerel, all caught far enough offshore that it didn?t seem to worry the decision makers. They?ve been inspecting samples of those species, they say. Today, a few of those restrictions have been lifted. You can now buy Fukushima octopus and snow crab, for example. And the country relies on a testing program that?s managed by the prefectures and depends on the fisherman?s voluntary compliance.? The prefectures regularly test samples for cesium, which builds up in muscle and irregularly test for strontium, which accumulates in bone , at least weekly, ?often daily, explained a spokesman for Japan?s embassy in Canada. If a fish contains cesium above limits, the fisherman is responsible for keeping that species off the market. That responsibility means they must not sell any fish of that species in that day?s catch. If a species from a particular area continues to show contamination, the central government can step in and ban fishing for that species in that area of the prefecture, as it has done in several instances. Then, if testing over multiple places within that area shows results consistently below limits, the feds can lift the ban. Take Japan?s Pacific cod. Today, it?s banned in Fukushima and neighboring Ibaraki prefecture but can still be snagged elsewhere and sold. At one point, it was prohibited in three other prefectures because its contamination levels were above limits, but the ban?s no longer in force. Do fish know prefectural boundaries? In North America, the U.S. Food and Drug Administration and its Canadian counterparts no longer single out imports from Japan for inspection like they did after the incident but they do still monitor radiation in all foods, spokespeople said. The FDA has also issued an order authorizing agents to seize certain foods from certain prefectures that Japan?s central government has already banned from exporting due to high contamination levels. Recently, the American Medical Assn. passed a resolution urging the FDA to monitor seafood carefully, and a group of physician organizations instrumental in that resolution, led by the University of British Columbia?s Dr. Erica Frank, are calling on U.S. and Canadian authorities to be vigilant. So could Pacific cod that had been feeding in those contaminated sediments make it to your faraway platter? Possibly, assuming it swam a few miles from Fukushima and through a few loopholes. If you indulged on a little sushi, would there be enough cesium to do harm? Fisher?s now starting to study the levels of radioactivity in those coastal bottom feeders along with the possibility of radiation in other migratory species. Being a worrywart, I ordered the mushrooms. But should I have asked where they came from? Sure enough, fungi feast on cesium, too. Top photo: Raw tuna. Credit: Holly Botner