The condition of the site right now is precarious. As long as there?s no earthquake, it?ll be okay. But that?s a big if where you?re sort of counting on an earthquake not occurring in a country that?s prone to earthquakes. And by an earthquake, I?m talking about a Richter 7 at or near the site. Now there?s three problems with the site right now. The first is the enormous amount of water that?s stored on the site in hundreds of tanks. Tokyo Electric isn?t letting us know exactly what the radioactive material is in those sites but there?s so much radiation in those tanks, we do know that the exposure to people who are outside of the plant boundary is very, very high. That tells us ? there?s this phenomenon called Bremsstrahlung and the decay of radioactive material in those tanks is releasing x-rays in very high quantities off site. That means that those tanks are extraordinarily radioactive and if there is an earthquake, none of them are seismically qualified. So we could easily have a situation where 700 tanks spring leaks, it runs across the surface of the site and into the Pacific Ocean. That?s more contamination in those tanks than has already been released into the Pacific Ocean. So number one is an earthquake destroying the tanks and causing them to leak. Number two is the concern I?ve had for years, which is the structural condition of unit 4. Unit 4?s fuel pool has the most fuel and the hottest fuel. It was recently changed out. So a loss of cooling in the unit 4 fuel pool can still lead to a fuel pool fire and contamination of vast amounts of the country. The chance of a fuel pool fire diminishes with time because the fuel becomes cooler. It?s not there yet but it is approaching the point where if the pool were to lose water, it?s likely that the fuel would not catch on fire. That assumes the fuel stays intact. If the earthquake is significant enough to distort the fuel and cause it to collapse, all bets are off and you can still get heating to the point of creating a fire if the fuel were to break and not be cooled. But the third thing, Akio, is what you referred to as the unit 3 problem. Unit 3 has less fuel in it than unit 4. That?s good. The bad news, though, is that unit 3 is much more severely damaged than unit 4. So if unit 4 could ride out a Richter 7 earthquake, it?s likely unit 3 will not. So the risk of a structural failure in unit 3 is higher, although there?s somewhat less nuclear fuel in the fuel pool, it still presents in my mind now rapidly becoming the single biggest risk on the site is a structural failure of the unit 3 building because of all the damage from the massive detonation shockwave that hit the building. The magnitude of this problem is huge. It?s as if we ? the Japanese should be fighting this as if it were a war. And you don?t fight a war on a budget. And I think that?s what?s happening in Fukushima. Tokyo Electric has minimal funds and they?re doing the best they can with minimal funds. And the Japanese government, it?s easier for them to blame the problems on Tokyo Electric rather than face the fact that at the root of this problem is that there?s not enough money being spent. So if you?re going to solve the biggest industrial accident in history, you?re going to need the funds required to do that. And I don?t think either party ? Tokyo Electric or the Japanese government ? want the Japanese people to understand just how deeply in debt the Fukushima Daiichi disaster has put them. I think it?s about a half a trillion to three quarters of a trillion dollars in debt to clean up the site and to clean up the prefecture. In reactors 1, 2 and 3, complete core meltdowns have occurred. Japanese authorities have admitted the possibility that the fuel may have melted through the bottom of the reactor core vessels. It is speculated that this might lead to unintended criticality resumption of the chain reaction or a powerful steam explosion ? either event could lead to major new releases of radioactivity into the environment. The temporary cooling pipes installed in each of the crippled reactors pass through rubble and debris. They are unprotected and highly vulnerable to damage. to a failure of some cooling systems, causing overheating of the fuel, further fuel damage with radioactive releases, additional hydrogen gas explosions, possibly even a zirconium fire and fuel melting within the spent fuel pools. Reactor No. 4 building and its frame are seriously damaged. The spent fuel pool in Unit 4, with a total weight of 1,670 tons, is suspended 100 feet 30 meters above ground, beside a wall which is bulging outward. If this pool collapses or drains, the resulting blast of penetrating radiation will shut down the entire area. At the Fukushima Dai-ichi nuclear power station, the spent fuel pools alone contain an amount of cesium-137 that is 85 times greater than at Chernobyl. Fukushima-diary.com... daily news Humankind's Most Dangerous Moment, by Harvey Wasserman Military, fascism rising in Japan against the people Fukushima facts that you have not been told about, dire update August 19, 2013. December 9, 2012, podcast, Arnie Gundersen update on Fukushima Fukushima reactor No. 4 vulnerable to catastrophic collapse; could unleash 85 times Cesium-137 radiation of Chernobyl; human civilization on the brink April 5, 2013. ABC San Diego: Fukushima fallout harming U.S. infants Court documents of the Fukushima Collective Evacuation Trial, for the Right to Education in a Safe Place Large amounts of radioactive black substance in Tokyo, many other places in Japan Professor says government research shows that Tokyo is as radioactive as Fukushima prefecture An hour of very strange activity at Fukushima, September 2, 2012 Tepco video The crisis was caused by absolute, gross negligence on the parts of General Electric, Tepco, and the Japanese Government Alternet.org/health... worst yet to come... Infowars.com search for Fukushima TEPCO live camera of Fukushima Daiichi. Discrepancies between TEPCO's video and video from the other, unofficial live camera of TBS News/JNN ? not caused by camera functions ? suggests TEPCO may be editing footage before releasing it as live . TBS News/JNN live camera of Fukushima Daiichi poor quality . Fukushima really blew up, launching TONS of Uranium and Plutonium into the atmosphere 4-hour Fukushima special on Coast to Coast radio, featuring David Blume, Arnie Gunderson, and others. May 9, 2012, interview with Micio Kaku, Fukushima reactor 4 still threatens the world. Fukushima webcam discussion thread, starting June 30, 2012. What are those flashes, those emissions? Michiyuki Matsuzaki, M.D.: A Statement of Facts: What Is Currently Happening to Fukushima Children? May 19, 2012. FAQs re radioactive isotopes, from the U.S. Centers for Disease Control Wall Street Journal: TEPCO has no plan to deal with Fukushima collapse China Syndrome inevitable ? massive hydrovolcanic radioactive explosion s Plutonium, U.S. National Institutes of Health Arnie Gundersen: If water is lost from reactor 4 spent fuel pool, a beacon of radiation will bathe site in ?sky shine? from gamma rays . Harvey Wasserman: We May Yet Lose Tokyo and Alaska and Georgia , February 20, 2012. ABC News Australia: Fukushima kids cop 'lifetime' radiation dose , July 12, 2012. Science Daily: How Low Doses Of Radiation Can Cause Heart Disease And Stroke , October 9, 2009. Fukushima worker says all reactors will be in crisis after a major aftershock. Effects of radiation come to weak-spirited people Opinion: Fukushima deniers are evil Former Fukushima Daiichi Worker: ?I believe the country will be evacuated if No. 4 fuel pool collapses? ? ?Should be hundreds or thousands of people working furiously every day? Black Cat Systems map of current radiation monitoring UN Ambassador: Fate of the world depends on Fukushima reactor 4 Arnie Gundersen: Everybody?s focused on Unit 4, and rightfully so, but Unit 3 had a more severe explosion and is likely structurally weakened more than Unit 4. Jeff Thomas: Ignoring the obvious June 30, 2012. Reactor 4 cooling system shuts down; backup system also inoperable. 47 hours at reactor 4 shows how close we are to a nightmare scenario Fukushima: Washington Hides 'Black Swan' of Economic Collapse The collapse of reactor 4? PDF: April 2012. Holophi CH AG Special Report on Fukushima Daiichi SFP 4 60 Minutes Australia: Fukushima will impact all of humanity Russian media: Over a third of Fukushima children at risk of cancer. Record high radiation levels detected at Fukushima reactor 1, July 3, 2012. NY Times: Computer worm used by U.S. to attack nuclear facilities ?had broken free, like a zoo animal that found the keys to the cage? ? In 2010 ?it began replicating itself all around the world? , June 1, 2012. Gundersen: If in Oregon, Wash., Calif. you need to demand officials test how Fukushima fallout has affected rivers and fish ? Significant radiation hit west coast and settled in on Cascades BBC VIdeo: Inside the Meltdown, February 2012. Minamisoma Official: Highly contaminated black algae observed everywhere ? due to bioaccumulation Wall Street Journal Fukushima Watch: Highlights of Tepco video of officials 'dealing with' nuclear accident in March 2011, recently released, August 6, 2012. National Resources Defense Council: What if the Fukushima nuclear fallout crisis had happened here [U.S.]? Fukushima Nuclear Accident Independent Investigation Commision Report, Executive Summary Professor in Japan Blasts Government, Tepco: 'These are lies, they?re absolutely lies' Wikipedia article: Corium, also called fuel containing material FCM or lava-like fuel containing material LFCM , is a lava-like molten mixture of portions of nuclear reactor core, formed during a nuclear meltdown, the most severe class of a nuclear reactor accident. Cesium implicated in heart attack death and injuries at radioactive debris incineration site. Nature International Weekly Journal of Science: Fallout forensics hike radiation toll: Global data on Fukushima challenge Japanese estimates, October 25, 2011. Excerpt from Statement of Ira Helfand, MD, Physicians for Social Responsibility: Unfortunately, there are a number of radioactive elements produced in large quantities in a nuclear reactor that are biologically active?they are actively taken up by the body and incorporated into our tissues. Iodine-131 is concentrated in the thyroid gland and causes thyroid cancer. Cesium-137 behaves like potassium. It is absorbed and distributed throughout the body. Cesium-137 has a half life of 30 years, and causes many different types of cancer. Strontium-90 is chemically similar to calcium. It is deposited in bone and, with its 29 year-half life, continues to irradiate bone and bone marrow for decades. It causes bone cancer and leukemia. Plutonium-239 with a half life of 24,200 years, is intensely carcinogenic if inhaled and causes lung cancer in microscopic doses. October 21, 2011. PDF re Birth Defects: Expert's Statement from Eisuke Matsui, Director, Gifu Environmental and Medical Institute: In this chapter, various kinds of potential health damage late damage are predicted in Koriyama City based on health damage surveys conducted in equally contaminated territories in Belarus and Ukrania after Chernobyl accident as in Koriyama City after Fukushima accident. Majia's Blog: All Hell Has Broken Loose at Fukushima Since Tepco Went on Vacation , May 26, 2012 New York Times: Fukushima vs. Chernobyl: How Have Animals Fared? Contaminated areas of Chernobyl and Fukushima are unlikely to be hospitable habitats for years to come. In Chernobyl, for example, the amount of americium-241, a highly radiotoxic isotope if ingested, is actually increasing as its parent nuclide, plutonium, decays. Radioactive materials like cesium are brought back to the surface soil each year by plant growth and pollination. August 11, 2012 Hot Particles and Measurement of Radioactivity , May 8, 2012. Many Japanese disaster survivors are dying from fatigue ? Bura Bura disease ? The nuclear accident at Fukushima was a preventable disaster rooted in government-industry collusion and the worst conformist conventions of Japanese culture, a parliamentary inquiry concluded Thursday. Fukushima is falling apart ? are you ready? June 2012. Scientific American: Nuclear Experts Explain Worst-Case Scenario at Fukushima Power Plant , March 12, 2011. Interesting Early Information: New York Times: With Quest to Cool Fuel Rods Stumbling, U.S. Sees ?Weeks? of Struggle , March 17, 2011. Dr. Miura, the director of Iwase general hospital conducted health checkup for people in temporary dwellings in Sukagawa city Fukushima. The result showed 6 in 10 children under 12 years old have diabetes. May 16, 2012. National Geographic: Mt. Fuji Overdue for Eruption. Mt. Fuji erupts on average every 30 years, but has not erupted since 1707, stirring up concerns that it may be building up explosive force. Volcano expert Shigeo Aramaki says, in the last 300 years there has been no eruption. With the past level of activity in mind, you cannot deny that 300 years of repose is pretty long?too long. July 2006. Japanese professor warns of high probability of eruption of Mt. Fuji within 3 years. Professor Emeritus Kimura from Ryukyu University: 34-kilometer-long fault found under the volcano, fumarole emissions, huge bubbling holes in ground. May 21, 2012. New York Times Current Overview of Japan, includes Fukushima status reports, August 10, 2012. Deadly Silence on Fukushima , May 11, 2011. Satellite pictures of Fukushima Daiichi, extensively notated in Japanese. Forest near Fukushima nuclear plant turning into high-radiation jungle , August 17, 2012.