Three official portraits of Prince George have been released in time for Christmas by the Duke and Duchess of Cambridge. The 16-month-old toddler, who is third in line to the throne, can be seen smiling on the stone steps of a courtyard in Kensington Palace. It has been almost five months since the prince was last seen in official photographs and a royal spokesperson made clear that the new pictures were released partially as a thank you to the media for not publishing any unauthorised photographs. A statement from Kensington Palace said the Duke and Duchess of Cambridge released the images in grateful acknowledgment of the fact that their request for Prince George to grow up without intrusion from photography has been, and continues to be, honoured . Click on the images below to see them in full: According to the BBC, the photographs were taken in late November by Prince Harry's private secretary and freelance photographer Ed Lane Fox. The images, released by Clarence House on Twitter, were shared more than 10,000 times. Retailer Cath Kidston has been rushing to restock the knitted tank top ? featuring Buckingham Palace's iconic guardsman ? worn here by Prince George. The Daily Telegraph points out that designers have sold out of stock previously worn by the prince. The 'George effect' was coined shortly after the prince was born when sales of the swaddling blanket he was wrapped in as he left hospital rose by 600% in the following week, says the newspaper. Cath Kidston no longer stocks the top, but has confirmed that it will be added back into its children's wear range in 2015 due to popular demand . Meanwhile, people who already own the vest have been putting it on eBay in a bid to make some cash. Prince George: photographer told to stop 'harassing' royal baby 2 October 2014 Lawyers for Prince William and Kate Middleton have issued a warning to a freelance photographer who was allegedly harassing Prince George. The couple are apparently concerned that the paparazzi have been pursuing their son during walks in London parks with his nanny. The final straw came last week when a man tried to take pictures of the young prince in Battersea Park, reports the Evening Standard. One senior royal source told reporters the individual had already been spoken to by royal protection officers about his behaviour on previous occasions over the past five years. BBC royal editor Nicholas Witchell says palace officials believe the photographer's actions amount to stalking . A statement from Kensington Palace said the Duke and Duchess of Cambridge were prompted to take action after the man was spotted near the young prince. No parent would tolerate the suspicion of someone pursuing and harassing their child and carer, said Kensington Palace officials. There is reason to suspect that the individual may have been placing Prince George under surveillance and monitoring his daily routines for a period of time. The duke and duchess understand the particular public role that Prince George will one day inherit but while he is young, he must be permitted to lead as ordinary a life as possible. The Evening Standard's royal editor Robert Jobson notes that so far no unofficial photographs of Prince George have been published in UK newspapers and magazines. Some have, however, apparently appeared in magazines abroad. Perhaps, given the role Prince George will one day play, more set-piece photo opportunities could be arranged in the future, he says. That would probably reduce the marketing opportunities for paparazzi photographs in an instant. Prince George: how is royal baby celebrating first birthday? 22 July Despite being third in line for the throne and receiving thousands of gifts since he was born, Prince George is celebrating his first birthday today with a low-key tea party . Prince William and Kate Middleton are inviting friends and family to Kensington Palace to mark the occasion but have insisted that they don't want their son to be showered with gifts. The Daily Telegraph says the plea appears to be well justified given that insiders say the prince has received 4,000 gifts since he was born, including three meerkats, a crocodile, two fattened bulls, a heifer and a goat. Michael and Carole Middleton will attend the tea party today, along with Aunty Pippa and Uncle James. Prince Charles and the Duchess of Cornwall are in Scotland on official duties, but Buckingham Palace staff have not ruled out a visit from the Queen. He started the festivities early by getting himself onto the cover of Vanity Fair's August edition, which raised some eyebrows by describing Prince George as an eligible bachelor . Nevertheless,?Today.com?reports that he has already received a marriage proposal - from a 10-month-old Australian admirer who popped the question by printing it on a T-shirt. An official portrait above of the young prince was released in advance of his birthday, showing the royal toddler walking confidently, arms aloft. It was described as rather underwhelming by the Independent, but the Daily Telegraph is impressed by the prince's boisterous energy . The paper adds:? With his arms outstretched and his eyes fixed on where he is going, the prince strides along the ground looking every inch the confident toddler. As the celebrate Prince George's birthday,?we review a busy first year in the life of the young prince. When was Prince George born? The Duchess of Cambridge was admitted to hospital in the early hours of 22 July 2013 and George Alexander Louis, Prince George of Cambridge, came into the world at 4.24pm that day, in the Lindo Wing of St Mary's Hospital, Paddington, with his father at the bedside. George weighed 8lb 6oz, according to the BBC.? How is he doing now? More recent figures on Prince George's weight have not been made public, but in April the Daily Telegraph reported that the Prince was expanding rapidly when he toured New Zealand and Australia with his parents. Visiting the Uluru rock, Kate told 17-year-old Shannon Hunt that George had grown an extra fat roll while away from home. When was Prince George christened? George Alexander Louis he doesn't need a surname, but could use Mountbatten-Windsor, Wales or Cambridge was christened at a low-key ceremony in St James's Palace, London, on 23 October last year. His first name surprised nobody ? 'George' had long been the bookies' favourite, said the BBC.? Who was Prince George named after? The new prince is third in line to the throne and if he one day reigns, it will be as George VII. The significance of Alexander is not known but Louis is thought to be a tribute to Louis Mountbatten, Prince Philip's uncle, who was killed by the IRA in 1979. Was George popular in New Zealand and Australia? In a 1983 break with royal protocol, Princess Diana insisted her nine-month-old son, Prince William, go with her on a royal visit to Canada. Twenty-one years later, William's own son made a similar public overseas tour, this time to Australia and New Zealand. And, judging from the presents he received not to mention the marriage proposal , George was the PR hit of the trip. The Telegraph published this list of gifts received by Prince George during the royal visit: What else has Prince George received? It's not just admiring members of the public who have showered the royal infant with gifts. According to The Sunday Times, Prince George has also received a blue tricycle from Boris Johnson, a precious stone globe with a cross from the Pope, a blanket from Barack Obama and a breakfast set from the prime minister of Malta. Finally, what sort of pyjamas does the young prince wear? Thanks to a royal walkabout in Crieff, we know that George has a pair of Spiderman pyjamas. However, his mother told local resident Lianne McNamara that George is too small to wear them just now, the Telegraph reported. Update, 8 September:?Prince George is to have a royal sibling, Clarence House has confirmed, announcing that the Duke and Duchess of Cambridge are expecting another child. Politicians from all parties lined up to celebrate the news of a second?royal baby, while some commentators drew a link between the announcement and the impending referendum on Scottish independence. All concerned will deny it utterly, of course, but an awful lot of people will look at this announcement and suspect it has been made with the intention of swaying the Scottish vote, says James Kirkup in the Daily Telegraph. The baby will be a Leo the Lion Kate's Mother knows the plan the stolen symbol of royalty and was conceived on October 31st - the lion is a universal symbol of courage which the royals and any one who bows their head to them has not cultivated within themselves. The royals plan everything by astrology and ritual. Don't believe me, do the research. The royals are not who we think they are and it is time for the rule by bloodlines to be done away with. Belief in rule by bloodlines is holding humanity back from evolving into the sacred, sovereign beings we are meant to be. The royals have hijacked humanity, held back how to live a sacred spiritual life and use knowledge about how humanity works to rule over us. Time for bloodlines and those that bow to them to evolve and get back on track. Life will be better.