As his royal highness is baby cambridge no more. Two days after arriving, he has a name, truly fit for a king. The duke and duchess of cambridge have dubbed him george alexander louis. Amy robach in bucklebury, england, this morning. On the name and so much more. Amy, good morning to you. Reporter: The guessing game is finally over. The palace, telling abc news, that they like the name. Quote, no more, no less, which has elite translates to america to, it is what it is. We are here in kate's hometown. Where the new royal family is beginning their life together without help from a nanny or a midwife. But kate has something even better than that, her mother, carole middleton. His royal highness, prince george alexander louis of cambridge. After two days, finally, a name. William and kate beat his parents who took a week to name him. A name a tribute to the queen, whose father was king george and middle name is alexandra. She visited yesterday, along with uncle harry and pippa also stopped by. Prince william and kate now anxious to spend some alone time with their little boy, george. I think any parent would have done. Know what this feeling felt like. Very special. Reporter: William and kate took no time before they headed out to kate's parents house in bucklebury, away from the prying eyes of the media. Getting his first days of security of his life to come. The family home secured by a perimeter of armed policemen on horseback, with a helicopter standing by. Now, kate's priority and prince william's, too, seems to be good, old grandma time. Reporter: They plan to spend three weeks in bucklebury. Later, william will return to make some ideas about his future. The prince doesn't get a day off. Reporter: Other people had other ideas. They should have named him tyrone. Reporter: Why tyrone? It's my name. Reporter: William and kate plan to do things on their terms. Respectful of royal tradition, but real role models for the modern monarchy. There's a lot of diapers ahead in william's near future. And a real chance for this 21st century couple to share parenting duties as hands-on parents. Josh, we have obtained, abc news, exclusively, some computer imaging that we worked on all night long to find out what prince george may look like when he gets older. If we can put the picture up right there. We can tell you that he may have a future in television news. A closer look, makes me think that looked a lot like prince tyrone. Prince george, it shall be. Amy robach, thank you. Has a ring to it. The news cycle continues. This transcript has been automatically generated and may not be 100% accurate.