Fugitive US whistleblower Edward Snowden is reported to have been given a document allowing him to leave the transit area of a Moscow airport and enter Russia. Please wait while this video loads. If it doesn't load after a few seconds you may need to have Adobe Flash installed. Edward Snowden applied for temporary asylum in Russia last week after his attempts to fly out of the country were thwarted. The US wants him sent home to face prosecution for espionage following his leak of classified information he obtained while working for the National Security Agency NSA . Mr Snowden, who alleges that the NSA has been involved in widespread eavesdropping on phone calls and email messages, flew into Moscow's Sheremetyevo airport from Hong Kong on 23 June. He is believed to have been in the transit area there ever since. Russian news agency RIA Novosti quoted an unnamed security official as saying that he has been issued with documents allowing him to formally enter Russia. Anatoly Kucherena, a Russian lawyer advising Mr Snowden, said at the airport on Wednesday that his asylum application was still being assessed and he would not be leaving immediately. He handed him several books, including Fyodor Dostoyevsky's seminal novel Crime and Punishment, a story about a poor student's moral deliberations after killing a pawnbroker. Mr Kucherena said Mr Snowden might find the book interesting, although he was not implying he's going through a similar mental anguish . Russian President Vladimir Putin has said Mr Snowden can be granted asylum in Russia only if he stops leaking secrets. Doing so would put further pressure on Russia's already strained relations with the US. According to WikiLeaks, Mr Snowden has considered several countries for asylum, including India, China, Brazil, Ireland, Austria, Bolivia, Cuba, Finland, France, Germany, Italy, the Netherlands, Nicaragua, Norway, Poland, Spain, Switzerland and Venezuela. Channel 4 ? 2015. We have updated our terms and conditions, privacy policy and cookies policy. Please ensure you read all these documents before using our Digital Products and Services.