By Laurie Kamens Published: 21:36 EST, 13 July 2013 | Updated: 12:25 EST, 14 July 2013 Angry crowds gathered in major cities across the country late last night following the not guilty verdict in the Trayvon Martin case. The demonstrators carried signs and gathered en masse from New York to Washington D.C. and Los Angeles. Though the marches were largely non-violent, police assembled close by to monitor activity - fearful strong reactions to the verdict could spill over into rioting. In Oakland, California, long a hotbed of racial tension, some protestors turned violent - vandalizing police cars, breaking windows and setting fire to garbage cans. One photo from the protests in the city shows men dousing a flag in lighter fluid and setting it alight. More demonstrations are planned today under the banner of 'Justice 4 Trayvon.' At least three separate protests are scheduled for New York City alone - one in lower Manhattan, one in Harlem an a third in Brooklyn. Police quickly brought the the Oakland protests under control. A crowd of more than 100 began marching peacefully in Oakland when a small section broke off smashing windows and starting small street fires. Local media reports said a police squad car was vandalized and police formed a line to block the protesters' path. The Oakland Tribune reports some windows on the newspaper's downtown offices were broken, and footage from a television helicopter showed people attempting to start fires in the street and spray painting anti-police graffiti. Officers reported the disruption was under control by 2am. The Oakland demonstration followed a raucous but largely peaceful one in San Francisco. Police say officers escorted demonstrators as they marched on the city's Mission District. The group was dispersed by 10 pm. Oakland has long struggled with race relations. In 2009, an unarmed black man named Oscar Grant was shot and killed while being handcuffed by Bay Area Rapid Transit police. The officer who shot him said he meant to use a stun gun instead of his pistol. The killing led to protests across the city and the officer being charged with first-degree murder. The Zimmerman verdict also sparked protests in Los Angeles, where demonstrators gathered in Leimert Park, the city's historically black neighborhood. Police said that about 200 gathered for a peaceful vigil. Lt. Andy Neiman of the LAPD Media Relations Department said another group of 50 to 100 demonstrators started marching around midnight. 'There was a period where crowds were running among vehicles, but police dissuaded them,' he said. Neiman said he knew of no arrests. Further protests are expected to take place across the country tonight with police officers on alert to watch for sudden bursts of violence. In Washington D.C., CBS reported the group of protesters grew from three people to about 400. They marched for an hour and a half, picking up people from bars and clubs along the way. People carried signs and chanted for racial equality. 'Stop criminalizing black men,' one sign read. 'I will not walk on these streets in fear,' one protester told the broadcaster. 'I?m not afraid'. Another rally is expected tonight at Meridian Hill Park and New York's Union Square while many are expected to re-converge outside the trial courthouse in Florida at 3pm today. The Miami Herald reported that many churches in the state were planning to remain open throughout the day to help people deal with news of the verdict. Two protest areas have been erected to allow protests in the city and police officers will be ordered to remain in uniform today to show their presence. Courthouses and other public buildings were the focus of many of the marches. More than 40 people gathered at Sacramento City Hall. The Sacramento Bee reported that protesters chanted: 'What do we want? Justice. When do you we want it? Now. For who? Trayvon.' A banner behind speakers read, 'No justice, no peace!' Demonstrations were organized quickly in the hours after news of the verdict broke. The outcry first poured out over social media and from demonstrators in front of the Florida courthouse in the moments after the not guilty verdict came down. Demonstrators outside the court started chanting 'Justice for Trayvon,' according to USA Today . Others shouted 'The system has failed,' in front of the courthouse where they were gathered en masse. Amongst the protesters at the courthouse were members of the New Black Panther Party who wore shirts reading, 'Freedom or Death.' The Sun Sentinel reported that the militants spoke of 'injustice' in the moments after the ruling. 'No one, no one could have foreseen that he would walk away,' said James Evans Muhammad, the party chairperson told the newspaper. A crowd of college students were amongst the louder voices present, chanting their dissent well after the verdict was announced. Violent words were thrown around on social media and vitriolic posters threatened that Zimmerman was a 'dead man walking.' Several online commentators sent out George Zimmerman's address while others post threats using the hashtag 'If I Ever See Zimmerman'. However, most heeded the Martin family's immediate calls for calm and sadness was the pervasive feeling among the thousands reacting to the divisive verdict last night. Stevie Johnson, wide receiver for the Buffalo Bills compared the Zimmerman verdict to Michael Vicks dog fighting case. 'Living in a world where you fight dogs; you could lose everything Mike Vick .. If you kill a black man you're not guilty! #INjusticesystem,' Johnson wrote. Miami Heat's Dwyane Wade lamented the verdict Tweeting,' How do I explain this to my young boys????' Musicians also tweeted their frustration with the jury's verdict. Celebrities including Rihanna, Ice Cube, and Nicki Minaj criticized the court's verdict. Rihanna tweeted, 'This is the saddest news ever!!! #whatsjustice.' Ice Cube wrote: 'The Trayvon Martin verdict doesn't surprise me. Stanford, FL never wanted Zimmerman arrested. Now he's free to kill another child.' American Idol judge and pop star Nicki Minaj wrote: 'And our taxes paid for that trial. We just paid to see a murderer walk free after killing an innocent unarmed little boy. #GodBlessAmerica.' Actors spoke out against the verdict as well, sending their prayers to the Martin family and expressing their disapproval of the court's verdict. HBO Girl's star and writer Lena Dunham sent her condolences to the Martin family tweeting, 'No. My heart is with Sybrina Fulton, Rachel Jeantel, everyone who loved Trayvon and has been sent the message that his life didn't matter.' Singer and actress Mandy Moore responded similarly writing, 'My heart is heavy...for all who knew and loved #TrayvonMartin. His life mattered. This is shameful.' Private Practice star Kate Walsh simply tweeted, 'Zimmerman verdict sickens me.' Others called for an end to the angry and violent social media reactions. Media mogul and entrepreneur Russel Simmons tweeted his sympathies for the family and put out a call for peace. 'I know many people are very upset about the verdict, but we must remain peaceful. No matter what, remain peaceful,' he wrote. Shortly after he tweeted again, 'If u have ant anger this evening, put that energy into challenging these horrible laws ...' Trayvon Martin's father also used Twitter as a public forum to speak after the verdict was handed down in his son's trial. Tracy Martin released several tweets shortly after the jury's verdict was announced. 'God blessed Me & Sybrina with Tray and even in his death I know my baby proud of the FIGHT we along with all of you put up for him GOD BLESS,' wrote Saturday night. Then two minutes later Martin said, 'Thanks to everyone who are with us and who will be with us so we together can make sure that this doesn't happen again.' This morning he added: 'Even though I am broken hearted my faith is unshattered I WILL ALWAYS LOVE MY BABY TRAY.' Martin's mother, Sybrina Fulton, added: 'Lord during my darkest hour I lean on you. You are all that I have. At the end of the day, GOD is still in control. Thank you all for your prayers and support. I will love you forever Trayvon!!! In the name of Jesus!!!' Several African American leaders also spoke out. Reverend Al Sharpton was amongst those who came out strongly against the court's decision. 'The acquittal of George Zimmerman is a slap in the face to the American people but it is only the first round in the pursuit of justice. We intend to ask the Department of Justice to move forward as they did in the Rodney King case and we will closely monitor the civil case against Mr. Zimmerman. I will convene an emergency call with preachers tonight to discuss next steps and I intend to head to Florida in the next few days,' Sharpton said, CNN reported. Leaders from the National Association for the Advancement of Colored People also made statements condemning the Florida court's verdict. NAACP President Benjamin Todd Jealous said: 'We are outraged and heartbroken over today's verdict. We stand with Trayvon's family and we are called to act. We will pursue civil rights charges with the Department of Justice, we will continue to fight for the removal of Stand Your Ground laws in every state, and we will not rest until racial profiling in all its forms is outlawed,' Local Florida NAACP President Adora Obi Nweze added: 'We lost a young man due to senseless violence, but justice did not prevail. Last year we pushed for the arrest of George Zimmerman and a thorough investigation and trial. Today, we are still called to act. No one should be allowed to use this law to commit a senseless crime again.' At a press conference after the trial Florida State Attorney Corey declined to comment on the verdict, but instead thanked the judge and jury for their participation. 'We have done our best to ensure due process. .. to show that the American justice system can and good only be done in a court of law. I don't think it helps anyone to be out espousing opinions about our cases,' Corey told reporters. However other Florida state officials were more emotional about the court's verdict. Speaking vehemently Bernie De La Rionda, Assistant State Attorney simply said: 'I'm disappointed by this verdict but we accept it.'