Supporters of ousted President Mohamed Morsi have massed for further protests to demand the army restore Egypt's first democratically elected leader, after almost 24 hours of violence that has killed at least 37 people. The atmosphere was tense on Saturday as interim leader Adly Mansour held talks with ministers, aides and the Tamarod?opposition group that engineered the mass demonstrations culminating in the ouster of Morsi. Opposition leader Mohamed ElBaradei was to be named the interim prime minister later on Saturday, a source close to Mansour said. Crowds were swelling late afternoon outside Cairo's Rabaa al-Adawiya mosque in Nasr City, where Morsi supporters have been camped out for the past 10 days. Morsi supporters also gathered for a sit-in outside the Republican Guards building where the ousted president is believed to be held. The nearby 6th October bridge over the Nile River was still littered with rocks and burned out tyres from the overnight deadly confrontations. Anti-Morsi protesters meanwhile, have set up checkpoints in Cairo's Tahrir Square after a night of deadly fighting nearby. Al Jazeera's Sherine Tadros, reporting from Cairo, said that the Freedom and Justice Party, the political arm of the Muslim Brotherhood declined to attend the meetings to discuss a new government. On the one hand you have the interim president Adly Mansour aggressively trying to push forward this political transition - the so-called roadmap - by meeting with these political factions to try to form a coalition government that will not exclude anyone. Tadros said. On the other hand you have the protests taking place by supporters of Mohamed Morsi. And they're saying that they will stay on the streets to demonstrate until the deposed president is reinstated. So they are not taking party in these meetings, she added. A coalition of Islamist groups early on Saturday vowed civilised protests and peaceful sit-ins in Cairo until the military coup is reversed and the legitimate president is restored . Despite the talk of peaceful demonstrations, residents of a Cairo district reported that Morsi supporters armed with machine guns, machetes and sticks clashed with them as they passed through their?area during the night. Coptic priest killed Fighting during the night between Morsi's supporters and opponents elsewhere in the capital and in the Mediterranean city of Alexandria, where pitched battles raged in the streets, killed at least 37 people and injured around 1,000, medics said. The bloodletting continued on Saturday with gunmen killing a Coptic Christian priest by dragging him from his car and riddling him with bullets in the restive north of the Sinai peninsula, security souces said. That came after armed Morsi supporters had stormed the provincial headquarters in the Sinai town of El-Arish and raised the black banner of al-Qaeda-inspired fighters on Friday night,?AFP news agency?reported. The fighting follows Wednesday's toppling of Morsi, underlining the determination of the ousted leader's Muslim Brotherhood to disrupt the military's plan for a political transition until new elections. The top leader of Morsi's Brotherhood, Mohammed Badie, vowed on Friday that members of the Islamist movement would throng the streets in their millions until his presidency is restored. Morsi's first year of turbulent rule was marked by accusations that he failed the 2011 revolution by concentrating power in the Brotherhood's hands and allowing the economy to take a nosedive. The grassroots campaign Tamarod, Arabic for Rebellion, has urged its supporters to take to the streets again on Sunday, foreshadowing further confrontation in the streets. Police meanwhile, pressed a round-up of top Islamists, announcing the arrest of Khairat El-Shater, widely seen as the most powerful man behind Morsi in the Brotherhood. 'Preventively detained' Army chief General Abdel Fattah al-Sisi announced Morsi's overthrow on Wednesday night, citing his inability to end a deepening political crisis. The Islamists accuse the military of conducting a brazen coup, after millions called for Morsi's ouster on the June 30 anniversary of his maiden year in power. The?interim president issued his first decree on Friday, dissolving the Islamist-led parliament and appointing a new intelligence chief. Morsi is being preventively detained , a senior military officer told AFP. A judicial source said the prosecution would on Monday begin questioning Brotherhood members, including Morsi, for insulting the judiciary . Coincidentally, ex-president Hosni Mubarak, toppled in a popular uprising that led to the poll in which Morsi was elected new leader, appeared in court in Cairo on Saturday when his retrial for alleged complicity in the killings of protesters in 2011 resumed. The 85-year-old former president appeared in the dock behind bars on Saturday, wearing dark sunglasses and a white prison uniform. During the televised hearing, Cairo's criminal court heard submissions by the defence before adjourning proceedings until August 17.