Cairo, Egypt - In Tahrir Square and at the presidential palace, hundreds of thousands of protesters are holding raucous celebrations, overjoyed at the possible imminent ouster of a president they view as illegitimate. A few kilometres away, tens of thousands of President Mohamed Morsi's supporters have been staging their own rally since Friday, vowing to defend the president and dismissing his opponents as the architects of an armed coup . The deepening political crisis in Egypt has largely come down to a debate over meaning of the word legitimacy. The president used the word dozens of times in his defiant speech on Tuesday night, describing himself as Egypt's guardian of legitimacy . His supporters are staging an open-ended sit-in in Cairo's Nasr City neighbourhood under the banner legitimacy is a red line . Morsi was elected democratically last year, they say, and the only way to remove him should be through elections at the end of his term. Democracy is a contractual agreement between the people and an elected leader to lead the country across a transition, said Gehad el-Haddad, a senior adviser to the Muslim Brotherhood's political wing, the Freedom and Justice Party. That contractual agreement was for four years. Morsi's critics, however, argue that contract was not etched in stone. The president gave up his legitimacy through a series of illegitimate actions, they say, most notably a November decree that protected his decisions from judicial review, a declaration that has never been cancelled. He lost the revolutionary movement early on [with the decree] ... then added to this was his and his party's incompetence, ineffectiveness at governing, said Mohamed Waked, a political commentator. People are not going to give them the chance to try and run a state. In interviews over the past week, officials from Morsi's Muslim Brotherhood and its political wing have struggled to list substantive achievements from the past year. Egypt's economy is in free-fall, with worsening fuel and electricity shortages. Official statistics, unreliable as they are, show that violent crime has increased exponentially since the revolution. There has been little progress towards the revolution's goals of bread, freedom and social justice . Locked in the past But these problems stem from decades of neglect and corruption, and would pose a daunting challenge for any Egyptian president. Morsi's real failing, opponents say, is more style than substance: He has focused on shoring up his support base instead of trying to unite a divided country and build consensus for reform. Khaled Fahmy, an Egyptian historian and activist, described the group's worldview as locked in the past , a time when the Brotherhood was a secretive organisation struggling to survive under then-president Gamal Abdel Nasser, who led a brutal crackdown on the group in 1954. He's had little connection with people outside the Muslim Brotherhood. His mindset is out of date, Fahmy said. It might have been suitable to confront the Nasserite state in the 1960s ... but it's not suitable to govern a country, especially if you won by the slimmest of majorities. Morsi took office after winning less than 52 percent of the vote in the second round of last year's presidential elections. He was propelled to victory not just by the Islamist vote, but by an uneasy coalition of liberals who backed him in order to block his opponent, longtime Mubarak-era prime minister Ahmed Shafiq, from winning office. But their narratives quickly began to diverge, and they split for good after Morsi issued his November decree, which also helped to push through Egypt's new constitution by shielding the assembly drafting it from dissolution by court order. The assembly was dominated by Islamists, and the final draft of the constitution was hastily approved in a marathon all-night voting session. To Morsi's supporters, the president was simply using his newfound legitimacy to overcome a recalcitrant bureaucracy. He took the reins of a state that was not broadly sympathetic to his Brotherhood. The upper ranks of the government remain stacked with members of the former president's regime, and many members of the security services are openly hostile to Islamist movements. The president came in with a vision. The bureaucracy, which is supposed to deliver on that vision, is largely corrupt ... aligned with the old regime, Haddad said. That relationship is still tense. The political crisis of the past few days has certainly highlighted and heightened that tension, particularly with the security services. On the streets of the Egyptian capital, police officers wave red cards, a symbolic demand for the resignation of Morsi. The interior ministry issued a statement expressing its complete solidarity with the army, which on Monday gave the president an ultimatum: resolve the political crisis within 48 hours, or we will. Losing allies Six of Morsi's 35 cabinet ministers have tendered their resignations in the past two days, as has his spokesman. Morsi's critics describe his decree as a breaking point, the moment when the president lost both their support and his own legitimacy. Senior members of the National Salvation Front, the largest formal opposition bloc, say they have had no communication from the presidency since it was issued. We will never respect him as a president: he split the nation, he divided us into groups, said Eman el-Mahdy, a spokeswoman for Tamarod, the grassroots campaign that organised this week's protests. Since November, analysts say, Morsi has largely played to his base. He appointed 17 new governors last month, half of whom were members of the Brotherhood or other Islamist factions. He has offered few ministerial positions to prominent non-Brotherhood members, instead naming them as presidential advisers; most of them have since resigned, and complain that Morsi's policies are driven largely by advice from senior Brotherhood officials. He talks about all of these problems, but he has done nothing to build consensus to fix them, said Mohamed Aboul Ghar, the head of the Social Democratic Party and a senior member of the National Salvation Front. These differing narratives are perhaps to some extent a hangover from the Mubarak era, when Egyptian politics were dominated so thoroughly by one man and his ruling party. Critics blame him for everything from electricity shortages to insecurity; supporters describe him as the one man capable of holding the country together. At the Nasr City sit-in, several people warned of looming civil war should he step down. If anyone else was in power, we'd be like Syria by now, said Umm Mahmoud, a housewife attending a protest there. But the focus on Morsi also underscores the extent to which he has focused on his support base, and even that could be slowly deserting him. One of the governors appointed last month was Adel el-Khayat, a member of Gamaa al-Islamiyya, once a banned, hardline armed group. He was appointed to head Luxor governorate, where members of the group went on a shooting rampage in 1997, killing 62 people, mostly foreign tourists, at the temple of Hatshepsut. Khayat stepped down a week later amid widespread anger from the tourism industry. Yet on Wednesday Tareq el-Zomor, a leading member of Gamaa al-Islamiyya, called for early presidential elections, telling Reuters news agency that Morsi could avoid a military coup by calling a vote. Morsi's final opportunity to head off the political crisis came last Wednesday, when he delivered a speech to the nation. The president acknowledged making mistakes, but instead of explaining what they were and how he planned to correct them, he dismissed his opposition as thugs and remnants of the old regime. Activists said the tone was petty and hectoring, a litany of complaints about politicians, businessmen and media figures who Morsi accused of corruption. And it perhaps helped fuel the anti-government rallies four days later. In interviews in Tahrir Square and at the presidential palace on Sunday, many protesters said they were angered by the speech, which seemed to ignore a large swath of the country. He made no concessions at all to anyone, and was talking only to his own constituency, Fahmy said. And that proved to be fatal.