The New Yorker questioned why are Americans so interested in an overseas monarchy that has virtually no power and which now functions primarily to attract tourists . They also suggested allow[ing] the cameras into St Mary's hospital , in the style of Kim Kardashian. In the New York Times, Lionel Shriver pointed out that the baby being third in line is of no more worldly import than my being third in line at my local Tesco . Also in the NY Times, Lauren Apfel bemoaned a princess culture in which girls ? idolise a subset of characters distinguished mainly by their cinched waistlines, their ability to accessorise with a diadem, and an arbitrary title . She called for women who can be admired for their strength of purpose, their brains, their prowess ... As a parent, I just don't care for princes and princesses, whatever form they come in, because it is an impossible title to achieve, unless you are born or marry into the family. Satirical website the Onion claimed the baby had started crawling, eating, speaking and had his father's eyes ? the twist being that the baby is a demon who has taken his father's eyes and eaten Prince Charles. Greg Gutfield, on Fox News, said: Someone's got to break it to the baby that his teeth aren't going to get any better. The royal baby's gift from the Australian government has shifted from Julia Gillard's knitted kangaroo to a donation for a research project to save the Australian desert rat, the bilby. No one knows what happened to the kangaroo. The Northern Territory, meanwhile, has announced it will be giving the baby Crocodile George, who hatched on 12 December, when William and Kate announced their pregnancy. Crocodile George will live with crocodiles William and Kate, gifts to celebrate the couple's engagement. Even Iranians were unable to escape royal baby coverage ? although Tehran's take on the event was somewhat different from that of the rest of the world's media. State TV revealed that public opinion in Britain was heartily against the royal family and exposed the Queen as an iron-fisted dictator. It said: Nothing could have manifested English people's hatred of their monarchy as much as the birth of this baby. [The] birth ? took place after nine months of controversy during which the Queen of England tried her best to be seen more and cover up her weaknesses. Press TV, aiming at an English-speaking audience outside Iran, did make a sensible point: Today, the British public ? grinding under massive austerity budget cuts, unemployment, poverty wages, social deprivations and crumbling services ? are thrown scraps of feelgood comfort from the much hyped event. The attitude is silly at best and escapist Prince Charming syndrome on steroids at worst. The capital, Ottawa, joined the global welcome for the new Prince of Cambridge, lighting up the country's parliament in blue on Monday evening. The Monarchist League of Canada suggested that everyone consider holding a Canadian royal baby wedding shower some time during this summer ? a simple, inclusive neighbourhood celebration, with guests raising a glass, giving a few dollars to a charity and signing a card . It went into great detail about how to host a shower: Some music in the background is a great help during the moments of the first guests' arrival, especially if you are inviting strangers. Very Pippa Middleton. Vladimir Zhirinovsky, leader of the Liberal Democrat party, said: I don't care about the heir. The British monarchy ... destroyed our state. The birth of another British monarch, who will suck our blood, cannot bring us any kind of happiness. Elsewhere, the Russian newspaper Kommersant's website initially wrote that the baby was the first child of Charles and Kate . The baby's birth was preceded by earthquakes in Gansu province, so many newspapers' front covers featured the first baby born in the Gansu area instead. Elsewhere Chinese fortune tellers predicted George's future. Mak Ling-ling took no risks: It's likely he will have to go overseas, perhaps representing the army or going to a boarding school. Au Chung-tak said: He must not live close to water. Instead he should live by the trees in order to ensure a successful marriage. He added that he would achieve harmony with his siblings . Le Monde mocked the media frenzy in the UK, suggesting the frustrated tabloids had to recycle secondhand material for their readers who wanted salacious stories ? even though many French news outlets bought into the hype. Everything you need to know about this birth, read the headline in Le Parisien. Le Figaro dedicated articles to l'arbre genealogique des Windsor the Windsor family tree and William, un prince normal in a nod to Fran?ois Hollande's much repeated pre-election promise to be a un pr?sident normal . One commentator suggested the French were missing their own royal family, who were rather unceremoniously ditched over 220 years ago. The Local, an English-language website, had a more prosaic explanation: It was not the busiest of news days and it is summer. Sudarsan Pattnaik, noted sand artist and winner of last week's international sand art competition, created a sculpture for the royal baby with the message Welcome Baby Cambridge . Plans were initially placed on hold owing to incessant rains in the state of Orissa, where he sculpts. The Indian mystic and holistic healer, Larrah Shah, has said Prince George will run in an election for president or prime minister and will probably win it . She predicted that he would be very politically inclined and improve international relations, particularly with Arab countries. This view was supported by Raj Kumar Sharma, who said: Physically he could be a little big and maybe on the plumper side at some point. He will love food and luxuries, not to mention women. The numerologist Anupam V Kapil calculated the baby's karmic number as eight. India's Republic Day number, 26, adds up to eight, while Independence Day falls in August, the eighth month. Therefore, the baby must have a karmic connection with India . The Lindo family, who were benefactors of St Mary's hospital, where Prince George was born, settled in Jamaica in 1765 and were involved with sugar plantations there. A surviving family member, Blanche Blackwell, 100, is the mother of Chris Blackwell, who owns Island Records, Bob Marley's label. The Namunyak women's group from the Ilpachie village in Samburu county have a black bull and goat waiting to be presented to the royal baby. William visited Ilpachie in 2004, so they feel a special affection for him. Kenya was also where William proposed to Catherine. Islamabad-based Daily BBC Record London Ltd no relation to the BBC has investigated the royal baby's family tree and made this discovery: The baby's relations will stretch from a simple Parisian actress via the Dracula princes in Romania, to even an Islamic sultan from Seville in Spain, who descended from the Muslim prophet Mohammed, experts say. Syed Talat Hussain, a Pakistani journalist and anchor, mocked the Pakistani media, saying: William seems to be the shared son-in-law of Pakistani media celebrating his fatherhood! Suretha Erasmus is a South Africa- based genetic counsellor who has created images of the royal baby as a teenager. He believes George will share many of Diana's facial features but will have his mother's dark hair. The website AllAfrica published a piece about the dangers of pregnancy in Africa and whether the duchess would have survived there. Every day, around 800 women die from causes linked to pregnancy and childbirth. And it will come as little surprise that the majority of these deaths occur in poor countries ... 99% of all maternal deaths occur in developing countries, largely in sub-Saharan Africa and south Asia.