So far, all we know is the time of arrival, weight and gender of the royal baby. Which means we're only slightly better informed about the future monarch than we are about trains. And much like a train timetable, many of us are staring up at television screens awaiting further information. To help you pass the time, we've done some research so you can find out what your chances are of being around by the time the baby takes the throne - and, if you are, what the countries reigned over by the new king will look like. If you're over 20 in the UK, forget it If ONS life expectancies are anything to go by, then Prince Charles would already be well into his reign over the UK and the Commonwealth of Nations. But, history proves that the royals don't share British life expectancies - we've calculated they tend to live for 15 years longer than someone born in the UK in the same year. In fact, Queen Elizabeth's reign suggests that gap may be growing as she looks set to far outlive her 86 year life expectancy. If we assume that the gap between royals and Brits isn't growing, and that each of the successors to the throne will accept and occupy it until their death then the royal baby will be crowned in 2082, at the age of 69. It seems unlikely however that Prince Charles will take over from his mother this year. If instead, each of the current heirs to the throne live to 102 years of age as did the queen mother then it won't be until 2084, when the royal baby is 71 years old that he will take become King. Unless our male and female life expectancies change dramatically by then, that means that only women born in 1993 and men born in 1996 can expect to watch the royal baby take to the throne. But you might see other milestones. If the royal baby is like other single men in the UK to get married, he'll do so at the age of 31 - a ceremony which most Brits in their early 50s today can live to enjoy. And, if the prince is anything like the 1 in 4 British men who are divorcees when they marry, then Britons in their late 30s can expect to see a second wedding 15 years later. On average, life expectancies in the Commonwealth of Nations are not as high as they are in the UK - in fact, for those born in 2011, they are 14 years lower. That difference in life expectancy means that not all Commonwealth countries can hope to see the new prince become King. In Lesotho and Sierra Leone, where average life expectancies are just 48 years, it's unlikely that any of the countries' present citizens will see the coronation of the royal baby. It's a very different story in Australia and Singapore, where the latest figures show that nationals live slightly longer than Brits - reaching 82 years of age. By then, the Commonwealth which currently contains more than 2 billion people, may be a very different place. India's population alone is expected to swell by one third over the next fourty years. African countries like Burkina Faso, Chad and Benin will more than double in size over the same period. The World Bank estimates that the UK will also be bigger by the time that the prince is in his late 30s - 16% bigger - as the country will number almost 36 million citizens. Will you be around by the time that the prince is born? Do you care? Share your views by posting a comment below. Can you do more with this data? ? Email us at data@guardian.co.uk ? Follow us on Twitter ? Like us on Facebook