Do you like 'George'? | Poll | Comment is free | theguardian.com 	 		 														 	 	 	 		 			 							 	 	 	 	 	 		 Turn autoplay off Turn autoplay on Please activate cookies in order to turn autoplay off 	Jump to content [s] 					Jump to comments [c] 				Jump to site navigation [0] 		Jump to search [4] 		Terms and conditions [8] 	 		 	 	 Edition: UK US AU Your activity Email subscriptions Account details Linked services Sign out Beta 			 	 	 							 		 			 						 		 	 		 					 	 	 	 			 			 		 					 				 	 			 					 	 		 			 	 				 				 		 							 	 	 		 						News 					 												 																			 						US 					 												 																			 						World 					 												 																			 						Sports 					 												 																			 						Comment 					 												 																			 						Culture 					 												 																			 						Business 					 												 																			 						Money 					 												 																			 						Environment 					 												 																			 						Science 					 												 																			 						Travel 					 												 																			 						Tech 					 												 																			 						Media 					 												 																			 						Life & style 					 												 																								 						Data 					 									 										 Comment is free 					 				 				 	 		 										 	 	 		 			 	 	 					 	 				 		 	 		 										 					 	 	 	 	 	 	 	 					 	 		 		 		 			 				 									Do you like 'George'? 				 									George Washington, George III, George Eliot, George Orwell, George Best, George Bush, George Clooney ? the new royal baby's name has had a mixed history. Are you a Georgian? 				 							 		 		 												 Share 	 	 	 	 	 	 Tweet this 	 Email 					 	 													 	 			theguardian.com, 				 Wednesday 24 July 2013 16.32 EDT 				 	 		 										 			 						 					 					 			Jump to comments ? 		 		 	 	 							The royal baby is named Prince George Alexander Louis, on 24 July 2013. Photograph: John Stillwell/AP 					 	 	 		 			 	 		 			 							 																Do you like the name 'George'? 							 						 					 							 						 ? 							 						 						 															Yes 													 					 							 						 ? 							 						 						 															No 													 					 		 	This poll is now closed 		 	 			 			 					 		 				 		 	 	 	 	 	Print this 	 			Share 	 			Contact us 	 	 	 	 		 			Send to a friend 			 		 		 			 Sender's name Recipient's email address 					 					 				Your IP address will be logged 			 		 	 	 	 	 	 		 			Share 			 		 					 				Short link for this page: 				http://gu.com/p/3hha6 			 							 				 					StumbleUpon 				 			 			 				 					reddit 				 			 			 				 					Tumblr 				 			 			 				 					Digg 				 			 			 				 					LinkedIn 				 			 			 				 					del.icio.us 				 			 			 				 					Facebook 				 			 			 				 					Twitter 				 			 		 	 	 	 		 			Contact us 			 		 		 		 						 					 Report errors or inaccuracies: userhelp@theguardian.com 				 				 											Letters for publication should be sent to: guardian.letters@theguardian.com 									 			 		 			 					If you need help using the site: userhelp@theguardian.com 				 				 					Call the main Guardian and Observer switchboard: +44 0 20 3353 2000 				 				 					 							Advertising guide 						 						 							License/buy our content 						 					 			 	 				 	 		 										 	 			 	 		 											 	 	 	 	 	 					 					UK news 		 	 						 																		Monarchy ?															 								 																		The Duchess of Cambridge ?															 								 																		Prince William ?															 								 																		Prince George 															 				 World news 		 	 										 					Life and style 		 	 						 																		Parents and parenting 															 				 		 									 	 		 											 	 	 	 	 			More from Comment is free on 	 					 					UK news 		 	 						 																		Monarchy ?															 								 																		The Duchess of Cambridge ?															 								 																		Prince William ?															 								 																		Prince George 															 				 World news 		 	 										 					Life and style 		 	 						 																		Parents and parenting 															 				 					 		 	 						 								 					 																			More on this story 									 																	 																																																														 													 	 		 										 						 	 			 	 																										 		 	 Harry, prince of fun? Only if you're into naked billiards 																											 Michael Moran: The promise made to Prince George may backfire if he grows up to be a bookish nerd more interested in metaphysics than Mahiki 																									 																																																									 							 																				 														 															 																																																		 	 																										 														 		 		 		 	 	 			 	 														 		 	 Prince Harry promises fun for new nephew 													 												 																																													 							 																				 														 															 																																																		 	 																										 														 		 		 		 	 	 			 	 														 		 	 Prince George: how Prince Harry will make his life fun 													 												 																																													 							 																				 														 															 																																																		 	 																										 														 		 		 		 	 	 			 	 														 		 	 Royal baby overload? Here's some other news you may have missed 													 												 																																													 							 																				 														 															 																																			 																		Prince George 									 																								 							 																				 														 															 																																																														 													 	 		 										 						 	 			 	 																										 		 	 Royal couple choose name fit for a king 																											 The royal baby is to be called George Alexander Louis or His Royal Highness Prince George of Cambridge, for short 																									 																																																									 							 																				 														 															 																																																		 	 																										 														 		 		 		 	 	 			 	 														 		 	 What's in a name? 													 												 																																													 							 																				 														 															 																																																		 	 																										 														 		 		 		 	 	 			 	 														 		 	 Why the name had to be George 													 												 																																													 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																			 																		Video 									 																								 							 																				 														 															 																																																														 													 	 		 										 						 	 			 	 																										 		 	 Prince Harry: 'I will make sure George has fun' 																											 New uncle Prince Harry says the birth of the Duke and Duchess of Cambridge's baby, Prince George, is a fantastic addition to the royal family 																									 																																																									 							 																				 														 															 																																																		 	 																										 														 		 		 		 	 		 			 									 Royal baby is named George Alexander Louis 													 												 																																													 							 																				 														 															 																																																		 	 																										 														 		 		 		 	 		 			 									Waiting for the royal baby: a street-level view 													 												 																																													 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 																				 														 															 																																 							 											 						 		 	 		 										 					 		 					 		 		 		 							 																																 	 				 							 			 						 	 Share 	 	 	 	 	 	 Tweet this Email 	 	 				 			 						 	 	 	 		 										 		 			 		 		 				 	 	 		 										 			 						 					 										 	 	 		 			 	 		 											 				 			 			 						 					 										 	 	 		 			 	On Comment is free 	 	 		 			 Most viewed Latest Last 24 hours 1.? 								With Roy ?Chubby? Brown and Citizen Khan?s help, I?m creating a comedy databank for Islamic Birmingham | Stewart Lee 2. 								Charlie Brooker: The most dangerous drug isn't meow meow. It isn't even alcohol ... 3. 								The families cheated out of their homes ? for the sin of being poor | Aditya Chakrabortty 4. 								How did Fox News' Birmingham blunder make it to air? Because everything does | Joe Muto 5. 								Forget the bad science. Here are my top 5 dos and don?ts of dating | Naomi McAuliffe 					 					More most viewed 					 Last 24 hours 1.? Cancer drugs will always be emotive but the government is right to restrict them | Simon Jenkins 2. Steve Bell's If ... on l'artiste who paints God 3. The families cheated out of their homes ? for the sin of being poor | Aditya Chakrabortty 4. Why our distorted fears cost more lives than terrorism | Polly Toynbee 5. Lena Dunham goes dark on Twitter. And it's no wonder 				 				All today's stories 				 				 			 			 						 					 										 	 	 		 			 	 		 												 	 		comment is free? 	 	 		Latest posts 		 	 		 	 	 	 			 						 				 	 	 	 	 						 					 	 	 									 	17min ago 					 						Cancer drugs will always be emotive but the government is right to restrict them 					 								Simon Jenkins: First thoughts: Drug companies and critically ill patients cannot be left to dictate how the NHS allocates its scarce resources 				 																																									 																									 																 	 	 	 	 	 				 			 						 				 	 	 	 	 						 					 	 	 									 	1hr 38min ago 					 						Steve Bell's If ... on l'artiste who paints God 					 								Steve Bell's If ... 				 																																									 																									 																 	 	 	 	 	 		 		 	 				 			 		 		 			 	 						 			 			 				 													Comment from the paper 												 			 			 	 					 						 															Aditya Chakrabortty: 														The families cheated out of their homes ? for the sin of being poor 						 					 									 								 							 					 						 															Polly Toynbee: 														Why our distorted fears cost more lives than terrorism 						 					 									 								 							 					 						 															Steve Bell: 														Steve Bell on David Cameron's deficit speech ??cartoon 						 					 									 					 									 	 	 	 				 			 			 						 					 										 	 	 		 			 	 		 											 		 	 		 						 		 	 Today's best video 			 		 			 										 					 																																										 			 			 		 	 					 																																											 		 		 		 			 	 		 						 										 	 			 		 	 					 																																										 			 	 	 	 	 				 		 		 	 Fox News expert: Birmingham is a 'totally Muslim' city 					 					 																																										 			 			 		 			 			 											 			Steven Emerson, who claims to be a terrorism expert, tells Fox News that Birmingham is a 'totally Muslim city' and London is patrolled by violent religious police 		 	 					 																																									 														 																						 										 					 																																										 			 			 		 	 					 																																											 		 		 		 			 	 		 						 										 	 			 		 	 					 																																										 			 	 	 	 	 				 		 		 	 Nine-year-old boy takes on parliament 					 					 																																										 			 			 		 			 			 											 			Alex Rukin addresses parliament to oppose the HS2 high-speed rail link 		 	 					 																																									 														 																						 										 					 																																										 			 			 		 	 					 																																											 		 		 		 			 	 		 						 										 	 			 		 	 					 																																										 			 	 	 	 	 				 		 		 	 CCTV of female suspect in Paris attack 					 					 																																										 			 			 		 			 			 											 			Hayat Boumeddiene, the partner of Paris gunman Amedy Coulibaly, shown arriving in Istanbul 		 	 					 																																									 														 																						 										 					 																																										 			 			 		 	 					 																																											 		 		 		 			 	 		 						 										 	 			 		 	 					 																																										 			 	 	 	 	 				 		 		 	 Muslim drag queens 					 					 																																										 			 			 		 			 			 											 			Meet Ali, a gay Pakistani asylum-seeker preparing for his first performance as a drag queen 		 	 					 																																									 														 							 	 				 			 	 		 										 			 						 					 										 	 	 		 			 	 		 												 	 		 										 			 						 					 					 	 		 											 				 			 				 			 		 		 	 		 										 			 						 					 										 	 	 		 			 	 		 											 	 	 		 			 			 		 				 			 	 		 	 	 		 	 	 	 	 		 										 			 						 					 					 				 			 	 	 	 		 	 License/buy our content 					 | 			 				 																																										 			 	 	 	 				 		 		 	 Privacy policy 					 | 			 				 																																										 			 	 	 	 				 		 		 	 Terms of service 					 | 			 				 																																										 			 	 	 	 				 		 		 	 US advertising 					 | 			 				 																																										 			 	 	 	 				 		 		 	 A - Z index 					 | 			 				 																																										 			 	 	 	 				 		 		 	 About us 					 			 		 	 ? 2015 Guardian News and Media Limited or its affiliated companies. All rights reserved.