Jonathan Jones: From Holbein to Vel?zquez, from the Medicis to the Tudors, royal children in painting always seem weighed down by destiny, their childhoods denied. It should be different this time The Prince of Wales continues with his royal duties in York while he waits for the arrival of his first grandchild Punters have placed wagers on what the heir to the throne will be called, with Barack among those tipped Photographers, TV crews and tourists gather outside St Mary's hospital, where there's little news except the spectacle itself Shops, pottery makers and even pension funds get ready to cash in when the Duchess of Cambridge becomes a mother Kensington Palace announces duchess in labour for birth of Queen's third great-grandchild and third in line to the throne Aerial footage from above St Mary's hospital in London show swarms of media waiting for news of the delivery of the royal baby The Duchess of Cambridge's labour is said to be progressing as normal after she was admitted to St Mary's hospital in London Kate and William's choice of clothes on the hopital steps will be a lot less starchy than Charles and Diana's, reckons Imogen Fox Hadley Freeman: What will the royal baby be called? Who said the bump was too small? And what advice did Pippa give to the parents-to-be? Tradition dovetails with technology ? an easel at Buckingham Palace followed by email ? to announce birth of Duke and Duchess of Cambridge's child Journalists from all over the world are staking a claim outside St Mary's hospital in London, where the Duchess of Cambridge is expected to give birth to the new royal baby The Duchess of Cambridge gave birth to a baby boy, third in line to the throne, on Monday at 4.24pm. We could not be happier, the Duke of Cambridge said. How are you and the people around you celebrating the news? Share your images, text or video. The Duke and Duchess of Cambridge's firstborn will be the eighth British monarch descended from Queen Victoria Graphic depiction of the royal line of accession from 1603 to 2013 Doubts over whether all 15 countries with the Queen as head of state would change their laws on primogeniture Global press ranks gather outside private wing of the central London hospital where duchess is due to give birth to royal baby Duke and Duchess of Cambridge asked Marcus Setchell to delay his retirement to oversee delivery Diane Roberts: You thought America declared independence in 1776? If the US media is anything to go by, we love your royals more than you As Kate and Wills prepare to open a new chapter in the royal fairytale, it's hard to keep a po-face ? especially where noble nappies are concerned From a history of regal nappies to a tale of bringing up baby Windsor-style, there's something for every budding royalist in the cash-in crop of royal baby books