None of us know the specific events that took place on the night of 26 February 2010 in the housing complex Retreat at Twin Lakes in Sanford, Florida beyond the fact that a 17-year-old boy named Trayvon Martin ended up dead, shot through the heart. It's that lack of knowledge ? more than perhaps anything else ? that explains why George Zimmerman, the man who followed Trayvon in his car, who ignored police dispatch requests to remain in his vehicle, whose actions directly initiated a confrontation and who ended up using deadly force to protect himself walked away from court a free man. Since Zimmerman killed the only other witness to the shooting, and since the prosecution could not provide an eyewitnesses or ironclad forensic evidence that punctured holes in Zimmerman's claim of self-defense, the jury had little choice but to find him not guilty. But here's the one thing we can say with some certainty about what happened that night: if the state of Florida didn't give George Zimmerman legal permission to carry a concealed weapon, Trayvon Martin would almost certainly be alive today. For all the focus on the racial and class-based inequities in the criminal justice system of which there are many or the legal perversion of stand-your-ground laws that dangerously lower the criteria for use of deadly force in self-defense or the mistakes of the prosecution of which there appear to be many , it is the presence of a loaded firearm that changed what might have been an unpleasant confrontation into a deadly encounter. This unfortunately is very much at pace with America's twisted gun culture and the extent to which we have accepted as a society the idea that practically any individual can get access to a firearm, carry it on them in public and use it when they believe their life is in danger ? and be justified in their actions. Concealed carry laws, which might strike some as more reminiscent of the Wild West than a civilized society, are not some weird quirk of Florida law. They exist in every state in the country. Indeed, it's great irony that the same month Zimmerman was acquitted, Illinois became the last state in the country to enact one. These laws differ state-by-state, but after years of National Rifle Association NRA lobbying, concealed carry licenses are today increasingly issued under a shall issue basis, which means that as long as a state resident meets certain criteria pdf a US citizen, a non-felon, at least 21 years of age, no history of drug or alcohol abuse etc and have met what are generally fairly loose training requirements, they can have a concealed carry license. In fact, Illinois's new conceal law requires a mere 16 hours of gun safety training, yet that is the most stringent requirement in the country. Unlike the dozen or so states that have a must issue requirement, in the 30+ shall issue states one doesn't have to show good cause for getting a conceal license. In fact, the state is prevented from demonstrating any real discretion in how licenses are provided. In of themselves, concealed carry laws represent a dangerous shift in America's gun culture, but what makes them so much more insidious is that at the same time that more and more Americans are being granted the right to carry a concealed weapon, states are also passing stand-your-ground laws that allow individuals ? as long as they fear injury or death or even the commission of a forcible felony ? to use deadly force. In Florida, the stand-your-ground law has allowed drug dealers to avoid jail time; has allowed for the justifiable shooting of unarmed persons; and has been used as an effective defense for those who have initiated a fight, pursued their victim and even shot them while they are on the ground. In the context of these laws not only is Trayvon Martin's death not surprising, it has the air of inevitability. The very fact that Zimmerman was carrying a gun in a state where the bar on self-defense has been dramatically lowered ensured that any confrontation between the two men had the potential to lead to something far worse than just a disagreement or even a fist-fight. For example, would Zimmerman have gotten out of his car to confront Trayvon in the first place if not for the fact that he was carrying a gun? Was Zimmerman secure in the knowledge that if Trayvon became angry or challenged him he could use his gun to legally defend himself? It seems almost unimaginable, particularly when one considers that a key argument of his defense team was that he was out of shape and unlikely to prevail in a hand-to-hand fight with the young strapping Trayvon. Moreover, Zimmerman's defense relied on the idea that it was Trayvon who initiated the fight that led to his death. Even if we accept that version of events, would Trayvon have confronted Zimmerman if he had known that he was carrying a concealed weapon? Almost certainly not. Now gun absolutists will argue ? using dubious evidence - that the presence of more guns decreases crime. It protects law-abiding Americans and keeps criminals on their toes, or so the argument goes. As Daniel Webster, director of the Johns Hopkins Center for Gun Policy and Research, said to me, the best research shows that the effects of conceal laws are relatively small ? both in reducing and increasing crime. But this misses the larger issue, which says Webster, is one of shifting social norms on carrying and using a gun in the first place. Increasingly, in large swaths of particularly red state America, it is not considered unusual or out of the ordinary to be walking around with a loaded weapon. Indeed, it's become a point of pride says Webster: I am exercising my rights, I'm not relying on the government to protect myself, my family, my community, is the new mindset. The impact is to basically deputize individuals with no training in law enforcement and then give them legal standing to use those guns with the most threadbare of rationales. But why should we assume that ordinary citizens have the same good judgment as those trained in the use of deadly force? Zimmerman is perhaps the best example of this. Even if you believe that the jury verdict in his case was correct, can anyone seriously argue that he exercised good judgment in confronting Trayvon Martin? The fact is, people will get into arguments; they will fight and yell at each other. It's human nature. But with the presence of a concealed weapon it takes what should be a disagreement or at worse fisticuffs into the potential realm of violent death. As Webster said to me: What is so bizarre about America's gun culture is that it is largely accepted as fact both by politicians and the general public that arming individuals with handguns will protect them against violence and crime, that these guns will be used safely and judiciously, and that such lax rules on gun ownership are a necessary attribute of living in a free society. The reality is that none of this is true. Americans die in record numbers from gun violence, in part, because we allow so many of our fellow citizens to purchase, own, carry and use guns in ways that are unbelievably promiscuous and flagrant. The reality is that the surest way to increase your chances ? and those of your family members ? of dying from gun violence is to own a gun. It's not that there aren't responsible gun owners. Most are. It's that in order to protect those individuals freedom to own and use firearms in extraordinarily broad ways we've put everyone else at risk, including 17-year-olds minding their own business in a Florida neighborhood. The Zimmerman case, rather than being an outlier may become the new normal, a harbinger of things to come in an era of loose gun laws, looser legal standards and a population inured to gun violence.