Markus Kaarma, 30, convicted of deliberate homicide in shooting death of German student Diren Dede, 17, who trespassed in his unlocked garage The G2 interview Angela Davis: ?There is an unbroken line of police violence in the US that takes us all the way back to the days of slavery? The activist, feminist and revolutionary explains how the ?prison industrial complex? profits from black people, that Barack Obama can?t be blamed for the lack of progress on race, and why Beyonc? is not a terrorist More than 20 arrests in Boston as family members of black men killed by police address Washington and Oakland rallies Families of Michael Brown, Tamir Rice, Eric Garner and Trayvon Martin expected to front calls against alleged police abuses Claudia Lacy: It?s hard to think such a thing could still happen in the United States. This is justice? Tell us what happened to Lennon. Tell me what happened to my son Lanre Bakare: Racism in the UK might be just as prevalent, but it doesn?t usually result in another dead black man at the hands of the police Phillip Agnew: When my fellow young leaders and I walked into the Oval Office this week, we felt empowered and powerless at the same time. The president said we shouldn?t demand too much, too soon Hannah Giorgis: The hard truth about no justice for Michael Brown is that we must reassess our expectations to create a new kind of peace Angela Davis: Those who resist are treated like terrorists ? as in Ferguson this year, and as I and other black activists were in the 60s and 70s Amanda Robb: Is crowd-sourced funding the new public defender? Just ask the killers of Trayvon Martin and Michael Brown ? or the secret conservatives who pay their legal fees Gary Younge: Only the courts can judge Michael Brown?s killer ? but this is the system that let George Zimmerman walk free Steven W Thrasher: The assumption that black people must be guilty of something lies behind the Ferguson shooting, and the police reaction Crystal Wright: ?My Brother?s Keeper?? How about keeping up with history and getting to the root of the problem? Zimmerman says ?I want to live without being in the press? ahead of CNN and Fusion interviews later this week When two Senegalese photographers messed with some very familiar screen moments, they were taken aback by the racial dimension to the response, says Missla Libsekal Jonathan Jones: The Florida neighbourhood watchman acquitted over the death of Trayvon Martin is selling a painting on eBay, and bids have reached $110,100. Why does Zimmerman fascinate America? Michael P Jeffries: There's a presumption of white innocence. It reflects a society rife with institutional racism and prejudice against people of color Monte?Frank: Many states empower ordinary citizens to act as vigilantes using lethal force. Do we really want to be a nation of Dirty Harrys? Dana Lone Hill: Yes, Native Americans feel there are bigger issues in the US than a bad NFL mascot, but that doesn't mean it's not offensive Police called to investigate domestic dispute at house in Lake Mary, Florida ??but Shellie Zimmerman opts not to press charges Former secretary of state says he worries the case won't have staying power in talk show appearance to discuss race issues