Plans to commemorate the 50th anniversary of Martin Luther King's I have a dream speech are being redrawn in the wake of an angry reaction over the decision to acquit George Zimmerman?over the shooting of Trayvon Martin, and a recent decision by the supreme court to strike down key sections of a law that protects black voters. Senior figures in the civil rights movement have told the Guardian that fast-escalating resentment over the treatment of black Americans will result in larger-than-expected crowds descending on Washington next month for the commemorations off King's famous address. Zimmerman's acquittal and the supreme court ruling on the Voting Rights Act have fuelled a renewed debate over race relations in the US and reinvigorated the civil rights movement. In Washington on Friday, Barack Obama delivered a surprisingly bold speech about the issue. On Saturday, vigils organise by the veteran civil rights campaigner Al Sharpton will be held across the US to protest against the acquittal of Zimmerman, who shot 17-year-old Martin as he returned home armed with nothing more than a bag of Skittles and a drink from a convenience store. But the King commemorations in August are likely to be even more pointed. Many believe the Zimmerman case, as well as the recent supreme court ruling on the Voting Rights Act, have demonstrated in stark terms how far America is from realising the dream articulated by King on the steps of the Lincoln Memorial in 1963. According to a CNN/ORC poll conducted earlier this year, roughly half of Americans still did not believe the vision King set out in 1963 has been fulfilled. Survey data indicates that view has remained unchanged throughout the duration of Obama's presidency. Obama is understood to have been invited to play a central role in the King commemorations, which are likely to be a global spectacle, but has not yet publicly committed himself. Until Friday, the president had not said much about the Zimmerman verdict and was coming under growing pressure to take a lead on the issue. Some African American leaders were saying privately that the president was failing to grasp the intensity of feeling over the case and at Thursday's White House press briefing, Obama's spokesman, Jay Carney, was repeatedly pressed on why the president had failed to take a more public stance. But in an unexpected move on Friday, Obama appeared at the White House press briefing to address the issue head on. You know, when Trayvon Martin was first shot, I said that this could have been my son, he said. Another way of saying that is Trayvon Martin could have been me, 35 years ago. And when you think about why, in the African American community at least, there's a lot of pain around what happened here, I think it's important to recognise that the African American community is looking at this issue through a set of experiences and a history that ? that doesn't go away. The president added that both the outcome and the aftermath of the case might have been different if Martin had been a white teenager. Drawing from personal experience, he added: There are very few African-American men who haven't had the experience of being followed in a department store. That includes me. In a remarks borrowed from King's 1963 speech, the president told reporters said Americans should now ask themselves: Am I judging people as much as I can, based on not the color of their skin, but the content of their character? Eric Holder, the attorney general, had already spoken twice this week about his concerns about the Zimmerman case, and told of the discrimination he has faced in his own life. Seemingly unconflicted that Department of Justice is considering whether to bring a fresh prosecution against Zimmerman on federal hate crime charges, Holder said Martin's tragic and unnecessary death should trigger a wider discussion. The White Housen is understood now to be considering what role Obama will play during the events commemorating the King speech in Washington next month. The president is believed to have been invited to a religious service at the Martin Luther King Memorial on 28 August, timed to coincide with the precise moment King delivered his remarks. That event is being organised by Leah Daughtry, a Christian pastor with close ties to the Obama administration. Daughtry and the White House declined to comment for this article. The service forms part of a week-long series of events in Washington. On Saturday 24 August, Sharpton's National Action Network will lead the 50th anniversary commemoration of the 1963 march on Washington, at which King made his I have a dream speech. At 3pm on the 28 August, bells will ring out across America, in a nod to King's concluding remarks: Let freedom ring . Benjamin Jealous, the president of the National Association for the Advancement of Colored People NAACP , which hosted its annual convention this week in Orlando, Florida, said the significance of this year's march had multiplied rapidly . That is both because of the supreme court decision on voter rights, and the verdict in the George Zimmerman trial, he said. The march has gone from being seen by many about primarily about the past, to being urgently about the present. According to Janaye Ingram, DC bureau chief for the National Action Network, there has been talk of a crowd as large as half a million for the main event on 24 August ? double the number who heard King speak in 1963. She said: With the verdict that came out of the Zimmerman case, there is the potential to see massive numbers. It has really put people in the mindframe of the 1960s ? even if they were not around then. Others were more cautious about predicting such a large turnout. The reality is that large civil rights marches have in the past been heavily funded by unions, Jealous said. The trade union movement has come under withering attack in recent years and its resources are fewer as a result. But all the black leaders contacted about the march said that recent developments had led to a surge in interest in the event, and they are expecting larger numbers as a result. There is no doubt that the last 30 days have heightened and materially changed the significance of the anniversary, said Marc H Morial, president of the National Urban League. It has been given a new spark. There have already been sporadic street protests over the Zimmerman verdict in cities including Washington, New York, Miami, Boston, San Francisco and Los Angeles. On Saturday, another wave of demonstrations are planned outside federal buildings in 100 US cities. Martin's mother and her son, Sybrina and Jahvaris Fulton, will join Sharpton outside the federal courthouse in New York. Tracy Martin, Trayvon's father, is due to attend an event at the federal courthouse in Miami. The swirling debate presents a dilemma for Obama's advisers, as they consider an appropriate role for the president in the King commemorations next month. The White House will want to tread a delicate line and perhaps avoid comparisons between Obama and King. However, as the first black president, it is almost inconceivable that Obama will not participate. Obama clearly is a person who deeply understands that the arc of his own life was impacted and in many ways defined by that moment in history, said Jealous. There is a lot about this president that is still defined by the time he spent as a community organiser in Chicago. The real question, then, could be what Obama will say ? and how willing he will be to address head on the debates that have raged over the past month. While the Zimmerman verdict has triggered visceral anger among many Americans, some believe it to be a consequence of Florida's flawed self-defence laws rather than a consequence of racial bias. Arguably, the supreme court's decision on protections for minority voters could have the more significant impact. The judges voted 5-4 last month to effectively halt the enforcement provisions of the Voting Rights Act, enacted in 1965 to outlaw racial discrimination against voters in nine mostly southern states such as Texas, Mississippi and Alabama. The law required state and local authorities to get federal approval before implementing even minor voting changes, as a safeguard to ensure they were not discriminatory. It has been used in a number of successful legal challenges and was endorsed by strong majorities of Republicans and Democrats in Congress in recent decades. Most recently, it was re-authorized by George W Bush. Civil rights lawyers say the court ruling, based in the conclusion that the country has changed since the civil rights era, set the country back decades. In 24 pages, the supreme court rendered inoperable the most effective tool we as a country have for combating racial discrimination in voting, said Myrna P?rez, a voting rights attorney at the Brennan Center for Justice at the New York University School of Law. It now falls to Congress to muster sufficient bipartisan support for a new voter rights law. There were two hearings on the issue this week - one in the Senate, the other in the House. Testifying before the Senate judiciary committee on Wednesday, John Lewis, a congressman from Georgia, said the court's ruling had left him devastated. It made me want to cry, he said. In 1963, Lewis was 23-year-old student organiser and one of the big six leaders who led the March on Washington. He is the only surviving speaker who shared a platform with King that day. In a democracy such as ours, the vote is precious; it is almost sacred, Lewis told the Senate committee. It is the most powerful nonviolent tool we have. Those who sacrificed everything - their blood and their lives ? and generations yet unborn, are all hoping and praying that Congress will rise to the challenge and get it done.