Former neighbourhood watch leader George Zimmerman has been found not guilty?of the murder of 17-year-old Trayvon Martin by an all-female jury in Sanford, Florida. The jury, which deliberated the case for two days, also cleared Zimmerman of man slaughter charges after asking for clarification on the details of the charge. Mr Zimmerman, I have signed the judgement that confirms the jury's verdict. Your bond will be released. Your GPS monitor will be cut off when you exit the courtroom over here. And you have no further business with the court, Judge Deborah Nelson said shortly after the decision was read on Saturday. Zimmerman smiled briefly but did not appear emotional as the verdict was read. His family was grinning broadly as they sat behind him in the courtroom. Martin's?family?was not present. After the verdict, Twitter and Facebook lit up with people discussing the case and organising protests and vigils. Lists of planned demonstrations across the country were shared on the social media networks.? A Twitter profile apparently run by the victim's father, Tracy Martin, tweeted, Even though I am broken hearted my faith is unshattered I WILL ALWAYS LOVE MY BABY TRAY. Spontaneous demonstrations were under way in San Francisco, Los Angeles and New York. In San Francisco, crowds held up signs with slogans, including: The whole system is racist and The people say guilty. Crowds also gathered in New York, some holding homemade signs and blowing whistles. It was after 10pm in Florida by the time the news broke, but protests were planned for Sunday. 'All about race' Al Jazeera's Andy Gallacher, reporting from Miami, said that the verdict was not surprising. This case has raised a lot of issues for people, not just about race but also about gun control, our correspondent said.? You've heard a lot of people talking about this case and saying race wasn't an issue, but that isn't the case, it is all about race. People thought he made assumptions because he was a young black teenager. The defence did a great job of showing the jury there was reasonable doubt that George Zimmerman went out with the malice and intent to kill Trayvon Martin. Martin was unarmed when he was shot and killed by Zimmerman in February last year in Florida. Zimmerman said his actions had been in self-defence. In Florida, the Stand your ground law means people can justify shooting people when they feel threatened, rather than retreating if the option is available. The February 2012 killing ignited widespread controversy after police initially declined to press charges against Zimmerman. The case also led to fierce debates about gun control and racial profiling.