Day eight of the Queensland election campaign sees premier Campbell Newman struggling for a synonym, as he utters the word 'strong' more than 20 times during a short press conference. Research finds some fear going into politics because of how former PM was treated, but women with flexible view about gender roles are more motivated Indonesian authorities have reacted harshly to the deaths of two police officers, a West Papuan independence leader in exile has claimed Francis addresses bloody 2009 crackdown that ended war with Tamil Tigers, saying only the truth can heal country?s wounds A new service launching today hopes to safely connect whistleblowers with investigative journalists, encouraging a ?new culture of accountability and justice? across the continent Air New Zealand and Fiji Airlines both turn flights around after Hunga Tonga-Hunga Ha?apai sends huge ash cloud kilometres into air about 65km north of capital Nuku?alofa Tim Cahill has been handed the captain's armband for Australia's Asian Cup match against Oman in the absence of the injured Mile Jedinak. Consultant is helping minor parties do preference deals to help their chances of winning a seat in Queensland, which has no upper house On 11 January, an estimated 1.6 million people took to the streets of Paris to voice their solidarity with those murdered at the hands of radical muslim terrorists and proclaim 'Je suis Charlie' I am Charlie . But not everyone in the city felt comfortable with that idea When British photographer Shelly Cornick moved to St Petersburg, she found herself woefully unprepared. Wearing only a thin winter coat and informed by a collection of vague stereotypes, she turned to her camera to interpret the alien landscape. The resulting photographs capture the resilience of daily life against a backdrop of brutalist architecture and fierce weather Tim Cahill has been handed the captain's armband for Australia's Asian Cup match against Oman in the absence of the injured Mile Jedinak. On 11 January, an estimated 1.6 million people took to the streets of Paris to voice their solidarity with those murdered at the hands of radical muslim terrorists and proclaim 'Je suis Charlie' I am Charlie . But not everyone in the city felt comfortable with that idea Thousands attend an anti-Islamisation rally in the eastern German town of Dresden, just days after the Paris terror attacks left 17 people dead The US government should have sent a higher profile figure to the anti-terror march in Paris on Sunday, says White House spokesperson Josh Earnest CCTV footage purportedly showing Hayat Boumeddiene, the partner of Paris gunman Amedy Coulibaly, arriving in Istanbul on January 2 An Indiana couple have been charged with child neglect after cellphone footage obtained by authorities recorded the pair telling a one-year-old baby to put a gun in his mouth and instructing him to make sounds like the weapon is firing. Authorities in Evansville said on Friday they found the video on the phone of Michael Barnes, who was arrested on Thursday after he agreed to sell a handgun to an undercover officer Israeli prime minister Binyamin Netanyahu addresses French Jews in the Paris grand synagogue Hundreds of Pakistani children return to a school in north-west Pakistan for the first time since the attack by Taliban gunmen in which 150 died Traumatised hostages are led away from the Paris supermarket siege after French police stormed the building The Golden Globes allowed some of Hollywood's biggest stars to express support for freedom of expression after last week's deadly attacks in France From Sydney to Stockholm, and from Montreal to Tokyo, rallies were held at the weekend to support the victims of the Paris killings. In Paris itself, an estimated two million people and dozens of world leaders joined a massive and historic march. The French ambassador to Australia, Christophe Lecourtier, tells people at a rally in Martin Place, Sydney, to keep in mind the protest ethos of satirical magazine Charlie Hebdo Meet Ali, a gay Pakistani asylum-seeker preparing for his first performance as a drag queen Around 1.5 million people took to the streets of Paris on Sunday in a show of defiance and unity, after a series of terror attacks killed 17 people in the French capital A video purporting to show Paris kosher supermarket attacker Am?dy Coulibaly has been posted online by a self-described Islamic State spokesperson As the search for AirAsia flight QZ5801 enters the third week, the black box still has not been found 'Before the war started, nothing worried me. Then our home got bombed,' says Sara, 14, from Damascus, who is now a refugee in Lebanon Indonesian authorities have reacted harshly to the deaths of two police officers, a West Papuan independence leader in exile has claimed Francis addresses bloody 2009 crackdown that ended war with Tamil Tigers, saying only the truth can heal country?s wounds 4,700 police and gendarmes deployed, and security measures reinforced at Jewish schools and synagogues. Is that enough? Day eight of the Queensland election campaign sees LNP leader struggle for a synonym, while elsewhere the treasurer, Tim Nicholls, has some trouble with the numbers A new service launching today hopes to safely connect whistleblowers with investigative journalists, encouraging a ?new culture of accountability and justice? across the continent Air New Zealand and Fiji Airlines both turn flights around after Hunga Tonga-Hunga Ha?apai sends huge ash cloud kilometres into air about 65km north of capital Nuku?alofa Consultant is helping minor parties do preference deals to help their chances of winning a seat in Queensland, which has no upper house Ruling says ban ?deprives same-sex citizens of a fundamental right? but immediate stay pending appeal means marriages can?t yet start Cuban TV broadcast images of the Argentine soccer star holding a letter in which Cuba?s revolutionary leader, last photographed in August, insists he?s still alive White House strikes apologetic tone ? ?This kind of symbolism is important? ? but cites ?more onerous? security precautions for US president as reason for absence Kevin Jorgeson has been behind Tommy Caldwell for about a week as they try to scale Dawn Wall without climbing aids other than safety ropes Andrew Zarauskas ?believed he had legally bought? tusks of protected species but 61-year-old must forfeit narwhal skull, six tusks and $86,000 Letters: Lee Rigby?s killers and the Kouachi brothers were not high enough up the list of agency priorities for more intrusive surveillance and their crimes were not prevented Letters: If world Jewish organisations were to learn from their Muslim counterparts and say loud and clear in response to Israeli atrocities ?not in my name?, this could help to reduce antisemitism When Mark Zuckerberg praised Charlie Hebdo and free speech, Facebook users cried hypocrisy, pointing to a post by a Pakistani actor that had been censored At least 69 people killed and 196 others admitted to hospital after drinking beer at funeral Last of detainees on list released over the weekend, setting positive tone for talks next week aimed at normalising relations after decades of hostility 'Before the war started, nothing worried me. Then our home got bombed,' says Sara, 14, from Damascus, who is now a refugee in Lebanon Kenyans near world?s largest desert lake predict conflict, hunger and cultural devastation when hydroelectric project is completed Foreign minister Wang Yi says Beijing won?t copy ?western colonialists? amid claims it exploits African resources for its own economic growth Panic and depression rise in hard-hit area as communities battle bereavement, changing family roles ? and even boredom Housing projects have brought dignity to some made homeless by the 2010 earthquake, but cholera is still present and the recent political protests signal the frustrations of many Only months after Haiti was rocked by an earthquake in January 2010, the country suffered its first outbreak of cholera in half a century. Five years on, Haitians continue to grapple with the crisis With South Sudan braced for renewed fighting, rights groups want the US president to table a UN resolution to deny the warring factions more weapons The women of Anacamona village eke out a physically challenging and hazardous living on the oyster beds of the Bijag?s archipelago From cooks to cleaners, staff at Panlap community care centre explain why they chose to work with Ebola patients and what it has cost them personally Thousands of Muslims, mainly ethnic Fulani herders, are living in deteriorating conditions at camps in the south-west of Central African Republic The latest round of ?reprioritised? funding announced by Australian treasurer Joe Hockey has been roundly criticised by the Pacific nation?s foreign minister Syria, Afghanistan and Somalia had largest numbers of those fleeing, bringing number of people under care of UNHCR to 20-year high It has been touted as an essential tool in advocating for change, but has social media been overrated? Are there other forms of grassroots campaigning that have been overlooked? Let us know your thoughts Dominic Ongwen, wanted for crimes against humanity and war crimes, was close to feared LRA leader Kony We asked, you answered. As part of our Students Speak series, students share their thoughts on whether faith-based NGOs can continue to operate in a world of increasingly religious sensitivities Isaac Bayoh: We have put everything aside to help get this virus out of our country, but faith has helped so many people to get this far We highlight the innovations that caught our eye in 2014. Plus, 10 years on from the Boxing Day tsunami Hospital closed over pay dispute has reopened following a swift response from government to meet staff demands Day eight of the Queensland election campaign sees LNP leader struggle for a synonym, while elsewhere the treasurer, Tim Nicholls, has some trouble with the numbers The radicalisation of the Kouachi brothers began in a picturesque park in the capital while Am?dy Coulibaly took the first steps towards terrorism in prison, but what the three had in common was growing up on the margins of French society Djamel Beghal has been on western intelligence agencies? radar for 15 years and has worshipped regularly at Finsbury Park mosque Peter Preston: Charlie Hebdo is part of a very French tradition of biting satire, but the massacre in Paris has seen countries across the world embrace anew the importance of a free press French intelligence had classified Kouachi brothers as ?very high priority? but surveillance was cut and they slipped the net The march is sure to be an impressive show of solidarity, but politicians and citizens alike will be walking for different reasons Guardian cartoonist Steve Bell on lampooning the terrorists who attacked the offices of the satirical magazine Charlie Hebdo Far-right Front National party and its leader Marine Le Pen have been most vocal in wake of attacks saying France is now at war Kouachi was sentenced to three years in 2008 for involvement in network sending men to fight with al-Qaida in Iraq Analysts say the three seemed professional and organised, as investigators probe reports of their claim to be from al-Qaida Shooting may have long-term implications for a society already witness to a rise in xenophobic and anti-Islam sentiment Supporters of Isis praise attack, but many Arabic Twitter users point out magazine also satirised Jews, Christians and Buddhists From her lead in Europe to steering Germany safely through the recession, chancellor is still going strong after 10 years in office French magazine has history of defying attempts to curtail freedom of expression; the latest a provocative tweet to Isis chief US authorities have charged two men this week in connection with a plot to overthrow authoritarian president Yahya Jammeh. The episode will only help to tighten his grip on the country, says Simon Allison French magazine?s cartoons ?breach Islamic taboo? on visual representation of the prophet Muhammad Analysis: German chancellor?s visit to UK shows gulf in power and influence wielded by the two leaders is embarrassingly wide Nils Pratley: Greeks are being urged to vote for mainstream party to avoid EU exit but if it becomes reality markets won?t be relaxed A new exhibition argues that a ?landscape first? approach to urban development could make our cities more resilient to flooding through innovative water management. But what does this look like in practice? The strangest thing about Oregon, Ohio changing its name temporarily to Oregon, Ohio Buckeyes on the Bay, City of Duck Hunters? The fact that stuff like this is not uncommon The reaction when locals heard I was planning to ride with cycling activists in this traffic-choked Indian megacity made me nervous ? but the reality wasn?t so different from London or New York. Could cycling culture have a chance here? Killian Doherty, an Irish architect working for the Architectural Field Office AFO , has been in Sierra Leone?s capital, Freetown, for much of the Ebola epidemic. He documented the curfews in some dramatic photographs Following the wildly popular transformation of Gorky Park from rusting funfair to Wi-Fi heaven, Muscovites finally felt as if their city was becoming liveable. But with more gentrifying projects on the cards, is it just a way to silence dissent? What was a ghost town ravaged by civil war has become a shabby, bustling metropolis ? but rapid urbanisation has taken a heavy toll on the Afghan capital Picturing place: In an age of intense competition between the world?s cities, authorities are focused on presenting a particular image for global consumption The 100 Resilient Cities programme has revealed a new set of cities it will help prepare for, and bounce back from, the shocks and stresses of modern urban existence Led by Akash Dhangar, the SlumGods want to use hip-hop to upgrade the image of their legendary Dharavi shantytown. But first they must change the perceptions of their own families and friends Mumbai?s informal settlements don?t fit the apocalyptic vision we?ve been sold. In fact, they could help solve India?s housing crisis A new law aims to improve life for street vendors on the streets of Mumbai ? by moving them away from their customer base. And then there?s the bribes The Koli fishing village of Chimbai sits happily next to a busy district of Mumbai, but how long can this ancient tribe rely on the sea? Reviving the port lands could be this congested island city?s best bet for affordable housing, transport links and public space. But chances like this have been squandered in the past The Indian Super League is attracting large crowds, new audiences and global sponsors to football, but will it ever hit the exalted heights of cricket as a national sport? The running season is in full flow in the runup to the Mumbai marathon ? but how do you escape the onslaught of traffic, crowds and heat in one of the world?s most densely packed cities?