CAIRO -- The mob-backed military ouster Wednesday of Egypt's first democratically-elected leader came just three days and a year after he took office and launched a presidency that never rose above the narrow desires and broad grievances of the Islamist movement that he belonged to, analysts say. Army chief of staff Gen. Abdel Fattah al-Sisi, speaking on national television in front of a row of prominent political and religious leaders, said the military was forced to act after President Mohammed Morsi had refused for weeks to set up a national reconciliation government. STORY: Military ousts Morsi STORY: Egypt celebrates in the streets Al-Sisi's announcement came as millions of anti-Morsi demonstrators packed Cairo's Tahrir Square and city squares across the country to demand the president's resignation, a flood of condemnation that amounted to a huge vote of no-confidence, by the public, said Michael Wahid Hanna, an Egypt analyst at the Century Foundation, a think tank in Washington. This has been an incompetent administration, Hanna said, citing fuel and gas shortages, electricity cuts and the fact the Muslim Brotherhood had burned all its bridges with its former allies. Morsi rejected the al-Sisi's pronouncement as a military coup. Earlier he had said no one had the right to undo the legitimacy conferred by elections. But for most Egyptians, political legitimacy is more complicated than that, and Morsi had squandered what he had, Hanna said. He's been a divisive, polarizing and incompetent figure resorting to increasingly authoritarian tactics, stifling speech and criticism and ignoring police abuse, Hanna said. OBAMA: Calls for review of aid to Egypt Morsi rammed through a non-consensual constitution that institutionalized the country's political crisis creating a unstable basis on which this new democracy was trying to gain traction and consolidate. Rather than focus on improving the lives of Egyptian, everything Morsi did seemed focused to consolidating the hold on power of his Muslim Brotherhood movement, Hanna said. Shadi Hamid, director of research at Brookings Doha Center, said Morsi's actions as president were driven by an Islamist mindset formed over decades of persecution and exclusion from power and an ongoing confrontation with leftover elements of a regime that had subjugated the Brotherhood in the past. The Islamists tendency to paranoia and fears of conspiracy were part of their motivation over the past year, Hamid said. When judges appointed under former tyrant Hosni Mubarak issued judicial edicts that dissolved the Islamists parliamentary gains, Morsi and other Islamist lawmakers sought a constitution that solidified their vision and exacerbated the friction with their political rivals, Hamid said. Their fears may have been well-founded in history but the result was greater friction with political rivals, a preoccupation with political wrangling and few accomplishments that would improve life for ordinary Egyptians, says Tarek Radwan, associate director of research at the Atlantic Council's Rafik Hariri Center for the Middle East, in Washington. The last year under Morsi has been an abysmal failure, Radwan said. Morsi comes from the 85-year-old Muslim Brotherhood, which has succeeded in every election since the uprising that ousted Hosni Mubarak in 2011. An engineer who studied in the United States, Morsi won the presidential poll with 52% of the vote over his opponent Ahmed Shafiq, a former air force commander. After he was sworn into office on June 30 last year, Morsi sought to wrest control of the state away from the military, which governed Egypt in the interim period, by pushing leading generals into retirement and granting himself executive and legislative powers. Some outside of Morsi's political faction hoped for the best despite skepticism over Morsi's abilities and intentions. But cautious optimism shifted to outright agitation when Morsi issued a constitutional declaration that gave him authority over the nation's judiciary in November. Everything that's happened since then has created this highly charged, highly polarized environment that we're seeing today, Radwan said. Morsi said the November constitutional decree was essential to protect democracy and elected institutions. But anger boiled over as tens of thousands of protesters poured into Egypt's streets. Weeks later, a new constitution drafted by a contested Islamist-dominated body passed in a nationwide referendum. Rights groups criticized the document for failing to protect freedom of speech and rights of women and minorities. But Morsi's political camp champions the fact that the constitution is, at least, complete. We know some articles might be modified, but we have finished the constitution, said Mohamed El Mekkawi, an advisor to Egypt's finance minister and a member of the Brotherhood's political wing ? the Freedom and Justice Party. Mekkawi said another achievement of Morsi's first year of rule is that the administration now consists of civilians rather than officials with military backgrounds. He champions Morsi for boosting relations with countries such as China, Russia and Brazil, and boasts that Morsi secured low-interest loans from countries in the region while an International Monetary Fund loan hangs in limbo. The efforts, however, have not prevented support for Morsi from dwindling. The president's approval rating dropped precipitously over the past 12 months, from a high of 79% last fall to 32% in June, according to the Egyptian Center for Public Opinion Research Baseera . The core problem, analyst and citizens say, is that life here hasn't improved. The economy continues to decline, and the government has failed to boost tourism and attract foreign investment. Costs of food have increased. Unemployment is rising, topping 13%. Citizens complain of fuel shortages, evident in long gas station lines. And life in the summer is aggravated by perpetual power cuts across the country. Pretty much anything related to public administration, in general, has worsened, said Ziad Akl, senior researcher at the Al-Ahram Center for Political and Strategic Studies in Cairo. The crux of the state is collapsing. Morsi's critics complain of everything from foreign policy blunders to government power grabs that indicate the Brotherhood seeks to monopolize power and elbow out their opponents. He only wants to serve his political bloc, they say, and is simply putting new faces on an old system of governing that is not different from Mubarak's era. Security concerns also run high, prompting many households to possess arms, and minority groups are particularly disturbed by lack of police protection. In a distressing case last week, four Shiite Egyptian Muslims ? who comprise just a sliver of the nation's population ? were murdered by a mob near the capital without any police interference for the three-hour period. More often, Coptic Christians are subject to violence, facing more attacks now than they did under Mubarak. In addition, some Christians have been hauled into court for insulting Islam while still other Christians face an enormous storm of threats coming from Islamist groups, said Youssef Sidhom, editor in chief of Watani, a Christian weekly newspaper. For weeks protest organizers have gathered millions of signatures to show their distaste of Morsi for failing to achieve the revolution's goals: freedom, social justice and dignity.. Morsi did not work toward any of these big labels, analyst Akl said.