We're going to wrap up the blog now. Before then, here's a summary of developments: ? A future king has attended his first photocall aged one day old as the Duke and Duchess of Cambridge presented their newborn son to the world. Cradling the third in line to the throne on the same spot where he himself was introduced to the public 31 years ago, Prince William said they were still working on a name . ??The Duchess of Cambridge's parents, Carole and Michael Middleton were first to visit the hospital where the royal couple had spent their first day as parents. An hour later, Carole Middleton told TV cameras the baby was absolutely beautiful ? They are both doing really well, and we are so thrilled. ??The Prince of Wales, returning from a two-day official visit to Yorkshire, was next to roll up, in a chauffeur-driven limousine. He left after 30 minutes and describing his grandson as marvellous, thank you very much, absolutely marvelous. ? William and Kate's son weighed 8lbs 6oz 3.8kg . He was delivered at 4.24pm on Monday in the maternity wing of St Mary's hospital by natural birth. The Duke of Cambridge was at the bedside. ? Gun salutes will sound across London today to mark the birth. ? Various heads of state have welcomed the birth. US president Barack Obama used a statement on the birth to celebrate the special relationship between the UK and the US. ? Heads of Commonwealth governments have begun sending gifts to the baby. Australian prime minister Kevin Rudd will name a research project into an endangered Australian marsupial, the bilby, after the prince. And John Key, the prime minister of New Zealand, has sent the baby a specially woven shawl. ? The royal mint has pressed 2,013 specially commissioned silver coins to celebrate the birth, which will be available exclusively to babies born on the same day as the prince. You can also read a full report here by Caroline Davies on the Royal baby's first public appearance, as well as coverage of other events earlier. Short of going into exile, the third in line to the throne cannot expect to enjoy the slightest privacy. He will spend his life with a media drone hovering overhead, listening, prying, revealing, proclaiming a global public interest in intrusion. Who knows but today's celebrity may yet prove the prince's happiest ? or at least most private ? moment. Here's a potential pub quiz winner in years to come. Prince Charles's visit to the hospital earlier this evening is believed to have been the first time that three male heirs to the throne - Charles, his son William and grandson - have come together in more than a hundred years. The last time a similar gathering happened was likely to have been before Queen Victoria's death in 1901 when her son, later Edward VII, was with his son the future George V and grandson, later Edward VIII. Prince William added: I'll remind him of his tardiness when he's a bit older because I know how long you've all been sat out here Hopefully the hospital and you guys can all go back to normal now and we're going to look after him ... Prince William said: Well, he's got a good pair of lungs on him, that's for sure. He's a big boy, he's quite heavy. He went on: It's the first time we've seen him, really, so we're having a proper chance to catch up. Asked how he felt, he added: Very emotional. The Duchess said: It's very emotional and such a special time and I think any parent will probably know what this feeling feels like. Kate, carrying the baby in a white shawl, handed him over to William with touching awkwardness as the crowd sang congratulations - very badly. They then re-emerged from the hospital with the baby in the car seat, William mouthed phew as he managed to fasten it in in one go. The he drove away in the range rover, Kate in the back with the baby, a security guard in the front seat. Well, he has a good pair of lungs on him, that's for sure, says the prince. In case you needed reminding, that little bundle is going to be the 43rd monarch since William the Conqueror obtained the English crown in 1066. It's also perfect for all parents that have any of the BRITAX pushchairs and want to convert their pushchair into a travel system . Ok.... We hear courtesy of Sky News that how first imminent appearance by the third in line to the throne will fit into the baby car seat scenario . So, the royal parents are going to appear shortly, cradling the baby in their arms. They will then go back inside and put the child into the car seat, which we got a glimpse of earlier, and then emerge again. Passers-by joined tourists in directing mobile phones, cameras and tablets upwards toward the towards Abbey's towers. Among those attempting to record the occasion for posterity was Susan Clark, 65, from Melbourne Australia. It's lovely. I think it's a very nice tribute, she said. It [a royal birth] doesn't happen very often. Husband Peter Clark, 67, agreed, and said the couple were thrilled the royal baby had arrived during their three-week visit to the UK. However, he expressed jocular concerns - for ringers and listeners alike - at the length of the celebratory performance. As the pair headed off for the relative tranquility of a boat trip on the Thames, he quipped: For three hours? It's letting everyone know. I'm not sure what the locals will think of it. Of the bell ringers performing the feat of endurance, he said: I hope they've been working out. At the New Yorker, Lauren Collins notes that there is nothing like living in a constitutional monarchy to turn one into a republican . Apologising for raining on the parade with the pissy insistence of a London squall , she adds: The birth of a royal baby, particularly, underscores the medieval nature of the institution?the hard, creepy bloodstockiness of a caste system enshrined in law ... 226 children of the 2,000 will live in overcrowded, temporary or run down housing and eleven will be homeless. A shocking 540 children will live in poverty, with 290 of this group experiencing poverty despite having one parent that works. It has seemed as if every media outlet in the world has had its say on the royal baby. But the definitive report, as always, comes from Taiwan's animated news network NMA. Royal Baby Embiggens Britain's Royal Family is one of their most outrageous works yet, with royal photographers definitely overstepping the mark, the Queen being almost killed by a naked Prince Harry and returning as a deadly robot, and the promise of a future gay, multiracial royal wedding in 2040 and a royal clone becoming next in line to the throne ... Enjoy. My colleague Hannah Waldram has been browsing through our Not the royal baby pictures which came in overnight; Guardian readers have been sharing their experiences and stories of newborns who arrived in the last few days with us.? First here are four more baby boys who'll share the their birthday with the future king. Oliver: If you want to see some more little newborns who arrived around the same time as the new prince, here's Juliette: What are the bookies? favourites for the royal name? Down at the Lindo wing, Sharon McEwan, who is from Jamaica but now lives just around the corner in Paddington, tells Maev Kennedy: ?They should give him a new name, a strong name, not one of those old names.? Gladys Richardson from Essex, who is sitting next to her, agrees: Despite the name being a bookies? favourite, royal advisers are likely to point out that the 19th century Prince George of Cambridge was not exactly a model that [Kate and William] would wish the new prince to emulate. Though a successful military commander, that Prince George of Cambridge was not popular with his cousin Queen Victoria, especially after he married an actress, Sarah Fairbrother, in 1847. She was, at that time, the mother of four children by three different fathers! This might just be a crazy hunch of mine, but I wonder if they might indeed want to name the baby after Michael Middleton, Kate?s father, to try to make sure that ? royal as he is ? he always remembers his Muggle side too. Diplomatic relations have been suspended since the British embassy in Tehran was ransacked by a mob in November 2011, and Iranian officials usually go out of their way to denounce the British government and all is works. The foreign ministry spokesman, Abbas Araghchi - an urbane and fluent English-speaker, himself a graduate of the University of Kent - was quoted by the semi-official ISNA news agency as saying: I congratulate the esteemed Queen and the heir to the throne. Apparently this baby is the third in line in the throne. However, Araghchi quickly added: Obviously the relations between UK and Iran are too complex to be affected by the birth of a baby. So clearly nappy diplomacy is unlikely to reopen embassies on its own ? but Tehran clearly intended to send positive vibes. There is even talk of inviting British guests to Rouhani's inauguration next month. The Duchess of Cambridge and her younger sister are very close, having shared their parents? Chelsea flat before Kate?s marriage. As the baby?s only aunt, Pippa is likely to have an intimate role in the new baby?s life. Happily for her nephew, if there is one thing that Pippa can do, it is throw the child a party. Pippa, 29, worked for a friend?s event planning business, and has remained closely involved with her parents? online supplier, Party Pieces. Balloons, we can assume, are taken care of for the foreseeable future. There are flashes of steel behind the frivolity, however. Having been catapulted into being an international celebrity following her sister?s wedding, Pippa secured a ?400,000 book deal for Celebrate: A Year of British Festivities for Families and Friends. The book may have been much derided ?For [children?s] parties, wrap a small gift. Sit everyone in a circle and ask them to pass the parcel? , but as the scattering of photographs of the unroyal sister in staged family settings show, this is a woman who knows the value of her own image. She has since been signed up to write columns for Waitrose magazine ousting Delia Smith , Vanity Fair and the Spectator ? and is reportedly trying to block publication of a satirical book based on spoof tweets of her party planning tips as well as the Twitter feed @pippatips. But a handful of public missteps suggest Pippa, less reserved than her sister, may have just a touch of her uncle Gary Goldsmith about her. While he lives in an Ibiza party pad called La Maison de Bang Bang and calls himself the ?King of Fun?, Pippa was photographed last year, following a party in Paris, laughing while a male friend pointed what appeared to be a pistol at a photographer. It seems unlikely however that Prince Charles will take over from his mother this year. If instead, each of the current heirs to the throne live to 102 years of age as did the Queen Mother then it won't be until 2084, when the royal baby is 71 years old, that he will take become king. Well, certainly the Queen acts as a certain cushion against the sort of level of scrutiny that the monarchy should be receiving. But it?s not a passive process where we simply sit back and wait for one monarch to die and another one to come in. Like any other political issue, this is something which needs people to get up and make the case. Public opinion will turn when that case is made coherently and effectively. He said there was a ?very simple democratic solution on offer? and said that ?like any other big political issue, public opinion can turn very quickly?. The solution?s very simple. You carry on having the prime minister and the House of Commons. You elect the House of Lords. You have a written constitution that lays down the line on what the limits of their powers are. And then you have an elected head of state that is there to do the job that the Queen is supposed to do, which is to be the referee and to be the check and the balance on the PM?s power, and is there to represent the nation in a ceremonial capacity as well as being a constitutional defender of the people. It?s a role that works very well in the Republic of Ireland. They elect and have elected a succession of very eminent heads of state. It?s not a theoretical exercise; it is just hard-nosed politics at the end of the day. And I think that personal aspect that you?re talking about is a double-edged sword for the royals. All this affected and artificially-constructed love for the royals that?s going on at the moment is all very, very superficial. Most people in the country aren?t really buying it. They?re not really affectionate towards these people. They don?t care about them. And they?re quite dull people. They?re not people that really capture the imagination and earn any kind of loyalty and public following, beyond the hardcore monarchists. He's heartily glad the baby has been born, after his hot vigil in nylon union flag and furry hat. But he's still wondering how to get the present to the baby. Meanwhile the photographers are assuring one another of what happens next, based on unimpeachable sources - other photographers. The only son of Prince Adolphus Frederick, the first Duke of Cambridge, George married the actor Sarah Louisa Fairbrother, after refusing to countenance an arranged marriage to royalty or aristocracy. They already had two children, and she was pregnant with their third when the nuptials went ahead. It is widely believed that there were plans for George to marry his cousin, Princess Victoria of Kent ? later Queen Victoria ? but these came to nothing after Victoria?s uncle Leopold I of Belgium secured her hand for his nephew, Prince Albert of Saxe-Coburg Gotha. Prince George?s marriage was never recognised because he did not seek the approval of the sovereign. His common-law wife, who was ostracised by the royal family, became known by the nickname Mrs Fitzgeorge, a surname taken by their offspring, who were not eligible for royal titles. Prince George made clear his views that arranged marriages were doomed to failure. If his own marriage was a success, it did not prevent him taking a long-term mistress, Louisa Beauclerk, who was his lover for more than 30 years. He died in 1904 and was laid to rest next to Mrs Fitzgeorge. The title of Duke of Cambridge would not be revived until the Queen awarded it to Prince William on his marriage to Catherine Middleton. Are you wondering whether you will have anything in common with the latest royal when you serendipitously, but inevitably, bump into him in 20 years' time, asks my colleague Mona Chalabi slightly revealingly. William and Kate's son stands to inherit more than most British babies. If nothing else, the Prince of Wales's ?763m Duchy of Cornwall estate is currently exempt from inheritance tax. With a tidy ?19m income not liable to corporation and capital gains tax the baby could well win big. I want to see her come out, I want to be part of history, the 31-year-old charity organiser - of the Running for Life African charity - said. I was there at the royal wedding but I missed the moment they came out because of the crowds. It is not known how long Kate might stay in hospital, or whether the couple will receive visitors today. Kate?s parents, Carole and Michael Middleton, and siblings Pippa and James may pop in, but as mentioned earlier Prince Charles is in Yorkshire. It is thought unlikely that the Queen will visit ? though she did on the occasion of William?s birth. But she will undoubtedly be able to see her third great-grandchild in private before departing for Balmoral on Friday. No name has yet been chosen, but the couple will consult with other royals about it, Caroline reports. It took a week before William?s name was announced ? a month for Charles. Harry?s was announced immediately, but then he was only the ?spare?, poor thing ... Durham has composed a special celebration peal, just as he did for the royal wedding, but courteously avoided keeping the entire village awake by ringing it the night the news broke. Tomorrow or Thursday night his team will merely ring a restrained quarter peal, lasting less than an hour. The full splendid new peal, magnificently chiming out for well over three hours, will be rung later. Like the baby, the new peal has not yet been named. ?We've been thinking of something along the lines of Bucklebury's Little Delight,? Durham said. The church warden John Tennant ? ex-Royal Fusiliers, local resident since 1949 ?and therefore just about recognised as belonging to the place? - brought along his mower to give the churchyard a short back and sides to smarten it up for the expected further flood tide of cameras. ?It is indeed very good news, he said. We are delighted to have Miss Middleton, as she was, the Duchess of Cambridge as she is, as a former resident of our beautiful village. Long may the line continue.?