Baby Cambridge will be the 43rd monarch since William the Conqueror obtained the English crown in 1066, but is also 41st in direct line of descent from Egbert, King of Wessex, who ruled from 802 to 839. Through the paternal line, William and Kate's firstborn is destined to be the great-great-great-great-great-grandchild of Queen Victoria. And, once grandfather Prince Charles and William have served their time on the throne, he/ she will become the eighth British monarch to descend from Victoria and Albert, whose descendants have populated many a European throne. The Queen's longevity means it is the first time in nearly 120 years that a still-serving sovereign has met a great-grandchild born in direct succession to the crown. Edward VIII was born in 1894, seven years before the death of Victoria. The infant's royal lineage stretches back, on the throne of England, to the Anglo Saxons through the Normans, Angevins, Plantagenets, Lancastrians, Yorkists and Tudors. Until 1603, English and Scottish crowns were separate, but following the accession of King James VI of Scotland James I of England to the English throne, a single monarch has reigned in the UK. The newborn will be the 20th monarch to do so since James VI of Scotland and James I of England reigned 1603-1625 , the son of Mary, Queen of Scots. James VI was the great-great grandson of Henry VII, and ushered in the Houses of Stuart and Orange on becoming king. Charles 1 1625-1649 , the second son of James I and Anne of Denmark, who became heir on the death of his brother Prince Henry, was the second Stuart on the throne, until he was beheaded and the office of king formally abolished on 7 February 1649. There followed, briefly, the Republic of England 1649 to 1660 ? or the interregnum ? during which Oliver Cromwell dissolved parliament and became lord protector, squabbled with the Commons then died in 1658. After the failure of his son Richard's shortlived protectorate, the army invited back the royal genes in the shape of Charles I's son, Charles II. Charles II, 1661-1685 James II, 1685 ? deposed 1688 joint monarchs William 1689-1702 and Mary 1689-1694 and then Anne 1702-1714 ? all descended from Charles I through his marriage to Henrietta Maria of France ? kept the throne warm, in that order. As Charles II had no legitimate children but reportedly at least 12 illegitimate offspring , his brother James succeeded, with his daughters Mary and Anne, both childless, following. But it is through the House of Hanover that the new baby traces its direct lineage. When the Stuarts died out, the Hanovers came to power through James I's granddaughter, Sophia, who married Ernst Augustus Elector of Hanover, and gave birth to George I, who would rule from 1714 to 1727. Hanoverian succession was a pretty straightforward affair for a while. George II 1725-1760 , eldest son of George I and Sophie of Celle, married Caroline of Ansbach. Their grandson, George III 1760-1820 married Charlotte of Mecklenburg-Strelitz . Their eldest son George IV 1820-1830 married his cousin Caroline of Brunswick and succeeded the throne after serving as prince regent during his father's final mental illness Theirs was a disastrous union, so much so he forbade her from attending his coronation and tried, unsucessfully, to divorce her. The two were formally separated after the birth of their only child, Princess Charlotte. The dissolute king, however, is believed to have fathered several illegitimate children with his mistresses. Princess Charlotte died, aged 21, from post-partum complications in 1817 after delivering a stillborn son. As the second son of George III, Prince Frederick, had died in 1827, George IV was succeeded by another brother, who reigned as William IV 1830-37 . At the time of his death, William had no legitimate children, however, he was survived by eight of the 10 illegitimate children he had had by the actor Dorothea Jordan, with whom he cohabited for 20 years. It was his niece, Victoria 1837-1901 , the daughter of his younger brother, Edward, Duke of Kent, to whom the crown fell. The house of Saxe-Coburg-Gotha was established with Victoria's marriage to Prince Albert. Their eldest son, Edward VII 1901-1910 succeeded and his marriage to Alexandra of Denmark produced five children. The eldest, Albert, Duke of Clarence, was expected to succeed, but shortly after his engagement to Princess Mary of Teck in 1891, he died during a flu pandemic. Instead his brother, George V, inherited both the crown and his fiancee and ruled from 1910 to 1936. It was George V who, given rife war-time anti-German sentiment, decided the bucolic-sounding Windsor was a preferable royal household name to Saxe-Coburg-Gotha. And so Edward VIII would be Edward Windsor, until he became Duke of Windsor on his abdication less than a year into his 1936 reign. That abdication, and the fact Edward had no children, led to the present Queen's father, George VI 1936-52 , becoming monarch with Elizabeth Bowes-Lyon at his side. Their eldest daughter, Princess Elizabeth Alexandra Mary, became the present queen on his premature death. ? This article was amended on 22 July 2013. It originally stated that George III was the son of George II. He was his grandson. This has been corrected.