By George, they've got it! The newest little royal was named HRH Prince George of Cambridge, with Alexander Louis thrown in for good measure, his parents, Prince William and Duchess Kate, announced Wednesday, two days after his birth. He'll be a future King George VII. But royal-baby mania goes on. Next up: The christening and the naming of the godparents. Prince Harry, 28, is sure to be included, and probably Kate's sister, Pippa Middleton, 29, but most royal children usually have multiple godparents. The baby's grandfather, Prince Charles, had eight; William had six. The ceremony probably won't take place until the fall because great-grandparents Queen Elizabeth II and Prince Philip will be on their annual vacation in Scotland starting Friday. The private ceremony will likely take place at Buckingham Palace in the chapel or the Music Room, where Charles and William were christened. Also possible: Windsor Castle, where Harry was christened. The hot picture: The gathering of the families, especially the one of the queen with three generations of her heirs. ROAD TO PARENTHOOD: Kate and Will's life together George is a name hefty with history for a boy jokingly described as hefty 8 pounds, 6 ounces by his proud papa. St. George is the patron saint of England, but most likely the name is a nod to George VI and George V, the queen's beloved father and grandfather. Louis comes from Prince Philip's uncle, Lord Louis Mountbatten, who also was close to grandfather Prince Charles. Alexander could be either a reference to old kings of Scotland, or it's the male version of Alexandra, a top girl name contender, the name of a past queen consort who was one of the baby's many royal ancestors. The palace said Wednesday there was no particular significance to these names; they're just the ones the couple likes. But less beloved King Georges included German-born George I, who couldn't speak English; mad George III, who lost the American colonies; and his son George IV, whose life was one drunken scandal after another. George has not been a super popular name in the USA: its highest recent ranking was 129th most popular, in 2000, according to the Social Security Administration. It's a different story in Britain. In 2011, it was ranked at number 12 of the top 100 names for baby boys in England and Wales, according to the Office for National Statistics.