There is normal, and then there is royal normal. The Duke and Duchess of Cambridge will undoubtedly aspire to give their firstborn as normal an upbringing as possible, but that automatic HRH style, bestowed at birth on the orders of the Queen, will inevitably constrain. The royal template leads to expectations of an infant destined for an elite private education, as a boarder, and with a nanny in the background for those times when Mama and Papa are away fulfilling their domestic duties and flying the flag in far-flung places on foreign tours. Then a university will be selected, along with a suitable degree course. There are no degrees on offer in modern sovereignship, but art could be useful, as he will be surrounded by historic works during his lifetime. Both William and Kate studied history of art at St Andrews, though William switched to geography. Constitutional law could perhaps be equally handy. Thereafter, gender dictates. Royal male heirs inevitably undergo a stint in the military. One thing is certain: as this latest addition to the royal family grows up, his parents will fight to protect the young prince from the glare of the national and international media. There was a time when this was easier. The monarch's private secretary would summon Fleet Street's editors and a trade-off would be reached. Access to key moments ? the child's first day at nursery, school and university ? would be granted in return for an agreement to lay off and respect their privacy the rest of the time. These days, when everyone has a cameraphone, it is not quite so straightforward. Just ask Uncle Harry. Among the first decisions the couple must make is whether to employ a nanny. They are not expected to have a full-time one, and Carole and Michael Middleton, the maternal grandparents, will be on hand for babysitting their first grandchild. Prince Charles is also a novice grandparent, but he can pick up tips from the Duchess of Cornwall, an old hand who has five. The nanny, even if part time, will be a crucial addition to the household. Royal nannies have been key figures within palace walls, often becoming substitute mothers. According to Charles's biographer, Jonathan Dimbleby, the Queen was able to spend just 30 minutes with her son in the morning before his daily perambulation and 90 minutes before bath- and bedtime. She was also absent for long periods in his early life, either in Malta, where Prince Philip was serving in the navy, or on official overseas tours. So it comes as no surprise that the young prince was particularly close to his nanny, Mabel Anderson. Anderson took charge of his care when Helen Lightbody, the senior nanny, left after a disagreement with Philip. She enjoyed bonds of affection that were at least as powerful ? as those between a child and his parents , Dimbleby wrote. William and Harry adored their nanny Tiggy Legge-Bourke, who was a guest at the former's wedding. But nannies can also cause jealousy. This is said to have contributed to the Princess of Wales's abrupt dismissal of William's first nanny, Barbara Barnes, known as Baba and to whom he was especially close, when he was just four. Diana was also reportedly resentful of Tiggy, whom Charles had hired to care for his sons after the couple's separation. Tiggy once reportedly said: I give them what they need at this stage: fresh air, a rifle and a horse. She [Diana] gives them a tennis racket and a bucket of popcorn at the movies. Home for the new baby will soon be Kensington Palace's 21-room Apartment IA, which is in the process of undergoing a ?1m refurbishment, funded by the taxpayer, to remove asbestos and renew the roof. The high walls around its large garden will afford the family a little privacy, and the couple are also expected to use the 10-bedroom Anmer Hall on the Queen's Sandringham estate in Norfolk, a grade II-listed Georgian property, as their country retreat. Tradition dictates Christmases will be spent at Sandringham ? or will they alternate between there and the Middletons' Berkshire base? Long summer weeks on the Balmoral royal estate in Scotland also beckon for the family, where the Balmoral estate is heavily protected and well away from prying camera lenses. At the Queen's insistence her children were not required, as their forebears were, to bow or curtsey to their mother. Nor did she, with her husbands agreement, want Charles to be hampered by the social and educational constraints of home schooling, which had been the norm. A week before his eighth birthday, and wearing a velvet-collared top coat over his new school uniform, he attended Hill House pre-preparatory school in west London. Newspapers reported breathlessly that, on his first day, he had painted a picture. The young prince then spent five years at Cheam school in Hampshire, which was founded to educate the sons of noblemen and gentry and was known in the 19th century as the Little House of Lords. This was his father's old school, but Charles's experience was apparently significantly more miserable than Philip's. Worse was to come when his parents chose Gordonstoun in Scotland over Eton, which was a stone's throw from Windsor Castle. The fees were higher at Gordonstoun, but it still led to contemporary reports of him being the first future monarch to be educated in an institution that was fundamentally classless. His unhappiness is outlined in Dimbleby's authorised biography, which quotes a letter Charles wrote to his nanny as saying: I hardly get any sleep at the House because I snore and get hit on the head the whole time. It's absolute hell. William seems to have enjoyed an altogether happier schooling, beginning at Mrs Mynor's nursery in Kensington at the age of three. His photocall on the first day demonstrated that he had already mastered the art of the royal wave. At four-and-a-half he was off to Wetherby school and from there, at the age of eight, to board at Ludgrove in Berkshire,. Eton was also back in fashion, and both he and Harry attended. The Duchess of Cambridge was also a boarder, attending the co-educational Marlborough college, in Wiltshire. It seems likely that the baby will be educated in similar fashion. Neither would it be any surprise if, in order to embrace the Commonwealth, a brief stint enjoying the educational facilities in Australia, New Zealand or Canada were organised at some point. Charles spent a couple of terms at Timbertop, an outback outpost of Geelong Grammar school in Victoria, where welcoming students called him a pommie bastard . As for university, in a nod to the rest of the UK, perhaps he will take a degree at a Scottish or Welsh institution rather than Oxbridge. , or even- and who knows sinceAfter the Queen's historic handshake with Martin McGuinness, a university in Northern Ireland may also be a possibility. Although the baby Cambridge is expected to be monarch, that day looks some way offmay have to wait some considerable time. Charles has been heir to the throne since he was three, and three generations ? the Queen, Charles and William ? stand between the infant and the crown. However long the apprenticeship, the royal family will fight to allow the future monarch the freedom to develop and grow in the manner that William enjoyed. It will be a challenge for William and Kate to balance media interest in the future head of state with their desire to protect their child's privacy. William disliked the attention focused on him at a young age, hiding whenever possible behind his blond fringe in front of the cameras. The harassment the paparazzi regularly subjected his mother to seemed to harden his view of the media even more. He was just 15 when Diana was killed in a Paris car crash while being pursued by photographers. Kate, too, has experienced first-hand the media intrusions that can come with being a member of the royal family. She was photographed topless while on holiday with William in France, and also in her bikini while pregnant. Prince Charles, on the other hand, was taken for twice daily walks around Hyde Park and Green Park as an infant without anyone seeming to notice. Or if they did, they pretended not to out of politeness. William's childhood at KP, as the royals call Kensington Palace, involved some daring days out incognito. There were trips to WH Smiths, with William and his brother wearing caps and Diana in a wig and sunglasses. Occasionally, they managed to slip unnoticed into the local Odeon cinema or to venture into McDonald's in disguise. Their mother also took them on private visits to Centrepoint in central London to see for themselves the plight of homeless people. These are valuable experiences the Cambridges will probably want to replicate with their own child. The couple may well decide to choose Anmer Hall as their main residence, which would allow them greater freedom away from prying eyes. As ever, and throughout this latest royal's life, royal protection officers will always be close by, as will housekeepers, servants and aides. At some point, the third in line to the throne will be prepared for their future role. There are likely to be lessons on the constitution, and some work experience watching how their relatives handle the job. When old enough, they will be expected to appear on the balcony for the Queen's birthday parade, trooping the colour, weddings and other state occasions. The baby's first overseas tour may be just a matter of months away. William was nine months old when he went to Australia and New Zealand with his parents. William will seek to ensure that his child is allowed to enjoy the same freedom as he experienced, protected by arrangements with the media, to attend school and university in relative privacy, and establish a trusted inner circle of friends who can be relied on to keep the young royal's private life private.