SANFORD, Fla. ? The jury deliberating George Zimmerman's fate has reached a verdict. They reached the verdict after deliberating all day on Saturday. Late in the evening the jurors asked for clarification on the instructions regarding manslaughter. At about 6 p.m. ET lawyers for both sides appeared in court where Judge Debra Nelson conferred with them about the manslaughter question and then recessed court. When the lawyers returned more than a half hour later the lawyers worked together on a note the judge sent back to jurors asking them to submit a specific question about manslaughter. It reads in part that the court cannot engage in general discussions about manslaughter. If you have a specific question, please submit it, the response says. A manslaughter verdict would mean jurors rejected Zimmerman's claim he killed in self defense and intentionally committed an act or acts that caused the death of Trayvon, according to Florida's definition of the charge. It clearly means man two is off the table, said Randy Reep, a Florida criminal defense lawyer, who was referring to the second degree murder charge. If you watch the judge give any input on instructions you'll be very surprised how little she really gives. There must be an element of manslaughter that the jury is struggling with and they were hoping to have the judge clear it up for them. But she won't. Jurors resumed deliberations Saturday morning as protesters gathered outside the courthouse and the nation watched for a verdict. They entered their 10th hour late in the afternoon as the courthouse buzzed with anticipation. Seminole County Sheriff officers, in pine-colored uniforms, were tightly patrolling the entrance of the building allowing only pre-approved people into the building. About 100 demonstrators gathered outside the courthouse, shouting slogans, waving banners and arguing with one another about the case. At 5 p.m. ET emotions ran high as the large crowd gathered at a fountain. Sheriff's deputies escorted two demonstrators away from the fountain after they verbally clashed, drawing crushes of cameras and gawkers. Jurors deliberated for three hours before breaking for lunch. They resumed their discussions about 1 p.m. ET. Judge Nelson sent them into the jury room when they first came in saying all of the evidence will be back there with you, referring to a request Friday by jurors to see an inventory of all the evidence in the case. The six-woman jury has the option of acquitting Zimmerman or convicting him of second-degree murder or manslaughter in the death of Trayvon Martin. Jurors began weighing evidence against Zimmerman Friday and recessed after three and a half hours. Zimmerman, 29, a former neighborhood watch volunteer, said he shot Trayvon, 17, in self-defense after being attacked. State prosecutors, however, claim Zimmerman profiled, followed and murdered the teen on Feb. 26, 2012. STORY: Crowds gather as jury deliberates STORY: Five key issues for Zimmerman jury STORY: Zimmerman verdict sparks worry of riots INTERACTIVE: Trayvon Martin-Zimmerman case Benjamin Crump, an attorney for Martin's family, said the parents are emotional but doing as well as expected as they await a verdict. Jurors staying out longer and considering the evidence and testimony is a good thing for us arriving at a just verdict, Crump said. Police and civic leaders have pleaded for calm in Sanford and across the country after the verdict is announced. In New York on Saturday, the Rev. Al Sharpton said that no matter the verdict, any demonstrations that follow it must be peaceful. We do not want to smear Trayvon Martin's name with violence, the civil rights leader said. He is a victim of violence. Before the jury began weighing evidence Friday, Nelson told the panel they must find, beyond a reasonable doubt, that Zimmerman is guilty of a crime. You must presume innocence. ... Zimmerman is not required ... to prove anything,'' she said. The state must prove the alleged crime was committed. It's up to the state to prove his guilt. Deliberations in the high-profile case began shortly before 2:30 p.m. Friday, after Assistant State Attorney John Guy gave the state's rebuttal statements to the defense's closing statements. Guy, looking intently at jurors, said that child had every right to be afraid of a strange man following him. Following a state tactic used throughout the trial, Guy quoted from Zimmerman's conversation by cellphone with a police dispatcher soon after spotting Trayvon. The prosecutor focused on Zimmerman saying f--king punks and these a--holes always get away. Those words, Guy argued showed the frustration, hate and spite that motivated Zimmerman to shoot Trayvon. Guy also put up a split screen of pictures: Trayvon's dead body on the grass and the bloody head of George Zimmerman after the shooting. Who lost the fight? Guy asked. He added that if Zimmerman is acquitted it will send a message that grown men can follow and kill children. He also repeated a sentence he delivered in his opening statement in the rebuttal: The defendant didn't shoot Trayvon Martin because he had to, he shot him because he wanted to, he said. Mark O'Mara, one of Zimmerman's lawyers, argued in a lengthy closing statement that his client is a conscientious citizen who fired a fatal bullet into a teen while fighting for his life. O'Mara used several visuals in his closing, including a chart about reasonable doubt, self-defense and a computer animation showing Trayvon walking up to Zimmerman and punching him. Trayvon, instead of going home, likely hid, waited for Zimmerman and confronted him, O'Mara said. That is not an unarmed teenager, O'Mara said in his closing statement, explaining with an actual concrete slab that Trayvon used his fists and a sidewalk to threaten great bodily harm. The defense attorney said that Zimmerman was not the aggressor and that the state's case arguing Zimmerman's cursing on a police call was ill will doesn't make sense. The fact that he was willing to say it on a call with law enforcement is evidence of non-guilt, O'Mara said. About two hours into their review Friday, jurors asked Nelson for an inventory of all the evidence in the case. Some of the items include several statements Zimmerman gave to police, Trayvon's autopsy report and photos of both Zimmerman's injuries and Trayvon's body. More than 50 witnesses testified as well including forensic experts who testified about the angle in which Trayvon was shot, the position Zimmerman's gun may have been in, and where DNA and blood was found. If convicted of second-degree murder, Zimmerman could face life imprisonment. If he's found guilty on a lesser charge of manslaughter, he faces a prison sentence of up to 30 years. Contributing: Rick Neale, Florida Today; Associated Press.