WASHINGTON AP ? While some looked at murder trial witness Rachel Jeantel and saw either a defiant young woman or a victim, Tom Joyner looked at her and saw potential. The nationally syndicated radio personality and philanthropist says he was touched by Jeantel, who spent two days testifying in the trial of George Zimmerman about her last conversation with her friend Trayvon Martin. In fact, Joyner was so moved that he has offered to pay for Jeantel to attend the historically black college of her choice. And she's accepted. ZIMMERMAN VERDICT: All-woman jury was key strategy, consultant says Joyner explained the offer in an open letter to Jeantel and all the young people in this country who, through no fault of their own, find yourself living in underserved communities and not yet figuring out your way in this world. I realized a hug wasn't enough, Joyner wrote in the letter posted Wednesday on BlackAmericaWeb.com. Wednesday night, Joyner and Jeantel appeared on Headline News, where she thanked the talk-show host. Asked if she would accept his offer, she said simply, I will. No details were discussed. Whatever her future is going to be, I want to help her, Joyner said on Headline News. You stand a better chance of success if you have a college education. Jeantel was the last person to talk to the 17-year-old before he was fatally shot in a February 2012 confrontation with Zimmerman, who claimed he shot Martin in self-defense. Zimmerman, 29, was acquitted last week of second-degree murder and manslaughter charges. Jeantel, 19, has yet to graduate from high school. Before attending college, she would have to get a diploma and take entrance exams. Joyner also offered to provide her with tutors to accomplish those goals. We are committed to meeting you where you are, helping you to get your GED and prepping you for the historically black college or university of your choice, Joyner wrote in the letter. Joyner has supported historically black colleges and students who attend them through the Tom Joyner Foundation. According to its website, the foundation has raised $65 million to support more than 29,000 students attending historically black colleges and universities, many of which have their roots in 19th century efforts to educate newly freed slaves. Joyner wrote that he'd only ask in return that Jeantel try to make a difference in someone's life. Time and time again, we watch our young people get written off, tossed aside or put at the end of the line because no one wants to give them a chance, he said. Joyner has provided full scholarships in the past to others, including Genarlow Wilson, who at age 17 was sentenced to 10 years in prison for engaging in sex acts with a 15-year-old girl. Wilson's conviction was ultimately overturned by the Georgia Supreme Court, and he graduated from Morehouse College in May with a degree in sociology.