SANFORD, Fla. ? Monday dawned as quietly as Sunday did in this sleepy small Central Florida city. The streets of Goldsboro, the historic black community, were all but empty. Downtown was tumbleweed still. A few miles from the county courthouse, in Mel?s Family Diner, waitresses served up signature dishes ? sissy burgers and biker omelets ? and voiced tentative relief. After all the preparations for violent outbursts and repeated entreaties from pastors for calm, people here did not riot ? and barely protested ? in these days after the acquittal late Saturday of George Zimmerman, the man whose deadly encounter with an unarmed black teenager, Trayvon Martin, brought the city infamy almost a year and a half ago. Having been swamped by tens of thousands of protesters last year demanding Mr. Zimmerman?s arrest, the city tensed as the verdict approached. Extra police officers went on patrol. Grocery stores hired more security guards. Convenience store clerks asked to be allowed to leave early when a verdict was near. One of the waitresses at Mel?s, who is white and did not want to be identified, only half-jokingly asked black friends if she could hide in their attic ?if anything happens.? The verdict came Saturday night: jurors accepted Mr. Zimmerman?s claim that he shot Mr. Martin in self-defense. The teenager?s parents, Sybrina Fulton and Tracy Martin, were ?heartbroken and devastated,? their lead lawyer said. Mr. Zimmerman?s whereabouts remain unknown to the public, and as of late Monday, according to his defense team, he had not collected the gun used in the episode, which the court had ordered released. As protests over the verdict unfolded across the country, it became clear in Sanford that the widely forecast unrest was unlikely to come to pass. ?We might be angry about the verdict,? said Larry Williams, 55, as he sat in the air-conditioned chill of his friend?s barbershop in Goldsboro on Monday. ?But why go out and do anything you would not want to do?? So, on Monday, people carried on, some with heavier hearts than others. Shauna Rollf, 24, who works at the Taste of Thyme Cafe, said business was lighter than normal because Sanford residents were avoiding all the reporters and camera crews prowling through downtown. Like others, she was awaiting the day the news media swarm left. ?I think everybody?s kind of exhausted,? she said. A few blocks away, a dozen pastors, city officials and perhaps a hundred residents, black and white, filed into the New Life Word Center Church for a noontime prayer service. They prayed for peace and racial reconciliation, and they prayed for the Zimmerman and Martin families. ?God, we realize there is no winner in this situation,? one pastor said, as those gathered raised their hands heavenward, crying out, ?That?s right.? The new police chief, Cecil E. Smith, also spoke from the altar, praising the town. ?Everybody wants us to go out and act up,? he said. ?We are peaceful in the middle of an issue that has divided our country.? Mr. Smith, along with Sanford?s mayor, Jeff Triplett, and other community leaders, is seeking to repair longstanding wounds laid bare by Mr. Martin?s shooting ? namely the distrust that many black residents harbor toward the city?s police. ?People are saying, ?I guess you want to go back to normal living.? No we don?t,? said another pastor, John Murphy. ?We want to go forward. We have to repent for all the things that stood in the way before of unity.? Not everyone appreciated the stillness. A day after the verdict, Isaac Jones, 56, spent part of his morning on a bench near a memorial for Mr. Martin in Goldsboro, and sadly took in the neighborhood?s quiet. ?Everybody?s taking this way too calm,? he said. ?Something has to be done. It?s going to happen again.? Other residents said that though Mr. Zimmerman was acquitted, his life would forever be haunted. ?He is going to be on the run for the rest of his life,? said Mack Cotton, 51. ?And he?s going to see that kid for the rest of his life. He ain?t going to be able to run from it.? If some people in Sanford wanted to move onward, others on Monday said parts of the city were caught too tightly in more intractable grips ? poverty, and what many here see as unfair administration of the law. ?There is no normal. Every day is a struggle,? said Mr. Williams, who lives on disability checks. ?There are so many laws down here that were not built for us in the black community.? But a few doors down, at the Goldsboro Westside Community Museum, home to photos of civil rights leaders and relics from the town?s segregationist past, the curator, Francis Oliver, said the verdict had brought some peace. ?We wanted George Zimmerman arrested; we got it. We wanted him to have his day in court; we got it. We wanted a new police chief; we got it,? she said. ?We have said before what we wanted out of the whole thing.?