What do black parents tell their sons now? That the death of 17-year-old Trayvon Martin was just an aberration? That such a tragedy could never happen in our own neighborhoods? That our sons are just as free, and safe, to walk the streets as other children? Black parents did not sleep well after the verdict was announced Saturday night. In fact, I doubt many of us went to bed before Sunday morning. We were calling and texting each other. Facebook was on fire as many of us vented our anguish, anger and frustration with the justice system. I literally heard from parents from across the country. The jury, the defense and the prosecution all came in for criticism by many. But most black parents -- myself included -- are especially concerned about what to say to our children, especially our sons. Not that any of this is new. For generations, black parents have been giving their sons the talk. More essential than gas money, the talk is about what to do if you encounter a police officer. It's about the basic steps you must take to offset being profiled because of your race and culture: Be respectful, not belligerent, even if you have done nothing wrong and are being harassed. If driving, keep your hands on the steering wheel in plain sight. Don't make any sudden moves. Always announce your intentions to the officer before doing anything, and ask him if it's OK just to be sure. If it's dark, turn on the light in your car before the officer approaches so he knows he can see you clearly. Do not consent to a search, even if you have nothing to hide. Always ask the officer if you are free to go or if you are being detained. And if you are being detained, clearly invoke your right to remain silent -- now more than ever in light of the U.S. Supreme Court's recent ruling in Salinas v. Texas. The Zimmerman verdict makes many of us wonder if the talk is enough. More chilling, we worry if any preventive measures will ever be enough. We are not na?ve about the history of young black men in our nation. We remember young Emmett Till, murdered and mutilated during an orgy of white Mississippi rage. We remember Jimmy Lee Jackson, shot dead by a bigoted state trooper in Marion, Ala. We remember Amadou Diallo, the unarmed Haitian immigrant killed in a spray of 41 police bullets. We remember Abner Louima, sodomized by police officers while handcuffed and in their custody at a New York police precinct. None of them was killed or assaulted while engaged in a crime. They were not guilty in fact, but judged to be so in an instant by vigilantes or rogue police officers. And yes, we also know that hundreds of our young men die in city streets across the nation at the hands of other young black men in gang wars and street crimes. We have always been and continue to be concerned about the painful irony of our children being targeted by their own. And many of us have talked to our sons about this tragic reality. Many of us continue to work in our communities to stop this horrific trend. Yet, there is something especially disturbing about the killing of Martin and the acquittal of Zimmerman. And that is that deeply embedded in both is America's historic predisposition to see our young black sons as inherently more dangerous and less valuable than other young men. Far too often, the justice system and our society see our boys as disposable and dispensable. And unfortunately, there seems to be no talk that can change that. David Person hosts WEUPTalk on WEUP 94.5 FM/1700 AM in Huntsville, Ala., and is a member of USA TODAY's Board of Contributors.