Shortly after the not-guilty verdict was announced in the George Zimmerman trial, Gina Cherelus heard four or five gun shots outside her apartment. Moments later she received a text message from the emergency broadcast system of the Florida A&M University Police Department that read: Physical disturbance occurred near our campus. Please stay indoors until further notice. Then cops started whizzing by my apartment, recalls Cherelus, a senior at FAMU. The next text from FAMU PD read: Student and faculty please use caution in ref to the Zimmerman verdict if you notice any activity please notify the police. 850 561-3256. Robert Grasso, public information officer for the Tallahassee Police Department, confirmed that one shot was fired in close proximity to the FAMU campus area, adding that nobody was injured. It was not related to the Zimmerman verdict , he said, noting that it was just a large party. The threat of danger subsided when FAMU PD texted that the campus was calm and that FAMU students were preparing for a peaceful march at 11:30 p.m. Asia Johnson, secretary of communications for the FAMU Student Government Association, said in an e-mail that the group met on campus so FAMU's interim president and FAMU PD could provide students with safety tips and urge them to keep protests peaceful. Our school's Twitter page started posting tweets asking students to meet at our Eternal Flame, which is kind of like the center of our campus, to do a peaceful protest, says Cherelus. But it looked like the whole city decided to go to the Capitol instead. Hundreds of students from FAMU, Florida State University, Tallahassee Community College and other members of the community answered the call to protest the verdict at the Florida Capitol. Michael Sampson, one of the organizers of the event and a member of the Florida State University student organization known as Tallahassee Dream Defenders, spread the message through social media. It was a proud moment to see over 300 people, in less than an hour, organize and gather, says Sampson. The protesters met at the Leon County Civic Center at midnight and marched for several blocks before reaching the Capitol. In remembrance of Trayvon Martin, half of the march took place in silence. The rest of the way, participants chanted and sang hymns. Other protesters wore hoodies and held signs that read, Racism Is Not Dead, and Who's Next? At the Capitol, Cherelus says that some people got on a megaphone and made comparisons between how Michael Vick was convicted for killing dogs and Zimmerman got off for killing a human being. The majority of people who spoke to air their grievances were students, she says. Cherelus says she was shocked and disappointed by the verdict. I did not think he was going to walk away free, she says. To hear about this not guilty verdict was definitely shocking, but it wasn't surprising because we see injustice happening everywhere, says Sampson, It's clear ? there's obviously no justice for black and brown youth. Sampson says his next step will be to organize another protest ? tentatively on Tuesday ? to ensure that their voice is heard. With added time and preparation ? and the passion that spurred about 300 people to congregate in less than hour at midnight ? Sampson thinks they'll be able to move hundreds, if not thousands, for Tuesday's protest. It's up to the power of organizing ourselves to make changes within our system to see that no more Trayvons happen, Sampson says. David Schick is a summer 2013 Collegiate Correspondent.