A deadly shooting at the site of a sit-in by Muslim Brotherhood supporters in Cairo, demanding the reinstatement of ousted President Mohamed Morsi, has left dozens of people dead. The Egyptian health ministry said at least 42 people had been killed and more than 300 injured in the incident early on Monday morning. Mohamed Ibrahim El-Beltagy, a Brotherhood MP, described the incident during dawn prayers after police had stormed the site, as a massacre . About 500 people were also reportedly injured. A doctor told Al Jazeera that the majority of injured had gunshot wounds to the head . The Brotherhood said the dead and the injured have been taken to a makeshift hospital in Nasr City, a neighbourhood in the Egyptian capital. Speaking to Al Jazeera, Gehad Haddad, a spokesman for Muslim Brotherhood, said that at around 3.30 in the morning, army and police forces started firing at sit-in protesters in front of the Republican Guard headquarters in Cairo. 'Hit in the head' ?We have people hit in the head, we have bullets that exploded as they entered the body, cluttering organs and body parts? he said. ?Every police force in the world understands how to disperse a sit-in. This is just a criminal activity targeting protesters.? But the military said a terrorist group had tried to storm the Republican Guard facility, where Morsi is reportedly being held. It also said that two officer had also been killed.? An Al Jazeera correspondent said military checkpoints had been deployed around Nasr City. Brotherhood's Haddad said there were two things ?the bloodbath? was trying to do. ?First is that we leave streets and forego the objective of bringing democracy in Egypt after 60 sixty years of military tyranny or they think that our blood is cheaper than any other?s blood in Egypt and no one would care,? he said. ?We are sticking to our ground, we will not be brought into a cycle of violence, we know how deadly that would be. Even if that means we will have to become the punching bag of the rest of society and our blood will flow for the rest of Egyptians to wake up and the rest of the world to understand that we are adamants of bringing democracy to our country.? Dozens have died and more than 1,000 people have been injured in street clashes between supporters and opponents of Morsi in the aftermath of the military coup last Wednesday. Also on Monday, Egypt closed down the Cairo headquarters of the Brotherhood, saying weapons were found inside it. The latest violence further raised political tensions, even as the country's interim leadership struggled to find a consensus on who should be the prime minister. The Salafist Nour Party announced it was suspending its participation from talks over new government in protest against Monday's fatal shootings. Earlier reports said interim president Adly Mansour?was leaning towards appointing centre-left lawyer Ziad Bahaa Eldin as prime minister, after members of the Nour Party expressed concern at an earlier suggestion that the job could go to Nobel Laureate Mohamed ElBaradei. But some Nour Party members expressed concern that the candidates had political affiliations. Younes Makhyoun, Nour's leader, told Reuters: Both are from the same party, the National Salvation Front,?this is rejected. I fear it would be going from one exclusive?approach to another, referring to accusations that the?Brotherhood tried to monopolise power. Meanwhile, the popular Salafist preacher?Yaser Borhamy told Al Jazeera that he has nothing against Bahaa el-Din, but they would rather have someone who does not belong to a political party - a pure technocrat if such thing exists, said Al Jazeera's Hoda Abdel-Hamid. She said others from Al Nour had been seen on local media channels saying they approve of Bahaa el-Din.? AFP reported that the prime minister would be named on Monday, quoting the interim president's adviser. Nour had signed up to the army's roadmap for the political transition, giving Islamist legitimacy to an overthrow rejected by Islamic parties aligned to Morsi's Muslim Brotherhood. Brotherhood defiant Unlike Nour, its bigger rival the Brotherhood has said it?would have no part in the military-backed political process. The army has denied it staged a coup, saying instead it was merely enforcing the will of the people after mass protests on June 30 calling for Morsi's resignation. The pro-Morsi camp is refusing to budge until its leader is restored - an unlikely outcome. On the other side of the political divide, hundreds of?thousands of Morsi's opponents poured into Cairo's Tahrir?Square, the cradle of the popular uprising to oust him. On Sunday night, a carnival atmosphere took hold, and a troupe of folk musicians played darabukka drums and mizmar flutes as others danced and let off fireworks.