Here's a summary of the main events today: ? Egypt?was braced for more mass protests in the wake of the killing of 51 supporters of the deposed president, Mohamed Morsi,?as political leaders bargained over the creation of a civilian transitional government to rule with military support, until new elections are held next year. Pro-Morsi crowds were still gathering in Cairo near the scene of Monday's killings, described as a massacre by?Muslim Brotherhood supporters but defended by the army as a response to a terrorist attack. ? The authorities are refusing to release the bodies of those killed until families accept official autopsy reports amid a mounting dispute about the circumstances of their deaths. The Egyptian health ministry said no women and children were among the dead as the Muslim Brotherhood alleged. ? UN secretary general Ban Ki-moon has backed calls for an independent inquiry into the killings. A statement released by his office said: ?The Secretary-General condemns these killings and calls for them to be thoroughly investigated by independent and competent national bodies, and those responsible need to be brought to justice. ??The Egyptian army insisted it did not use excessive force against pro-Morsi supporters amid calls for an independent investigation into the alleged massacre.?Speaking to AP, spokesman Colonel Ahmed Mohammed Ali, said: What excessive force? We were dealing with people shooting at us with live ammunition. It would have been excessive if we killed 300. Amnesty called for an inquiry and an end to the practice of white-washing abuses by the Egyptian army. ? Samir Radwan, favourite to become prime minister, told the Guardian that his priorities, if appointed, would be tackling the economy and national reconciliation ? vital in an atmosphere of extreme polarisation.?Radwan said if chosen his priorities would be the economy and healing the deep divisions in Egyptian society. ? The removal of the Muslim Brotherhood appears to have opened the way to lucrative financial backing from the Gulf. The United Arab Emirates has agreed to grant Egypt $1bn and lend it another $2bn, according to Reuters. Its sources also said Saudi Arabia may lend Egypt another $2bn. The popular Tamarod campaign, which organised a widely signed petition calling for Morsi to resign, has revealed it was not consulted on the new constitution or timetable for early elections, the Egypt Independent reports. Earlier we stated that the campaign had condemned the new charter. This was also reported elsewhere, but it has not been confirmed. The information was based on what appears to be a false Twitter account hat tip Johanna Paraszczuk . The United Arab Emirates has agreed to grant Egypt $1bn and lend it another $2bn, according to Reuters. Egypt's health ministry has insisted that women and children were not among those killed outside the Republican Guards headquarters on Monday. It said 51 men were killed and 455 injured, Ahram reports. At Cairo's Zeinhom morgue, mourners of those killed in Monday's massacre were still waiting for their friends' bodies to be released ? many still coming to terms with the horror of what happened. It was barbaric, said Mohamed Abu Sayed, a lecturer at al-Azhar university, who was waiting for the body of his friend Mohamed Abdel Rahman, a chemist. It was a black day in the history of Egypt's army. Abu Sayed called for Islamists to continue their peaceful resistance in response. The UN's secretary general, Ban Ki-moon, has backed calls for an independent inquiry into the killing of more than 50 Morsi supporters on Monday. A statement released by his office said: ?The Secretary-General condemns these killings and calls for them to be thoroughly investigated by independent and competent national bodies, and those responsible need to be brought to justice. Ban's office said he had grave concerns about events in Egypt and called for efforts to build consensus. His remarks, though strongly-worded, will not satisfy Muslim Brotherhood supporters who have expressed anger at the muted response of the international community. Writing in today's Guardian, former minister Yahia Hamed says: Despite this brutality, the coup has been supported ? either openly or behind platitudinous expressions of concern ? by foreign governments. The removal of the Muslim Brotherhood opens the way to potentially lucrative financial backing from the Gulf, Bloomberg reports. Emad Mostaque, a London-based strategist at Noah Capital Markets EMEA Ltd, told the agency: We can expect that there will be more investment from Saudi Arabia and the UAE, who were hesitant because of the Muslim Brotherhood beforehand. And Raza Agha, chief Middle East and Africa economist at VTB Capital Plc in London, said: Aid from Saudi Arabia and the UAE will support the balance of payments and will help boost reserves. Sure enough, a ministerial delegation from the United Arab Emirates is due to arrive in Egypt early this week, Reuters reports citing a UAE government source. The man being tipped as Egypt?s next prime minister is currently on holiday in Switzerland, but says he is ready to serve his country, Patrick Kingsley reports after talking to Samir Radwan. In an audio update from Cairo, Patrick said: Radwan told Patrick that his appointment was not certain, but he confirmed he is being considered for the post. ?He felt this was a job he could do. It caught him slightly by surprise ... but he seems like a chap who is ready to step up for his country, Patrick said. Radwan, who was finance minister in the days that followed the fall of Mubarak, is a development economist who has been advising the government of Oman on economic strategy. Patrick added: He said that if he was appointed, and he made it clear that it was not a done deal, his top priority would be national reconciliation. He said [Egypt] was a South African situation, where major national reconciliation was required. His second priority would be the economy. When I last spoke to him two weeks ago he had some choice things to say about the economy in Egypt, which he said was the worst it had ever been for half a century. Radwan is a less divisive figure than Mohamed ElBarabei, who was vetoed by the Salafists as interim prime minister, Patrick said. The Salafist group?s success in blocking ElBaradei?s appointment was a symbolic victory that would it help allay unease among its supporters about the group?s involvement in the new regime. The Salafists are emerging as unlikely kingmakers in the new Egypt, Patrick said. A new charter setting out plans for elections next year and changes to the constitution is short on human rights and shows the influence of Salafists, according to an analyst. Zaid al-Ali, senior adviser on constitution building, at the democracy campaign International Idea, gives his analysis in a series of tweets. Welcome to Middle East Live. The Egyptian army is facing calls for an investigation into Monday's killing of more than 50 supporters of the ousted president Mohamed Morsi.? Here's a roundup of the latest developments: ? Interim president Adly Mansour has set out a timetable for amending the constitution, and for parliamentary and presidential elections for early 2014, after the bloodiest day in Egypt for more than a year. At?least 51 supporters of the deposed president Mohamed Morsi were killed by security forces in what the Muslim Brotherhood condemned as a massacre, but the military insisted was the result of an armed attack on a Cairo barracks. ? The Egyptian army has insisted it did not use excessive force against pro-Morsi supporters amid calls for an independent investigation into the alleged massacre. Speaking to AP, spokesman Colonel Ahmed Mohammed Ali said: What excessive force? We were dealing with people shooting at us with live ammunition. It would have been excessive if we killed 300. Amnesty called for an inquiry and an end to the practice of white-washing abuses by the Egyptian army. ? Former finance minister Samir Radwan has emerged as the new favourite to become Egypt's interim prime minister, Reuters reports citing senior political sources. The Salafist al-Nour party, which backed last week's coup against the Muslim Brotherhood, blocked the appointment of liberal opposition leader Mohammed ElBaradei as prime minister.? ? Protests against the military will continue until Morsi is restored to the presidency, one of the ministers from his deposed government has vowed. Writing in the Guardian Yahia Hamed says: We will continue to demonstrate against this attack on democracy ? and resist by all peaceful means until the elected president is reinstated and the army ends this grossly illegitimate intervention in Egypt's politics. Egyptians have the right to demand clear condemnation of those who forcibly suppressed our nascent democracy, and to express frank rejection of this coup. Today's massacre will not pass unquestioned. ? The Obama administration attempted to sidestep questions over the legality of military aid to Egypt on Monday by announcing it would not suspend payments to Egypt pending further review on whether last week's events amounted to a military coup. Spokesman Jay Carney said:? We have had a long relationship with Egypt and the Egyptian people and it would not be wise to abruptly change our assistance programme. The smart policy is to review this matter. The argument that the army had to go in to restore order when it staged its coup has been shown to be fallacious. In the past 10 days, the security forces became a major instigator of disorder and violence. The army also became wholly partisan, handing out orange juice and cold water to one side and firing bullets at the other ... The army's claim to be protector of all Egyptians is disintegrating before our eyes. Before it loses its cohesion ? and there are reports of unrest in its lower ranks ? it should back down, because even worse might follow.