In November 2011, after I joined a protest on Mohamed Mahmoud Street in Cairo with a friend, Egyptian riot police beat me ? breaking my left arm and right hand ? and sexually assaulted me. I was also detained by the interior minister and military intelligence for 12 hours. After I was released, it took all I had not to cry when I saw the look on the face of a very kind woman I'd never met before, except on Twitter, who came to pick me up and take me to the emergency room for medical attention. She is now a cherished friend. As I described to the female triage nurse what had had happened to me, she stopped at and they sexually assaulted me to ask: It had been about 14 or 15 hours since riot police had attacked me; I just wanted to be X-rayed to see if they had broken anything. Both arms looked like the Elephant Man's limbs. I explained to the nurse that when you're surrounded by four or five riot police, whacking at you with their night sticks, there isn't much resisting one can do. I've been thinking a lot about that exchange with the nurse. Whenever I read the ghastly toll of how many women were sexually assaulted during last week's protests against Mohamed Morsi in Tahrir Square, I have to wonder about such harshness after brutality. Activists with grassroots groups on the ground who intervene to extricate women from sexual violence in Tahrir said they documented more than 100 cases; several were mob assaults, several requiring medical attention. One woman was raped with a sharp object. I hope none was asked why didn't you resist? This isn't an essay on how Egyptian regimes like Mubarak's targeted female activists and journalists as a political ploy. Nor is it about how regimes like Morsi's largely ignored sexual violence, and even when it did acknowledge it, blamed women for bringing assaults upon themselves. Nor is it an article about how such assaults and such refusal to hold anyone accountable have given a green light to our abusers that women's bodies are fair game. Nor will I tell you that ? were it not for the silence and denial surrounding sexual assault in Egypt ? such assaults would not be enacted so frequently on women's bodies on the Egyptian streets. I don't know who is behind those mob assaults in Tahrir, but I do know that they would not attack women if they didn't know they would get away with it and that the women would always be asked why didn't you resist? From the ground up, we need a national campaign against sexual violence in Egypt. It must push whoever we elect to govern Egypt next, as well as our legislators, to take sexual assaults more seriously. If our next president chooses ? as Morsi did ? to address the nation from a stage in Tahrir Square for the inauguration, let him or her salute the women who turned out in their thousands upon thousands in that same square, knowing they risked assaults and yet refusing to be pushed out of public space. The square's name literally means liberation , and it will be those women who, in spite of the risk of sexual violence, will have helped to enable his or her presence there as the new president of Egypt. Undoubtedly, the Egyptian interior ministry needs reform, especially when it comes to how it deals with sexual assault. The police rarely, if ever, intervene, or make arrests, or press charges. It was, after all, the riot police themselves who assaulted me. Their supervising officer even threatened me with gang rape as his conscripts continued their assault of me in front of him. Any woman who ends up in the ER room deserves much better than why didn't you resist? Nurses and doctors need training in how best to care for survivors of sexual assault and how to gather evidence. Female police units are said to have been introduced at various precincts, but they need training. They also need rape kits ? in the unlikely event any woman actually gathers herself enough to report rape in Egypt. When I was reporting on sexual violence in Cairo in the 1990s, several psychiatrists told me their offices were the preferred destination for women who had survived sexual violence, be it at home or on the streets, because they feared being violated again in police stations. While that fear is still justifiable today, something has begun to change: more and more women are willing to go public to recount their assaults. I salute those women's courage, but I wonder where they find comfort and support after their retelling is over. PTSD therapy is not readily available in Egypt. We need to train more of our counsellors to offer it to those who want it. We need to recruit popular football and music stars in advertising campaigns: huge, presidential election campaign style billboards across bridges and buildings ? addressing men with clear anti-sexual violence messages, for example ? as well as television and radio spots. Culture itself has a role to play in changing this culture: puppet theatre and other arts indigenous to Egypt can help break the taboo of speaking out; and we need more TV shows and films that tackle sexual assaults in their storylines. There is an innate and burning desire for justice in Egypt. Revolutions will do that. We need to coordinate efforts and aim high to ensure such a campaign meets the needs of girls and women across the country, not just Cairo and the big cities. In January 2012, I spent a few days with a fierce 13-year-old girl we'll call Yasmine, for a documentary film, on which I was a writer, called Girl Rising. The film paired nine female writers with girls each from their country of birth whose stories they recounted to illustrate the importance of girls' education. Five months before we met, Yasmine had survived a rape. My arms were still broken and in casts when we met and I naively considered removing the casts and pretending I was OK in order to protect her . I did not want her to think that 30 years down the line, at my age, she could still be subject to such violation. She certainly did not need my protection and I'm glad I kept my casts on, because as soon as we met, she simply and forthrightly told me: She then went on to recount what happened to her. I admired her courage and her insistence on going to the police with her mother to report the rape. She was lucky she found an understanding police officer who took her complaint seriously. When I told her what had happened to me, she was shocked that it was police who'd attacked me. Have you reported what happened to you? Have you taken them to court? she asked me. Yasmine has not had a single day of formal education. She believed she deserved justice. We all do.