Top 	 world news 					 stories 3 July 2013 | The Guardian 	 	 	 	 	 		 			 							 	 	 	 	 	 		 Turn autoplay off Turn autoplay on Please activate cookies in order to turn autoplay off 	Jump to content [s] 				Jump to site navigation [0] 		Jump to search [4] 		Terms and conditions [8] 	 		 	 	 Edition: UK US AU Your activity Email subscriptions Account details Linked services Sign out Beta 			 	 	 							 		 			 						 		 	 		 					 	 	 	 			 			 		 					 	 	 			 					 	 		 			 	 				 				 		 							 	 	 		 						News 					 												 																			 						US 					 												 																			 						World 					 												 																			 						Sports 					 												 																			 						Comment 					 												 																			 						Culture 					 												 																			 						Business 					 												 																			 						Money 					 												 																			 						Environment 					 												 																			 						Science 					 												 																			 						Travel 					 												 																			 						Tech 					 												 																			 						Media 					 												 																			 						Life & style 					 												 																								 						Data 					 									 										 News World news UK Europe China Middle East Africa South and Central Asia Asia Pacific Americas Cities 					 				 				 	 		 										 	 	 		3 July 2013 					Top stories for 					 world news 								 			RSS 			 		 			 					All stories 				 				 					Top stories 				 			 			 			 				 									10.22pm 				 														 					Bolivia 				 			 			 									 				 				Bolivia complains to UN after Evo Morales' plane 'kidnapped' 				 		 		 		 	 	 			 	 				US refuses to comment on Morales plane but admits contact with other nations over potential Snowden flights 				 		 				 		 	 					 		 			 				 									9.14pm 				 														 					Ecuador 				 			 			 									 				 				Snowden row intensifies as hidden bug found in Ecuador's embassy 				 		 		 		 	 	 			 	 				Ecuadorean minister threatens to reveal perpetrators after device discovered during meeting over Assange 				 		 				 		 	 					 		 			 				 									7.31pm 				 														 					Eurozone crisis 				 			 			 									 				 				Eurozone crisis: Portugal sends stock markets tumbling 				 		 		 		 	 	 			 	 				Threat of Portuguese government collapse causes FTSE to fall 74 points and German Dax and French CAC to drop 1.5% 				 		 				 		 	 					 		 			 				 									7.25pm 				 														 					Kurds 				 			 			 									 				 				Kurdish smugglers struggle to feel Turkey peace dividend 				 		 		 		 	 	 			 	 				Villagers feel under siege as crackdown follows ceasefire that ended years of conflict 				 		 				 		 	 					 		 			 				 									7.03pm 				 														 					Occupy Oakland 				 			 			 									 				 				Occupy Oakland protesters awarded $1m over police violence during arrests 				 		 		 		 	 	 			 	 				12 activists to split compensation, including $500,000 for one woman who suffered permanent hearing loss during protests 				 		 				 		 	 					 		 			 				 									6.14pm 				 														 					France 				 			 			 									 				 				French nuclear tests 'showered vast area of Polynesia with radioactivity' 				 		 		 		 	 	 			 	 				Declassified papers show extent of plutonium fall-out from South Pacific tests of 60s and 70s was kept hidden, says French paper 				 		 				 		 	 					 		 			 				 									5.52pm 				 														 					Metropolitan police 				 			 			 									 				 				Two people shot while trying to evict tenant from house in south London 				 		 		 		 	 	 			 	 				Metropolitan police arrest suspected gunman after Brixton shooting leaves pair in hospital 				 		 				 		 	 					 		 			 				 									5.31pm 				 														 					Nelson Mandela 				 			 			 									 				 				South African courts step in over Mandela family burial row 				 		 		 		 	 	 			 	 				Exhumation and reburial of former leader's three late children under way following unseemly family feud 				 		 				 		 	 					 		 			 				 									5.06pm 				 														 					Aid 				 			 			 									 				 				Syria: 'Aid money is going out as fast as it is coming in' 				 		 		 		 	 	 			 	 				With public appeals unmet and the threat of disease as temperatures rise, where's the urgency over the humanitarian crisis in Syria? writes Mark Tran 				 		 				 		 	 					 		 			 				 									4.48pm 				 														 					Arizona 				 			 			 									 				 				19 fallen firefighters: the lives left behind by the Arizona hotshot crew 				 		 		 		 	 	 			 	 				They were mostly athletic young men in their 20s. At least two left behind unborn children. Two were cousins. And all the members of the Granite Mountain Hotshots saw fighting fires as a calling 				 		 				 		 	 					 		 			 				 									4.37pm 				 														 					United Nations 				 			 			 									 				 				Edward Snowden's digital 'misuse' has created problems, says Ban Ki-moon 				 		 		 		 	 	 			 	 				Ban makes remarks in Reykjavik but Icelandic MP Birgitta J?nsd?ttir says it was 'wrong for Ban to condemn Snowden personally' 				 		 				 		 	 					 		 			 				 									4.25pm 				 														 					Egypt 				 			 			 									 				 				Egypt awaits military statement as deadline passes 				 		 		 		 	 	 			 	 				Abdul Fattah al-Sisi talks to army and opposition as troops congregate in districts of Cairo 				 		 				 		 	 					 		 			 				 									4.08pm 				 														 					Ecuador 				 			 			 									 				 				Hidden microphone found at Ecuador's embassy in UK, says foreign minister 				 		 		 		 	 	 			 	 				Microphone was found last month inside office of Ecuadorean ambassador, in building where Julian Assange resides 				 		 				 		 	 					 		 			 				 									4.06pm 				 														 					Abu Qatada 				 			 			 									 				 				Jordan expects Abu Qatada's arrival on Sunday 				 		 		 		 	 	 			 	 				Home Office reportedly plans to fly Islamist cleric out of Northolt airport in west London at 2am on Sunday 				 		 				 		 	 					 		 			 				 									3.49pm 				 														 					Bolivia 				 			 			 									 				 				Bolivian president's treatment stirs up fury in Latin America 				 		 		 		 	 	 			 	 				Venezuela, Argentina, Ecuador and Uruguay join in condemnation as Bolivia denounces 'kidnap' of Evo Morales 				 		 				 		 	 					 		 			 				 									3.03pm 				 														 					Bolivia 				 			 			 									 				 				Bolivian president leaves Austria as diplomatic row erupts over diversion 				 		 		 		 	 	 			 	 				South American nations condemn treatment of Evo Morales as envoy says plane search for Snowden violates international law 				 		 				 		 	 					 		 			 				 									2.53pm 				 														 					Che Guevara 				 			 			 									 				 				Che Guevara's 'betrayer' tells his side of the story after 40 years 				 		 		 		 	 	 			 	 				Ciro Bustos, who sketched Guevara's face for the Bolivian army, tries to kill myth he sold out the Argentinian revolutionary 				 		 				 		 	 					 		 			 				 									2.03pm 				 														 					Bolivia 				 			 			 									 				 				Bolivian president's jet rerouted amid suspicions Edward Snowden on board 				 		 		 		 	 	 			 	 				France and Portugal accused of refusing entry to their airspace, while plane lands in Vienna with no sign of Snowden ? Follow live updates on the diplomatic crisis 				 		 				 		 	 					 		 			 				 									1.17pm 				 														 					Chad 				 			 			 									 				 				Former Chad leader Hiss?ne Habr? charged with crimes against humanity 				 		 		 		 	 	 			 	 				Reagan's support for dictator accused of killing and torturing tens of thousands of opponents offers cautionary tale for American intervention, says Michael Bronner 				 		 				 		 	 					 		 			 				 									12.46pm 				 														 					Rwanda 				 			 			 									 				 				Rwanda's approach proves perfect antidote to counterfeit drugs 				 		 		 		 	 	 			 	 				Agnes Binagwaho and Amir Attaran: Rwanda's integrated solution to combating fake drugs could inform a global treaty on medical safety 				 		 				 		 	 					 		 			 				 									11.54am 				 														 					Turkey 				 			 			 									 				 				Turkey stands at the crossroads. Will it?opt for democracy? 				 		 		 		 	 	 			 	 				Elif Shafak: If the government changes its attitude to the protests, Turkey could become an exemplar state in the Muslim world 				 		 				 		 	 					 		 			 				 									11.40am 				 														 					Global development 				 			 			 									 				 				Multiracial Mali: 'We are bound together by blood' ? video 				 		 		 		 	 		 			 									 				 													Video 	 3min 31sec 								 			 			 				Human rights activists are finding the fallout of the Islamist occupation in Timbuktu hard to deal with, with a new fear among Mali's Arabs, Tuaregs and black people 				 		 				 		 	 					 		 			 				 									11.01am 				 														 					Angela Merkel 				 			 			 									 				 				Angela Merkel: NSA snooping claims 'extremely serious' 				 		 		 		 	 	 			 	 				German chancellor says fight against terrorism is essential but methods used must be proportionate 				 		 				 		 	 					 		 			 				 									10.49am 				 														 					Russia 				 			 			 									 				 				Russian Islamist Doku Umarov calls for attacks on 2014 Winter Olympics 				 		 		 		 	 	 			 	 				Supporters must use maximum force to ensure Sochi Games do not take place, rebel leader says in video 				 		 				 		 	 					 		 			 				 									10.49am 				 														 					Kim Dotcom 				 			 			 									 				 				Kim Dotcom has fiery exchange with New Zealand PM at surveillance inquiry 				 		 		 		 	 	 			 	 				Internet entrepreneur attacks proposed expansion of spying powers in New Zealand after NSA scandal 				 		 				 		 	 					 		 			 				 									10.06am 				 														 					Japan 				 			 			 									 				 				Japanese men's pocket money at 30-year low 				 		 		 		 	 	 			 	 				Decline in monthly allowances usually doled out by wives suggests workers have yet to feel benefits of Abenomics 				 		 				 		 	 					 		 			 				 									9.42am 				 														 					Egypt 				 			 			 									 				 				Egypt: President Morsi defiant as army deadline runs out 				 		 		 		 	 	 			 	 				Egyptian president vows to risk death rather than quit as he warns foreign leaders to stay out of nation's power battle 				 		 				 		 	 					 		 			 				 									8.01am 				 														 					Pakistan 				 			 			 									 				 				CIA drone strike in Pakistan kills suspected militants 				 		 		 		 	 	 			 	 				Government condemns missile attack on building near Afghan border said to have been used as unofficial sharia court 				 		 				 		 	 					 		 			 				 									12.05am 				 														 					Aid 				 			 			 									 				 				Encourage countries to strengthen their own health systems, DfID told 				 		 		 		 	 	 			 	 				Review of aid to combat malaria highlights challenges such as bednet sellers in Nigeria suffering from free distribution of nets 				 		 				 		 		 		Tuesday 2 July 	 			 			Thursday 4 July 		 		 			Today's stories 		 	 	 		 										 			 						 					 										 	 	 		 			 	 		 											 				 			 			 						 					 										 	 	 		 			 	 		 			On the Guardian today Film Golden Globe Awards 2015 winners: full list Media Fox News man is 'complete idiot' for Birmingham Muslim comments ? David Cameron Books JK Rowling attacks Murdoch for tweet blaming all Muslims for Charlie Hebdo deaths Life and style Farewell to my daughter Kate, who died on Christmas day World news Why did the world ignore Boko Haram's Baga attacks? Comment is free The real American Sniper was a hate-filled killer. Why are simplistic patriots treating him as a hero? 				 			 			 						 					 										 	 	 		 			 	 		 											 		 	 		 						 		 	 Today's best video 			 		 			 										 					 																																										 			 			 		 	 					 																																											 		 		 		 			 	 		 						 										 	 			 		 	 					 																																										 			 	 	 	 	 				 		 		 	 Fox News expert: Birmingham is a 'totally Muslim' city 					 					 																																										 			 			 		 			 			 											 			Steven Emerson, who claims to be a terrorism expert, tells Fox News that Birmingham is a 'totally Muslim city' and London is patrolled by violent religious police 		 	 					 																																									 	 		 										 			 						 					 					 																						 										 					 																																										 			 			 		 	 					 																																											 		 		 		 			 	 		 						 										 	 			 		 	 					 																																										 			 	 	 	 	 				 		 		 	 Muslim drag queens 					 					 																																										 			 			 		 			 			 											 			Meet Ali, a gay Pakistani asylum-seeker preparing for his first performance as a drag queen 		 	 					 																																									 														 																						 										 					 																																										 			 			 		 	 					 																																											 		 		 		 			 	 		 						 										 	 			 		 	 					 																																										 			 	 	 	 	 				 		 		 	 'Je suis Charlie': George and Amal Clooney at Golden Globes 					 					 																																										 			 			 		 			 			 											 			Hollywood stars show support for freedom of expression 		 	 					 																																									 														 																						 										 					 																																										 			 			 		 	 					 																																											 		 		 		 			 	 		 						 										 	 			 		 	 					 																																										 			 	 	 	 	 				 		 		 	 Formerly blind Orangutang released into wild 					 					 																																										 			 			 		 			 			 											 			How an orangutan was rescued and cured of blindness in Sumatra 		 	 					 																																									 														 							 	 				 			 			 						 					 										 	 	 		 			 	On World news 	 	 		 			 Most viewed Latest Last 24 hours 1.? 								Boko Haram's 'deadliest massacre': 2,000 feared dead in Nigeria 2. 								Why did the world ignore Boko Haram's Baga attacks? 3. 								Paris policeman?s brother: ?Islam is a religion of love. My brother was killed by terrorists, by false Muslims? 4. 								Charlie Hebdo attackers: born, raised and radicalised in Paris 5. 								Joe Sacco: On Satire ? a response to the Charlie Hebdo attacks 					 					More most viewed 					 Last 24 hours 1.? Charlie Hebdo, Europe, Britain, and Terrorism: dangers ahead 2. Isis claims abduction of 21 Christians in Libya 3. AirAsia QZ8501 black box flight recorder brought back to Indonesia ? video 4. Pakistan school reopens after Taliban massacre ? in pictures 5. Paris attacks: 10,000 troops deployed as France hunts for accomplices 				 				All today's stories 				 				 			 			 						 					 										 	 	 		 			 	 		 													 	 	 	 		 					 			 	 				 			 	 		 										 			 						 					 										 	 	 		 			 	 		 												 	 		 										 			 						 					 					 	 		 											 				 			 				 			 		 		 	 		 										 			 						 					 										 	 	 		 			 	 		 											 	 	 		 			 			 		 				 			 	 	 		 	 	 	 	 		 										 			 						 					 					 				 			 	 	 	 		 	 License/buy our content 					 | 			 				 																																										 			 	 	 	 				 		 		 	 Privacy policy 					 | 			 				 																																										 			 	 	 	 				 		 		 	 Terms of service 					 | 			 				 																																										 			 	 	 	 				 		 		 	 US advertising 					 | 			 				 																																										 			 	 	 	 				 		 		 	 A - Z index 					 | 			 				 																																										 			 	 	 	 				 		 		 	 About us 					 			 		 	 ? 2015 Guardian News and Media Limited or its affiliated companies. All rights reserved.