TOKYO ? A damaged reactor at the Fukushima Daiichi nuclear power plant suddenly began releasing steam again, but the operator of the plant said Thursday it did not appear to be a result of renewed nuclear reactions ? a worst-case situation that could lead to a large new release of radioactive materials. Still, the steam was another indicator of the fragile state of the plant more than two years after the worst nuclear disaster after the accident at Chernobyl. The latest news adds to revelations of a slew of other problems at the plant, including indications that radioactive water may have been leaking into the ocean since the disaster. The issues have led critics to question the stewardship of Tokyo Electric Power Company, or Tepco, which operated Fukushima Daiichi before the triple meltdowns there and is now in charge of its cleanup. Distrust has also run high because of Tepco?s continued tendency to play down or hide problems at the plant. Tepco said it based its conclusion that there was no new chain reaction at Reactor No. 3 on its failure to find xenon, a byproduct of fission that lingers for only a few hours and would be an indication of new nuclear activity. Tepco also said the temperature remained stable. Hiroki Kawamata, a spokesman for Tepco, said officials were unsure what was generating the steam and hypothesized that rainwater seeping into the reactor?s damaged containment vessel may have turned to vapor because of heat inside the vessel. David Lochbaum, a nuclear analyst at the Union of Concerned Scientists, a group based in Cambridge, Mass., which is generally critical of nuclear power, said that there were many phenomena that could produce steam, including something as simple as a live electrical cable falling into a puddle. In an indication of the complexities of the cleanup effort, the company is still struggling to get a covering over the reactor building to protect the reactor and the remaining nuclear fuel. Workers cannot replace the roof until they have removed highly radioactive debris from the upper sections of the building, a job that requires using remotely controlled cranes. Video images seemed to show less steam on Thursday evening, but after sundown it became too dark to accurately check for any vapor, Masayuki Ono, acting general manager of Tepco?s nuclear power and plant siting division, said at a news conference. Workers were ready to inject water containing boric acid into the reactor from the outside at any signs of further trouble, like a rapid rise in temperature, the company said in an e-mailed statement. Such spikes would raise the possibility of criticality in the reactor?s damaged fuel, most of which is thought to have melted and slumped to the bottom of its containment structure after a hydrogen explosion, one of several after an earthquake and tsunami in March 2011 knocked out crucial cooling systems. Boric acid would be expected to choke off a nuclear chain reaction. The No. 3 reactor?s damaged core, like the cores of two other crippled reactors at the site, is being cooled by water that is pumped into the reactor, filtered and recycled. Among the recent mishaps at the site, the cooling system for the reactor shut down for hours in April. Tepco later said a rat had somehow short-circuited a vital switchboard, possibly by gnawing on cables. More than 100,000 people fled their homes after the meltdowns at Fukushima. While many areas not immediately surrounding the plant are beginning to be repopulated, the news of the residents? return has been overshadowed by the continued problems at the plant.