Royal baby: David Cameron's best wishes for Kate and William - video | UK news | The Guardian Close Skip to main content sign in subscribe search jobs more from the guardian: jobs change edition: switch to the UK edition switch to the AU edition US edition switch to the UK edition switch to the Australia edition The Guardian Winner of the Pulitzer prize home ? world ? UK europe americas asia middle east africa australia home US world selected opinion sports soccer tech arts lifestyle fashion business money travel environment browse all sections close The Duchess of Cambridge Royal baby: David Cameron's best wishes for Kate and William - video Sorry, your browser is unable to play this video. Please install Adobe Flash? and try again. Alternatively upgrade to a modern browser. The Duchess of Cambridge's labour is said to be progressing as normal after she was admitted to St Mary's hospital in Paddington, west London, early on Monday. The prime minister, David Cameron, says the whole of the UK is excited with the royal couple for the occasion. The birth of the third in line to the throne will be officially announced at Buckingham Palace Source: ITN Monday 22 July 2013 07.48?EDT Share on Facebook Share on Twitter Share via Email Share on LinkedIn Share on Google+ Share on WhatsApp Topics The Duchess of Cambridge Monarchy Prince William David Cameron Prince George more on this story Harry, prince of fun? Only if you're into naked billiards Michael Moran Michael Moran: The promise made to Prince George may backfire if he grows up to be a bookish nerd more interested in metaphysics than Mahiki Published: 26 Jul 2013 Harry, prince of fun? Only if you're into naked billiards Prince Harry promises fun for new nephew Prince Harry takes on role of doting uncle, saying 'I only hope my brother knows how expensive my baby sitting charges are' Published: 25 Jul 2013 Prince Harry promises fun for new nephew Prince George: how Prince Harry will make his life fun Pete Cashmore: The new royal baby's uncle has promised him some good times, but judging by what Prince Harry has got up to in the past, he won't be the typical babysitter. We wonder what he has in mind Published: 26 Jul 2013 Prince George: how Prince Harry will make his life fun Royal baby overload? Here's some other news you may have missed What else was going on while the world watched the doors of St Mary's hospital for a first glimpse of Prince George? Published: 26 Jul 2013 Royal baby overload? Here's some other news you may have missed Prince George: royal couple choose name fit for a king The royal baby is to be called George Alexander Louis or His Royal Highness Prince George of Cambridge, for short Published: 24 Jul 2013 Prince George: royal couple choose name fit for a king Prince George: what's in a name? With the announcement that the newest addition to the royal family will be a George, here are some key numbers to remember about the name you might find it hard to forget ? Published: 24 Jul 2013 Prince George: what's in a name? Why the royal baby's name had to be George rather than James John Mullan John Mullan: In choosing a name popular with the House of Windsor, William and Kate have side-stepped a number of traps from royal history Published: 25 Jul 2013 Why the royal baby's name had to be George rather than James Prince Harry: 'I will make sure George has fun' - video New uncle Prince Harry says the birth of the Duke and Duchess of Cambridge's baby, Prince George, is a fantastic addition to the royal family Published: 26 Jul 2013 Prince Harry: 'I will make sure George has fun' - video popular The Guardian back to top home US world selected opinion sports soccer tech arts lifestyle fashion business money travel environment all sections close home US world selected UK selected europe americas asia middle east africa australia opinion sports soccer MLS NFL MLB NBA NHL soccer live scores tables competitions results fixtures clubs tech games arts movies tv & radio music books art & design stage classical lifestyle food health love & sex family women home & garden fashion business markets companies money travel USA europe UK environment development cities science media crosswords video World ? UK News ? The Duchess of Cambridge jobs subscribe all topics all contributors info and resources contact us feedback complaints & corrections terms & conditions privacy policy cookie policy securedrop ? 2015 Guardian News and Media Limited or its affiliated companies. All?rights?reserved.