The Duchess of Cambridge gave birth to a boy on Monday, Prince George of Cambridge, who is third in line to the throne George Washington, George III, George Eliot, George Orwell, George Best, George Bush, George Clooney ? the new royal baby's name has had a mixed history. Are you a Georgian? With the announcement that the newest addition to the royal family will be a George, here are some key numbers to remember about the name you might find it hard to forget ? By George, he's got it! The future king shares his name with six of his royal predecessors, as well as a host of Georges from the worlds of music, literature, TV, cinema and football. A lot to live up to ? Meeting is first time since 1894 that monarch has seen great-grandchild directly in line to the throne Jason Goldman: Research suggests a baby's name can determine personality, dating habits, self-esteem and the likelihood of smoking ITV's extended live coverage of the Duke and Duchess of Cambridge leaving hospital eclipsed BBC1's average of 3.3 million. By Jason Deans Kermit the Frog and Miss Piggy take a break from filming in London to congratulate the royal couple on the birth of their son David Banks: The new heir to throne will need similar protection from intrusion as his father had, but will the PCC's replacement be up to it? Duke and Duchess of Cambridge show off young son on steps of hospital in London and say they are 'working on a name' Packed in front of St Mary's hospital, the world's media could feed only on scraps before the new prince made an appearance Simon Jenkins: The third in line to the throne cannot expect to enjoy the slightest privacy. The media drones are already overhead Duke of Cambridge says young prince has 'good pair of lungs on him' and reveals couple are still working on name St Mary's hosputa; is besieged by around 300 photographers as reporters struggle to find new developments to fill airtime. By Lisa O'Carroll Mail Online recorded its best ever day for unique users with 10.57 million as UK web traffic to news sites hits 94 million. By Mark Sweney Sophie, the Countess of Wessex, says she has sent messages to Kate and William and plans to see them in the next few days Do talk to Fergie, but not to Beatrice and Eugenie, take the tube, don't forget to abdicate ? and find out who Les Dawson and Leon Trotsky were. We asked writers to pen a letter to the new Prince of Cambridge ? Duchess of Cambridge may remain at St Mary's hospital for another night, disappointing those hoping for glimpse of baby Live coverage: Duchess of Cambridge due to leave hospital Prince William stayed overnight with mother and baby at the Lindo wing at St Mary's hospital, Paddington, west London