Hurray!/So what? You can delete as appropriate but whether you like it or not, the name George is likely to become a much-repeated noun in your vocabulary. So you may as well get to know it. 4,347 baby Georges George was the 12th most popular baby name in England and Wales last time we looked, with 4,347 babies being given the name - just ahead of the slightly less aristocratic 4,226 new-born Rileys. If those numbers from the Office for National Statistics leave George feeling sad, they have some others that may cheer him up. Most Georges aren't in London. Looking at baby names by the mother's usual place of residence, London has plenty of Daniels, Olivers and Muhammeds but most Georges are outside of the capital - in the South East and South West of England. One London-based George may however give the prince some cause for consternation - especially if he finds grammatical errors on ellipses or typos on fullstops irritating. Less cool in the 70s Maybe Brits were less royalist in the '70s, or maybe they experimented with more exotic names. Either way, the most common British kings names became suddenly less popular among British parents just before the '80s. George plummeted 80 places in the sixty years before 1974 - from 3rd place. Similar declines happened for James and Charles before all three names sprang back in the '90s. 8 out off 77 Out of 77 royal ancestors of baby Cambridge, eight were named George and six were on the throne. That might explain why bookmakers made George the favourite with odds stacked anywhere from 7 -1 to 10-1. And with around ?40bn gambled each year in 9,128 betting shops, it's likely that some bets were certainly placed. We wouldn't want to do the sums on how much has been won or lost - not least because other press reports used the same quote but instead cited ?30,000 and converted it to $50,000 . James was also considered a likely contender among the bookies though one must always consider the pitfalls of nicknames and a Georgie may well be viewed as considerably less vulgar than a Jim, Jimmy or Jamie. If Wikipedia is a reliable source we suspect it isn't Prince George may well bump into some of his homonyms while making trips abroad. The name was apparently very popular among Egypt's coptic Christians in 2004 and was the second most popular choice for baby boys in Israel's Christian community. 1280, Bulgaria The first recorded monarch to have the name was George I of Bulgaria, emperor of Bulgaria around 1280. Much like Prince Philip, the name is originally Greek. Unlike Prince Philip, it is derived from earth-worker or farmer . ? Get the data Can you do more with this data? ? Email us at data@guardian.co.uk ? Follow us on Twitter ? Like us on Facebook ? Post a comment below