I would have thought that there was a clear set of principles that make the American diplomatic pursuit of Edward Snowden as a fugitive from justice a rather empty and futile gesture. As far as I can tell, there is not even a need for asylum as governments should have been prepared to grant Snowden residence status because his alleged criminal acts in the United States were without question political crimes , without violence or monetary motivation. I had thought it was as clear as law can be that any person who has committed a political crime should be exempted from mandatory extradition even if a treaty existed imposed a duty on its parties to hand over individuals accused of serious criminal activity. To be sure, from the perspective of the United States government, Snowden's exposure of the PRISM surveillance program was a flagrant violation of the Espionage Act. But it was also as clearly a political crime as almost any undertaking can be. There was no violence involved or threatened, and no person can be harmed by the disclosures. What puzzles me is why the refusal to hand Snowden over by expelling him to the United States, which is what Washington has asked Russia to do, raises any kind of serious question beyond wondering how the US government officials arrogantly made the request in the first place. As it was put to Moscow by the US government: We expect the Russian government to look at all options available to expel Snowden to the United States to face justice for the crimes with which he is charged. Inherent hypocrisy It is also puzzling is why foreign governments do not make this simple point in response that international criminal law enforcement does not extend to political crimes even in the relation of governments friendly with one another, and there are good public policy and humanitarian reasons why such criminals should not be treated internationally as fugitives from justice. It seems clearly within the domain of reason to believe that the extent of secret surveillance, both within the United States and globally, is posing a dangerous threat to democracy and the rights and security of individuals, and in this sense, Snowden is an authentic whistleblower drawing attention to an urgent concern of many people and governments throughout the world. He can also be deemed to have engaged in acts of civil disobedience as his moral motivations clearly led him to act on behalf of the public good in a manner that he realised was in violation of applicable criminal law in the United States. Some have suggested that unlike Daniel Ellsberg who remained in the country after he released the Pentagon Papers, Snowden does not deserve to be treated as a whistleblower because he did not stay around to face the legal music, as if such a show of subservience to the legal system is a sina qua non of good faith. Breach of?sovereignty The US government position contradicts its own long standing practice of refusing to give up those wanted for political crimes, including in some instances even shielding persons charged with terrorist activity. The most notorious example is that of Luis Posada Carrilles, an exile from Cuba with a long record of involvement in anti-Castro terrorist activity, alleged to have blown up a Cuban passenger plane in 1976 with 73 persons on board, and living without legal difficulties in Florida. This makes it a particularly dismaying moment when the governments of France, Portugal, Spain, and Italy denied overflight rights to the plane carrying Evo Morales, President of Bolivia, apparently hoping to persuade a friendly government to seize Snowden if he were on board and turn him over to American authorities who would transport him back to the United States. It should hardly be surprising that such diplomatic hard ball at Bolivia's expense angers Latin American countries, justifiably sensitive about the US willingness to encroach upon their sovereign rights in a manner that would not be tolerated if the situation were reversed. Undoubtedly, an anguishing reminder that the mentality that bestowed the Monroe Doctrine and 'gunboat diplomacy' on the Western Hemisphere is not entirely a thing of the past. Snowden himself shifted the context from the exemption of political crimes to asylum, which presupposes a justifiable fear of persecution of returned to the country of nationality. Nicol?s Maduro, President of Venezuela, symbolically offered Snowden asylum on July 5, the holiday celebrating national independence. Snowden has reported accepted the offer, but there is no indication how he will make sure that his trip from Shermetyevo International Airport in Moscow to Caracas is not diverted on route in a way that allows the United States to take him into custody. There is another question lurking in the background. Will Venezuela be now made to pay for doing the right thing? And what of Bolivia, Nicaragua, Ecuador that each indicated receptivity to Snowden's request for asylum? There has been speculation that in the post-Chavez era Maduro has been seeking to normalize relations with the United States, and that this goal might now be put on indefinite hold. And what about Hong Kong, China, and Russia that spurned American efforts to have Snowden expelled to the United States after his passport was cancelled? Snowden is a whistleblower I suppose that this attack of surveillance panic is a symptom of the larger importance being attached by Washington to cyber security, and worries about disabling attacks by way of hacking and debilitating viruses. But to go after Snowden in this way is more than panic, it suggests one more example of American exceptionalism that causes anger and resentment throughout the world - in effect, we are insisting that we expect from others far more than we are prepared to give. It is especially striking that among Snowden's disclosures are confirmations of the earlier rumors that the United States and Israel had developed the computer worm or virus, Stuxnet that had been used to disrupt operations in Iran's nuclear facilities. As with the use of drones around the world, the blowback effects seem once more ignored as America flexes its geopolitical muscles without regard for the constraints of international law, and the values of a free society. Reciprocity is the indispensable foundation of effective international law, and it is here that the Snowden affair seems particularly disturbing. If a Chinese Snowden was to make comparable revelations that violated Chinese criminal law there would not be a chance in a million that the United States would return such an individual to China, and wouldn't Washington be outraged if China used its leverage to persuade governments to divert a plane suspected of carrying the person they were seeking to prosecute, especially if it were a plane known to be carrying the president of a sovereign state? Can one imagine the US government turning over the blind Chinese human rights activist, Chen Gunagchen, for prosecution under a Chinese law criminalising deliberate harm to the country's public image? Of course not, and it is a good thing. Sovereign states, if not entirely paranoid and wedded to an autocratic conception of national security, should welcome the exemption of political crimes from cooperative law enforcement. Why would it be deemed unfriendly to provide sanctuary to Snowden as European countries, and even China and Russia, seemed to believe? Why were even the Latin American countries only led to act when a president was denied normal international comity in international airspace as head of a sovereign state? Giving sanctuary to political crimes helps makes the world safe for political dissent and pluralism, and offers a shield against the autocratic security state. It is admirable that Venezuela, whatever its reasons, stepped forward to offer Snowden asylum, which was deserved, considering the vindictive approach taken toward such other recent leakers as Bradley Manning and Julian Assange. What may be most regrettable in this yet unfinished drama is the American refusal to engage in self-scrutiny, to wonder whether surveillance and secrecy are not being abused, a gross over-reaction to 9/11 and extremist threats, that alters the balance between state and society in an anti-democratic manner, as well as threats the entire world as it falls within the domain of US national security. Such a worldview is decidedly imperial as it precludes granting reciprocal rights to others, and implicitly claims that the United States is above the law, or shapes the law to suit its own particular priorities. Instead of seeking to prosecute and punish Snowden, the healthy national response would be to reestablish limits on governmental surveillance and extraterritorial security claims. At least, it is time for citizens not to be fooled by the politics of deflection by which the government and a pliant media avoid the message and obsess about the messenger, and discuss the substantive issues that prompted the disclosures rather than seek to punish an individual of conscience who chose bravely to risk the fury of a state because some of its unseemly secrets were being made public. Richard Falk is Albert G Milbank Professor Emeritus of International Law at Princeton University and Visiting Distinguished Professor in Global and International Studies at the University of California, Santa Barbara.