Black preachers have said they are planning peaceful protests in 100 cities across the United States this weekend to press for federal charges in the shooting death of 17-year-old Trayvon Martin. Standing outside the US Justice Department building in Washington on Tuesday, the preachers pledged to hold the protests near federal buildings and said action was justified because of what they see as the civil rights questions surrounding the death. A Florida jury on Saturday found George Zimmerman, 29, not guilty of second-degree murder in the 2012 shooting. Zimmerman, a neighbourhood watch volunteer, said he shot the unarmed Martin, a black youth, in self-defence. People all over the country will gather to show that we are not having a two- or three-day anger fit, said Al Sharpton, a?preacher, television host and civil rights advocate joined by about 15 other clergy. Sharpton said demonstrations were planned for Saturday in 100 cities to push for new charges against Zimmerman and the repeal of Florida's stand your ground self-defense law. We don't need consolation. We need legislation, and we need some federal prosecution, Sharpton said. The Justice Department, which has offices in every major US city, said Martin's death remains under investigation. Any charges against Zimmerman would likely fall under a 2009 law against hate crimes, but lawyers with civil rights expertise said a new prosecution was unlikely because of the lack of evidence that racism drove Zimmerman to shoot. A juror in Zimmerman's trial told CNN she did not think Zimmerman racially profiled Martin. All of us thought race did not play a role, said the juror, granted anonymity by the television news network. 'They always get away' Protesters at demonstrations following the verdict have accused Zimmerman, who is white and Hispanic, of racially profiling Martin. Sharpton said he was aware of the legal questions, but he said Zimmerman had a pattern of profiling black men as criminal suspects. He also quoted Zimmerman's lament of they always get away to a police dispatcher upon seeing Martin. Who is they? And get away with what, since all he Martin was doing was going home? Sharpton said. Zimmerman's defense lawyers have said their client was viciously attacked by Martin. Attorney General Eric Holder was scheduled to address the NAACP civil rights organisation at 4:30pm 1830 GMT in Orlando, Florida, 40km from the small city of Sanford where the trial took place. The first black attorney general, Holder said on Monday that Martin's death was tragic and unnecessary but he did not forecast the likelihood of new charges. The black preachers said they considered Martin's death a spark for a renewal of the US civil rights movement by a generation that grew up after the desegregation struggles of the 1950s and 1960s. There is going to be an intellectual riot, said Jamal Bryant, pastor of the Empowerment Temple church in Baltimore, Maryland. One hundred cities are going to feel the wrath of a guided, intellectual, meaningful, spiritual uprising.