Jurors in George Zimmerman's second-degree murder case in Florida resumed their deliberations for a second day on Saturday, as the civil rights leader Jesse Jackson issued a public appeal for calm ahead of a potential verdict. The panel of six women returned to the courthouse in Sanford at 9am, to continue sifting through almost three weeks of testimony and evidence from the neighbourhood watch leader's trial for shooting Trayvon Martin, an unarmed black teenager. Police in Sanford and Miami, Martin's home town, say they are prepared for the possibility of unrest if Zimmerman, 29, is acquitted, and insist they will not tolerate a violent reaction. Reverend Jackson was one of the black leaders who led peaceful protests in Sanford and elsewhere soon after the shooting on 26 February last year, when Zimmerman was originally released without charge. Speaking at a peace rally in Chicago, and in a series of Tweets, Jackson said the public reaction to the verdict, whichever way it goes, needs to be tempered. If Zimmerman is convicted, there should not be inappropriate celebrations because a young man lost his life, he said. If Zimmerman is not convicted, avoid violence because it only leads to more tragedies. Self-destruction is not the road to reconstruction. Zimmerman's family also released a statement calling for restraint. The jury deliberated for about three and a half hours on Friday, before breaking for the night. Almost two hours into their discussions they sent a note to judge Debra Nelson, asking for a detailed inventory of all the physical evidence from the case. Zimmerman, who is of mixed Hispanic-white parentage, admits shooting Martin, 17, in a confrontation at the Retreat at Twin Lakes gated housing development but denies murder on the grounds of self-defence. Mark O'Mara, Zimmerman's lead attorney, told the jury that he had the right to shoot because Martin attacked his client with a sucker punch and was straddling him on the ground, smashing his head on to a concrete pavement. Prosecutors portrayed Zimmerman as an overzealous vigilante who mistook the hoodie-wearing teenager for a criminal as he walked home in the rain from a convenience store, at which he had purchased a soft drink and sweets. In his closing arguments, state attorney Bernie de la Rionda said Zimmerman made a number of wrong assumptions about Martin and disobeyed a command from a police dispatcher not to follow or confront him. Jurors have three options ? convicting Zimmerman of murder, which carries a sentence of at least 25 years; finding him guilty of manslaughter, carrying a penalty of between 10 and 30 years; or acquittal. Protestors began to gather at the courthouse in Central Florida soon after the jury, consisting of five white women and one Hispanic, was sent out to begin its deliberations at 2.30pm on Friday. Other than a few forceful verbal exchanges with a handful of Zimmerman supporters, the gathering was peaceful. Dozens of officers from the Sanford police department and Seminole County Sheriff's Office are providing extra security at the courthouse. The case brought issues of race, Florida's controversial gun laws and the right of a person to stand their ground into sharp focus. As the protests grew, the state's governor, Rick Scott, appointed a special prosecutor, Angela Corey, to re-examine the evidence, leading to Zimmerman being arrested and charged six weeks after the shooting. It emerged Saturday that Corey had fired Ben Kruidbos, the IT director of the state attorney's office who testified at a pre-trial hearing last month that prosecutors had withheld from the defence evidence including photographs and texts recovered from Martin's mobile phone. Kruidbos received a hand-delivered letter at his house on Friday accusing him of deliberate, wilful and unscrupulous actions . Your egregious lack of regard for the sensitive nature of the information handled by this office is completely abhorrent. You have proven to be completely untrustworthy, Cheryl Peek, the managing director of the state attorney's office, wrote in the letter.