Trayvon Martin so nearly went to his grave unnoticed, his death barely recorded among the grim statistics of gun violence involving African American youths. Initially, after the 17-year-old was killed on 26 February 2012, as he was walking unarmed on a side street in a gated community in Sanford, central Florida, the incident attracted virtually no attention outside the local press. But the determination of his parents, Tracy Martin and Sybrina Fulton, combined with the amplifying echo-chamber of social media, turned an hitherto unnoted death into a cause c?l?bre. Their call for the man who shot their son with a 9mm pistol, the then 28-year-old neighbourhood watch captain George Zimmerman, to be held accountable transformed the shooting into a litmus test of justice in America today. It put the country's proliferating stand your ground gun laws, racial profiling and discrimination against black young men ? as well as police incompetence ? in the dock. On 8 March, Martin's parents launched a petition on change.org, complaining that Zimmerman had been released without charge and calling on the local district attorney to investigate. The petition went viral, attracting within days more than two million signatures, a record for the campaigns website. In the wake of the petition, a storm gathered. Protests were staged across Florida and around America, the crowds sporting hoodies and eating Skittles sweets, just as the teenager had the evening he died. Those seasoned civil rights activists, the reverends Al Sharpton and Jesse Jackson, descended on Sanford, and the furore reached as high as the White House, where President Obama lamented that If I had a son, he would look like Trayvon . The billowing controversy put a spotlight on the state of law enforcement locally and nationally. Locally, the police chief handling the case, Bill Lee, came under pressure for having appeared to run a less than robust investigation into the shooting. Lee allowed Zimmerman to walk free, stating publicly that there was insufficient evidence to show he did not act in self-defence. Despite the efforts of the Sanford city authorities to protect him, Lee was forced out in June last year, by which time a special prosecutor had issued charges against Zimmerman. Race aggravated the picture, with influential groups such as the National Association for the Advancement of Colored People calling for a review of the local police force's conduct, claiming that the investigation was racially-biased in a way that compounded the initial racial component of the teenager's death. Supporters of Zimmerman countered that he is Hispanic, and that race didn't come into it. When the case came to trial, Zimmerman's defence team mounted a conventional argument of self defence and did not rely on the stand-your-ground provision in Florida law. But the shooting drew national attention to a plethora of such laws that have expanded the power of gun owners by extending their right not to retreat from a threat out of their homes and into public places. More than 20 states had adopted such laws, Florida among the first and most enthusiastically. A Tampa Bay Times investigation found that of 200 cases in which Florida's stand your ground law was invoked, almost 70% of the accused had gone free. The accused were much more likely to face no penalty if a black person had been killed 73% than if a white person had been killed 59% . Of the incidents explored by the newspaper, almost a third involved defendants who initiated the fight, shot an unarmed person or pursued their victim ? and still went unpunished. Some were released having shot their victims in the back. As the shockwaves of the Trayvon Martin shooting reverberated far beyond Florida's shores, they caught off guard some very prominent entities ? notably, the National Rifle Association, the nation's most powerful pro-gun lobby group, which has been a staunch advocate of stand your ground laws. The NRA's executive vice president, Wayne LaPierre, tried to deflect criticism from his own organisation by accusing the media of exaggerating what had happened in Sanford. You don't care about the truth, and the truth is the national news media in this country is a national disgrace, he said. But, for the first time in many years, the NRA was put on the defensive. It was a precursor, perhaps, for the battering the lobbying group was to face after the Newtown school shooting a few months later. In the outcome, the trial of George Zimmerman for second-degree murder was largely stripped of many of these fundamental and searing elements. Lawyers spent three weeks appearing to tread carefully around the issues of race, the social backgrounds of the victim and defendant, and Florida's controversial gun laws. Some of that was court ordered. Judge Debra Nelson rejected a series of pre-trial motions from both sides, excluding certain evidence or descriptions from being introduced, such as photographs showing Martin apparently smoking marijuana, or any hint that Zimmerman had racially profiled the teenager. But, overwhelmingly, the attorneys chose to make the trial legally and procedurally straightforward, relying on the evidence and conflicting statements of eyewitness and experts, especially the forensic analysis of Zimmerman's alleged injuries, to try to prove their points. What little emotion was on display came mostly outside the witness box, such as when Martin's parents walked out during particularly graphic testimony or when Zimmerman appeared to tear up when John Donnelly, a close friend, spoke of his dedication to the community in glowing terms. That Zimmerman suspected Martin of being a criminal because he was black was never suggested in three weeks of testimony; Martin's size, weight, demeanour and attire ? that now famous hooded top ? were. Likewise, the defence sought to portray Zimmerman's perceived guardianship of his gated community purely in terms of service to its residents, rather than masking any deep-seated or previously held resentment for suspicious outsiders. Observers watching the trial in a vacuum would have seen a basic to-and-fro over the physical evidence and the issues of self-defence and the right to stand your ground. They would have been largely oblivious to the wider civil rights and social controversies surrounding it.