German city braces itself for far-right Pegida demonstration, the first since the attacks in Paris The radicalisation of the Kouachi brothers began in a picturesque park in the capital while Am?dy Coulibaly took the first steps towards terrorism in prison, but what the three had in common was growing up on the margins of French society Ehab Yousef dares leader of war-torn country to accept adapted ice-bucket challenge after four die in wintry conditions Obama administration seeks to recover from decision not to send a senior representative to weekend anti-terrorism march in Paris International police organisation issues red notice against ousted Ukrainian president for alleged financial wrongdoing Hopes raised that crash mystery will be solved as divers retrieve flight data recorder from wreck of QZ8501 in Java Sea As the media coverage focused on the Paris terror attacks last week, over 2000 Nigerians were reported to have been killed by Islamist militants. What makes one massacre more newsworthy than another? Move eases concerns that unity government led by Ashraf Ghani and rival Abdullah Abdullah will not be able to function Officials try to pinpoint when and where cameras found in possession of Kouachi brothers and Am?dy Coulibaly were obtained EU interior ministers agree at meeting in Paris to step up drive against radicalisation and disrupt movement of terrorist networks One defendant threatens to sue film-maker who coordinated arrests with police amid crackdown on gay people in Egypt President Ashraf Ghani unveils 25 names for positions such as foreign secretary and head of intelligence after months of delays As the media coverage focused on the Paris terror attacks last week, over 2000 Nigerians were reported to have been killed by Islamist militants. What makes one massacre more newsworthy than another? When British photographer Shelly Cornick moved to St Petersburg, she found herself woefully unprepared. Wearing only a thin winter coat and informed by a collection of vague stereotypes, she turned to her camera to interpret the alien landscape. The resulting photographs capture the resilience of daily life against a backdrop of brutalist architecture and fierce weather An Indiana couple have been charged with child neglect after cellphone footage obtained by authorities recorded the pair telling a one-year-old baby to put a gun in his mouth and instructing him to make sounds like the weapon is firing. Authorities in Evansville said on Friday they found the video on the phone of Michael Barnes, who was arrested on Thursday after he agreed to sell a handgun to an undercover officer The Golden Globes allowed some of Hollywood's biggest stars to express support for freedom of expression after last week's deadly attacks in France From Sydney to Stockholm, and from Montreal to Tokyo, rallies were held at the weekend to support the victims of the Paris killings. In Paris itself, an estimated two million people and dozens of world leaders joined a massive and historic march. Meet Ali, a gay Pakistani asylum-seeker preparing for his first performance as a drag queen Around 1.5 million people took to the streets of Paris on Sunday in a show of defiance and unity, after a series of terror attacks killed 17 people in the French capital A video purporting to show Paris kosher supermarket attacker Am?dy Coulibaly has been posted online by a self-described Islamic State spokesperson As the search for AirAsia flight QZ5801 enters the third week, the black box still has not been found People converge on central Paris for a march in solidarity with the victims of last week?s terrorist attacks At least 40 people have been killed after a bus caught fire when it hit an oil tanker. Sportsmen and supporters have joined the thousands at vigils around the globe to pay tribute to those who lost their lives during the attack on the Charlie Hebdo offices and the twin sieges that followed Tens of thousands of people took part in tribute rallies across France following three days of terror The family of a Muslim police officer killed in the Charlie Hebdo shooting in Paris has urged people not to carry out retaliation attacks French police have released footage of Friday's assault on two gunmen suspected of the killings at satirical magazine Charlie Hebdo After the deaths of 17 people in attacks on the satirical magazine Charlie Hebdo and a kosher supermarket in Paris, and then the deaths of the three Islamist gunmen who carried out the attacks, France's president addresses the nation Starring at a gay rights fundraiser, the great standup saw other black artists being treated with racist contempt ? and launched into an astonishing tirade that the 17,000-strong audience would never forget The radicalisation of the Kouachi brothers began in a picturesque park in the capital while Am?dy Coulibaly took the first steps towards terrorism in prison, but what the three had in common was growing up on the margins of French society Ehab Yousef dares leader of war-torn country to accept adapted ice-bucket challenge after four die in wintry conditions Obama administration seeks to recover from decision not to send a senior representative to weekend anti-terrorism march in Paris International police organisation issues red notice against ousted Ukrainian president for alleged financial wrongdoing Hopes raised that crash mystery will be solved as divers retrieve flight data recorder from wreck of QZ8501 in Java Sea As the media coverage focused on the Paris terror attacks last week, over 2000 Nigerians were reported to have been killed by Islamist militants. What makes one massacre more newsworthy than another? Move eases concerns that unity government led by Ashraf Ghani and rival Abdullah Abdullah will not be able to function Officials try to pinpoint when and where cameras found in possession of Kouachi brothers and Am?dy Coulibaly were obtained EU interior ministers agree at meeting in Paris to step up drive against radicalisation and disrupt movement of terrorist networks One defendant threatens to sue film-maker who coordinated arrests with police amid crackdown on gay people in Egypt President Ashraf Ghani unveils 25 names for positions such as foreign secretary and head of intelligence after months of delays Dozens more in hospital, as authorities say crocodile bile may have been added to traditional beer A circle of pens in Trafalgar Square has been a moving tribute to the journalists and cartoonists who lost their lives in the Charlie Hebdo attack Three killed and 26 wounded in Yobe state, a day after bombing involving 10-year-old girl killed at least 16 in Borno state Pontiff baptises 33 infants and departs from prepared text to tell mothers to ?give them milk? if children were hungry Kevin Norris had been on a bender in the days before his death, claims girlfriend of 38-year-old man who died in custody in Bowral after police used a stun gun to subdue him Tony Abbott says the new name deprives the group of legitimacy, but why do its members hate it and what makes naming them so complicated? Campbell Newman and Annastacia Palaszczuk say they will not make deals with minor parties to form government Economists say jobs and coffers will swell because it is ?still lucky enough to be in investment phase of the mining boom? Only months after Haiti was rocked by an earthquake in January 2010, the country suffered its first outbreak of cholera in half a century. Five years on, Haitians continue to grapple with the crisis The women of Anacamona village eke out a physically challenging and hazardous living on the oyster beds of the Bijag?s archipelago From cooks to cleaners, staff at Panlap community care centre explain why they chose to work with Ebola patients and what it has cost them personally Thousands of Muslims, mainly ethnic Fulani herders, are living in deteriorating conditions at camps in the south-west of Central African Republic The latest round of ?reprioritised? funding announced by Australian treasurer Joe Hockey has been roundly criticised by the Pacific nation?s foreign minister Syria, Afghanistan and Somalia had largest numbers of those fleeing, bringing number of people under care of UNHCR to 20-year high It has been touted as an essential tool in advocating for change, but has social media been overrated? Are there other forms of grassroots campaigning that have been overlooked? Let us know your thoughts Dominic Ongwen, wanted for crimes against humanity and war crimes, was close to feared LRA leader Kony We asked, you answered. As part of our Students Speak series, students share their thoughts on whether faith-based NGOs can continue to operate in a world of increasingly religious sensitivities Isaac Bayoh: We have put everything aside to help get this virus out of our country, but faith has helped so many people to get this far We highlight the innovations that caught our eye in 2014. Plus, 10 years on from the Boxing Day tsunami Hospital closed over pay dispute has reopened following a swift response from government to meet staff demands In his second dispatch, Street Child social worker John Momodu Kargbo explains how teachers prevent Ebola spreading in remote areas With a booming tech sector in Nairobi, investors and entrepreneurs are questioning the wisdom of building $14bn techno city nearby The radicalisation of the Kouachi brothers began in a picturesque park in the capital while Am?dy Coulibaly took the first steps towards terrorism in prison, but what the three had in common was growing up on the margins of French society Djamel Beghal has been on western intelligence agencies? radar for 15 years and has worshipped regularly at Finsbury Park mosque Peter Preston: Charlie Hebdo is part of a very French tradition of biting satire, but the massacre in Paris has seen countries across the world embrace anew the importance of a free press French intelligence had classified Kouachi brothers as ?very high priority? but surveillance was cut and they slipped the net The march is sure to be an impressive show of solidarity, but politicians and citizens alike will be walking for different reasons Guardian cartoonist Steve Bell on lampooning the terrorists who attacked the offices of the satirical magazine Charlie Hebdo Far-right Front National party and its leader Marine Le Pen have been most vocal in wake of attacks saying France is now at war Kouachi was sentenced to three years in 2008 for involvement in network sending men to fight with al-Qaida in Iraq Analysts say the three seemed professional and organised, as investigators probe reports of their claim to be from al-Qaida Shooting may have long-term implications for a society already witness to a rise in xenophobic and anti-Islam sentiment Supporters of Isis praise attack, but many Arabic Twitter users point out magazine also satirised Jews, Christians and Buddhists From her lead in Europe to steering Germany safely through the recession, chancellor is still going strong after 10 years in office French magazine has history of defying attempts to curtail freedom of expression; the latest a provocative tweet to Isis chief US authorities have charged two men this week in connection with a plot to overthrow authoritarian president Yahya Jammeh. The episode will only help to tighten his grip on the country, says Simon Allison French magazine?s cartoons ?breach Islamic taboo? on visual representation of the prophet Muhammad Analysis: German chancellor?s visit to UK shows gulf in power and influence wielded by the two leaders is embarrassingly wide Nils Pratley: Greeks are being urged to vote for mainstream party to avoid EU exit but if it becomes reality markets won?t be relaxed Plasma trials and two antiviral drugs are being used on sufferers but their effectiveness remains unknown American threats to retaliate for Russian development of new cruise missile take tensions to new level A new exhibition argues that a ?landscape first? approach to urban development could make our cities more resilient to flooding through innovative water management. But what does this look like in practice? The strangest thing about Oregon, Ohio changing its name temporarily to Oregon, Ohio Buckeyes on the Bay, City of Duck Hunters? The fact that stuff like this is not uncommon The reaction when locals heard I was planning to ride with cycling activists in this traffic-choked Indian megacity made me nervous ? but the reality wasn?t so different from London or New York. Could cycling culture have a chance here? Killian Doherty, an Irish architect working for the Architectural Field Office AFO , has been in Sierra Leone?s capital, Freetown, for much of the Ebola epidemic. He documented the curfews in some dramatic photographs Following the wildly popular transformation of Gorky Park from rusting funfair to Wi-Fi heaven, Muscovites finally felt as if their city was becoming liveable. But with more gentrifying projects on the cards, is it just a way to silence dissent? What was a ghost town ravaged by civil war has become a shabby, bustling metropolis ? but rapid urbanisation has taken a heavy toll on the Afghan capital Picturing place: In an age of intense competition between the world?s cities, authorities are focused on presenting a particular image for global consumption The 100 Resilient Cities programme has revealed a new set of cities it will help prepare for, and bounce back from, the shocks and stresses of modern urban existence Led by Akash Dhangar, the SlumGods want to use hip-hop to upgrade the image of their legendary Dharavi shantytown. But first they must change the perceptions of their own families and friends Mumbai?s informal settlements don?t fit the apocalyptic vision we?ve been sold. In fact, they could help solve India?s housing crisis A new law aims to improve life for street vendors on the streets of Mumbai ? by moving them away from their customer base. And then there?s the bribes The Koli fishing village of Chimbai sits happily next to a busy district of Mumbai, but how long can this ancient tribe rely on the sea? Reviving the port lands could be this congested island city?s best bet for affordable housing, transport links and public space. But chances like this have been squandered in the past The Indian Super League is attracting large crowds, new audiences and global sponsors to football, but will it ever hit the exalted heights of cricket as a national sport? The running season is in full flow in the runup to the Mumbai marathon ? but how do you escape the onslaught of traffic, crowds and heat in one of the world?s most densely packed cities?