Eris Zion Venia Dyson: African Americans have waited patiently for a president to speak the truth about the racism we experience. At last, we heard it Deborah Orr: The jurors who acquitted George Zimmerman say they acted in strict accordance with US law. That in itself speaks volumes Randolph McLaughlin: Zimmerman walked free thanks in part to 'reasonable doubt', but there's zero doubt that racial profiling distorts US criminal justice Attorney general tells NAACP convention that such laws 'try to fix something that was never broken' and calls for wider debate Protesters take to the streets of Los Angeles for a second time since George Zimmerman was acquitted for the murder of unarmed black teenager Trayvon Martin Woman named only as juror B37 abandons plans to write book as NAACP steps up pressure on DoJ to launch federal prosecution Lindsey Bever: A few call it justice; others see the verdict as another attack against young black men like Trayvon Martin Protests, marches and vigils have been held throughout the US since Saturday, when George Zimmerman, who shot Trayvon Martin, was acquitted of all charges brought against him Alice Walker: I feel the grief of all people who love fairness and justice. But George Zimmerman has his own conscience to reckon with Protests against the acquittal of George Zimmerman continue across the US on Monday, as president Barack Obama calls for calm Federal prosecutors would need to prove that Zimmerman sought to harm Trayvon Martin because he was black ? analysts Michael Cohen: Trayvon Martin would likely still be alive if George Zimmerman didn't have a concealed gun that fateful night The Obama administration was facing intense pressure to bring a federal prosecution against George Zimmerman, acquitted of murdering the unarmed black teenager Trayvon Martin, as activists called for a day of action to protests against the verdict People protesting against the verdict in the George Zimmerman trial clash with police on Sunday night in Los Angeles Protests in New York continued until late in the night after the acquittal of George Zimmerman in the shooting death of unarmed black teenager Trayvon Martin. The rally started small earlier in the day in Union Square , and then slowly grew into a gathering of thousands. They abandoned their initial site to march in the streets toward Times Square, slowing or stopping traffic. President says 'the death of Trayvon Martin was a tragedy, but we are a nation of laws, and a jury has spoken'