? Thousands of people have attended rallies in more than 100 cities across the US to urge justice for Trayvon Martin . ?Beyonce and Jay Z also appeared at the rally. Today it was my son. Tomorrow it might be yours, Martin's mother, Sybrina Fulton, told the crowd. ? In Miami Martin's father, Tracy Martin, promised to do everything we can to make sure there's change. He added: That's our promise to our son's memory . Hundreds of protestors from the rally in front of LA's federal courthouse split into marches, chanting, banging drums and blowing whistles as they streamed north, west and south, Rory Carroll reports. Traffic honked in support as the west-bound group crossed a bridge, eliciting cheers. Some of the placards juxtaposed Trayvon Martin with Emmett Till, a black teenager murdered in 1955 after allegedly whistling at a white woman. ?This is 21st century lynching,? they chanted. Miami's rally has wrapped up with pockets of remaining protestors dispersed by a typical Florida summer tropical downpour, according to Richard Luscombe. Jordan Dent, a student at Miami-Dade College, said he was impressed by Tracy Martin's composure and liked that he spoke from the heart. The heartbreak that family suffered has been intense but to see him here in Miami, wearing a Miami Marlins baseball cap and talking to us, and being so strong, is inspiring. Dent, 22, was among the first to arrive at the rally, which began at 10am and lasted almost four hours. We are all Trayvon, he said, repeating the slogan of the Justice for Trayvon campaign. We can't change the verdict and we can't bring Trayvon back, but when George Zimmerman decided not to stay in his car he started something that it's our responsibility to finish. Never again should a black child have to worry about who's following him home. Helicopters continue to hover overhead but the LA rally is winding down, Rory Carroll reports. Most people are drifting away, although some are lingering. Around 200 to 300 showed up. I'd hoped for a better turnout but you have to start somewhere, said Brandi McCorry, 45, a civil servant, who attended with her family. It was very important for us all to be here. I have two sons and they could have been Trayvon. Jose Ceja, 75, said Trayvon's death did not affect just black people. We are all equal. We are all flesh and blood. The rally in DC has just ended, writes Paul Lewis. It was a passionate affair, with successive speakers taking to the podium on the steps of the district courthouse to call for justice over Martin?s death. There were repeated chants of ?No justice, No peace?, and ?Boycott Florida? from the bustling crowd, some of whom were forced to stand on walls to hear the roster of speakers that ranged Dr E. Faye Williams, chair of the National Black Congress of Women, to Dick Gregory, the black comedian and civil rights campaigner. Many people in the predominantly black crowd said they felt emboldened by Barack Obama?s decisive intervention yesterday. ?Yesterday, you saw an example of superlative leadership,? said Pastor Lennox Abrigo, to loud applause. ?It is the first time we have heard in our country, from the leader of the free world, and entirely black perspective.? Obama?s declaration that ?Trayvon Martin could have been me 35 years ago? was repeatedly taken up as a chant, as the crowd yelled ?I am Trayvon Martin?. Joe Madison, aka ?The Black Eagle?, the American talk show host, compared Martin?s death to a succession of racist murders of black people from the civil rights era. Referring to the legacy of black segregation laws, he added: It wasn?t Jim Crow that killed Trayvon Martin. It was Jim Crow?s grandson, that not only killed him, but tried him. George Zimmerman became the judge, the jury and the executioner... What has happened is we have felt pain. Pain leads to passion. But passion has to lead to purpose. The purpose of being here today is to make sure the Trayvon Martin case is not a ?moment?, but a movement. Organisers from Al Sharpton's National Action Network said that up to 500 supporters were at the Miami rally, to show the Martin family that they are not alone and to increase the pressure on Florida's governor Rick Scott to change or scrap the controversial Stand Your Ground law, Richard Luscombe reports. We are delighted that so many are here, it just let's the whole country know that the Martin family are in our hearts and that we don't accept what happened, said Pamela Knox Shuler, a volunteer organiser with the Florida chapter of the NAN. This is a real call for change, and change now. Tracy Martin promised his son he would fight for change and we'll be standing beside him every step of the way. Veteran civil rights leader, the reverend Al Sharpton, began his address at the foot of police headquarters in New York City with a chant; I am Trayvon Martin , Ryan Devereaux writes. The crowd before him, numbering well into the hundreds, immediately repeated his words. We're standing up today for justice for Trayvon Martin, Sharpton said. He said he would join a march to Washington DC next month in support of a wide range of racial justice issues, saying demonstrators would number tens of thousands . Sharpton recalled the moment he first heard of the shooting that left an unarmed, 17 year-old Trayvon Martin dead. I'd never heard of Sanford, he said, referring to the town where Martin died. But I heard too many times of stories where people are killed and treated like they are worthless, and it was a sense of justice that we said that this man should not be let go. Sharpton introduced Sybrina Fulton, Trayvon Martin's mother, who took the microphone with her remaining son, Jaharvis, standing nearby. I am honored that you all decided to take part in this occasion, she began. She paused as she continued to thank the crowd, appearing to struggle for words. We love you, a woman yelled. Others cheered and applauded. Fulton went on to describe how she felt her son was portrayed in the trial that acquitted his killer, George Zimmerman. Trayvon was a child, Fulton said. I think sometimes it gets lost in the shuffle because as I sat in the courtroom, it made me think they were talking about another man. And it wasn't. It was a child. He was always a child. He acted as a child. He behaved as a child, she said. And don't take my word for it, he had a drink and candy. Not only do I vow to you to do what I can for Trayvon Martin, she told the crowd. I promise you I'm going to work hard for your children as well. In closing, Fulton encouraged supporters to express their voices in a peaceful manner ... so we can change some of these laws. The sun has come out as hundreds stage a spirited, peaceful rally in front of LA's imposing courthouse, writes Rory Carroll. It's an eclectic gathering, with people variously attired in shorts, suits and hoodies. Ryan Milhomme lives in Miami's Liberty City, close to the Miami Gardens neighbourhood that Trayvon Martin called home, writes Richard Luscombe. Clutching a bag of Skittles and a can of iced tea similar to one Martin was carrying on the night he was shot, Milhomme, 24, said he came to the rally to demand change. We're sending a powerful message here and across the country, he said, and we want that to be become even more powerful. My president stands for justice, the Martin family stands for justice and today we are standing for justice with them. Milhomme joined a group of about 150 demonstrators at an impromptu street rally outside Miami's courthouse soonafter Tracy Martin had spoken. Traffic was brought to a halt and police kept a watchful eye but the gathering was cometely peaceful and good-humoured. The lawmakers, all members of the Congressional Black Caucus, are fierce critics of the process that led to George Zimmerman's acquittal in the fatal shooting last year of the Florida teenager. Exerting pressure on Florida's economy as Jackson is suggesting, they said, could help overturn the state's controversial stand-your-ground laws that many contend contributed to the tragedy. That's probably the best strategy, because people understand dollars and cents, Rep. Lacy Clay D-Mo. said Friday. And they understand, if there's a significant drop-off in revenues ? at conventions, at Disney World and Universal Studios ? that that will get the attention of the powerful. There were huge cheers at the mention by a pastor of Obama's remarks yesterday. Superb leadership, says pastor. Martin promised a lively yet peaceful gathering in Miami that he would be fighting to change Florida's Stand Your Ground laws. We will do everything we can to make sure there's change, that's our promise to our son's memory, he said. He said he was deeply touched by the outpouring of support since last weekend's verdict and asked demonstrators, many in I Am Trayvon teeshirts and carrying Justice for Trayvon banners, to stand strong for the battles ahead. Trayvon could have been anyone's child. That's the message that's being sent to the world. In downtown LA, people are gathering outside the Federal courthouse on Spring street for a protest due to begin here at 9am local time ? simultaneous to the one in New York. Rory Carroll writes: Protests due to be held in Palmdale, Riverside and San Bernardino, east of LA, are likely to be smaller. There are at least eight vigils planned in and around the city this weekend. After a week of baking temperatures it's overcast and slightly cooler. Police said they expect today's vigils to pass off peacefully because but are still mounting a strong showing lest rogue elements or another so-called ?bash mob? run riot. Groups of mostly young people used social media to organise blitzes through Hollywood and the Inland Empire this week, robbing and roughing up people as they raced through sidewalks and stores. A bash mob predicted in Long Beach on Friday did not materialise. ?We are very cognizant of monitoring the rest of the city for any potential flash mobs, and we have additional resources in place to respond quickly and aggressively,? said LAPD Lt. Andy Neiman. ?We will aggressively go after anybody who participates in this kind of illegal activity.? This photo purports to show the couple at the rally, which is taking place outside One Police Plaza in Lower Manhattan. Ryan writes that Jay Z's appearance came as a surprise to many at the rally, who were awaiting an address from reverend Al Sharpton and Sybrina Fulton, mother of Trayvon Martin. Thank you, Jay! one woman yelled. No concerts in Florida! others chanted. Protesters held signs that read: Black children matter, black lives matter. Mirna Duran, 31, and Rodney Valencia, 40, sat in the shade to escape the July sun. Both were visiting New York City from Washington DC. If I were in DC I'd be doing the same thing, Duran told the Guardian. There's strength in numbers. Valencia, who is half-white and half-African American, said racial profiling is common place for people of color. We've all been through something like that, he said. That needs to change, Valencia said. We're not back in the 40s and 50s and 60s or something like that. Plans to commemorate the 50th anniversary of Martin Luther King's I have a dream speech are being redrawn in the wake of an angry reaction over the decision to acquit George Zimmerman?over the shooting of Trayvon Martin, and a recent decision by the supreme court to strike down key sections of a law that protects black voters. The rallies today are being coordinated by the National Action Network, the same group that is taking the lead in organising the march to mark the anniversary of Martin Luther King's famous speech. Trayvon Martin's father, Tracy Martin, has said the widespread support following his son's death is keeping us going . Tracy Martin will attend the rally in Miami at 12 noon. Speaking to CNN just now he said a range of people had come out in support of the family's call for justice. White, black, brown - there's a mix of people, everybody is out here, he said. Martin praised Obama's speech yesterday, when the president suggested that Trayvon Martin could have been him 35 years ago . On Friday President Barack Obama addressed the debate over George Zimmerman's acquittal in remarks that were interpreted by some as his most expansive on race since he was elected. You know, when Trayvon Martin was first shot I said that this could have been my son. Another way of saying that is: Trayvon Martin could have been me 35 years ago, Obama said. And when you think about why, in the African American community at least, there's a lot of pain around what happened here, I think it's important to recognize that the African American community is looking at this issue through a set of experiences and a history that doesn't go away. In a speech said to be the president providing context to the uproar over Zimmerman's acquittal, he said there are very few African American men in this country who haven't had the experience of being followed when they were shopping in a department store. That includes me . There are very few African American men who haven't had the experience of walking across the street and hearing the locks click on the doors of cars. That happened to me ? at least before I was a senator. Rallies are planned in 100 cities across the US today as anger continues over the acquittal of George Zimmerman, who last week was cleared in the shooting death of Trayvon Martin. Martin's parents will attend the demonstrations, which were organised by veteran campaigner Al Sharptonin response to a national outpouring of anger after Zimmerman was found not guilty of murder last week. Thousands of people are expected to gather in cities including New York, LA and Miami. Sharpton says the purpose of the rallies is to urge the Justice Department to consider a federal civil rights prosecution. The demonstrations come after President Obama said in a speech at the White House the US was not a a post-racial society . The president addressed the debates over race relations that have taken place since Zimmerman was cleared. You know, when Trayvon Martin was first shot I said that this could have been my son. Another way of saying that is: Trayvon Martin could have been me 35 years ago, he said. On Friday night hundreds marched through Oakland, California, in support of Trayvon Martin. Protests in Oakland earlier this week ended in multiple arrests, while demonstrations in LA also saw arrests following a peaceful vigil in the city. We have reporters on the ground in Miami, New York City, Washington DC and LA and will be providing live updates through the day. Rallies are scheduled for 12 noon local time across the US, with the LA demonstrations due to take place three hours after the Miami and New York events.