A Sundance prize-winning film about the real-life shooting of a black man by a white policeman has opened on the same weekend as neighbourhood watch leader George Zimmerman was acquitted of murdering unarmed black teenager Trayvon Martin in the US. Fruitvale Station won the dramatic grand jury prize and dramatic audience awards at Robert Redford's annual celebration of indie film-making in January. The film's plot echoes the events surrounding Martin's death following a late-night encounter with Zimmerman on 26 February last year. Starring The Wire's Michael B Jordan and Oscar-winner Octavia Spencer The Help and directed by 27-year-old first time feature film-maker Ryan Coogler, Fruitvale Station details how 22-year-old Oscar Grant was shot and killed by transport policeman Johannes Mehserle at the Fruitvale train station in Oakland, California, in the early hours of New Year's Day, 2009. The incident happened after Mehserle and another officer were called to reports of a fight. The policeman's move to restrain Grant and subsequent decision to shoot him in the back were captured by passers-by on mobile phones. Mehserle was found guilty of involuntary manslaughter, though not guilty of second-degree murder and voluntary manslaughter, a verdict which sparked protests and small-scale rioting in Oakland. He argued that he had intended to tase Grant, but accidentally shot him after seeing him reach for his waistband. The victim was unarmed. Fruitvale Station is being released by Harvey Weinstein's Weinstein Company in the US and is tipped for Oscars success next year. Weinstein has produced dozens of awards-season favourites over the past 20 years, including the Oscar-winning civil rights themed drama The Help for which Spencer win best supporting actress in 2011 and the forthcoming White House-set political biopic The Butler. Coogler's film achieved the highest per-screen average gross of any movie released in the US this weekend, with a take of $54,000 ?36,000 on limited release at seven cinemas. Obviously, we had no idea of what would be going on at the time we dated the movie, but it's very topical, said The Weinstein Company's Erik Lomis. Jordan said he almost cancelled an appearance at a sold-out screening at Los Angeles at the weekend following the news of Zimmerman's acquittal. My heart hurts so bad right now. I wasn't going to come after I found out about George Zimmerman getting acquitted. It broke me up, he told an audience at the Regal LA Live cinema. That's why I think this film means so much, because it keeps happening again and again. [We must] learn how to treat each other better and stop judging one another just because we're different. It's not just a black and white thing, it's a people thing. It's the only way that things are going to take the necessary steps to move in the right direction so things can get better because I don't think it's ever gonna stop, but something's gotta fucking change. The Guardian's Xan Brooks described Fruitvale Station as a quietly gripping debut feature in which one has the sense of a man being slowly, surely written back into being after the film's Cannes screening in May. The film is due to expand to six more American cities on Friday before rolling out across the nation the following weekend.