The chief prosecutor in the United States has described the shooting death of Trayvon Martin as tragic and unnecessary, as the Justice Department announced a review of the case. US Attorney General Eric Holder made his remarks on Monday in a speech to a convention of 14,000 members of Delta Sigma Theta, a group for university-educated black women. While Holder did not indicate whether he intended to bring a federal case, he referred to the incident as the tragic, unnecessary shooting death of Trayvon Martin . The Justice Department shares your concern. I share your concern, he said. His comments follow confirmation that the justice department was considering whether to file criminal civil rights charges against Zimmerman. Zimmerman shot dead the unarmed 17-year-old dead in Sanford, Florida, while acting as a?neighbourhood watch volunteer last February. He maintained he was acting in self defence and was acquitted on Saturday of the teenager's murder. Street protests? Protests broke out in several cities in the US on Sunday evening as people voiced their disappointment and frustration at the verdict. In New York, thousands marched from Union Square to Times Square over Zimmerman's?not-guilty verdict, adding there was a real sense of anger, of disbelief, of frustration among protesters. Marches of varying sizes also erupted in San Francisco, Chicago, Washington, Atlanta, Oakland and Philadelphia following the reading out of the verdict late on Saturday night. Martin's ?father, Tracy Martin, tweeted that his son would have been proud of the fight put up for him. Even though I am broken hearted my faith is unshattered, he wrote in one tweet. Together can make sure that this doesn't happen again, he said, in another. Al Jazeera's Dexter Mullins reported that a crowd of several hundred protesters hit the streets of Central Harlem on Sunday night, expressing outrage over the verdict. Chanting No Justice! No Peace! and Who's Streets? Our Streets! , the protesters woke numerous residents, many of whom decided to join the crowd. Obama plea US President Barack Obama said on Sunday that Martin's death was a tragedy for the country and called for calm after Zimmerman's acquittal. We are a nation of laws, and a jury has spoken. I now ask every American to respect the call for calm reflection from two parents who lost their young son, said Obama. Avoid violence, it will lead to more tragedies. Find a way for self-construction not deconstruction in this time of despair, he wrote on Twitter. Throughout the trial, Zimmerman said his actions had been in self-defence. In Florida, the Stand your ground law means people can justify shooting people when they feel threatened, rather than retreating if the option is available.