As civil unrest grows in Egypt, that country?s Islamofascist president is refusing to bow to military pressure to step down, setting the stage for further bloody conflict. In an impassioned televised speech late Tuesday, Mohammed Morsi vowed not to leave office. ?I am prepared to sacrifice my blood for the sake of the security and stability of this homeland.? On Monday the armed forces gave the embattled president and that country?s political parties 48 hours to devise a solution to Egypt?s political crisis. The army said it would offer a ?road map? for peace if Morsi and his adversaries failed to observe ?the will of the people.? The deadline is today. Earlier on Tuesday Morsi?s office posted a statement on Twitter. ?President Mohammed Morsi asserts his grasp on constitutional legitimacy and rejects any attempt to deviate from it, and calls on the armed forces to withdraw their warning and refuses to be dictated to internally or externally.? But Morsi?s entreaties don?t seem to be working. His own cabinet has abandoned him. On its official Twitter account the cabinet condemned the speech. ?The cabinet declares its rejection of Dr. Morsi?s speech and his pushing the country toward a civil war,? the statement read. ?The cabinet announces [it is] taking the side of the people.? Morsi?s refusal to resign puts him on a collision course with that nation?s armed forces, which were instrumental in removing his predecessor, Hosni Mubarak. His speech came shortly after the military reportedly took over the newspaper, Al Ahram, and used it to publicize plans to depose the president should he fail to agree to reforms. In an article titled, ?removal or resignation,? the newspaper reported that the army would ?abolish the controversial Constitution? and strike a committee to draft a new one. It would also make a military leader the nation?s interim prime minister. The newspaper also reported that ?to ensure the country?s security? the military and security services had already placed several of Morsi?s allies in the Muslim Brotherhood under house arrest. Orders have been issued to arrest ?anybody who resists these decisions.? Hours after the speech was broadcast, Egypt?s high command responded to Morsi, who calls Jews ?bloodsuckers? and ?the descendants of apes and pigs.? ?We swear to God that we will sacrifice even our blood for Egypt and its people, to defend them against any terrorist, radical or fool,? read the post on the official Facebook page of the Supreme Council of the Armed Forces SCAF , headed by Gen. Abdel Fattah al-Sisi. In the Tuesday evening address Morsi was responding to an ultimatum issued Monday by the military. As an estimated one million people demonstrated against him in Cairo and Alexandria on Sunday, protesters set the headquarters of Morsi?s Muslim Brotherhood on fire. Al-Sisi, who is also defense minister, said the demonstrations were an ?unprecedented? expression of the popular will. In recent days protesters have carried signs condemning President Obama for supporting Morsi and the Muslim Brotherhood. In May the Obama administration quietly approved $1.3 billion in U.S. military aid to Morsi?s government, rewarding it for its increasingly vicious assaults on foreign workers, religious minorities, and civil society. U.S. Secretary of State John Kerry authorized the aid despite finding in a May 9 memo that ?we are not satisfied with the extent of Egypt?s progress and are pressing for a more inclusive democratic process and the strengthening of key democratic institutions.? Daniel Pipes believes it?s time for the U.S. government to ?stop coddling Morsi and to get behind the millions of protestors. But will the geniuses in the White House, the State Department, and [the] Embassy [in] Cairo hear?? It should be noted that not all the Egyptians are demonstrating against the ongoing Islamization of their country. Some are Islamists upset that Morsi is moving too slowly in turning Egypt into Iran. They say he isn?t hardline enough and complain he hasn?t repudiated the Camp David Accords. As Robert Spencer notes, ?After all, that was why they got rid of [former President Hosni] Mubarak.? Meanwhile, details of the army?s so-called road map have begun to surface. Citing unidentified ?military sources,? Reuters partly echoed Al Ahram, reporting that the armed forces are planning ?to install an interim council, composed mainly of civilians from different political groups and experienced technocrats, to run the country until an amended constitution [is] drafted within months.? Following the installation of the interim council, there would be a new presidential election. Parliamentary elections would be ?delayed until strict conditions for selecting candidates were in force,? the sources said. The new president of the constitutional court, Adli Mansour, is being considered as a transitional head of state. ?The armed forces planned to open talks with the main opposition National Salvation Front and other political, religious and youth organizations once a deadline set for Morsi to reach a power-sharing agreement expires on Wednesday. The sources would not say how the military intended to deal with Morsi if he refused to go quietly.? It?s not clear what the National Salvation Front has in store for Egypt. It named former U.N. nuclear watchdog Mohamed ElBaradei as its spokesman in negotiations with the armed forces. ElBaradei, who is frequently rumored to be an Egyptian presidential candidate, previously served on the board of trustees of the International Crisis Group, a nongovernmental organization. Among the leftists and useful idiots on the current board are radical philanthropist George Soros, retired General Wesley Clark, and Islamist sympathizer Thomas Pickering. Even if Morsi is forced out, it?s not obvious what kind of leader would replace him. Despite the historic protests of recent days, Egyptians on the whole remain largely supportive of Islamization and the imposition of Shariah law in Egypt. But if a new president is selected by people with ties to George Soros, there is ample reason for concern. Freedom Center pamphlets now available on Kindle: Click here. I don?t know if Jews are ?bloodsuckers or descendants of pigs,? but those who write on this site certainly seem like they are! Whether they be Zionists or assorted Israelophiles? Completely devoid of logic, full of hatred, shamelessness, vileness, and negativity. This site is a pit of ignorance. So if Jews were displaced some thousands of years ago, now you want Jews of Russian, African, Indian, American origin to occupy a piece of land in Arab world which was already inhabited by people? Then what about Cannanites who were massacred by Israelites to occupy Israel in the first place? See your logic sucks. It was wrong to have Jews migrate from all over the world and occupy Palestinian land in the name of Nazism and how they were treated in the West. Europe dumped Jews onto the Muslim world. See the conspiracy. Why doesn?t America give a piece of its land and declare it Israel? Why doesn?t Europe? See? So it was wrong. Now the only solution is: one-state settlement and truth and reconciliation. One state settlement under which all Jews who have come to the land for whatever reason may live side by side with Palestinians. No to racism and ?Jewish state? at the expense of Palestnians. pig?s knowledge of the science of personal hygiene! In FACT, Allah asserts in your Quran that BOTH the Torah & Injil Gospels are PRESERVED with him also! FOOL! You invariably prove that your knowledge of your own scriptures as I have already demonstrated is beneath contempt! For example you do not even know WHO according to the Arabic of the Quran is a Muslim! Tell us all who is, please? If you are smart enough. The foremost characteristic of any Muslim is to DENY all Facts & Reality because the 1,500,000 Israeli Arabs are the most secure and best treated than anywhere in the Middle East. Your knowledge of their rights in Israel is the perverted and twisted one gleaned from your Muslim media So far everything you have attributed to Israelis, Jews, Americans & Christians are the contorted points of view of a Pakistani who has absolutely no facts except conjecture in an otherwise brainwashed mind. The readers know that your views are warped not because you have a single fact to back you up but because your indoctrination is so complete it is impossible for you to use LOGIC like all 1,500,000,000 Muhammadans. I have invested a lot of time with you knowing full well that no matter how many facts I can throw at you, you would never change your mind but I needed to do this so that our readers will learn about the real mind set of Muslims especially those who are supposed to be ?educated?.