Foreign nuclear experts on Friday blasted the operator of Japan?s crippled Fukushima nuclear plant, with one saying its lack of transparency over radioactive water leaks showed ?you don?t know what you?re doing?. The blunt criticism comes after a litany of problems at the reactor site, which was swamped by a tsunami two years ago. The disaster sent reactors into meltdown and forced the evacuation of tens of thousands of residents in the worst atomic accident in a generation. Earlier this week, Tokyo Electric Power Tepco admitted for the first time that radioactive groundwater had leaked outside the shattered plant, confirming long-held suspicions of ocean contamination. ?This action regarding the water contamination demonstrates a lack of conservative decision-making process,? Dale Klein, former head of the US Nuclear Regulatory Commission NRC , told a panel in Tokyo. ?It also appears that you are not keeping the people of Japan informed. These actions indicate that you don?t know what you are doing ... you do not have a plan and that you are not doing all you can to protect the environment and the people.? Klein is part of a Tepco-sponsored nuclear reform monitoring panel composed of two foreign experts and four Japanese including the company?s chairman. The utility previously reported rising levels of potentially cancer-causing materials in groundwater samples from underneath the plant, but maintained it had contained toxic water from leaking beyond its borders. The embattled company ? which faces massive clean-up and compensation costs ? has now admitted it delayed the release of test results that confirmed the leaks, as Japan?s nuclear watchdog heaped doubt on its claims. ?We would like to express our frustrations in your recent activities regarding the water contamination,? Klein said. ?These events detract from the progress that you have made on your clean-up and reform for the Fukushima plant .? Tepco?s President Naomi Hirose apologised later on Friday, saying the vast utility had failed to learn lessons in the aftermath of the March 2011 disasters, when it was criticised for being slow in making crucial information public. Calling the failure ?regrettable?, Hirose said Tepco had at least four opportunities to warn of possible water leaks in recent months. ?If asked whether we responded to recent problems based on what we learned from experiences after March 11: we did not,? he told a news briefing, adding that he would take a 10 per cent salary cut for a month to atone for the utility?s mistakes. Responding to reporters? questions, Klein dismissed suggestions of a company cover-up, and said that Tepco had a ?good plan? to clean up the site, but they were ?waiting way too long before communicating with the public?. ?As soon as the issue is identified they need say what they know and what they don?t know,? he added. Earlier, Barbara Judge, chairman emeritus of Britain?s Atomic Energy Authority, said she was ?disappointed and distressed? over the company?s lack of disclosure. ?I hope that there will be lessons learned from the mishandling of this issue and the next time an issue arises ? which inevitably it will because decommissioning is a complicated and difficult process ? that the public will be immediately informed about the situation and what Tepco is planning to do in order to remedy it,? she said. Judge told the press briefing that corporate culture was largely to blame. ?Like in many other companies, there was a culture of efficiency and closeness ... privately working out problems until they thought they were ready to discuss them,? she said, adding that the panel was trying to usher in a ?culture of safety before efficiency?. Decommissioning the site is expected to take decades and many area residents will likely never be able to return home, experts say.