In the aftermath of Japan's earthquake and tsunami in March 2011, the Fukushima Daiichi nuclear plant was initially driven into shutdown by the magnitude 9.0 quake; its emergency generators then failed because they were inundated by the tsunami. But the greatest damage to the complex, and the greatest release of radiation, may have been caused by explosions of hydrogen gas that built up inside some of the reactors. That hydrogen buildup was the result of hot steam coming into contact with overheated nuclear fuel rods covered by a cladding of zirconium alloy, or zircaloy -- the material used as fuel-rod cladding in all water-cooled nuclear reactors, which constitute more than 90 percent of the world's power reactors. When it gets hot enough, zircaloy reacts with steam to produce hydrogen, a hazard in any loss-of-coolant nuclear accident. A team of researchers is developing an alternative that could provide similar protection for nuclear fuel, while reducing the risk of hydrogen production by roughly a thousandfold. In the aftermath of Japan's earthquake and tsunami in March 2011, the Fukushima Daiichi nuclear plant was initially driven into shutdown by the magnitude 9.0 quake; its emergency generators then failed because they were inundated by the tsunami. But the greatest damage to the complex, and the greatest release of radiation, may have been caused by explosions of hydrogen gas that built up inside some of the reactors. That hydrogen buildup was the result of hot steam coming into contact with overheated nuclear fuel rods covered by a cladding of zirconium alloy, or zircaloy -- the material used as fuel-rod cladding in all water-cooled nuclear reactors, which constitute more than 90 percent of the world's power reactors. When it gets hot enough, zircaloy reacts with steam to produce hydrogen, a hazard in any loss-of-coolant nuclear accident. A team of researchers at MIT is developing an alternative that could provide similar protection for nuclear fuel, while reducing the risk of hydrogen production by roughly a thousandfold. Tests of the new cladding material, a ceramic compound called silicon carbide SiC , are described in a series of papers appearing in the journal Nuclear Technology. We are looking at all sides of the issue, regarding replacing the metallic cladding with ceramic, says Mujid Kazimi, the TEPCO Professor of Nuclear Engineering at MIT, who is senior author of the papers. Because of the harsh environment fuel rods are exposed to -- heat, steam, and neutrons that emanate from nuclear reactions -- extensive further testing will be needed on any new cladding for use in commercial reactors, Kazimi says. SiC is very promising, but not at the moment ready for adoption by the nuclear industry, he adds. Other groups have suggested the use of SiC for cladding, but the material had never been subjected to the detailed tests and simulations that the MIT team carried out. Kazimi and his colleagues not only tested the material's response under normal operating conditions, with temperatures of 300 degrees Celsius 572 degrees Fahrenheit , but also under the more extreme conditions of an accident, with temperatures up to 1500 C 2732 F . Nuclear fuel rods are made of hundreds of small pellets of enriched uranium placed end-to-end inside hollow tubes of zircaloy that are about a half-inch across. The tubes are filled with inert helium gas to improve the heat conduction from the pellets to cladding that is cooled by the water that circulates outside the tubes. These tubes are then packed together in bundles that are inserted into the reactor core, where they heat water to produce steam to drive a turbine generator to produce electricity. To test SiC cladding under normal operating conditions, the MIT team used a three-layer cladding design that features a middle layer made of a composite of SiC fibers reinforced with more SiC. The tubes were tested inside MIT's research reactor in special loops that replicate the coolant temperature and chemistry conditions in large power reactors. The irradiation apparatus was designed by MIT research scientist David Carpenter and research engineer Gordon Kohse. The effects of irradiation were studied by graduate student John Stempien and others, working with Kazimi. The results showed good strength retention during mechanical testing, Stempien says. Graduate student Youho Lee and research scientist Tom McKrell conducted high-temperature oxidation studies on SiC. Under the extreme conditions of an accident, the corrosion rate was 100 to 1,000 times less than that of zircaloy. While zircaloy loses strength as temperature increases -- becoming 2 percent weaker for every 10 C increase in temperature and losing all strength at about 1300 C, Stempien says -- the strength of the SiC ceramic remains essentially constant to temperatures well above 1500 C. The potential advantages of SiC cladding extend beyond reducing the risks in an accident, Kazimi explains. Because SiC reacts slowly with water, even under normal conditions it degrades less and can remain in a reactor core longer. That could allow reactor operators to squeeze extra energy out of fuel rods before refueling: The rods are typically replaced after four or five years in a reactor, and degradation of the cladding is a major limitation on their longevity. In addition, the ability to leave fuel rods in place longer would reduce the spent fuel produced by each reactor, resulting in less volume for disposal, Kazimi says. There are still further tests to be done: In particular, while zircaloy tubes can have their ends capped by welding a metal disk onto each end, ceramic can't be welded, so a suitable bonding agent will need to be found. We need to join the ceramic to ceramic in a way that can withstand the conditions in the nuclear core, Kazimi says. That's not as perfected a science as it is for metals. Other details, such as the optimal thickness of the tubes for durability and for heat transfer, also need to be determined. In addition, the material needs to be tested further to determine its response to various stresses. The fracture behavior is different, co-author Lee says. In particular, while metal deforms predictably under pressure, a ceramic tends to fracture in a way that is more statistical, he says: It can only be predicted as a statistical likelihood of certain failure modes.