Trayvon Martin supporters marked the first day after George Zimmerman's acquittal with protests in Los Angeles, New York and elsewhere Sunday, blocking the 10 Freeway for about 20 minutes, while President Obama called Martin's killing a tragedy and asked Americans to honor the jury's verdict. The Los Angeles Police Department called a citywide tactical alert and made at least one arrest, saying protesters threw rocks and batteries at officers just north of the freeway. LAPD Cmdr. Andy Smith said police responded by firing nonlethal rounds. By late evening, demonstrators were marching on several streets, disrupting traffic but otherwise remaining peaceful. In New York, chanting protesters massed in Times Square after marching about two miles from an earlier rally in Union Square. Protests also took place in Chicago, Oakland and Sanford, Fla. In Florida, Zimmerman spent the day in seclusion after a six-person jury found him not guilty of second-degree murder and manslaughter Saturday night. One of his attorneys said Zimmerman intended to get his gun back because he needed it more than ever. Martin's family kept a low profile after initially reacting to the verdict via Twitter. Thanks to everyone who are with us and who will be with us [so] we together can make sure that this doesn't happen again, Martin's father, Tracy Martin, tweeted. In Washington, Obama said he respected the jury's decision and asked the nation to reflect on gun violence. He called Martin's death a tragedy, Not just for his family, or any one community, but for America. I know this case has elicited strong passions, the president said. And in the wake of the verdict, I know those passions may be running even higher. But we are a nation of laws, and a jury has spoken. Some members of Congress and the National Assn. for the Advancement of Colored People called for the Justice Department to pursue a civil rights case against Zimmerman. The department issued a statement reiterating that it was still investigating the case. Martin family attorney Benjamin Crump told ABC's This Week that the couple had not ruled out a lawsuit. They deeply want a sense of justice. They deeply don't want their son's death to be in vain, Crump said. They're in disbelief about this verdict. It's just one of the things they have to deal with ? they're in church this morning, praying and turning to God, a higher authority, to make sense of it all. Zimmerman attorney Mark O'Mara told ABC News that his client had received threats and wears a protective vest in public. Zimmerman fears for his safety and needs his gun now even more, O'Mara said. There are a lot of people out there who actually hate him, though they shouldn't, O'Mara said. Zimmerman still thinks he needed the gun the night he shot Martin, O'Mara said. I think that he feels, truly in his heart, that if he did not have that weapon he might not be here. O'Mara said he suspected Zimmerman would have to move away from Sanford and would have a hard time finding work. I don't think anyone can hire him.... George is a pariah, he said. Zimmerman's older brother, Robert Zimmerman Jr., told CNN that George was afraid because there are people that would want to take the law into their own hands as they perceive it, or be vigilantes in some sense. They think that justice was not served, they won't respect the verdict no matter how it was reached and they will always present a threat to George and his family. Sanford police stepped up patrols, particularly around the gated community where the shooting occurred, the Retreat at Twin Lakes. Steve Ornstein, 45, has lived at the stucco complex for four years, just up the street from Zimmerman, whom he knew. On Sunday, Ornstein walked through a grassy yard, down the path behind backyard patios where the killing occurred. He pointed out where Martin had stayed, and homes of various neighbors who testified at the trial. There were was no sign left, no bloodstains on the concrete and no memorial. But Ornstein said it still felt eerie. He doesn't like to walk back there. Complex managers have suspended the neighborhood watch program indefinitely, he said. Many in Sanford sought solace in church. At the Allen Chapel AME Church, the Rev. Valarie Houston told a packed sanctuary that she struggled to accept what she considered a racially biased verdict. Last night, with tears in my eyes and pain in my heart, I couldn't go to sleep, said Houston, who is black. I didn't want to wake up this morning. The prejudice and injustice pollutes the air of America. The city is in unrest, she said. It is not over yet.