Protesters in Los Angeles and Oakland blocked traffic and clashed with police Sunday in a day of protests in California against the acquittal of George Zimmerman in the shooting death of Trayvon Martin. Several people were arrested in Los Angeles. Los Angeles police said they began making arrests early Monday after about 80 protesters gathered in Hollywood on Sunset Boulevard and an unlawful assembly was declared. More than 100 police officers converged on the crowd and ordered people to disperse. Police arrested six people at that and other demonstrations Sunday and early Monday, mostly for failure to disperse and one person for battery on a police officer, Officer Norma Eisenman said. She did not have details. A handful of people also were given citations, mostly for blocking a street or jaywalking, she said. No injuries were reported, Eisenman said. In the early part of Sunday evening, hundreds of protesters to the Florida verdict gathered in the Crenshaw area. They walked onto the 10 Freeway, closing lanes briefly in both directions. Police cleared the freeway before 7 p.m. L.A. Mayor Eric Garcetti urged protesters to practice peace in a Twitter posting. ? Eric Garcetti @ericgarcetti July 15, 2013 A native of South Central Los Angeles, Bills now works at Walmart. He watched portions of the Zimmerman trial on television. ?I think the laws [are] kind of different out there? in Florida, Bills told KPCC's Molly Peterson. But when asked about the criminal justice system in California, he added that they have the same feeling? toward black people. He, like his friends, have been stopped by police ?many a time,? Bills said, and arrested on occasion. ?I think, yeah, they profile any black brother walking down the street,? Bills said. ?Just like they profile any Latino brother walking down the street.? By around 10 p.m., Bills and other protesters reached the intersection of La Brea and Santa Monica Boulevard. They stopped for several minutes to chant ?no justice, no peace,? and wave signs. One protester sat sideways on a CVS shopping cart. Story continues below poll window. ?Am I mad?? Bills said. ?I better be mad.? The group continued north to Hollywood Boulevard, then turned east. Officers eventually dispersed the crowd, police Cmdr. Andrew Smith said. However, at a nearby street corner a crowd threw rocks and flashlight batteries at officers, prompting them to fire beanbag rounds. The protest wound down late Sunday, but some scattered groups remained. In Oakland, police confronted members of a crowd who began breaking windows and spray-painting graffiti at a downtown intersection Sunday night, the Oakland Tribune reported. Protesters marched about five miles before sitting at a major intersection and blocking traffic. The Tribune said the crowd was largely peaceful, but by 10 p.m. a smaller group of protesters began vandalizing businesses. KGO-TV reported that rocks and bottles were thrown toward police. The police communications office said early Monday that the protest had wound down but had no information on whether any arrests had been made. Earlier, demonstrations across the state were largely peaceful Sunday afternoon as hundreds took to the streets to march in support of the slain 17-year-old, blocking traffic on major streets of San Francisco, Oakland and Los Angeles. Police closed San Francisco's Market Street and escorted about 400 people as they marched across downtown to the waterfront Ferry Building. The racially diverse crowd of protesters banged drums, blew whistles and held signs that declared Zimmerman: the people say guilty, and The whole system is racist. Rand Powdrill, 41, of San Leandro, said he came to protest the execution of an innocent black teenager. If our voices can't be heard, then this is just going to keep going on, he said. A similar march shut down Crenshaw Boulevard in Los Angeles. It was peaceful until small groups broke away, Smith said. By late Sunday, a few dozen remaining protesters marched to Hollywood Boulevard and brought traffic at a busy intersection to a standstill. The demonstrations came a day after Zimmerman was cleared of all charges in Martin's February 2012 death in Florida. Zimmerman has maintained the shooting was self-defense. The death of the unarmed black teen unleashed debate across the U.S. over racial profiling. In downtown Oakland Saturday night, people broke windows, vandalized cars and buildings and started small fires in the streets. Local media reports said officers formed a line to block the protesters' path. In a statement Sunday, Oakland Mayor Jean Quan said Martin's death raised powerful, incredibly difficult issues surrounding racial profiling, but she criticized vandals who dishonored the memory of Trayvon by engaging in violent activities that hurt our growing economy and endangered people. We will not tolerate violence in our city, Quan said. This story has been updated.