Throngs of marchers crowded into Times Square Sunday night following George Zimmerman's acquittal in the shooting death of Trayvon Martin, blocking traffic amid calls for federal civil rights charges to be filed in the case. Zimmerman, a former neighborhood watch volunteer, was cleared of all charges late Saturday night by a Florida jury in the shooting of Martin, the unarmed black teenager whose killing unleashed furious debate across the U.S. over racial profiling, self-defense and equal justice. Martin supporters held so-called Justice 4 Trayvon Martin rallies after Zimmerman's acquittal throughout the tri-state Sunday, but the largest appeared to be in Times Square, where more than 1,000 people crowded into the plaza and surrounding streets to protest, causing gridlock for more than an hour. We're not here to say specifically, 'George Zimmerman should have been guilty, this or that,' but just that something's wrong with our society and our world in general when these types of things are able to happen, said Moses Havranek. Hundreds of the protesters moved on to march uptown on Sixth Avenue, shouting, No justice, no peace. About a dozen people were arrested for blocking traffic. There was also an earlier, planned rally in Union Square, attended by more than 1,000 people. Danny Maree of the East Village, who appeared as part of the Million Hoodies Movement for Justice, said: We really feel Trayvon Martin suffered two deaths that night. The first came from George Zimmerman's gun, but the second one came from the Justice Department that didn't arrest anybody. That's institutional racism. Though there has been rigorous debate about whether the trial should have been about race, people at the rally said the subject cannot be avoided. I have teenagers and my children are of color, and I'm afraid for them, said Alexandra Mendes. He called 911 and they told him to leave that kid alone. He should have left the kid alone, said Taj Springs. There are too many black, Hispanic children dying out on the streets for no reason. In Brooklyn, a crowd of about 200 to 300 people gathered in front of Borough Hall, calling on the Department of Justice to bring federal charges against Zimmerman. I'm a history teacher in Flatbush, and the only thing I could think of when I found out about this and all during the trial was, it could have been one of my students, just walking down the street coming home, said Michael Bridges of Flatbush. Just because you're wearing a hoodie, just because you might have looked suspicious, because quote-unquote you don't look safe. And that's just unfair. I just think unity needs to be across the board. Fairness needs to be across the board, said Richard Melvin of Bedford-Stuyvesant. Earlier in the East Village, some congregants wore hooded sweatshirts at the Middle Collegiate Church. The Rev. Jacqueline Lewis, wearing a pink hoodie, urged peace and told her congregation that Martin Luther King Jr. would have wanted us to conduct ourselves on the highest plane of dignity. But, she added, we're going to raise our voices against the root causes of this kind of tragedy. In Harlem, beneath the shadow of Adam Clayton Powell Jr.'s statue on 125th Street, protesters held up Honk for Trayvon signs. Others joined with signs protesting stop-and-frisk and with signs supporting Ramarley Graham, the unarmed black Bronx teenager killed by the NYPD in February 2012. In Newark, hundreds of people ignored the sweltering heat and humidity to march and chant no justice, no peace and Martin's name as they made their way toward the federal courthouse. There was a large police presence at all the protests across the New York and New Jersey. Except for the scattered arrests during the march from Times Square, there were no reported problems at most of the gatherings. Zimmerman, 29, who pleaded not guilty, blinked and smiled slightly when the verdict was announced. He could have been convicted of second-degree murder or manslaughter. But the jury of six women, all but one of them white, reached a verdict of not guilty after deliberating more than 15 hours over the course of two days. Many who supported Zimmerman, including Cindy Lenzen, 50, and her brother, 52-year-old Chris Bay--who stood outside the Sanford, Fla., courthouse when the verdict was read, thought the entire case was a tragedy, especially for Zimmerman. It's a tragedy that he's going to suffer for the rest of his life, said Bay. No one wins either way. This is going to be a recurring nightmare in his mind every night. Martin's mother and father were not in the courtroom when the verdict was read; supporters of his family who had gathered outside yelled No! No! upon learning of the not-guilty verdict. The teen's father, Tracy, reacted on Twitter: Even though I am broken hearted my faith is unshattered I WILL ALWAYS LOVE MY BABY TRAY. Trayvon Martin's brother, Jahvaris Fulton, said simply: Et tu America? ? a reference to the Latin phrase Et tu, Brute? known as an expression of betrayal. Meanwhile, Zimmerman's brother Robert said that with so many critics angry over the acquittal, his brother may never escape the social consequences of the shooting. He's going to be looking over his shoulder the rest of his life, he said on CNN Sunday. The jurors considered nearly three weeks of often wildly conflicting testimony over who was the aggressor on the rainy night the 17-year-old was shot while walking through the gated townhouse community where he was staying and where Zimmerman lived. None of the witnesses who were called had a clear view of their encounter. Defense attorneys said the case was classic self-defense, claiming Martin knocked Zimmerman down and was slamming the older man's head against the concrete sidewalk when Zimmerman fired his gun. We're ecstatic with the results, defense attorney Mark O'Mara after the verdict. George Zimmerman was never guilty of anything except protecting himself in self-defense. Another member of his defense team, Don West, said he was thrilled this jury kept this tragedy from becoming a travesty. Prosecutors called Zimmerman a liar and portrayed him was a wannabe cop vigilante who had grown frustrated by break-ins in his neighborhood committed primarily by young black men. Zimmerman assumed Martin was up to no good and took the law into his own hands, prosecutors said. State Attorney Angela Corey said after the verdict that she believed second-degree murder was the appropriate charge because Zimmerman's mindset fit the bill of second-degree murder. We charged what we believed we could prove, Corey said. The jurors' names have not been made public, and they declined to speak to the news media.