Language is not meaningless - even the federal Conservative cabinet?s Orwellian mask-language has meaning ? paid attention to. ?Democracy? in the mouths of Stephen Harper and John Baird and James Moore means increasing environmental irresponsibility, increasing government by private corporations, and the total disregard of Canadian wishes, on behalf of international finance and ?enterprise?.? The phrase ?fascism in Canada? suggests ? quickly and reasonably to most people - repression and public bullying, propaganda and disinformation the prime minister?s? statements are repeatedly proved false , programs of lies and subterfuge, unrelieved attacks upon unions, NGOs, advocacy groups and regulatory bodies protecting Canadian health and freedoms, increasing government secrecy, and ? tirelessly ? a Mainstream Press and Media which is more and more an arm of corrupt government. The profusion of attacks upon formerly-taken-for-granted democratic ideas, institutions, and practices confuses the population because no single one of the attacks overturns daily life for most people.? In the first case 2006 the Party he leads admitted guilt and paid a fine after years of denial and court resistance.? Since the second 2011 , the whole Conservative machine lives in denial as citizens organize and try to prove in law what they allege is Conservative criminality. Chief cabinet ministers reek with misdoings.? Peter MacKay began his leadership career by violating a signed contract ? publicly.? John Baird and Tony Clement engineered a $50 million siphoning of taxpayers money to fatten the pork barrel in Clement?s riding. James Moore announced his love of CBC and promised increased support as a prelude to sinking a dagger deep into the heart of the operation. The unelected overseers of growing ?fascist dumb-think?- the Prime Minister?s Office personnel - have just been exposed by the RCMP as having many hands on the corrupt attempted pay-off of Senator Mike Duffy.? We are told that only 14% of Canadians believe Stephen Harper was not the architect of the wrong doing. Finally, the faceless and graceless ?trained seals? of the Conservative government caucus are only slightly more embarrassing, perhaps, than the bloated, nearly one hundred unelected primed parrots of the PMO, a quarter of whom make $100,000 a year or more. Very plainly, the shift from a democratic parliament to a neo-fascist State in Canada is signalled by that strange operation which is nowhere mentioned as part of government in any constitutional document.? The PMO ? especially in the present regime ? is the mask-government, the real, unelected power fronting for private corporate rule in Canada. The unelected personnel of the PMO dictate policy and practice to the ?elected? Conservative Members of Parliament. When Stephen Harper and his supporters speak of ?putting the economy first?, that is Orwell-speak for following the agenda of the large corporations first, last, and always. Resistance to the idea that a fascist mentality operates at the top levels of Canadian government arises from several sources.? A main source of denial is, of course, the Conservative machine which, for instance, did everything it could as long as it could to deny wrongdoing in election practices. But other, legitimate sources resist the idea.? Many believe fascism has to produce jack-boots and concentration camps before it can be identified as present.? Others genuinely believe ?it can?t happen here? in Canada, and so dismiss the idea.? Still others believe that if an electoral system exists, democracy exists.? They couldn?t be farther from the truth. The idea of fascism the name chosen by Mussolini originally was to disregard the individual and individual rights in the exclusive interest of the nation.? It very soon, however, took the turn from which it has never changed. In 1921 Mussolini made chief allies of the landowners and the industrialists, and fascism has been ?corporatist? ever since, meaning, since then, a marriage of the State and corporations. Adolf Hitler, in the 1930s, famously united with the industrialists, forged a unified front with them, and fed them slave labourers until the defeat of Nazism. The first key to contemporary fascism is the unity, the amalgamation of purpose, and the solidarity of private corporations and government ? taking precedence over democratic, human, and civil rights.? That explains the federal Conservative government attacks upon fair elections, regulatory bodies, agencies to protect food and medical standards and the environment.? It explains, too, its unceasing attacks upon democratic assemblies NGOs, environmental groups, unions, etc. The federal Conservative government?s refusal to protect West Coast fish stocks, to do anything serious to regulate Tar Sands extraction, or to regulate the massive water and land pollution created by hydraulic fracturing fracking , and to allow the gigantic train disaster at Lac Megantic are ordinary characteristics of a government that sacrifices all human and environmental values to the desires of its profit-driven corporate partners. The Lac Megantic catastrophe was, quite simply, the product of Canadian Conservative government refusal to interfere with the profit-driven abandonment of the simplest safety precautions. Commentators on the Lac Megantic catastrophe sometimes reveal how successful the corporate brainwash has been upon them, remarking that the move to industry-based safety practices is a normal and reasonable move.? But, of course, it is neither normal nor reasonable. The whole process involving government abandonment of regulation is not only anarchistic insanity, it is also policy.? It is government, in fact, by corporations.? By permitting the Railway Corporations, in effect, to erect and police safety standards, the Conservative government is, in fact, doing nothing ? an invitation to unbridled violation of human rights and human decency. The Conservative government quotes changes and changes to safety regulation ? all of which are questioned by experts. The man I call the resident confuser of criticism for the Conservatives is at it again.? Hugging sentimentality, Fred DeLorey says The Hill Times, July 15, p.31 that he won?t get involved in ?politics? concerning one of the most important political events of the decade ? Lac Megantic!? Knowing that the regulatory agencies under the Conservatives are hugely undermined, he says with confidence that we ?must let the proper authorities complete their investigation?.?? Like his boss, Stephen Harper, he pushes responsibility off on an appointed body employed to support Conservative failure to protect. Green commentator Camille Labchuk on the same page of Hill Times fingers ?the ideology of deregulation?, pointing out it was the wonderful regulator, Transport Canada, which ?apparently gave MMA permission to leave unattended locomotives carrying ? hazardous materials?. Not surprisingly, a Vancouver Sun story of June 17, 2013 reports a huge failure to meet specific fish monitoring requirements and general industrial guidelines by most private hydro plant operations in B.C.? The story points to important failures to protect fish habitat. Larry Pynn, p. A7 ? Since no regulatory program is pursued strongly by governments and since violations are virtually unpunished, the private corporations permitted in fact by the B.C. Campbellclark governments seem openly contemptuous of both specific requirements and general industrial guidelines. Like the Lac Megantic disaster, the simpler, less trumpeted devastation of rivers in B.C. is a product of fascist mentality producing fascist policy.? To ignore that fact is to invite increasing devastation of the environment and increasing repression of resistance to it. Mussolini gave the name to Fascism in in the 1920s.? His model was both used and changed by Hitler?s Nazism in the 1930s.? Both Mussolini and Hitler instituted the idea of a single, key leader and maker of policy, called in Mussolini?s case ?Il Duce? and in Hitler?s case ?Der Fuehrer?.? The initiative might be equated somewhat to the present leader of the federal Conservative government choosing to speak ? not of the Conservative government in Ottawa but ? of ?the Stephen Harper government? or merely of ?the Harper government?. That little act of vanity and more deeply of policy to focus on a single source of power, a single law-giver, is an indication of? more dangerous directions taken.? And it points to the danger of unelected power groups who take real control of government. At the same time as the Conservative government of Canada is placing the Canadian population in excessive danger Lac Megantic, July 2013 , a strong move is afoot by giant investors to pump money into railway takeovers and the expansion of the rail carriage of dangerous liquids.? As if in a storybook tale, railways have been quietly taken over by some of the most powerful and thought by many to be the least responsible wealthy in the world. Major shareholders are now Bill Gates the CNR , Warren Buffet Burlington Northern Santa Fe , and Bill Ackman CPR .? They are keystones in the multi-billion dollar expansion of railways as fossil fuel transporters.? Very clearly, stern and actively policed regulation of railways in Canada is an absolute must. Behind the scenes a huge structure is being created to transport fossil fuels by rail in, through, and around Canada with at present a railway regulation system that is, in effect, almost non-existent.? The present Conservative government in Canada led by Stephen Harper, with a new minister of transport Lisa Raitt will ? we may be sure ? do everything it can to answer the demands of the railway corporations and to erase safety for Canadians ... ?placing the economy first?.? Lisa Raitt proved herself to Stephen Harper as someone quite willing to rape democratic rights.? She is famous, as minister of labour.? Twice she erased the democratic rights of unions so that corporate profit would be assured.? We may be certain that on her watch the safety of Canadians and the Canadian environment will come last as she makes railway transport a very profitable activity for some of the richest men in the world, outside Canada, of course. The definition of contemporary fascism places and explains what is called The Conservative Party of Canada.? Caught in continuing election fraud and irregularity, the Conservative government refuses to bring in changes put forward by Elections Canada.? The Conservative Party clearly intends, we may assume, to win another election by fraud.? That is wholly consistent with a fascist organization.? Though it seems to be a contradiction, a fascist state will use ?popular election? as long as it can ? however much it tampers with it and makes it? fraudulent.? ?Then the rulers can posture and prate about ?free societies? and ?democratic countries?.? It can pretend it is acting by ?the will of the people? ? as this Conservative government regularly insists it is doing. What Canadians see more and more is a parade of fraud and deception, of disinformation and lies, of government secrecy and of growing repression. All those things are undertaken to mask the corporate looting of Canada, the unregulated violation of the Canadian environment, and governmental sacrifice of the vulnerable ? whether the working people, the aged, the unemployed, or even the wounded and crippled military veterans being tossed aside by a brutal Conservative administration. All of those things are related.? Only the na?ve or the bribed continue to believe they are not all connected ? and intended. The name given to the overall program may stick in the throats of many Canadians who want neither to face the truth nor to take up the battle that has to be fought.? But the program is, like it or not, a fascist program tailored to the contemporary world as it exists in Canada. ?Close to the edge.... We get up, we get down... ?If one reads page 6 of the below PDF file......First off, the below linked PDF was written before Shinzo Abe secured his grip on power in Japan`s election yesterday...Shinzo Abe now has a strong majority...And written here on several occasions, Shinzo Abe is fast tracking the restart of Japan`s nuclear facilities.. In the below report, they specifically state that Japan as a LNG market, Japan`s current use of LNG could decline by 67% or more depending on how much of their nuclear power is brought back online... page 6 The below report also states that future LNG estimated demand from China is in doubt, the reason for that doubt is....? China has vast domestic supplies of shale gas and no one knows for sure how aggressively and how fast China will develop their domestic gas reserves.. page 6 of the below PDF As written here in past posts, Japan needs their nuclear utilities online for economical reasons, the economic cost to Japan`s ruling Government in raw $dollars is $20 billion dollars annually, and about 600,000 domestic jobs in Japan will be lost if the nuclear industry isn`t restarted, not to mention energy insecurity and high priced electric bills for average Japanese people, ...Like here in British Columbia, the more money we spend on hydro electric bills and car fuels the less money gets spent in the overall economy, the public will cut back in other areas, Japan has already seen the domestic pullback.. As for China developing their own vast reserves of shale gas, that was forewarned here some time ago too...In this viral post.. So here`s the deal, the real deal, there are LNG export facilities coming online around the world, Australia, USA, east Africa, more Russian and Qatari supply coming online, Israel LNG, Mozambique..More natural gas coming from the Stan countries, developing all this supply was predicated on several factors, the most important, only 6 year to 8 years ago the world thought the USA would be a huge market for LNG imported LNG into the USA ...That market is caput, a dozen inport LNG regasification plants were built to receive this gas, they were all but shuttered before most were even completely built, the American shale gas fraccing revolution destroyed a market the world`s LNG export countries were depending on before it even started... The import plants are now being converted to LNG export plants, thus giving the USA a monster sized economic advantage over any Canadian LNG development.. The LNG exporting countries also didn`t account for China discovering the world`s largest reserves of natural gas, a 400 year supply situated in mainland China..That monkeywrench is still an unknown quantity.. But then the LNG exporting countries caught a break, it was a great break for them but bad news for Japan and the world, no one anticipated the Tsunami ? and earthquake ? at Fukushima....That caused Japan to shutdown all their nuclear facilities... Funny coincidence eh?...Japan`s nuclear disaster was a saving grace for LNG exporting countries, and wannabe LNG exporting countries, for Japan absorbed the majority of the LNG glut on the market, that glut was created by the USA suddenly finding itself awash in domestic gas... and now the USA is a dead market for imported LNG....Had the USA not gone fraccing crazy that glut of LNG would have never developed.. Conspiracy theorists could go nuts with those implications, a Japanese Nuclear accident ? and shutdown to save an LNG industry?...Well, I`ll leave that conversation for another day.. So, Japan`s disaster saved LNG exporting country`s bacon albeit temporarily , but now.. But now Japan is going full-nuclear restart, therefore we again have, and will have a massive glut of LNG on the market with even more capacity coming online over the next few years, in other words.. There will be more gas sellers than buyers....And we have Japan/Korea and China now developing, R&Ding and exploring the potential of ocean methane hydrates...There is more ocean methane hydrates available than any other source of fossil fuel..A 500 year supply minimum.. So let`s recap....The world LNG exporting countries geared up for a big USA market for their gas...That market collapsed before it began. Unfortunate events at Fukushima was a godsend for all those LNG exporting countries, Japan bought up most of the excess supply that was originally intended for the USA... However, the cost was and is to great for Japan, ...Japan can`t afford not to restart the nuclear electrical utility companies, they will indeed restart all of and possibly build even more nuclear plants.. The combination of these events, the combination of excess supply of gas now and even more supply coming online very soon...With the medium term outlook for LNG demand flat and or negative.. And the fact that the big energy companies who already own LNG plants, who have more LNG exporting plants coming online very soon as no less than 12 monster LNG facilities are near built..These are the very same energy companies kicking the tires in British Columbia and the USA...And the USA has that pre-existing facilities built already advantage.. This series of events has cast very serious doubts anything will get built in British Columbia, do the energy companies want to create even more supply to compete with themselves?????..That is doubtful.. Which brings me to the reason for this post...What took the energy experts so long to figure it out? And...The only way anything gets built in British Columbia is...is if we offer a taxation and royalty structure so attractive to the energy companies...Well, anything that attractive to the energy companies means British Columbia won`t... We won`t pay off our BC debt with LNG, we won`t pay off BC Hydro debt, BC Ferry debt, we won`t eliminate sales tax and road tolls, Christy Clark`s $trillion dollar fantasy and prosperity fund worth $hundreds of billions of dollars to future generations promised was nothing but pixie dust and wishful thinking.. All of that pre-election hooey is off the table and today, 9 weeks after the last B.C. general election the big LNG climbdown begins..All those new hospitals, new funding, our roads paved with LNG gold, all debts, tolls and sales tax eliminated, all crown corporation debt paid off, all those election promises are now nothing but ancient hyperbole spun.. Ross K gave me the early hint.. Go have a look ..Link below. Rich Coleman had a op-ed piece published in the Vancouver Sun, no questions asked or answered, only Rich Coleman talking vague terms...But what struck many people, people who have been paying attention was this utterance by Rich Coleman.. Like other jurisdictions have done, we intend to create a Prosperity Fund into which revenues from our natural gas sector will flow and will help eliminate B.C.?s debt... According to LNG minister Rich Coleman, LNG will now only help eliminate B.C.s debt The big climbdown has begun, we have gone from a $trillion dollars to help... Here is some information from a much earlier Straight Goods posting.. LNG facilities are currently proposed by business groups that include some of the world`s biggest energy companies-Shell, Imperial, Chevron, British Gas, Petronas, SK & and ES of South Korea, Inpex and the Chinese National Offshore Oil Corporation, to name some of the major players, it`s no fantasy. The projects mean 39,000 jobs to British Columbia during construction with another 75,000 full time jobs created once in operation. We can create 1 $trillion dollars in economic activity and create the BC Prosperity fund with $100 billion over 30 years. An opportunity this good faces lots of global competition. Premier Christy Clark and Today`s BC Liberals have worked diligently to enable LNG as an economic generator for decades to come. There is the smoking gun evidence, from the BC Liberal platform...39,000 construction jobs and 75,00 full-time jobs once in operation.. That whole number thing seems backwards from the git-go, normally there are more during construction jobs than the full time after everything is built job numbers.... Do you see those job numbers in the BC Liberal election platform... 39,000 jobs to British Columbia during construction with another 75,000 full time jobs created once in operation How many LNG plants are being proposed, we have heard these Liberals say 4 LNG plants, 6 LNG plants, 8 LNG plants... Well, there was an article in the Vancouver Sun earlier this year, the BG Group British Gas announced they are going to the planning stage, then if that goes well they will apply for an environmental assessment, no they haven`t made any firm commitments, it`s still very early in the process, they mention something about, if everything goes well they will start assembly of their LNG plant in 2016.. But what is absolutely startling is the honesty in the article, honesty from a major world class energy company.. What British Gas has stated in the article is this... The BG Group has filed plans for a liquefied natural gas plant at Prince Rupert that would consume the equivalent to all of the province?s current production of natural gas and almost all the energy generated by BC Hydro?s proposed Site C dam to produce it. Do you see that? This one LNG plant will consume all the present natural gas production in British Columbia, that`s not the scary part, what is stated in the article puts Christy Clark and Today`s BC Liberal`s jobs number to shame, this article makes a complete mockery of what the Liberals are stating in their 2013 election platform.. BG intends to build a facility on Ridley Island capable of producing 21 million tonnes of LNG a year. Called Prince Rupert LNG, it would be built overseas in modules and shipped to Prince Rupert for assembly. ?Even so, the plant would create 3,500 jobs during construction, ?250 permanent direct jobs and another 250 spinoff jobs. ?BG says it is planning to build it in two phases, beginning in 2016. The first phase ? two seven-million-tonne-a-year processing units, or trains ? is to be completed by 2021 ? Do you see that?....3500 temporary construction jobs, 250 full-time jobs with 250 full-time spinoff jobs... Ok, one last recap...The amount of jobs associated with LNG is a lie, now the amount of revenue is being slashed before anything is even built, in Christy Clark`s and the BC Liberal`s 2013 election platform they suggested strongly that our BC Debt would be eliminated and $100 billion also would be placed in a prosperity fund, and now 2 months after our election LNG revenue over 30 years will only help eliminate B.C.`s debt whatever that means You can read Rich Coleman`s blather at the below link if you like..No questions asked, no details given, no shovels in the ground now, no companies are even deciding whether or not they will build for at least few years, Rich Coleman is wrong with his unchallenged statements in that article, especially about the Japanese market.. And that is precisely why our mainstream media is useless, why Palmer and Baldrey are stooges, why Bill Good and Sean Leslie are paid BC Liberal pom pom girls...They haven`t got the balls to tell.. ?Today and this week in question period the opposition NDP tried to make hay with new revelations into the ethnicgate scandal... I wrote this post about Dyble`s report, in this post I asserted correctly that the BC Liberal`s had engaged and employed the ethnic outreach plan, a plan to use public dollars for party work....I clearly stated that the plot was not only thought of and contemplated but fully implemented.. I wrote many posts at the time, I highlighted how the Burnaby hospital scandal was part of ethnicgate..How Christy Clarking stating she was a Filipino was part of ethnicgate, and how the fake Bollywood awards was part of ethnicgate, I wrote in multiple posts that ethnicgate was not only an idea but tens of thousands of public-paid for man hours went into implenting every aspect of it.. ?Way to go NDP, .....Read the shocking linked story above...Read the shocking story below... There was already smoking gun ethnicgate information available and proven in these two posts, unfortunately Adrian Dix and his election campaign ignored this information, they refused to act on this information during the election, they knew better, ,,They The NDP Party brass, and MLA`s ignored my numerous emails, ignored my passionate postings, they refused to acknowledge I even existed, yet everyday the NDP sent out emails to me asking for money, I talked to hundreds of readers who were also ignored, and asked for money, money and moe money...tsk tsk, we don`t want your advice or opinion, however send a cheque..money order or credit card number..blah blah blah.. Excuse me, so now 4 years from the next election and you want to peck away about ethnicgate...I don`t care, the issue is dead, you blew it Adrian Dix, it matters not now...Your time would be better spent asking about LNG, when is something going to be built, how much money will we receive, what is the royalty structure...Everything in BC is dependent upon $hundreds of $billions of dollars flowing to BC from LNG..Health services funding, education funding, debt and deficits, bridge tolls, the survival of BC Hydro, every burning issue in British Columbia is answered with LNG revenue will fix all...There are a ton of informative posts on LNG on this site highlighting all the problems, from pricing, from demand, market forces, new price structures, world capacity under construction, world competition, employment numbers associated with LNG plants, 250 employees per plant... I suggest NDP you concentrate your efforts on LNG...All our provincial eggs have been put in one basket...Your whining about ethnicgate now is a slap in the face to everyone who fought during the writ...The Straight Goods fought tooth and nail, you Adrian Dix rolled over and scratched your belly. And now the entire province will suffer and live under a corrupt corporate entity, seniors will suffer, students, workers and the environment, all because you knew better than us history writers and how you enjoyed scratching your belly.... It all seems so pointless, ethnicgate, Basi n Virk scandal, BC Rail, BC Hydro deferral accounts, BC Ferry fiscal nightmare, E Health waste, the assault on public education and teachers, Pacific Carbon Trusts scam, ever increasing MSP premiums, ICBC/BC Hydro/Ferries management run wild, CLBC, wheelchair fees, hospital scandals, needless hospital deaths, asset sales to claim bogus balanced budgets, balanced budget claims while debt rises by near $5 billion dollars a year..Cabinet ministers Bloy, Yap, Bennett, Coleman and many many more lie like rugs, all the while a beholden to Government advertising media talked of memogate and greased weasels, talked of LNG $trillions.....A BC Liberal party and Christy Clark who took the the sport of lying by numbers to artform.. And now Adrian and Co. want to drum beat on multi-culturalism Liberal public dollar theft and fraud...Talk to the families of those who had family members killed in hospitals, talk to the families of injured workers who WCB left with nothing, talk to Alexandra Morton about the plight of wild salmon and environmental crimes committed by the fish-farm industry, talk to those fighting tooth and nail to protect our province from Enbridge river and water destroyers.. Those are the heroes, the fighters, along with online writers and bloggers who gave their souls, wrote millions of words making the case for justice, for change for direction anew, ....All those issues are still here, still unresolved, ethnicgate was a crime of a few dollars stolen and party votes meanwhile the real crimes and criminals are still ongoing and active, and still ignored by a lost opposition...An NDP opposition who has lost their way, afraid to speak up against fish farms , to cowardly to fight for wild salmon, no courage to drive public monies for river habitat restoration. I have to congratulate John Dyble`s for his ethnicgate review, it was very thorough, hard hitting , to the point, names names, however, an investigation into a three legged stool scandal where you have only an ability to interview and question but one of those legs is an exercise in futility, we are left thirsty for more, a mere appetizer offered when the public required a full meal, Dyble`s report points two other directions , it points to caucus, it points to party, Dyble had no ability to interview caucus or cabinet, he had no ability to interview the party, and most troubling is Dyble had no ability to interview Mike MacDonald, Christy`s campaign chair, her election guru and the former top staffer in Christy Clark`s office, Mike MacDonald was there at the time this ethnic planning document was created and distrubuted, it came across his eyes at a minimum.. What we do know, Brian Bonney on the public dime sent 1100 emails, on 3 different private emails accounts, he fired them off to the BC Liberal party, to caucus and more, Dyble had no ability to interview any of those email recipients..Brian Bonney and family were busy paid operatives. We also know there were ethnicgate committee meetings where fruits of the planning documents were sent to the Liberal party, to Fiera Lo and other members of the Liberal party, we know the ministry of multiculturalism was actively implementing the ethnicgate strategy, how do we know that, simple.. Harry Bloy was minister of multiculturalism when this scandal was hatched, he was minister when members of that ministry started implementing the plan, the proof is simple, if the planning document wasn`t acted upon at that time, at the time Harry Bloy was minister the plan and evidence wouldn`t have existed when John Yap became minister...Harry Bloy had to resign as minister for a different email scandal, this was well after the ethnicgate planning document was created, Bloy resigned, John Yap took over, in John Dyble`s report John Yap was aware of the plan, John Yap approved hiring workers and on the Government dime, these operatives were actively working on this sleazy project, lists were created of peoples who attended ethnic events, these lists were passed onto the BC Liberal Party, that confirms this plan was not only in full swing it actually bore products, the fruits of their labour were realized, the BC Liberal caucus no doubt is sitting on and probably using the fruits of the ethnicgate plan, that being lists of ethnic people, ethnic voters.. You can`t undo damage done, a liken it to robbing a bank, an inside job, you get caught, a couple of minor heads roll but your friends keep all the money.. John Dyble had no ability to interview Mike MacDonald, Christy Clark`s top staffer, the man who is leading Christy Clark`s election campaign, a man who was top dog in Christy`s office when this scheme was hatched, he was emailed the document, how Christy Clark could not of known what was going on, it boggles the mind, and that`s the failing of John Dyble`s investigation in a nutshell, a scandal-filled review where people were hired for the project, email in the ministry of multiculturalism were found advising those working on the project to use private emails and write nothing down..That`s proof that the ministry knew what they were doing was wrong, the ministry took extraordinary steps to hide their activities, so indeed the plan was being executed.. There are questions about the timing of family day, different from the rest of Canada, and it did fall on Chinese new year, there is also the fake Bollywood awards, we know the Liberal Government asked the real Bollywood awards show to move their traditional awarding date in June to April, they refused and all of a sudden we are paying $12 million dollars to host a first inaugural award show, it seems to have been created for a quick hit, a quick political win..Exactly what is described in the planning document. Again, fruits of their labour, a well-advertised Bollywood event where stars from India come to BC just weeks before our election, in that contract there are provisions for photo-ops with the Government, with Christy Clark and MLA`s running in our election, this is exactly what the ethnic planning document talked about, in that document there was a particular point highlighted, from the planning document, and I`ll quote the line.. Bollywood awards show qualifies...Again the BC Liberal party gets the benefit, John Dyble`s investigation can`t take back the products produced, no subpoena powers, he can`t compel testimony, he couldn`t interview cabinet, he couldn`t interview the BC Liberal party, he couldn`t access any of their emails or documents, nothing, no ability to take back the forbidden fruit. John Yap should resign from Government, immediately. I commend John Dyble for sawing and chopping down that one legged stool, however this is a three legged scandal! One leg of a three legged stool,? you know what happens to a one legged stool, it crashes to the ground. We need an RCMP investigation with subpoena powers, even if that investigation isn`t concluded before the election it is required. And on a more somber note, our BC Government already has at its disposal over 200 hired persons known as public affairs, they churn out press releases they monitor media, internet, newspapers, they phone into radio shows, they freep polls they go on comment threads, partisan media spin doctors, over 200 of them and now this Government, Christy Clark`s Liberals have gone to the line that separates a totalitarian Government from a Democratic one, a Government where entire ministries are employed to subvert people, to woo them, propagandize them, how many, 200, 300 entire ministries dedicated to maintaining power, how close have we come to the edge, up to, on it, or have we already gone over..