The future King, who will be third in line to the throne, is named George Alexander Louis with an official title of His Royal Highness Prince George of Cambridge. The couple are understood to have had a few ideas for names in mind but it took a few days for them to finally confirm which one was right for their son. The happy couple had been expected to pick a traditional royal name for their son, who was born at St Mary's Hospital in London, weighing 8lbs 6oz, but the decision was left completely up to them All three names picked were said to be chosen because both Kate and Wills liked them. The name George has remained the bookmakers' favourite in the name-guessing stakes from the moment Kate's pregnancy was announced with William Hill revealing that it was the favourite ahead of James and Louis. The name George is synonymous with British kings, with six having previously worn the crown. Also, there has only been one other Prince of Cambridge and he was also called George. George is also the fourth name of the Prince of Wales - the baby's grandfather. The name means farmer or earth worker and was the 12th most popular name for boys born in England and Wales in 2011. St George, a fourth-century Christian martyr, is the patron Saint of England and represents honour, bravery and gallantry, while the legend of George slaying a dragon and rescuing an innocent maiden is medieval. George is also the fourth name of the Prince of Wales - the baby's grandfather Alexander is a popular Scottish name, where Alexander III was regarded as one of the country's greatest rulers. Louis has deep significance in the Windsor family in honour of the Prince of Wales's favourite uncle Lord Louis Mountbatten, who was killed by the IRA in 1979. Mountbatten and William's father the Prince of Wales were very close, with Charles regularly confiding in his relative. He was known by the Royal Family as Uncle Dickie and was assassinated by the IRA in August 1979 after his boat was blown up on a fishing trip off the coast of County Sligo, Republic of Ireland. Louis is also the last of William?s three middle names.