MOSCOW AFP ? ?President Vladimir Putin on Wednesday said Moscow's relations with Washington outweighed the squabbles over a spying scandal revealed by US fugitive Edward Snowden, who has applied for asylum in Russia. Relations between states are much more important than squabbles surrounding the work of security services, Putin was quoted as saying by the RIA Novosti news agency. Putin's remarks came after the White House voiced opposition to Snowden's request for a safe haven in Russia as he tries to evade US espionage charges. The former National Security Agency contractor has been marooned at Moscow's Sheremetyevo airport since June 23 after leaking details of a massive US surveillance programme that has strained ties with Washington's allies. Washington has rubbished the notion that Snowden could be viewed as a human rights activist and has criticised Moscow for providing the 30-year-old with a propaganda platform . We believe there is ample legal justification for the return of Mr. Snowden to the United States, where he has been charged with serious felonies, White House spokesman Jay Carney said Tuesday. We want to continue the US-Russia relationship unimpeded by this issue, Carney said. And we believe there is a way to move forward here that allows for Mr. Snowden to return to the United States... and for Russia to resolve this situation that they have been dealing with now for three weeks. On Tuesday, Snowden filed an application for temporary asylum with the Russian migration service, starting a process that could take up to three months. Putin, meanwhile, reiterated his earlier stance that Snowden would only be welcome to stay in Russia if he did not harm the United States with further leaks. We have warned Mr. Snowden, that any activity on his part that has to do with harming Russia-US relations is unacceptable for us, Putin said Wednesday. This is his fate and his choice, Putin said of Snowden's request to stay in Russia. We have our own state interests, including those directed at building Russia-US relations.