Over the last four years, Skittles has enjoyed an?enviable social-media presence???with some 25 million followers?on Facebook?and more than?100,000 on Twitter,?it?s one of the highest-profile brands on the web.?But since Skittles? last posts on July 13th, 2013 the prolific rainbow-colored candies have retreated into their hard shell, becoming suddenly and eerily Tweet-free and utterly silent on Facebook. That day, of course, was the same that George Zimmerman was acquitted in the shooting death of Trayvon Martin, who was carrying only a bag of Skittles and a bottle of iced tea at the time of his killing. Surely, one factor in Skittles? grip on market dominance ? ?they are the single most popular candy on the market with teens and younger children ??is the company?s tireless social-media strategy: never taking a day off from posting?at least one or two clever witticisms. Not on Christmas, not on New Year?s Eve, not ever. A Tweet from @Skittles on May 10th: ?Do pole vaulters keep their equipment in a pole vault?? Back in late March, the New York?Times?noted?that?L?Affaire Zimmerman had turned a previously innocuous confection into a cultural icon symbolic ?of racial injustice that underscores Trayvon?s youth and the circumstances surrounding his death,? as well as a means to protest both. Activists initially flooded the Sanford, Fla. police department with mailed-in bags of Skittles to object to its slow response to the Martin killing. Then, Skittles began to show up in huge piles at makeshift memorials. Soon, traditionally black colleges, like Spelman College in Atlanta, began buying them in bulk to fundraise for the Martin family and other charities associated with Martin?s death. It?s not known just how much of a sugar rush in sales Skittles has seen, or how much more profit it means to Wrigley?s parent company Mars, or even why it has suddenly decided to stop Tweeting and posting on Facebook, because a spokeswoman for the Wm. Wrigley Jr. company, Caroline Sherman, declined to address these questions. However, in an email that echoed it?s earlier sentiments, Ms. Sherman wrote that ?Wrigley maintains the position that it?s inappropriate to get involved or comment on the situation.? This is, of course, the usual go-to plan from almost any crisis PR pro?s playbook: Say nothing, or risk being damned no matter what you do. Donate money, and supporters might complain it?s not enough, while those who backed Zimmerman?s acquittal will argue that nary a penny should be spent. Say something, and supporters will accuse a faceless company of speaking out too late, while detractors will object to a self-aggrandizing move designed to fan sales and exploit the situation. ?They?ve made an assessment that anything they say could be taken out of context?and be blown up in the news,? said Michael Sitrick, a nationally renowned crisis PR specialist whose Sitrick & Co. has represented beleaguered clients as diverse as singer Chris Brown and insurance giant AIG. ?I agree with them: We haven?t heard if other charges might be brought or other lawsuits filed [against Zimmerman]. The risk/benefit analysis is: ?Is the benefit worth the risk?? and given how sensitive it is, it?s not. No one can criticize something [Mars]?didn?t?say,? Sitrick explains, adding, ?That [Skittles] have become a symbol for protesters and activists is all the more reason they should stay quiet, at least for the next two or three weeks. Right now, the wound is too fresh and new.? Playing possum online is not tenable in the long run for Skittles, but it may not even be viable in the short run, either: In a fascinating piece on Buzzfeed yesterday called ?The Secret Power of Black Twitter,? Shani O. Hilton detailed how many disgusted African Americans fanned out on the online social networking service to crush a George Zimmerman trial juror?s book deal in record time. Social media has raised the stakes when it comes to accountability for any brand, but the combination of Skittles mammoth online presence and African Americans over-indexing on Twitter black folks make up 14 percent of the US population, but account for a quarter of all users on Twitter means there is there is much more on the line than just this or next quarter?s profits at Mars. The very reputation of Skittles is at stake. Some social activists had already begun to urge a re-examination of the quick embrace of Skittles in the hope of forcing Wrigley to use money from its foundation to support causes linked to Trayvon Martin?s killing, if not the Martin family itself. Twitter might just become their lever to make that happen. Still, there?s also a public health ramification to turning an already wildly popular candy like Skittles into an instrument of social justice: African American girls are 80 percent more likely to be overweight than similarly aged white girls, per the Dept. of Health and Human Services. When its Office of Minority Health looked at?children and adolescents between six and 17 years of age, it found that?while fewer than 15 percent of white kids were obese, more than one in four black kids were. The health implications of a disproportionately black obesity epidemic are already staggering. Almost a fifth of all?African Americans?aged 20 or older have?diabetes.?The American Heart Association says more than 40?percent of American blacks have high blood pressure, and the HHS found?African American?adults are 60?percent more likely to suffer a?stroke?than white Americans. With their ?Taste the Rainbow? motto and bright colors, Skittles always conveyed youthful innocence and fun. But ever since the acquittal of Trayvon Martin?s killer,?they?re becoming an increasingly bitter pill. Yes they have a social responsibility, their impression that they give corporately is that they support equality vie their message taste the rainbow - be that a statement simply to sell candy, it has worked because they are? perceived as unbiased against people of colour, ie people of all hues of the rainbow and have benefited from that support, greatly. It behooves them to support justice for Trayvon imho. that isn't to say that Zimmerman is guilty, I do not know that, what I do know is that it should NEVER HAVE HAPPENED! We have to avoid it ever happening again and to that end Skittles has a social responsibility, WE ALL DO! There are certain brands that blacks favor and become identified with the black community. The same is true with the gay community. Skittles has become a symbol of black solidarity. A bag of Skittles makes a political statement. Is this what the manufacturer wants to happen? Let's wait six months and look at Skittle sales. My guess is Skittle sales among 2nd Amendment supporters will go straight into the toilet. There are ten times as many dedicated gun owners than there are supporters of Trayvon Martin.?