SALT LAKE CITY ? Nearly 33 years ago, Johnnie Mae Martin's teenage son was shot and killed by a serial sniper targeting Jews and blacks in a cross-country killing spree. David Martin, 18, and Ted Fields, 20, died Aug. 20, 1980, in Salt Lake City's Liberty Park. They drew the sniper's attention because they were black and they were jogging with white women. Joseph Paul Franklin was convicted of killing the two men and violating their civil rights, as well as killings in other states. He was sentenced to six life terms in prison, and in 1997 was put on death row in Missouri for a killing there. Three decades of pain rushed back Saturday night when Johnnie Mae Martin heard the verdict in George Zimmerman's trial for the death of Trayvon Martin, the Florida teen killed last year: not guilty. It's hard, she said softly, drowned out by more than 150 demonstrators who gathered Monday, carrying signs decrying racism, police brutality and racial profiling. I know what the Martin family is feeling tonight, she said, wiping perspiration and tears from her face as she rested in the shade. Their son will never come home anymore. They won't hear his voice in the house anymore. But he's there in spirit, and I would just like to see all of us come together. The crowd was diverse, with faces of all ages and colors rallying under the same message. Justice for Trayvon, they shouted. No justice, no peace. Word about the rally spread on social media and from friends, and the crowd lined the sidewalk and cheered as many drivers on State Street honked, waved and shouted support out their car windows. It was 99 degrees downtown, but University of Utah student Kevin Shaw stood silent in the crowd in a black sweatshirt, the hood over his face. I'm kind of quiet, but this is one way I can quietly show my support, he said. I'm here because I'm passionate about justice, and I don't think justice is being done. I hope that our society will wake up a little bit. Prominent Utah activist Tim DeChristopher was also in attendance, walking with the group as they circled the courthouse and blocked three lanes of traffic in their march down 400 South. DeCristopher declined to comment, referring instead to those who addressed the crowd. The opinion in the crowd was clear. The group attributed the killing to racial profiling, decrying the stand your ground self-defense law and the legal system that acquitted Zimmerman of murder. George Zimmerman, guilty, they shouted. The whole damn system, guilty. Monday's rally was the latest in a series of demonstrations occurring across the country, some on a grand scale. Darius Gray, a longtime Salt Lake City resident, joined the rally because he believes it is important for Americans and Christians to come together peacefully and stand for something. While the courts made their ruling in Florida, and we must abide by the ruling, an injustice was done, he said. All life is valuable, whatever race, ethnicity or gender. We are all children of the same Heavenly Father. Gray worries that a pattern of injustice is continuing in the U.S. against young men of color. That is troubling, he said. What further matters is how we address it, and what we do. ? It's important we approach it in love, with the idea always to have dialogue, meaningful dialogue. But for Johnnie Mae Martin, race is no longer a question. When we look at each other, it's just like looking at a beautiful flower garden, a beautiful bouquet, she said. My prayers are that we come together, just come united. That's all. Email: mromero@deseretnews.com