With a prayer rally planned for tonight in the aftermath of George Zimmerman's acquittal in the shooting death of Florida teen Trayvon Martin, local civil rights activists and other leaders urged participants to remain peaceful as they express their frustration with the trial's outcome. Violence does nothing to help Trayvon and the Martin family get the justice they deserve and only distracts from the thousands of Americans who have signed petitions urging that the Justice Department pursue federal charges, Rep. Karen Bass, D-Los Angeles, said. Our focus should continue to be on peaceful mobilization and active participation toward solutions. That's the best way to support the family during this very difficult time. U.S. Attorney General Eric Holder has confirmed the Justice Department is considering whether to pursue federal civil-rights charges against Zimmerman. Local civil rights leaders are calling on Southland elected officials, including members of the Los Angeles City Council, to support a resolution urging Holder to pursue such a case. The Los Angeles City Council, by fast-tracking a resolution demanding a federal prosecution of Zimmerman will send the strong message that Los Angeles city officials regard the violation of Martin's rights and that of any other citizens as inviolate, according to Earl Ofari Hutchinson of the Los Angeles Urban Policy Roundtable. After a series of weekend protests in the Southland that put police on tactical alert in response to the Zimmerman verdict, Mayor Eric Garcetti cut short an East Coast trip and planned to return to Los Angeles this afternoon. Meanwhile, a prayer rally was planned for 6 p.m. at Leimert Park. Activist Najee Ali, who helped organize the event, said he has conferred with Bass and is encouraging participants to remain peaceful. She's very concerned it could easily spiral out of control, Ali said. Outsiders have come into our community who are extremists and are trying to take advantage of the situation to promote violence and vandalism. If you want to protest the verdict, do it legally -- don't cause disruption. Ali said of tonight's rally, There will be no marches. Just a prayer rally. He noted that he and Bass lived through the 1992 Los Angeles riots. We want to show leadership and speak out with the police to prevent anything like that from happening again, he said. A series of marches and protests occurred in the Los Angeles area over the weekend, and although they were largely peaceful, police wound up making about nine arrests at various demonstrations, and there were some reports of protesters throwing bottles and rocks at police. Six people were arrested overnight during a protest that occurred in Hollywood -- one on suspicion of assault with a deadly weapon and five for allegedly failing to disperse, according to LAPD Officer Gregory Baek. In early demonstrations, one person was arrested for alleged battery on a police officer -- although the officer was not injured -- and two others were arrested on suspicion of inciting people to riot, Baek said. During the Hollywood protest overnight, marchers pushed their way into the lobby of the W Hotel before marching to the CNN building at Sunset and Cahuenga boulevards. Participants chanted and carried signs, some with photos of Trayvon Martin. At one point during that demonstration, officers fired bean- bag rounds into the crowd.