CAIRO ? At least 51 people were killed and more than 300 injured when Egyptian soldiers and police clashed with Islamists early Monday at a sit-in by supporters of former Egyptian president Mohammed Morsi, raising the specter of civil war. Interim leader Adly Mansour issued a statement Monday expressing deep sorrow over the deaths and calling for self-restraint in the interest of the nation. Significantly, the statement from his office echoed the military's version of events, noting that the killings followed an attempt to storm the Republican Guard's headquarters. Mansour, who was named to the interim post by the Egyptian military after Morsi's ouster last week, said in the statement read on national TV, that he had ordered an investigation into the deaths. The head of Egypt's emergency services announced the new death toll Monday from the confrontation outside a military building in Cairo. A government spokesman said two police and one army officer were killed in attacks by supporters of the deposed president. The Muslim Brotherhood said that the death toll included five children. Morsi supporters said the security forces fired on hundreds of demonstrators, including women and children, at their sit-in encampment outside a Republican Guard building as they performed early morning prayers. They opened fire with live ammunition and lobbed tear gas, said Al-Shaimaa Younes, who was at the sit-in. There was panic and people started running. I saw people fall. The military said people tried to storm the building in Cairo's Nasr City. But Brotherhood spokesman Gehad El-Haddad, who was at a sit-in with his family near the violence, said security forces fired on peaceful demonstrators. The exact course of events Monday remains unclear, but the Brotherhood's political arm has called on Egyptians to rise up against the army, a move that threatens to divide further a country that is already deep in crisis. As tensions rose, Egypt's top Muslim cleric warned of civil war and said he will go into seclusion at his home until the bloodshed ends as a show of protest. Sheik Ahmed el-Tayeb also called for the transitional period that began following last week's ouster of the president to be limited to six months. In a statement he said he will go into seclusion until everyone shoulders his responsibility to stop the bloodshed, instead of dragging the country into civil war, the Associated Press reports. El-Tayeb is the grand imam of the Al-Azhar Mosque, the world's primary seat of learning for Sunni Muslims, the vast majority of the world's Muslims. Police and military attacked people outside the Republican Guard facility as people were praying, firing rounds of live ammunition and shotgun pellets, El-Haddad said on his Twitter account. Many shots were aimed at the feet, resulting in a lot of leg wounds, he said, and security forces fired tear gas into the crowd in an attempt to disperse protesters. Military spokesman Col. Ahmed Mohammed Ali said initial information indicates that gunmen affiliated with the Brotherhood tried to storm the Republican Guard building shortly after dawn, firing live ammunition and throwing firebombs from a nearby mosque and rooftops. A statement by the armed forces carried by the state news agency said an armed terrorist group tried to storm the building, killing one officer and seriously wounding six. The statement said the forces arrested 200 attackers, armed with guns and ammunition. The wounded were taken to a field hospital set up in the area. This is a crime against humanity, said Hesham Al Ashry, an ultraconservative Islamist who was protesting but left the area before violence broke out. Pro-reform leader Mohamed ElBaradei condemned the violence and also called for an investigation. Peaceful transition is the only way, he wrote on his Twitter account. Last week, military officers killed four Brotherhood demonstrators, who were unarmed, in the same location as Monday's violence. The military has a history of using excessive force to quell demonstrations. One of the most brutal cases took place in October 2011 in an area of Cairo called Maspero. The military ran over some demonstrators with military vehicles at a mainly Coptic Christian rally. Twenty-seven people were killed, including a military officer. Monday's violence heightens the conflict between the military and Morsi supporters, who call the military's move to oust Morsi a military coup. They have refused to stop protesting until Morsi is released from detention and reinstated as president. Egypt's opposition believes the army's move to set the nation on a new transitional path ? suspending the constitution, dissolving the legislature and appointing a new interim president and government ? was justified and backed by popular support. But many in the pro-Morsi political camp believe all the votes they cast over the past two-and-a-half years have been stolen. They have been staging a sit-in since last week. We only came here to defend our vote, said Nassser Ibrahim, a teacher, at a pro-Morsi rally Sunday afternoon not far from where Monday's violence erupted. The shootings come at a fragile time in Egypt's transition after Morsi was ousted from power last Wednesday and threaten to unhinge a delicate political system. Egypt's Nour Party ? a hard-line Islamist group ? said Monday that it was withdrawing from negotiations over who will be named to the new government in response to the massacre. Prior to Monday's violence, the party recently rejected the appointment of liberal figure ElBaradei as prime minister. The group's recent withdrawal from talks threatens to further stall, or even paralyze, the new transition. As tension between opposing political camps rose over the last week, dozens have been killed in clashes. One of the highest death tolls came after clashes broke out last Friday nationwide without much interference from security forces. Neither the police nor the military effectively intervened in deadly clashes between pro- and anti-Muslim Brotherhood supporters that left 36 people dead on July 5, 2013, Human Rights Watch said. Contributing: Associated Press