LONDON ? The Prince of Cambridge has a name: George Alexander Louis. Clarence House announced Wednesday the newborn son of Prince William and Duchess Kate will be known as HRH Prince George of Cambridge, with Alexander and Louis as his second and third names. A PRINCE IS BORN: The royal baby arrives Little Prince George of Cambridge, meanwhile, was off to his maternal grandparents' home in the English countryside Wednesday after first being introduced to his great-grandmother Queen Elizabeth II. The British media showed William and Kate leaving with the baby for her parents' estate in rural Bucklebury, about 50 miles outside London. This time, William wasn't driving the Range Rover. He was in the front seat and Kate was in the back with the baby in a car seat. The new little prince spent his first night at his parents' small apartment-cottage at Kensington Palace, where Kate's siblings, Pippa and James Middleton, visited Tuesday evening, according to the Daily Mail and others. Both sets of grandparents visited him at the hospital Tuesday. Prince Harry also stopped in for a look, according to the BBC. But his most important visitor so far was the queen, and she came to him, driven the short way over from Buckingham Palace Wednesday morning. She spent about 30 minutes with the new family. For two days, the new third-in-line to the throne, first child of the Duke and Duchess of Cambridge, was known only as HRH Prince insert name here of Cambridge. Now he's named after his great-great grandfather, George VI. He will be a future King George VII. When Will and Kate left St. Mary's Hospital on Tuesday with their baby, Will said they would have a name as soon as we can. And grandfather Prince Charles and his wife, Camilla Duchess of Cornwall, told the assembled media and well-wishers outside the hospital that they had no idea what the child's name was. A source with knowledge of the matter told London's Evening Standard newspaper that the happy couple had a number of names in mind, but they wanted to see his little face and get to know him first. NAME HIM IN ONE!: Create your own royal name According to the BBC, it took a week for William's parents ? Diana and Charles ? to announce their newborn's name in 1982, while the Prince of Wales' name was not revealed for a whole month when he was born in 1948. However, Prince Harry's name was made public when he left the hospital in 1984. Choosing a name that sounds right after the word King is more complicated than perusing a list of trendy baby names, and the queen was likely to be at least consulted in the matter of naming the future monarch. Reporters stationed outside the gates of Kensington Place began tweeting early Wednesday when the queen's green Bentley was spotted entering the palace to visit her third great-grandchild, her first great-grandson. ROYAL BABY: Reveals have come a long way since 1982 It's not clear how long the family will stay at Carole and Michael Middleton's estate; William has two weeks paternity leave from his job as a helicopter pilot in the RAF in Wales. New speculation in the British media suggested the couple and baby might spend some time with the queen at Balmoral or at one of the smaller residences on the estate, including Prince Charles' house Birkhall. Meanwhile, the baby's great-grandfather, Prince Philip, hasn't yet met him because he's still at the royal Sandringham estate in Norfolk where he has been recovering from abdominal surgery. He's expected to join the queen at Balmoral.