Prince Harry this week pledged to make his newborn nephew's life as fun as possible, and so has found himself dubbed the Funcle for the foreseeable future. We support this appointment, Harry being very much the fun ie frequently amusingly drunk royal, and can now imagineer his fun schedule for the future king. Harry will be apportioned a strict, maverick vocal coach like the one what got rid of George VI's stammer in that film. Through him, Harry will learn an approved sequence of gurgles that has been spoken to royal babies since Victorian times. He will also be presented with a solid gold shaky-hammer full of diamonds to wave at the child. Additionally, his applications for membership of Whisky Mist and Boujis will be rushed through as a matter of procedure. Harry will be encouraged to read to him texts commissioned from top authors, including The Little Prince Who Really Did Very Well For Himself by JK Rowling and naturally, some stuff from Will Self and Irvine Welsh, which on the face of it, might be better left until he's a bit older. As he starts to walk, he will be encouraged to familiarise himself with the process of the public meet-and-greet in his own fully animatronic scaled-down play village , which is every bit as unnerving to the casual observer as it sounds. He will also learn that peculiar royal laugh, which sounds like a mule choking. Harry's role becomes part-entertainer, part-mentor, a Prince Will.I.Am if you like. Prince George will be introduced to basic sports such as football in an absurdly over-protected executive box at the Emirates, obviously , rugby and grouse shooting. He may be encouraged to draw and paint and write poems. And he will be taught equestrianism on one of those South American mini-horses that they use as guide ponies for blind people. A difficult period for the growing prince, as he approaches puberty and its attendant changes. Harry will guide him through this time of flux by gradually introducing him to social functions where the young prince can talk to girls, and taking him on holidays to coincidentally bikini-friendly locations in South America. The teenage prince can now become more publicly active, but still restrained within the strictures and duties of his position. As such, he should now be spending much more time hanging out with rugby players; pursuing short-lived, doomed-from-the-outset romances with perky-nosed society girls whose fathers all own South African mines; going on further holidays in which he spends five minutes out of a two-week jolly pretending to dig a drainage ditch; and going to pubs but definitely not drinking in them. Whisky Mist! Las Vegas! Strip billiards! Now the real fun begins!