A juror who has been vocal since the acquittal of George Zimmerman said Tuesday night that Trayvon Martin played a huge role in his own death. When George confronted him . . . he could have walked away and gone home, the woman, identified only as juror B-37, said of the 17-year-old victim in an interview on CNN's Anderson Cooper 360?. He didn't have to do whatever he did and come back and be in a fight. But she added that she and other jurors nevertheless felt a lot of sympathy for what happened to Trayvon and that she wished she could have given his family the verdict they wanted. I don't want people to think that we didn't think about Trayvon Martin, she said, her voice appearing to crack with emotion. We did. She said that the jury deliberations were intense. She said she and others wanted to find something they could convict Zimmerman of, but there was nothing legally that they could do. I wanted to find him guilty of not using his senses, but you can't fault anybody, she said of Zimmerman. You can't charge him with anything because he didn't do anything unlawful. She said she believed the situation got out of control, partly because of what both Zimmerman and Trayvon did. George got in a little too deep, she said. But Trayvon got mad and attacked him. Late Tuesday, the 18th Judicial Circuit court in Florida issued a statement from four other jurors in the Zimmerman case, who said juror B-37's opinions were her own, and not in any way representative of their views. Serving on this jury has been a highly emotional and physically draining experience for each of us, the statement said. The death of a teenager weighed heavily on our hearts but in the end we did what the law required us to do. Juror B-37 said earlier in the day Tuesday that she is dropping plans to write about her account of the controversial case. The juror, still known only by her court designation as juror B-37, issued the statement less than 24 hours after her new literary agent, Sharlene Martin, had announced plans for a book co-authored by the juror's husband, who is an attorney. Martin tweeted the juror's change of plans Tuesday and also announced that she had decided to rescind her offer of representation. The juror said in her statement that the isolation of being sequestered shielded me from the depth of pain that exists among the general public over every aspect of this case. WATCH: Juror B-37 goes public on the Zimmerman verdict The potential book was always intended to be a respectful observation of the trial from my and my husband's perspectives solely and it was to be an observation that our 'system' of justice can get so complicated that it creates a conflict with our 'spirit' of justice, she said in the statement. Now that I am returned to my family and to society in general, I have realized that the best direction for me to go is away from writing any sort of book and return instead to my life as it was before I was called to sit on this jury. Martin, in announcing initially on Monday that she had signed the juror, said the book would deal with serving on a sequestered jury in a highly publicized murder trial and the importance of following the letter of the law. The reader will also learn why the jurors had no option but to find Zimmerman not guilty due to the manner in which he was charged and the content of the jury instructions, Martin had said Monday. Martin also said at the time that the juror had approached her within 24 hours of the verdict and had been referred by a high-ranking producer from one of the morning shows. Juror B-37 had quickly staked out a high-profile in the case after the verdict, appearing on Anderson Cooper 360? on Monday night. She told the CNN anchor that Zimmerman was a man whose heart was in the right place, but he went too far and did not use good judgment. According to notes from the jury selection process, juror B-37 is a white, middle-aged woman from Seminole County who works as a chiropractor. She is the daughter of an Air Force captain, has two adult children and has been married to a space attorney for 20 years. Under pretrial questioning, she described the protests that took place in Sanford, Fla., after the shooting as rioting.