SANFORD, Fla. ? The outcry from many civil rights activists and scholars against the verdict of not guilty handed down to George Zimmerman by a jury is not drawing strong support in the world of defense lawyers. Benjamin Jealous, head of the NAACP, said the verdict confirms for many that the only problem with the new South is it occupies the same time and space as the old South. George Ciccariello-Maher, who teaches and writes about race at Drexel University in Philadelphia, accused the media of demonizing the victim, 17-year-old Trayvon Martin, and cited the non-black jury, a judge's instructions to lawyers not to refer to race and the narrow focus of the self-defense issue. OBAMA: 'The jury has spoken' in Zimmerman case MORE: Civil rights leaders seek new charges against Zimmerman Zimmerman, 29, fatally shot Trayvon, 17, in a gated Sanford community last year. Zimmerman, who was a neighborhood watch coordinator, is Hispanic. Trayvon was black. Randy Reep, a criminal defense lawyer in Florida, said the case put the criminal justice system in the spotlight, blemishes, warts and all. Unlike Jealous and Ciccariello-Maher, Reep said he thinks the system worked. In watching the case, it is clear to me the jury got it right, Reep said. The prosecution team did the very best with what they had, they just did not have the facts on their side. At least enough facts. Reep said the nation deserves a conversation about race. However, our criminal justice system, where one man is taken on by an entire state, is not the forum for that ? at least it should not be. Kimberly Priest Johnson, a defense attorney in Dallas, said the state's charges outweighed the evidence in this case, and the jury confirmed that. She noted that no legal decision can end the tragedy of a young man's death. The case does prove, however, that our jury system works, and the rule of law prevails over public opinion, Priest Johnson said. Jules Epstein, a law professor at Widener University School of Law in Wilmington, Del., said the prosecutor may have erred by charging second-degree murder. The charge requires proof of an evil state of mind, but the evidence seemed to show bad judgment and then an event that spiraled out of control, Epstein said. Epstein echoed Reep's comment that a courtroom is not the place for a forum on race. The jury's job is not to rule on racial profiling, racial animosity or the merits of a stand-your-ground law, he said. The jurors' function was to answer one question ? whether the charges were proven beyond a reasonable doubt, he said. A verdict of not guilty is not a finding of self-defense or that Trayvon Martin did anything wrong; it is a verdict of not proved beyond a reasonable doubt.