President Obama said Friday that all Americans should respect a jury's acquittal of George Zimmerman in the killing of Trayvon Martin, but white Americans should also understand that African Americans are pained by Trayvon's death and continue to face racial discrimination. Trayvon Martin could have been me 35 years ago, the nation's first African-American president said during a surprise appearance in the White House briefing room. Obama, who last year said the 17-year-old Florida shooting victim could just as easily have been his son, talked about how he has been subjected to casual prejudice. He also said African Americans need to address the problems of violence in their own communities. African-American males know they are more likely to be both victims and perpetrators of violence, Obama said, and somebody like Trayvon Martin was probably statistically more likely to be shot by a peer than he was by somebody else. The problem is that so many people paint with a broad brush and see all black young men as potential criminals, Obama said. A Florida jury acquitted Zimmerman on Saturday night of murder in the 2012 death of 17-year-old Trayvon. This was Obama's first on-camera comments on the case since the verdict was handed down Saturday night. He had had issued a written statement calling for calm on Sunday. Obama has generally avoiding discussing racial issues -- today was probably his most extensive comments on the issue as president, reminiscent of his speech on race relations during the 2008 campaign. FIRST TAKE: Obama leading from behind on race In an extraordinary 19-minute appearance, Obama spoke personally and at times emotionally about the frustrations African-Americans have with the justice system, and the continuing racial divides that shadow the nation. I think it's important to recognize that the African American community is looking at this issue through a set of experiences and a history that doesn't go away, Obama said, and it's going to be important for all of us to do some soul-searching. Obama told reporters that, like other African Americans, he has been followed by security guards while shopping, and has seen motorists lock their doors or women hold tighter to their purses as he walked near them. While didn't want to exaggerate, Obama said those sets of experiences inform how the African-American community interprets what happened one night in Florida. He cited racial disparities in the criminal justice system, and how blacks tend to be charged more often with drug offenses and sentenced to longer prison terms than whites. He also said it's fair to wonder what would have happened in Florida if the shooter had been a young African-American. Obama said he respects the different views of the verdict, but the trial was conducted professionally, and once the jury has spoken, that's how our system works. While demonstrations and peaceful protests are understandable, he said violence dishonors what happened to Trayvon Martin and his family. Said Obama: Now, the question for me at least, and I think for a lot of folks, is where do we take this? While the Justice Department investigates whether to charge Zimmerman with civil rights violations in the case, Obama said state and local levels should examine whether changes to laws can head off violent confrontations. He cited laws to ban racial profiling, and proposed new kind of training for law enforcement in order to reduce the kind of mistrust in the system that sometimes currently exists. The president also questioned the wisdom of Florida's stand your ground law, which, in the view of critics, all but encourages confrontation that could turn deadly. Obama also suggested people consider whether Trayvon also had the right to stand his ground, adding: Do we actually think that he would have been justified in shooting Mr. Zimmerman who had followed him in a car because he felt threatened? The nation should also think about ways to bolster and reinforce our African American boys, Obama said, saying there are too many kids out there who need help, but are getting a lot of negative reinforcement. Obama said all Americans should do soul-searching in the wake of the verdict and the reactions to it, but questioned whether a full-blown national conversation would do much good if too many politicians or pundits were involved. On the other hand, in families and churches and workplaces, there's the possibility that people are a little bit more honest, and at least you ask yourself your own questions about, am I wringing as much bias out of myself as I can? Obama said. Borrowing a quote from Abraham Lincoln, Obama said political leaders should do whatever they can to encourage ''the better angels of our nature. rather than using these episodes to heighten divisions. Obama also said that Americans should realize that, over the course of decades, American race relations have improved, citing his daughters and their friends as examples. While that doesn't means we're in a post-racial society, Obama said there is progress. I don't want us to lose sight that things are getting better, Obama said. Obama also paid tribute to Trayvon's parents, saying that I can only imagine what they're going through and it's remarkable how they've handled it. In a statement, Trayvon's parents Tracy Martin and Sybrina Fulton said Friday, we are deeply honored and moved that President Obama took the time to speak publicly and at length about our son, Trayvon. The President's comments give us great strength at this time.