It's complicated. Life is packed with nuances and subtleties and shades of gray. But the news media are often uncomfortable in such murky terrain. They prefer straightforward narratives, with good guys and bad guys, heroes and villains. Those tales are much easier for readers and viewers to relate to. Which brings us to Trayvon Martin and George Zimmerman. The story of their tragic confrontation on February 26, 2012, in Sanford, Florida, was framed early on. Zimmerman, then 28, was the neighborhood watch captain/ wannabe cop who racially profiled and ultimately killed Trayvon, an unarmed, hoodie-clad black teenager out on the streets of the gated community Retreat at Twin Lakes simply because he wanted some Skittles. The storyline quickly took root, amplified by the nearly ubiquitous images of the two: a sweet-looking photo of a several-years-younger Trayvon released by his family, and a mug shot of Zimmerman from a previous arrest in which he looks puffy and downcast. The contrasting images powerfully reinforced the images of the menacing bully and the innocent victim. Some of the media's major mistakes stemmed from stories that fit neatly into that widely accepted narrative. NBC News edited Zimmerman's comments during a phone call to inaccurately suggest that he volunteered that Trayvon seemed suspicious because he was black. In fact, Zimmerman was responding to a question when he mentioned the teenager's race. The network apologized for the error. Similarly, ABC News broadcast a story reporting that a police surveillance video showed no evidence that Zimmerman suffered abrasions or bled during the confrontation with Trayvon. Shortly thereafter, it clarified the situation, reporting that an enhanced version of the video showed Zimmerman with an injury to the back of his head. When it emerged that Zimmerman's mother was Peruvian, some news outlets took to referring to him with the rarely used phrase white Hispanic, which is kind of like calling President Obama white black. Mark O'Mara, Zimmerman's lawyer, was brutal in his post-acquittal comments about the press' treatment of his client. Hard to blame him. After the Sanford police originally declined to prosecute Zimmerman, State Attorney Angela Corey charged him with second-degree murder in the wake of the flurry of news coverage, street protests and a powerful campaign on social media. But there was much more to the story, as the obvious weakness of the prosecution's case against Zimmerman and the jury's not-guilty verdict make abundantly clear. There was evidence that Zimmerman decidedly got the worst of it during the struggle before he shot Trayvon. Trayvon was an athletic 17-year-old, not necessarily a helpless victim. Zimmerman may well have been acting in self-defense. This is hardly to suggest that Zimmerman is a candidate for canonization. This is on him. It was his reckless behavior that set this tragedy in motion. If he had stayed in his vehicle as he was told to do by the police, Trayvon Martin would be alive today. As more details emerged, so, too, did a fuller picture of the events of February 26, 2012. But by then the popular view of what had happened had hardened. Conservatives see this episode as yet another manifestation of the pervasive bias of that dreaded liberal media. But there's something else at play. Journalists are addicted above all else to the good story. And the saga of the bigoted, frustrated would-be law enforcement officer gunning down the helpless child was too good to check. It's also another example of how groupthink can shape news coverage. A healthy dose of skepticism should always be part of the journalism process. And in this case there was a particularly strong reason for caution. While some residents of the complex saw some parts of the conflict, only two people knew, really knew, how it went down. And one of them was dead. Under those circumstances, certainty was elusive. Back in 2006, the nation's media gave huge play to a saga in which three Duke University lacrosse players were charged with raping a stripper at a team party. But the case collapsed, the prosecutor was disbarred and many news organizations looked seriously foolish. Asked what had gone wrong by journalist Rachel Smolkin for a reconstruction of the episode in American Journalism Review, Daniel Okrent, a former New York Times public editor, responded: It was too delicious a story. Sound familiar? But the Duke lacrosse fiasco also provides some hopeful guidance for the media in dealing with the next Trayvon Martin/George Zimmerman story. Well before the case imploded, Stuart Taylor of National Journal and Joe Neff of the News & Observer in Raleigh did topnotch, against-the-grain reporting, poking holes in the prosecution's overwrought version of history. Let's hope we see much, much more of that the next time the news media encounter a story that's too delicious. Rem Rieder writes about media for USA TODAY.