Whites and blacks are divided over the not guilty verdict in the George Zimmerman trial, a survey by the Pew Research Center shows. The poll found that 86% of black people are dissatisfied with Zimmerman's acquittal in the shooting death of 17-year-old Trayvon Martin. Only 5% of blacks were satisfied with the verdict. Whites were more satisfied: 49% said so, while 30% say they were dissatisfied. The national poll of 1,480 adults conducted July 17-21 has a margin of error of +/-3 percentage points. The survey backs up the sentiments that have been awash in posts on social media sites since the verdict was announced. Zimmerman, 29, was acquitted July 13 of shooting Trayvon in a gated subdivision in Sanford, Fla. He said he shot the teen in self-defense after the two fought. Trayvon was unarmed. The incident and the verdict sparked national protests about racial profiling, vigilantism and the treatment of blacks by the justice system. Eight in 10 blacks say the case raises important issues about race that need to be discussed. But only 28% of whites say the case raises important issues about race, while 60% of whites say the subject of race is getting more attention than it deserves. It shows that blacks and whites have a different predisposition to issues like these, says Michael Dimock, director of the Pew Research Center for the People & the Press. They have a different history and view things from a different lens. So it becomes hard to find common ground. The case has been momentous for blacks; 58% say they have been following the verdict very closely. A third of whites say the same. Dimock says that for black people the case says something deeper about the biases whites have against them and how they are treated, especially young black men. But there is hope, he says. The survey found 41% of whites ages 18 to 29 were less satisfied with the verdict, more than any other age group. One Facebook post called I am not Trayvon Martin started by a young white male has gone viral. It has become a rallying cry for those who are dissatisfied with the verdict but don't identify personally with Martin. There was also a big gender gap. Women of any race were more likely to agree that the case raises issues about race that need to be discussed; 43% said so. Among men of all races, 29% of men agreed. Among whites, a third of women said the case raises issues about race that need to be discussed; 22% of men said that. I don't know why, Dimock says. Maybe because women have a tendency to be more sympathetic to all arguments ... but this is a substantial gender gap.