One school music director's commentary about the not guilty verdict in George Zimmerman's trial last weekend has gone viral. Titled I am not Trayvon Martin, the Facebook status by Bob Seay of Lamar, Colo., has become a rallying cry for some who are upset with the verdict but don't identify personally with Martin, who was fatally shot the night of Feb. 26, 2012, in Sanford, Fla. Since it was posted Sunday morning, it has been shared more than 50,000 times and liked by more than 116,000 Facebook users, as well as picked up by the Huffington Post. You don't have to be Trayvon Martin to know this is wrong. You don't have to be black, or young, or a 'troubled student' or a pot smoker to know this was murder. And you don't have to be the parent of Trayvon Martin to know this was a gross miscarriage of justice, Seay's post reads. The status plays off another popular movement in the aftermath of the court decision, I am Trayvon Martin, which has inspired demonstrations of hoodie-clad teenagers and young adults in cities nationwide. I couldn't believe it, Seay said. I stayed up all night watching it. It was like watching the numbers on a gas pump roll over. Seay said he wrote the post to protest Stand Your Ground laws, which he said make it too easy to kill people in the U.S. He also said his post has generated a lot of feedback at various extremes. I've had everything from marriage proposals to death threats, he said. In the week since the Florida jury announced its verdict in the Zimmerman case, other opinions posted to Facebook have spread quickly as well. An open letter to George Zimmerman by user Alex Fraser has had more attention than Seay's, spreading throughout Facebook since early Sunday morning as well. You will feel people stare at you. Judging you for what you think are unfair reasons, Fraser wrote. Enjoy your 'freedom.' Fraser could not be reached for further comment. Of course, social media's ability to elevate the profile of non-celebrity users is not limited to big national news stories. ? Two sisters posted a photo in January that said, We want a puppy! Our dad said we could get one if we get 1 million likes! Since then, it has gotten almost 1.7 million likes. The girls have since created a website, milliesmillions.com, to raise money and awareness for animal shelters. ? In February, Valerie Diaz, a Virginia Beach, Va., high school student, posted: My Daddy said that if I get 100,000 likes, he'll stop smoking. She reached her goal the next day, local media reported. ? In June, Mike Patterson was paralyzed while rescuing a 4-year-old girl from a creek in Rockmart, Georgia. His Facebook page has had 73,000 likes since then.