SANFORD, Fla. ? In a murder case that has sharply divided national opinion, a Florida jury will soon decide whether George Zimmerman is a killer who tracked and murdered an innocent black teenager or a conscientious citizen who fired a fatal bullet while fighting for his life. Those are the two sides of the question presented in two weeks of stirring testimony here. Prosecutors gave their closing arguments Thursday, and the defense will present its closing Friday. The jury will then decide whether Zimmerman, 29, a neighborhood watch volunteer charged with killing Trayvon Martin, should be acquitted or convicted of second-degree murder or manslaughter. The murder charge carries a potential life prison term, and the maximum penalty in Florida for manslaughter is 30 years. State prosecutor Bernie de la Rionda told the jury that Trayvon was an innocent teenager who is now dead because Zimmerman wrongly assumed the teen was a criminal and murdered him. Prosecutors throughout the trial have portrayed Zimmerman as a lying wanna-be cop who followed Trayvon even after a police dispatcher told him via cellphone that pursuit was not necessary. A teenager is dead, and he's dead through no fault of his own, de la Rionda said to jurors. He's dead because another man made an assumption. In a dramatic, at times loud closing statement, de la Rionda outlined for jurors why they should find Zimmerman guilty. The prosecutor focused on several main theories of his case: Trayvon would be alive if Zimmerman hadn't profiled him, the unarmed teen was pursued by a man carrying a gun, and Zimmerman gave inconsistent statements to police and a reporter. Zimmerman's defense team maintains that Trayvon, 17, was the aggressor and that Zimmerman shot him in self-defense during a struggle in which the teenager repeatedly bashed Zimmerman's head into a concrete sidewalk. The case has gripped the nation since the shooting happened on Feb. 26, 2012. Police initially did not charge Zimmerman with a crime, citing Florida's Stand Your Ground law, which allows someone who believes he is in imminent danger to take whatever steps are necessary to protect himself. Protests ensued in several cities, including New York, by supporters of Trayvon's family. Many protesters voiced the opinion that Trayvon was targeted and killed for racial reasons. Trayvon was black, and Zimmerman is Hispanic. Florida's state prosecutor stepped in and charged Zimmerman with murder on April 11, 2012. The trial, held in the same Florida city where Trayvon was killed, has brought the facts of the case under a nationally-televised spotlight, with every moment captured on camera. Using a projector, de la Rionda on Thursday showed jurors a photo of Zimmerman taken at the police station the night of the shooting ? alongside a close-up of Trayvon's dead body. De la Rionda noted that Trayvon's hands had no blood on them. His Trayvon's body speaks to you, de la Rionda said. It proves to you that this defendant is lying. De la Rionda told the jury the key word in the prosecution's case was assumptions. Zimmerman automatically assumed that Trayvon Martin was a criminal, and that is why we are here, de la Rionda said. Later, he said Trayvon wasn't trespassing in the gated community but was being a normal teen making a trip to the store. De la Rionda also painted Zimmerman as someone who already knew he could ultimately win any confrontation with Trayvon. He's got a gun; he's got the equalizer, de la Rionda said. He asked the six-woman jury to use your God-given common sense and find Zimmerman guilty of second-degree murder. The defense has called several witnesses who lived in the community where the struggle between Trayvon and Zimmerman happened. Zimmerman claims he was heading back to his truck when Trayvon assaulted him. People who live in the area said they heard screams and saw a struggle going on in the dark. Screams can be heard in a 911 call dialed by one of the residents. The tape of that call was played for the jury. The fathers of both Trayvon and Zimmerman took the stand to testify that they were positive that the screams on the tape came from their own son. Randy Reep, a Florida criminal defense attorney who has followed the case, said he'll be surprised if Zimmerman is convicted of murder. The state did not prove the elements of second-degree murder, Reep said, noting that there were too many conflicting witness statements. Zimmerman's attorneys get three hours for their closing Friday. The state will then get one hour to present rebuttal statements. The jury could begin deliberations Friday. Bacon reported from McLean, Va.