PHOTO: Rally for President Morsi on 13 June 2039 GMT: Egypt ? Pro-Morsi Group Have Left Maspero, Armed Forces In Control Cairo-based reporter Bel Trew tweets that pro-Morsi supporters have now left Maspero, while others report that the army is now in control of the area: 1954 GMT: Egypt ? Army Deploys on 6 October Bridge in Cairo Ayman Moyheldin of US NBC News: The Associated Press writes: ?Several armored vehicles, at least one with young Morsi opponents sitting on the roof, deployed?.Military helicopters flew toward Tahrir [Square].? The deployment comes after reports of firing of automatic weapons in the clashes between supporters and opponents of former President Morsi. 1943 GMT: Egypt ? 10 Killed Today The death toll has risen to 10 today, according to the Ministry of Health, with 210 wounded. Four people were killed near the Republican Guard Headquarters in Cairo and another has died on the 6 October Bridge tonight. Four others died in the northern Sinai city of el-Arish, where supporters of former President Morsi stormed the main Government building. The 10th was killed in the southern city of Assiut. 1940 GMT: Egypt ? Fighting on 6 October Bridge in Cairo; At Least 1 Dead Police have now arrived on the scene of sustained fighting between supporters and opponents of former President Morsi: 1915 GMT: Morsi Supporters and Opponents Clash on 6 October Bridge; 6 Dead Today Back from a break to find an announcement from the Ministry of Health that six people have been killed in Egypt today ? four of them in Cairo ? and 180 wounded. Opponents and supporters of former President Mohamed Morsi are fighting on the 6 October Bridge, near Tahrir Square in central Cairo. Ayman Mohyeldin of US NBC News: A clip of the fighting: 1650 GMT: Muslim Brotherhood Leader Appears at Pro-Morsi Demo cont. More from Mohammad Badie?. Muslim Brotherhood head Mohammad Badie, reportedly arrested on Wednesday night, has appeared at today?s pro-Morsi rally in Nasr City: 1543 GMT: Egypt Video ? Moment When Police Fired on Pro-Morsi Demo Footage of police opening fire on the pro-Morsi protest nearing the Republican Guards Headquarters, including a grahic image of a demonstrator lying injured and probably dead: An Army spokesman has denied that troops opened fire with live ammunition, claiming they ued only blank rounds and tear gas. 1537 GMT: Egypt ? Interim President Formally Dissolves Upper House of Parliament Interim president Adli Mansour has issued a decree following dissolving the Shura Council, the upper house of Parliament. The Supreme Constitutional Court ruled in June that the Council was elected illegally. The lower house of Parliament was declared illegitimate last year by a court over technicalities about its election. 1522 GMT: Egypt ? Pro-Morsi Crowd on Wednesday Night ?No Elections After This Day? Footage of a crowd protesting the military coup as it was announced: 1422 GMT: Egypt ? BBC Journalist Bowen Injured BBC reporter Jeremy Bowen, who brought the first news of the death of a pro-Morsi protester in clashes with the police, was subsequently hit in the head by birdshot. A photograph on Twitter shows that he is OK as his head is bandaged. Three members of a news crew from Britain?s Channel 4 were also hit by birdshot. None were wounded seriously. 1347 GMT: Egypt ? 3 Dead as Police Fight with Pro-Morsi Demo AFP says three protesters are dead, while Mohamed Effat posts: Haitham Tabei of AFP reports on how the clash started: 1323 GMT: Police Clashing with Pro-Morsi Demo in Cairo, 1 Dead The confrontation started as the march tried to reach the Republican Guards Headquarters, where former President Morsi is reportedly under house arrest: Earlier today at the main rally in Nasr City: From the BBC?s Jeremy Bowen and Mike Giglio of The Daily Beast: The Muslim Brotherhood?s Twitter site points to footage of the rally for former President Morsi in Alexandria on Friday: A snapshot from journalist Louisa Loveluck at the mass rally for former President Morsi in the Cairo suburb of Nasr City: And from photograph Matthew Cassel: Prosecutor-General Abdel-Meguid Mahmoud announced his resignation on Friday, a day after the judiciary overturned his dismissal by former President Morsi. Mahmoud said he had made the decision to ?avoid the embarrassment of making judicial decisions against those who removed me from office?. Morsi fired Mahmoud, who had been appointed by former President Hosni Mubarak, by decree in November 2012. Last week, an appeal court upheld a decision to dismiss Talaat Abdullah, who had replaced Mahmoud as prosecutor-general in November 2012. On the same day a separate verdict confirmed Mahmoud?s dismissal from the post. The Supreme Judicial Council chose to implement the verdict dismissing Abdullah, while ignoring the one confirming Mahmoud?s dismissal. Egypt: UN Expresses Concern Over Violence, Arbitrary Arrests United Nations human rights head Navi Pillay has declared: I urge a major effort by all political parties, and the authorities, to deter and punish any acts of vengeance. There should be no more violence, no arbitrary detention, no illegal acts of retribution. Serious steps should also be taken to halt, and investigate, the appalling ? and at times seemingly organized ? sexual violence targeting women protestors. Pillay?s spokesman Rupert Colville addressed the arrest of the Muslim Brotherhood?s leaders: We don?t really know the details and what the basis of these detentions is. Obviously if you detain or arrest someone there needs to be, according to the law, a very good reason to do so,? he said. ?There needs to be due process. The African Union on Friday suspended Egypt after the country?s military deposed President Mohamed Morsi, a senior AU official said. As Ahram Online reports, suspension is the AU?s usual response to any interruption of constitutional rule by a member state. ?As mandated by the relevant AU instruments, the African Union Peace and Security Council decides to suspend the participation of Egypt in AU activities until the restoration of constitutional order,? Admore Kambudzi, Secretary of the Peace and Security Council, said. Egypt?s interim President, Adly Mansour, has appointed new legal and security advisors, both members of the Judiciary, Ahram Online reports. Mansour issued a decree to appoint Judge Aly Aoud Saleh as his constitutional advisor and Judge Mostafa Hegazy as his political advisor. ElBaradei: Coup Was Necessary Response to ?Earthquake? Chatter continues about the endorsement of Mohamed ElBaradei ? Nobel Prize laureate and leader of the National Salvation Front ? of Wednesday?s military takeover: ?The security people obviously are worried ? there was an earthquake and we have to make sure that the tremors are predicted and controlled.? Video from Wednesday of a bystander shot by a cartridge in Sidi Bishr in Alexandria on Wednesday night, as police drive by. The injured man was taken to hospital. The Associated Press offers an inside account, from ?army, security, and Muslim Brotherhood officials?, of President Morsi?s final days in office: The army chief came to President Mohammed Morsi with a simple demand: Step down on your own and don?t resist a military ultimatum or the demands of the giant crowds in the streets of Egypt. ?Over my dead body!? Morsi replied to Gen. Abdel-Fattah el-Sissi on Monday, two days before the army eventually ousted the Islamist leader after a year in office. The article has nuggets such as the withholding of information from Morsi by security services and the police?s refusal to protect Muslim Brotherhood offices attacked in recent weeks. However, the most interesting revelation is how the Brotherhood ? the base of Morsi?s power ? saw the end coming for the President, but could not convince him: The Muslim Brotherhood officials said they saw the end coming for Morsi as early as June 23 ? a week before the opposition planned its first big protest. The military gave the president seven days to work out his differences with the opposition?. A Brotherhood spokesman, Murad Ali, said the military had already decided that Morsi had to go, and el-Sissi would not entertain any of the concessions that the president was prepared to make. ?We were naive. ? We didn?t imagine betrayal would go this far,? Ali said. ?It was like, ?Either we put you in jail, or you come out and announce you are resigning,?? Ali added. ?He didn?t do either because he didn?t want to hand the country to the military again.? Aya Khalil reports from Zagazig, former President Morsi?s hometown, on one of the post-coup confrontations ? ?thousands? of Morsi supporters were attacked by ?thugs?with sharp and heavy objects?. Hanan Amin, chairwoman of the Muslim Brotherhood?s Freedom and Justice Party in the Al Sharqia Governorate, said the march ? made up mainly of women ? was suddenly confronted: ?We walked 12 kilometers and were surprised when thugs started to come towards us with swords, throwing rocks and glass bottles at us.? Amin continued, ?The police were closing in on us and throwing molotov cocktails,? Amin said. ?We started to say the shahada [testimony of faith].? She claimed 140 people were injured with two in critical condition. A resident, Adel Zidan, said his family welcomed seven of the protestors into his apartment: ?People were just trying to escape from the violence. There are 60-70 people, mostly women, hiding downstairs in the apartment entrance and on the stairs.? Supporters of former President Morsi, deposed by the military on Wednesday night, will try to counter today with mass protests. The National Coalition in Support of Legitimacy has called for ?Friday of Rejection? demonstrations after noon prayers. The largest rally is likely to be in front of a mosque in the Cairo suburb of Nasr City, where the Morsi supporters have staged a sit-in to counter anti-Morsi gatherings in Tahrir Square and the Presidential Palace. The Coalition, formed last week in support of Morsi called on State institutions to ensure the safety of peaceful demonstrations, while the armed forces put out a caution that everyone had a right to peaceful protest, but that right should not be abused. Meanwhile, political leaders, including the interim President Adli Mansour, and the military said that all groups would be welcome in the reformed political system. ?Wisdom, true nationalism and constructive human values that all religions have called for, require us now to avoid taking any exceptional or arbitrary measures against any faction or political current,? the army statement said. The assurances contrasted with reports throughout the day of arrests of leading members of the Muslim Brotherhood, including its head Mohammad Badie and key official Kharat El Shater, and house arrest of Morsi and his senior advisors. The day was also marked by confirmation of 16 deaths in violence since Morsi was removed. Beyond the clashes over the coup, security sources said a soldier was killed and two were wounded in the Sinai Peninsula when a police station in Rafah came under rocket fire. Earlier, attackers fired rocket-propelled grenades at army checkpoints guarding El Arish airport, close to the border with Gaza and Israel. ?American foreign policy is a wreck. The presumption that Washington controls events around the globe has been exposed to all as an embarrassing illusion. It wasn?t supposed to be this way. America was the unipower, the hyperpower, the sole superpower, the essential nation. Washington was the benevolent hegemon. Only members of the axis of evil had something to fear from the United States. All the U.S. government had to do was exercise ?leadership? and all would be well.