CAIRO ??Enraged Islamists pushed back Friday against the toppling of President Mohammed Morsi. Tens of thousands of his supporters took to the streets vowing to win his reinstatement and clashed with their opponents in violence that killed 30 and drove the divided nation toward an increasingly dangerous showdown. In a battle on a bridge over the Nile River in Cairo, gunfire rang out and flames leaped from a burning car as the rival camps threw volleys of stones and fireworks at each other. Military armored vehicles raced across the bridge in a counterattack on Morsi?s supporters. 								 								 In Alexandria, Islamists descended on an anti-Morsi rally, opening fire with guns, where at least 12 people were killed, mostly Morsi opponents, emergency services official Amr Salama said. One man was stabbed and thrown from the roof of a building by Morsi supporters after he raised an Egyptian flag and shouted insults against the ousted president, according to an Associated Press reporter at the scene. Health ministry officials said more than?400 people nationwide have been wounded. The clashes accelerated after the supreme leader of Morsi?s Muslim Brotherhood defiantly proclaimed that his followers would not give up street action until the return of the country?s first freely elected president, swept out of power days earlier by the military. Morsi opponents called out the public to defend against the Brotherhood, deepening the battle lines. In scenes of mayhem, troops opened fire on peaceful pro-Morsi protesters. ?God make Morsi victorious and bring him back to the palace,? Brotherhood chief Mohammed Badie proclaimed before cheering supporters at a Cairo mosque in his first appearance since the overthrow. ?We are his soldiers we defend him with our lives.? Badie said it was a matter of honor for the military to abide by its pledge of loyalty to the president, in what appeared to be an attempt to pull it away from its leadership. Hours later, Badie?s deputy, Khairat el-Shater, considered the most powerful figure in the organization, was arrested in a Cairo apartment along with his brother on allegations of inciting violence, Interior Ministry spokesman Hani Abdel-Latif told The Associated Press. El-Shater was the Muslim Brotherhood?s original candidate for the presidency but was disqualified for a past prison sentence. Mohammed Morsi ran in his place and became Egypt?s first freely elected president. The US State Department condemned the violence and called on all Egyptian leaders to denounce the use of force and prevent further bloodshed among their supporters. ?The voices of all who are protesting peacefully must be heard ? including those who welcomed the events of earlier this week and those who supported President Morsi,? State Department spokeswoman Jen Psaki said in a statement. ?The Egyptian people must come together to resolve their differences peacefully.? UN?Secretary-General Ban Ki-moon called on Egypt?s security forces to protect demonstrators and prevent violent clashes and urged the Egyptian people to work together to restore civilian control, constitutional order and democratic governance. Ban expressed alarm at violent clashes between protesters, including reports of deaths and injuries by security forces and ?horrifying reports of sexual violence,? a spokesman said said Friday. The UN chief said political leaders must demonstrate their commitment by words and actions to ?a peaceful and democratic dialogue which includes all of Egypt?s constituencies, including women,? his spokesman said. ?The way forward should be determined by the people of Egypt themselves,? Ban?s spokesman said. ?For such a process to succeed, there is no place for retribution or for the exclusion of any major party or community.? The National Salvation Front and youth groups said in a statement late Friday that the Brotherhood has marched into the streets and targeted strategic areas in Cairo ?to portray a false image? to the world that they have popular backing and to spark foreign intervention. They called on the public ?to defend popular legitimacy,? saying the army can ?end this conspiracy? with the help of the people. In cities across the country, clashes erupted as Morsi supporters marched on local government buildings, battling police or Morsi opponents. ?We are all now afraid for Egypt,? Amr Moussa, a former Arab League chief who was a major leader of the opposition to Morsi during his year in office, said on Al-Hayat TV. ?Egypt can?t afford to enter into violence or civil war.? But Islamists vowed to show by their numbers and the turmoil that the military had made a mistake in ousting Morsi on Wednesday night after millions of Egyptians poured into streets around the country for four days this week demanding the Islamist president go in the biggest rallies the country has seen. Badie?s speech injected a new vehemence into Morsi?s supporters, and the eruption of clashes at multiple locations soon afterward suggested a coordinated counter-push against those behind his ouster. ?The military got itself in a trap by siding by one side. Now they see the masses in the streets and now they realized that there are two peoples,? Hamada Nassar, a figure from the hard-line former militant group, Gamaa Islamiya, told AP. As clashes raged Friday night, the military?s spokesman warned against ?any provocation or contact with groups of peaceful protests, and those who transgress that will be dealt with complete determination according to the law.? The day?s turmoil began in the afternoon when army troops opened fire as hundreds of Morsi supporters marched on the Republican Guard building in Cairo, where Morsi was staying at the time of his ouster before being taken into military custody at an unknown location. The crowd approached a barbed wire barrier where troops were standing guard around the building. When one person hung a sign of Morsi on the barrier, the troops tore it down and told the crowd to stay back. A protester put up a second sign, and the soldiers opened fire, according to an Associated Press photographer. One protester was killed, with a gaping, bleeding wound in the back of his head, while others fell bloodied and wounded. Witnesses told to AP Television News at the scene that men in plainclothes fired the lethal shots. Protesters pelted the line of troops with stones, and the soldiers responded with volleys of tear gas. Many of those injured had the pockmark wounds typical of birdshot. The BBC?s Middle East editor, Jeremy Bowen, was hit by birdshot in the head as he covered the clashes. ?Am fine,? he reported in a tweet. Three hours later, Badie ? who security officials had previously said was taken into custody soon after Morsi?s removal ? made his appearance before tens of thousands of Islamists massed at Rabia al-Adawiya Mosque, not far from the Republican Guard building. The circumstances of his appearance were a mystery. Security officials had said Badie was taken into custody Wednesday night from a villa on the Mediterranean coast and flown to Cairo, part of a sweep that netted at least five other senior Brotherhood figures and put around 200 more on wanted lists. Just before Badie?s appearance, the Brotherhood?s political party said on its webpage that he had ?been released.? But on stage, Badie denied he was ever arrested. There was no immediate explanation by security officials for the circumstances of his detention and release. Authorities also announced the release of Saad Katatni, head of the Brotherhood?s political arm the Freedom and Justice Party, as well as one of Badie?s deputies, Rashad Bayoumi, pending further investigation. Britain?s Foreign Secretary William Hague said he was ?very concerned? by the reports of violence. In a Twitter message, he wrote: ?Hope calm heads will prevail, vital to avoid escalation.? Fears have been high over a major Islamist backlash to the military?s move. The Brotherhood has said it will not work with the new military-backed leadership. Morsi supporters say the military has wrecked Egypt?s democracy by carrying out a coup against an elected president. They accuse Mubarak loyalists and liberal and secular opposition parties of turning to the army for help because they lost at the polls to Islamists. Many supporters have equally seen it as a conspiracy against Islam. Extremist Islamist groups that gained considerable freedom to operate during Morsi?s year in office have already vowed violence in retaliation. The first major Islamic militant attack came before dawn Friday in the tumultuous Sinai Peninsula, killing at least one soldier. Masked assailants launched a coordinated attack with rockets, rocket-propelled grenades and anti-aircraft guns on the airport in the northern Sinai city of el-Arish, where military aircraft are located, as well as a security forces camp in Rafah on the border with Gaza and five other military and police posts, sparking nearly four hours of clashes. One of military?s top commanders, Gen. Ahmed Wasfi arrived at el-Arish on Friday to lead operations there as the army declared a ?war on terrorism? in Sinai. A crowd of Morsi supporters tried to storm the governor?s office in the city but were dispersed by security forces. The night of Morsi?s ouster, jihadi groups held a rally in el-Arish attended by hundreds, vowing to fight. ?War council, war council,? a speaker shouted, according to online video of the rally. ?No peacefulness after today.? Islamic militants hold a powerful sway in the lawless and chaotic northern Sinai. They are heavily armed with weapons smuggled from Libya and have links with militants in the neighboring Gaza Strip, run by Hamas. After the attack, Egypt indefinitely closed its border crossing into Gaza, sending 200 Palestinians back into the territory, said Gen. Sami Metwali, director of Rafah passage. At the Rabia al-Adawiya rally earlier in the day, the crowd filled much of a broad boulevard, vowing to remain in place until Morsi is restored. The protesters railed against what they called the return of the regime of autocrat Hosni Mubarak, ousted in early 2011. ?The old regime has come back ? worse than before,? said Ismail Abdel-Mohsen, an 18-year old student among the crowds outside the Rabia al-Adawiya Mosque. He dismissed the new interim head of state sworn in a day earlier, senior judge Adly Mansour, as ?the military puppet.? ?After sunset, President Morsi will be back in the palace,? they chanted. ?The people want God?s law. Islamic, Islamic, whether the army likes it or not.? Many held copies of the Quran in the air, and much of the crowd had the long beards of ultraconservative men or encompassing black robes and veils worn by women, leaving only the eyes visible. One protester shouted that the sheik of Al-Azhar ? Egypt?s top Muslim cleric who backed the military?s move ? was ?an agent of the Christians? ? reflecting a sentiment that the Christian minority was behind Morsi?s ouster. In southern Egypt, Islamists attacked the main church in the city of Qena on Friday. In the town of Dabaiya near the city of Luxor, a mob torched houses of Christians, sending dozens of Christians seeking shelter in a police station. Clashes broke out Friday in at least two cities in the Nile Delta between pro- and anti-Morsi demonstrators.