www.aljazeerah.info News, 	 July 2013 Egypt?s Muslim Brotherhood on 				Saturday called for another day of protests against the ousting 				of Mohammed Morsi by the military Wednesday, after overnight 				clashes between supporters and opponents of the toppled 				president left at least 30 dead. Islamists vowed further protests on Saturday to demand the 				 				military restore Egypt's first democratically elected leader, 				after a night of ferocious clashes that killed 30 people and 				injured more than 1,100 nationwide. The masses will continue their civilised protests and 				peaceful sit-ins in Cairo until the military coup is reversed 				and the legitimate president is restored, a coalition of 				Islamist groups said in a statement. Despite the talk of peaceful demonstrations, residents in 				parts of Cairo reported seeing dozens of bearded Islamists armed 				with machine guns, machetes and sticks on Friday night before 				the deadly clashes broke out. Snipers were spotted on rooftops, and medics told AFP they 				treated some residents of the normally quiet middle-class 				neighbourhood of Manial for bullet wounds with a downward 				trajectory. The backlash came two days after the army toppled Islamist 				president Mohammed Morsi, underlining the determination of his 				Muslim Brotherhood to disrupt the military's plan for a 				political transition until new elections. Ahead of Saturday's new round of protests, central Cairo was 				already tense, Gallagher Fenwick, FRANCE 24?s special 				correspondent in Egypt, noted. ?Tension is running high again in downtown Cairo, especially 				in Tahrir Square after a festive 48 hours following the ousting 				of former president Mohammed Morsi, with a lot of Egyptians, 				perhaps in the opposition, thinking that the Islamist camp was 				done with,? Fenwick said. ?But the Islamists have proved that they are very determined 				and that they will follow through with their promise to stay in 				the streets until their president returns?, he added. Street battles Protesters opposed to Morsi spent the night in Tahrir Square, 				epicentre of the 2011 revolt that ousted dictator Hosni Mubarak, 				who coincidentally appeared in court on Saturday over the 				killing of protesters during that uprising. A bridge leading up to Cairo University?? where Morsi 				supporters have been camped out for 10 days?? was littered with 				rocks and burned out tyres from the confrontations. The Tamarod movement, which engineered the mass protests 				against Morsi that culminated in his overthrow, urged its 				supporters to take to the streets again on Sunday. Tens of thousands of Morsi's supporters turned out on Friday 				to protest his ouster in the popularly backed military coup. Equally large numbers of anti-Morsi protesters also flooded 				the streets of Cairo and the Mediterranean city of Alexandria, 				sparking pitched battles between members of the rival camps. Police meanwhile pressed a round-up of top Islamists, 				announcing the arrest of Khairat al-Shater, widely seen as the 				most powerful man behind Morsi in the Muslim Brotherhood 				movement. At least 12 people were killed in Alexandria as Morsi's 				supporters and opponents fought in the streets, the official 				MENA news agency said. In Cairo's Tahrir Square, at least two people were killed 				when Morsi supporters traded fire with his opponents, state 				television reported. The clashes subsided when troops separated the protesters 				using armoured vehicles. We are not taking sides. Our mission is to secure the lives 				of protesters, military spokesman Colonel Ahmed Aly told AFP. Four protesters were killed outside the Republican Guard 				headquarters after breaking away from a pro-Morsi demonstration, 				MENA reported. In the restive north of the Sinai peninsula, armed Morsi 				supporters stormed the provincial headquarters in the town of 				El-Arish after a gunfight and raised the black banner of al 				Qaeda-inspired Islamist militants, an AFP correspondent said. International outcry A spokesman for UN chief Ban Ki-moon quoted him calling for a 				peaceful end to the crisis. There is no place for retribution 				or for the exclusion of any major party or community . The United States too condemned the clashes and urged all 				leaders including the army to ensure the bloodletting ended. We condemn the violence that has taken place today in Egypt. 				We call on all Egyptian leaders to condemn the use of force and 				to prevent further violence among their supporters, State 				Department spokeswoman Jen Psaki said. The Islamists accuse the military of conducting a brazen coup 				against Morsi, after millions called for his ouster on the June 				30 anniversary of his first turbulent year in power. The supreme guide of Morsi's Brotherhood, Mohammed Badie, 				vowed on Friday that members of the Islamist movement would 				throng the streets in their millions until his presidency is 				restored. Millions will remain in the squares until we carry our 				elected president, Mohamed Morsi, on our shoulders, Badie told 				supporters massed outside Cairo's Rabaa al-Adawiya mosque, 				before leading chants of Military coup! and Invalid! The armed forces have already sworn in Adly Mansour as 				interim president, and he issued his first decree on Friday, 				dissolving the Islamist-led parliament and appointing a new 				intelligence chief. Morsi preventively detained Morsi, who has not been seen since Wednesday, had issued a 				defiant call for supporters to protect his elected legitimacy , 				in a recorded speech aired hours after his removal. The military had said it supported the right to peaceful 				protest, but warned against violence and acts of civil 				disobedience. Army chief General Abdel Fattah al-Sisi announced Morsi's 				overthrow on Wednesday night, citing his inability to end a 				deepening political crisis. Military police rounded up senior Brotherhood members, 				although two were later released. Morsi himself was preventively detained , a senior officer 				told AFP. A judicial source said the prosecution would on Monday begin 				questioning Brotherhood members, including Morsi, for insulting 				the judiciary . Morsi's rule was marked by accusations that he concentrated 				power in the hands of the Brotherhood. FRANCE 24 with wires Some 30 people were killed 				across Egypt on Friday as Islamists opposed to the overthrow of 				President Mohammed Morsi took to the streets to vent their fury. 				On the same day, police arrested leading Muslim Brotherhood 				members for ?inciting violence?. Enraged Islamists pushed back Friday against the toppling of 				President 				 				Mohammed Morsi, as tens of thousands of his supporters took 				to the streets vowing to win his reinstatement and clashed with 				their opponents in violence that killed 30 and drove the divided 				nation toward an increasingly dangerous showdown. In a battle on a bridge over the Nile River in Cairo, gunfire 				rang out and flames leaped from a burning car as the rival camps 				threw volleys of stones and fireworks at each other. Military 				armored vehicles raced across the bridge in a counterattack on 				Morsi?s supporters. The clashes accelerated after the supreme leader of Morsi?s 				Muslim Brotherhood defiantly proclaimed that his followers would 				not give up street action until the return of the country?s 				first freely elected president, swept out of power days earlier 				by the military. 				 				Morsi opponents called out the public to defend against the 				Brotherhood, deepening the battle lines. In scenes of mayhem, troops opened fire on peaceful pro-Morsi 				protesters. Islamists threw one opponent off a rooftop. ?God make Morsi victorious and bring him back to the palace,? 				Brotherhood chief Mohammed Badie proclaimed before cheering 				supporters at a Cairo mosque in his first appearance since the 				overthrow. ?We are his soldiers we defend him with our lives.? Badie said it was a matter of honor for the military to abide 				by its pledge of loyalty to the president, in what appeared to 				be an attempt to pull it away from its leadership. ?Your leader 				is Morsi. ... Return to the people of Egypt,? he said. ?Your bullets are not to be fired on your sons and your own 				people.? Hours later, Badie?s deputy, Khairat el-Shater, considered 				the most powerful figure in the organization, was arrested in a 				Cairo apartment along with his brother on allegations of 				inciting violence, Interior Ministry spokesman Hani Abdel-Latif 				told The Associated Press. After the speech, a large crowd of Islamists surged across 				6th October Bridge over the Nile toward Tahrir Square, where a 				giant crowd of Morsi?s opponents had been massed all day. Battles broke out there and near the neighboring state TV 				building. Pro-Morsi youth shielded themselves from flying stones 				and fireworks with sheets of barricaded metal. A car burned at 				the top of an exit ramp amid the sounds of automatic weapons and 				shotguns. ?They are firing at us, sons of dogs! Where is the army?? one 				Morsi opponent shouted as another was brought to medics with his 				jeans soaked in blood from leg wounds. At least three people 				were killed at the bridge. The fighting ended when at least seven armored personnel 				carriers sped across the bridge, chasing away the Morsi 				supporters. Young civilians jumped onto the roofs of the APCs, 				shouting insults at the Islamists and chanting, ?The people and 				army are one hand.? Across the country, clashes erupted as Morsi supporters tried 				to storm local government buildings or military facilities, 				battling police or Morsi opponents. At least 30 people were 				killed throughout the day in Egypt, with 210 wounded, Heath 				Ministry official Khaled el-Khatib told The Associated Press. Islamists descended on anti-Morsi rally, opening fire with 				guns in the Mediterranean coastal city of Alexandria, where at 				least 12 people were killed, mostly Morsi opponents, emergency 				services official Amr Salama said. One man was stabbed and 				thrown from the roof of a building by Morsi supporters after he 				raised an Egyptian flag and shouted insults against the ousted 				president, according to an Associated Press reporter at the 				scene. Five policemen killed by militants in shootings around the 				Sinai city of el-Arish, according to security officials speaking 				on condition of anonymity because not authorized to talk to the 				press. The U.S. State Department condemned the violence and 				called on all Egyptian leaders to denounce the use of force and 				prevent further bloodshed among their supporters. ?The voices of all who are protesting peacefully must be 				heard ? including those who welcomed the events of earlier this 				week and those who supported President Morsi,? State Department 				spokeswoman Jen Psaki said in a statement. ?The Egyptian people 				must come together to resolve their differences peacefully.? Col. Ahmed Ali, a spokesman for the armed forces, said the 				Muslim Brotherhood was trying to ?pick a fight? with the army 				and ?drag it to a clash in order to send a message to the West 				that what happened in the country is a coup and that the 				military is cracking down on the peaceful protesters.? That mirrored a statement from an umbrella group of Morsi 				opponents ? including the National Salvation Front and youth 				groups. The group urged the public to take to the streets 				immediately ?to defend popular legitimacy? against what they 				called a ?malicious plot? by the Brotherhood. Islamists vowed to show by their numbers and the turmoil that 				the military had made a mistake by removing Morsi on Wednesday 				night. The action followed mass demonstrations for four days 				this week by the president?s opponents in the biggest rallies 				the country has seen. ?The military got itself in a trap by taking one side. Now 				they see the masses in the streets and now they realized that 				there are two peoples,? Hamada Nassar, a figure from the 				hard-line former militant group, Gamaa Islamiya, told AP. An interim president ? senior judge Adly Mansour ? was sworn 				in Thursday, and a Cabinet of technocrats is to be formed to run 				Egypt until new elections can be held, although officials have 				not said when that will be. Mansour dissolved the interim 				parliament ? the upper house of the legislature ? which was 				overwhelmingly dominated by Islamists and Morsi allies. He also 				named the head of General Intelligence, Rafaat Shehata, as his 				security adviser. The Islamists called rallies Friday to express their outrage 				at Morsi?s ouster. The Brotherhood has said it will not work 				with the new military-backed leadership, and Morsi?s supporters 				say the armed forces have wrecked Egypt?s democracy by carrying 				out a coup against an elected president. They accuse loyalists of former leader Hosni Mubarak, ousted 				in 2011, and liberal and secular opposition parties of turning 				to the army for help because they lost the election to 				Islamists. Many also see it as a conspiracy against Islam. The turmoil began in the afternoon when army troops opened 				fire as hundreds of his supporters marched on the Republican 				Guard building in Cairo. That site is where Morsi was staying 				when he was toppled before being taken into military custody at 				an undisclosed location. The crowd approached a barbed wire barrier where troops were 				standing guard. When one person hung a sign of Morsi on the 				barrier, soldiers tore it down and told the crowd to stay back. 				A protester put up a second sign, and the soldiers opened fire, 				according to an AP photographer. A protester fell dead with a gaping, bleeding wound in the 				back of his head, while others were bloodied and wounded. 				Witnesses told AP Television News at the scene that men in plain 				clothes fired the lethal shots. The Health Ministry said a total 				of four were killed at the site, though it was not known how all 				died. Protesters threw stones at the troops, who responded with 				volleys of tear gas. Many of those injured had wounds typical of 				birdshot. The BBC?s Middle East editor, Jeremy Bowen, was hit by 				birdshot in the head as he covered the clashes but said his 				injuries were superficial. Badie made his appearance three hours later on a stage in 				front of tens of thousands of Islamists massed at Rabia al-Adawiya 				Mosque, not far from the Republican Guard building. Morsi ?is my president and your president and the president 				of all Egyptians,? Badie proclaimed, thrusting his arms in the 				air, as a military helicopter circled low overhead. The gray-haired Badie is a revered figure among the 				Brotherhood?s followers, who swear an oath of absolute obedience 				to him ? to ?hear and obey.? The circumstances of his appearance were a mystery. Security 				officials had said Badie was taken into custody from a villa on 				the Mediterranean coast soon after Morsi?s removal Wednesday 				night and flown to Cairo, part of a sweep that netted at least 				five other senior Brotherhood figures and put around 200 more on 				wanted lists. Just before his speech, the Brotherhood?s political party 				said on its webpage that Badie had ?been released.? On stage, 				however, Badie denied he had been arrested. There was no 				immediate explanation from security officials. Authorities also announced the release of Saad Katatni, head 				of the Brotherhood?s political arm the Freedom and Justice 				Party, as well as one of Badie?s deputies, Rashad Bayoumi, 				pending further investigation. Fears have been running high over an Islamist backlash to 				Morsi?s overthrow. Extremist Islamist groups that gained 				considerable freedom to operate during Morsi?s year in office 				have already vowed violence in retaliation. The first major militant attack came before dawn Friday in 				the tumultuous Sinai Peninsula, killing at least one soldier. 				Masked assailants launched a coordinated attack with rockets, 				rocket-propelled grenades and anti-aircraft guns on the airport 				in the northern Sinai city of el-Arish, where military aircraft 				are located. Also hit was a security forces camp in Rafah on the 				border with Gaza, and five other military and police posts. One of military?s top commanders, Gen. Ahmed Wasfi, arrived 				at el-Arish to lead operations there as the army declared a ?war 				on terrorism? in Sinai. A crowd of Morsi supporters tried to 				storm the governor?s office in the city but were dispersed by 				security forces. On the night of Morsi?s ouster, jihadi groups rallied in 				el-Arish, vowing to fight. ?War council, war council,? a speaker 				shouted, according to online video of the rally. ?No 				peacefulness after today.? Islamic militants hold a powerful sway in the lawless 				northern Sinai. They are heavily armed with weapons smuggled 				from Libya and have links with militants in the neighboring Gaza 				Strip, run by Hamas. After the attack, Egypt indefinitely closed 				its border crossing into Gaza, sending 200 Palestinians back 				into the territory, said Gen. Sami Metwali, director of Rafah 				passage. 				At the Rabia al-Adawiya Mosque rally earlier in the day, the 				crowd filled much of a broad boulevard, vowing to stay until 				Morsi is reinstated. The protesters railed against what they 				called the return of the Mubarak regime. 				 ?The old regime has come back ... worse than before,? said 				Ismail Abdel-Mohsen, an 18-year-old student at the mosque rally. 				He described the interim president as ?the military puppet.? ?After sunset, President Morsi will be back in the palace,? 				they chanted. ?The people want God?s law. Islamic, Islamic, 				whether the army likes it or not.? Many held copies of the Quran in the air, and much of the 				crowd had the long beards of ultraconservative men or 				encompassing black robes and veils worn by women. One protester shouted that the sheik of Al-Azhar, Egypt?s top 				Muslim cleric who backed the military, was ?an agent of the 				Christians? ? reflecting a sentiment that the Christian minority 				was behind Morsi?s ouster. In southern Egypt, Islamists attacked the main church in the 				city of Qena. In the town of Dabaiya near the city of Luxor, a 				mob torched houses of Christians, sending dozens seeking shelter 				in a police station. AP Clashes erupted between 				supporters and opponents of ousted president Mohammed Morsi near 				Tahrir Square, shortly after the Muslim Brotherhood leader 				addressed a rally Friday. The health ministry reported over a 				dozen deaths and hundreds of injuries. ? Clashes between opponents and supporters of deposed 				president Mohammed Morsi broke out near Cairo?s Tahrir Square on 				Friday after a crowd of Morsi supporters surged over a Nile 				bridge toward the square, where anti-Morsi demonstrators have 				been camped. State TV said at least five people were killed in 				the clashes. ? Earlier Friday, Muslim Brotherhood chief 				Mohammed Badie addressed a rally in Cairo, after the Islamist 				movement denied earlier reports that he had been arrested. Badie 				said the Brotherhood is ready to reach an understanding with the 				army, but only if Morsi is reinstated. ? Health ministry 				officials said at least 17 people were killed and more than 200 				others were wounded in clashes across Egypt. ? At least three 				people died earlier in the day when security forces opened fire 				on Morsi supporters marching on Republican Guard headquarters in 				Cairo. ? An army spokesman denied that troops fired on Morsi 				supporters near the Republican Guard headquarters and said 				soldiers were only using blank rounds and teargas. ? Egypt?s 				interim head of state Adly Mansour has issued a decree 				dissolving the Islamist-led upper house of parliament and has 				appointed a new intelligence chief. The supreme leader of Egypt's 				Muslim Brotherhood, Mohammed Badie, has been arrested and taken 				to Cairo on a military helicopter, security officials say. 				Ousted president Mohammed Morsi was a member and former leader 				of the Islamist movement. Egypt's army rounded up the leadership of ousted president 				Mohamed Morsi's Muslim Brotherhood on Thursday as a top judge 				took office after an abrupt end to the Islamist's first year in 				power. 				 				Morsi's government unravelled late on Wednesday after the 				army gave him a 48-hour ultimatum in the wake of massive 				demonstrations since June 30 against his turbulent rule. Military chief General Abdel Fattah al-Sisi announced Morsi's 				overthrow, citing his inability to end a deepening political 				crisis, as dozens of armoured personnel carriers streamed onto 				Cairo's streets. And on Thursday, the army turned the screws on the 				Brotherhood, with military police arresting supreme leader 				Mohammed Badie for inciting the killing of protesters , a 				security official told AFP. A judicial source said the prosecution would on Monday begin 				questioning members of the group, including Morsi, for 				 insulting the judiciary as the charges began to pile up. Other Brotherhood leaders would be questioned on the same 				charges, including the head of the group's political arm Saad 				al-Katatni, Mohammed al-Beltagui, Gamal Gibril and Taher Abdel 				Mohsen. Morsi and other senior leaders have also been banned from 				travel pending investigation into their involvement in a prison 				break in 2011. The arrests came after chief justice Adly Mansour, 67, was 				sworn in as interim president at a ceremony broadcast live from 				the Supreme Constitutional Court. He will serve until elections at a yet-to-be determined date, 				said Sisi, as he laid out a roadmap for a political transition 				that includes a freeze on the Islamist-drafted constitution. As the world debated whether the military's action amounted 				to a real coup, analysts agreed that Morsi and his Islamist 				movement brought about their own rapid demise. Morsi and the Brotherhood made almost every conceivable 				mistake... they alienated potential allies, ignored rising 				discontent, and focused more on consolidating their rule than 				on using what tools they did have, Nathan Brown wrote on the 				New Republican website. A senior military officer said the army was preventively 				holding Morsi and that he might face formal charges linked to 				his prison escape during the revolt that overthrew dictator 				Hosni Mubarak in 2011. Morsi had issued a defiant call for supporters to protect his 				elected legitimacy , in a recorded speech hours after the 				military announced his ouster. We had to confront it at some point, this threatening 				rhetoric, the officer said. He succeeded in creating enmity 				between Egyptians. Morsi's rule was marked by a spiralling economic crisis, 				shortages of fuel and often deadly opposition protests. Thousands of protesters dispersed after celebrating wildly 				through the night at the news of his downfall. Egypt's press almost unanimously hailed Morsi's ouster as a 				 legitimate revolution. And the people's revolution was victorious, read the front 				page of state-owned Al-Akhbar. Morsi's opponents had accused him of failing the 2011 				revolution by concentrating power in the hands of his 				Brotherhood. His supporters say he inherited many problems from a corrupt 				regime, and that he should have been allowed to complete his 				term, which had been due to run until 2016. US President Barack Obama said he was deeply concerned over 				Morsi's ouster and urged the army to refrain from arbitrary 				arrests . In May, Washington approved $1.3 billion in military aid to 				Egypt. That was now under review, said Obama, as he called for a 				swift return to democratic rule. Germany termed Morsi's ouster by the military a major 				setback for democracy in Egypt , while Russia called on all 				Egyptian political forces to exercise restraint . Britain said it will work with the interim authorities 				despite not supporting the military intervention. UN chief Ban Ki-moon said civilian rule should be resumed as 				soon as possible and that Egypt's future should reflect the 				people's will, in a statement echoed by NATO. At least 10 people were killed in clashes in Alexandria and 				in the southern province of Minya during the night, security 				officials said. Already in the week leading up to Morsi's downfall, at least 				50 people died in clashes between his supporters and opponents. In addition to rounding up Brotherhood members, the security 				forces also turned off broadcasts by the group's television 				channel, a Morsi aide told AFP. AFP Egypt's army said Thursday it 				was preventively holding ousted president Mohammed Morsi in 				the defence ministry after it overthrew his government just a 				year after he came to power in the country's first democratic 				elections. Egypt?s army said it was ?preventively? holding ousted 				president Mohammed Morsi in the defence ministry on Thursday 				after it overthrew his Islamist-led government just one year 				after he became the country?s first democratically elected 				president. The military-led coup was hailed by ordinary Egyptians across 				the country. As army chief Abdel Fattah al-Sisi announced that 				Morsi?s rule was over, a huge crowd in Cairo?s Tahrir Square 				celebrated with singing, dancing and fireworks. Morsi came under intense pressure after the army issued a 				48-hour ultimatum on Monday for him to step down. The military said Morsi was detained along with a dozen 				presidential aides after he urged supporters on national 				television to support his ?legitimacy? and resist the military 				?peacefully?. ?We had to confront it at some point, this threatening 				rhetoric,? an officer told the AFP news agency. ?He succeeded in 				creating enmity between Egyptians.? Police also began rounding up leaders of Morsi?s Muslim 				Brotherhood movement. Saad al-Katatni, head of Morsi's Freedom 				and Justice Party, was put in custody and 300 arrest warrants 				have been issued for Brotherhood officials. Some reports said Morsi could potentially face charges 				related to his escape from jail in 2011, amid the unrest that 				led to the popular overthrow of long-time Egyptian leader Hosni 				Mubarak. The army also shut down three television channels deemed 				supportive of the toppled government, including one owned by the 				Brotherhood and the Qatar-owned Al Jazeera network. Days before Morsi?s downfall, millions of Egyptians angry 				about a declining economy and lack of representation in the 				Muslim Brotherhood-controlled government marched across the 				country. On several occasions, protesters clashed with Morsi 				supporters, also out in force, leading to at least 50 deaths. As General Sisi announced Morsi?s ouster on Wednesday, army 				tanks and trucks surrounded pro-Morsi rallies in fear of an 				outbreak of fresh violence. At least seven of Morsi's supporters were killed in clashes 				with security forces in Alexandria and the eastern city of Marsa 				Matrouh, security officials said. Roadmap but no timetable The army said that the current constitution drafted by 				Islamists would be temporarily suspended and would be reviewed 				in due time. It also promised early elections, in line with a 				new roadmap Egypt?s opposition helped craft. Liberal opposition leader Mohamed El Baradei, former head of 				the UN nuclear watchdog, sat beside Sisi as he announced on 				state television that Morsi's rule was over. The army chief, who was appointed defence minister by Morsi 				himself, was flanked by the head of the Coptic Church and Muslim 				spiritual leaders, in a well-orchestrated scene meant to reflect 				broad support for Morsi?s forced exit. The roadmap is meant to wipe clear a slate of messy 				democratic reforms enacted since Morsi took over, and is 				supposed to lead to presidential and parliamentary elections. 				However, there was no timetable for the new changes. World leaders expressed concern for the coup that toppled 				Morsi, with US President Barack Obama calling for a swift return 				to democratic rule. Fair Use Notice This site contains copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available in our efforts to advance understanding of environmental, political, human rights, economic, democracy, scientific, and social justice issues, etc. We believe this constitutes a 'fair use' of any such copyrighted material as provided for in section 107 of the US Copyright Law. In accordance with Title 17 U.S.C. Section 107, the material on this site is distributed without profit to those who have expressed a prior interest in receiving the included information for research and educational purposes. For more information go to: http://www.law.cornell.edu/uscode/17/107.shtml. If you wish to use copyrighted material from this site for purposes of your own that go beyond 'fair use', you must obtain permission from the copyright owner.