Egyptian?President Mohamed Morsi has been removed from power and the Egyptian constitution has been suspended by the country's military. The Muslim Brotherhood leader has been replaced by Adly Mansour, who is?the?chief justice of Egypt's constitutional court. Military chief General Abdel Fattah al-Sisi called ?for presidential and then parliamentary elections, the establishment of a panel to rewrite the constitution, a national reconciliation committee that would include youth movements, and?a national coalition cabinet. In the hours following Morsi's departure, Egyptian military forces have been? arresting pro-Islamist ?supporters and Muslim Brotherhood officials. They also? reportedly broke into a live Al Jazeera broadcast, arresting reporters and shutting down coverage. Morsi, who ?has been? moved ?to an undisclosed location, rejected the military declaration and?called for?citizens to peacefully resist the military coup. After serving as head of state for a year, Morsi's?office urged ?that civilians and military members to uphold the law, and the Constitution, and not to accept that coup which turns?Egypt?backwards. Sisi? warned that?the armed forces and police will deal decisively with violence responding to the army's decision. Ahead of a?11 a.m. EDT deadline imposed by the military, Morsi refused?to step down. At 12:42 EDT Cairo journalist Jake Shenker? tweeted : Egypt 's current crisis is approaching a disturbing climax. Subsequently Egypt?s army began?mobilizing troops?and?blockading?bridges. A travel ban ?was placed on the president and other top Muslim Brotherhood figures, according to?The New York Times ? and? Agence France-Presse. Egyptian troops, including commandos, then deployed near protest sites and key facilities. Earlier a?Morsi advisor? said : ?For the sake of Egypt and for historical accuracy, let?s call what is happening by its real name: Military coup.? BBC Middle East editor Jeremy Bowen?reported?that the army was deploying all over Cairo, especially at Cairo University ? a pro-Morsi hotspot. ? Storyful @Storyful July 3, 2013 Earlier?the army commandeered ?the State TV?building and removed the staff responsible for live coverage,? NBC's?Richard Engel reported. Here's a photo that shows the secular/Islamist make up of Egypt: On Tuesday?Reuters reported, citing military sources, that?the army had drafted a plan to suspend the constitution and dissolve the Islamist-dominated upper house of parliament?if Islamist President Mohamed Morsi and his opponents fail to reach a power-sharing agreement by Wednesday. Morsi rejected?that ultimatum, defiantly claiming that no domestic or international forces would threaten his legitimacy as the elected head of state.? The price ... is my life, the Muslim Brotherhood leader?said. The opposition responded:? Morsi's tweet is pushing [the] country toward 'civil war,' according to Bloomberg. Egypt's army commander subsequently said that the army was willing to?shed its blood to defend Egypt against ?any terrorist, radical or fool.? Reuters notes that on Tuesday at least 16 people, mostly ?Morsi supporters, were killed and about 200 wounded when gunmen opened fire on pro-[Morsi] demonstrators at Cairo University campus. Many fear that there will be much more bloodshed if the deadline passes without a deal, although no one really knows what will happen if Morsi doesn't back down. On F ebruary 11, 2011, then-President Hosni Mubarak stepped down and turned power over to the military after three weeks of protests in which hundreds of demonstrators were killed. On June 17 Morsi won the country's first democratic elections with 51.7% of the vote. Morsi subsequently ordered the retirement of the top Mubarak-era military leadership, unilaterally extended his presidential powers, and approved an Islamist-crafted constitution while the economy continued to sputter. We'll ?be following the developments throughout the day.