By Alun Palmer in Cairo BBC journalist Jeremy Bowen was shot in the head and leg today as demonstrations in Egypt ended in bloodshed. He was wounded as tens of thousands of people took to the streets over the ousting of president Mohammed Morsi by the military. Islamist leaders had called for a day of rage across the country after a military coup deposed Egypt?s first democratically elected leader. Rubber bullets and tear gas were fired outside Cairo?s Republican Guards Club where the deposed president is believed to be held. Bowen, a veteran of conflicts around the globe, said it was the first time he had been shot. As I helped his cameraman bandage his wounds, he said: ?I was crossing the road when they opened fire. I think it was a shotgun. I got two pellets in the leg and one in the ear. It came out of nothing.? Bowen, 53, added: ?As the crowd got angrier and angrier it started to surge forward and someone opened fire straight away from the military side. ?Before they had used any kind of teargas they resorted to live fire. ?Initially I thought it was in the air and then I saw the weapons were levelled. After that I saw a man went down. I saw the body, bloodied, being carried away. ?We?d been hanging around filming, they fired some gas and the crowd scattered, and just as I was reaching the curb and I felt something hit the side of my head by my ear and my leg. ?I?ve been in a lot of hairy situations as a reporter over many years but I have never been hit by anything.? Earlier in the day more than 200,000 people gathered at sites across Cairo after Friday prayers. At Cairo University, the Imam asked worshippers ?Would you die for god on this ground?? Yes they replied as one. The preacher, his voice soft and cracking with fake emotion, implored the 300 faithful of their duty to fight for Allah before raising his voice, and the crowd, into a frenzy. After prayers, the young and old went to the barricade and armed themselves with sticks and iron bars as thousands marched in from surrounding mosques. From the subways they poured to different rallying points in the city. Young and old, men and women in their thousands all chanting in praise of Morsi. At the Raba El-Adwyia square, in the Nasr City district, more than 100,000 gathered for prayers and protest. Side streets and rooftops were packed as supporters of the Muslim Brotherhood president and his government. Friendly protestors welcomed me with water and fig rolls as I passed through. Each asked to get their message out that democracy, and their votes, must be protected. All voiced their hatred for army chief Gen Abdul Fattah al-Sisi, the head of the military who led the coup. In one side street a huge photo of the officer was repeatedly walked on and hit with shoes, an insult in the Middle East. A splinter group from the set out to the nearby Republican Guards Club where Morsi is believed to be held. As a flag was draped on a barricade without warning, teargas and shotguns were fired on the crowd. Eyes streaming from the potent mixture, the crowd tried to stand firm. ?I have no guns, I have no weapons I have nothing,? one injured man told me. ?We have nothing but they opened fire on their own people.? Looking around the crowd, no-one was carrying a weapon. Without warning and little provocation, another volley of shotguns, plastic bullets and tear gas was fired from the army lines. The wounded were dragged back to the lines and dozens braved more rounds to drag one body back to relative safety. He was later declared dead. News of the killing spread quickly around Cairo and a steady stream of cars and buses began bringing more numbers to the flashpoint. Behind barbed wire, the soldiers remained impassive. Before the day of rage, the army said it will allow demonstrations as long as they are peaceful and did not threaten national security. The arrest of Morsi and 200 other Muslim Brotherhood and Islamist leaders has sparked widespread discontent. Early this morning a soldier was killed after Islamist militants attacked military and police checkpoints in the Sinai Peninsula with rockets and mortar fire. Muslim Brotherhood supporters in a town north of Cairo also claimed to have been attacked on Thursday night. More than 50 people have died since the latest unrest began on Sunday with 23 dead on Tuesday night when Morsi supporters clashed with protesters near Cairo University. Egypt?s top judge Adli Mansour was sworn in as interim president in a ceremony on Thursday where he praised the army, police, media and judiciary for standing against the Brotherhood. But the Islamist group said it would not work with the new leadership and called for a wave of protests dubbing it the day of rage or day of resistance. Brotherhood officials urged their followers to keep their protests peaceful. In a statement, read by senior cleric Abdel-Rahman el-Barr to a crowd outside the Rabia al-Adawiya Mosque, the group said: ?We declare our complete rejection of the military coup staged against the elected president and the will of the nation. ?We refuse to participate in any activities with the usurping authorities.?