Morsi was a member of the Brotherhood?s Guidance Bureau before his inauguration in June 2012. He called on protesters to practice self-restraint and peaceful protesting. The statement also denounced the ?killing, arrests, chaining of media freedom and the closing of TV channels,? describing it as tactic of the ?oppressive police state.? On Wednesday night, Egypt?s military commander-in-chief Abdel-Fattah El-Sisi handed over power to the head of High Constitutional Court Adly Mansour, dismissing Mohamed Morsi from presidency, in response to the demands of millions calling for early presidential elections. The military statement was rejected by Morsi who issued a statement asserting that he remains president of Egypt and the high commander of the armed forces. Muslim Brotherhood leader Mohamed El-Beltagy, currently on travel ban for insulting Egypt?s judiciary, stated earlier on Wednesday that the removal of Morsi will push some groups to use violent resistance. Morsi?s dismissal was followed by the Muslim Brotherhood-owned television channel Misr 25 going off the air along with several other Islamist-run channels, including the controversial Hafez and Al-Nas. The ejected president a long with nine leading Islamist figures will be investigated next week by the Egyptian prosecution for insulting the judiciary. Read the original article here. ?No more beards!? Egypt celebrates arrest of Muslim Brotherhood leader as army hunts three hundred followers of deposed president Morsi The supreme leader of Egypt?s Muslim Brotherhood has been arrested over the killing of eight protesters during the uprising which toppled President Mohamed Morsi, security officials revealed today. Mohammed Badie was detained late last night in the Mediterranean coastal city of Marsa Matrouh, near the Libyan border, where he has been staying in a villa owned by a businessman with Brotherhood links. He was flown to Cairo on a military helicopter, according to the officials, who spoke on condition of anonymity because they were not authorized to speak to the media. He, and his powerful deputy, Khairat el-Shater, are wanted for questioning over their role in the killing this week of eight demonstrators in clashes outside the Brotherhood?s Cairo headquarters. A report by the official news agency gave no further details, but Mr Badie and Mr el-Shater are on a wanted list of more than 300 Brotherhood members and leaders of other Islamist groups. The BBC Middle East Editor Jeremy Bowen reporting from Egypt tweeted that a chant secular Egypt loves to hear at demos is: ?No more beards?, in relation to the beard-wearing Muslim Brotherhood. Badie and el-Shater have been widely believed to be the source of real power in Egypt during the rule of Mr Morsi. Morsi himself, the Brotherhood veteran who a year ago became Egypt?s first freely elected president, has been held in an unknown location since the generals pushed him out yesterday. The Brotherhood announced it would boycott the new military-sponsored political process and called on its supporter to restrain themselves and not use violence. ?We declare our uncompromising rejection of the military coup staged against the elected president and the will of the nation and refuse to participate in any activist with the usurping authorities,? said the statement, which the group?s mufti Abdel-Rahman el-Barr read to the Morsi?s supporters staging a days-long sit-in in Cairo. The arrest came as the chief justice of Egypt?s Supreme Constitutional Court was sworn in as the nation?s interim president, taking over hours after the military ousted the Islamist President Mohammed Morsi. Celebrations took place across Egypt all last night after the head of Egypt?s armed forces issued a declaration suspending the constitution and appointing the head of the constitutional court as interim head of state. Gehad el-Haddad, a spokesman for the Muslim Brotherhood party, said Morsi was under house arrest at a Presidential Guard facility where he had been residing, while 12 of his aides were also being held. Earlier, the chief justice Adly Mansour took the oath of office at the Nile-side Constitutional Court in a ceremony broadcast live on state television. According to military decree, he will serve as Egypt?s interim leader until a new president is elected. A date for that vote has yet to be set. In his first remarks, Mr Mansour praised the massive street demonstrations that led to Mr Morsi?s removal. He also hailed the youth behind the protests that began on June 30, saying they embodied ?the nation?s conscience, its ambitions and hopes?. ?The most glorious thing about June 30 is that it brought together everyone without discrimination or division,? he said. ?I offer my greetings to the revolutionary people of Egypt.? Dressed in a dark blue suit and blue tie, Mr Mansour said the revolution must continue ?so we stop producing tyrants?. ?I look forward to parliamentary and presidential elections held with the genuine and authentic will of the people,? he said. ?The youth had the initiative and the noblest thing about this glorious event is that it was an expression of the nation?s conscience and an embodiment of its hopes and ambitions. ?It was never a movement seeking to realise special demands or personal interests.? Mr Morsi was Egypt?s first democratically elected president but was overthrown by the military yesterday after just one year in office. The military, in a statement read by army chief General Abdel-Fattah al-Sissi last night, also suspended the Islamist-drafted constitution and called for new elections. Mr Morsi has denounced the action as a ?full coup? by the generals. Millions of anti-Morsi protesters around the country erupted in celebrations after the televised announcement by the army chief. Fireworks burst over crowds in Cairo?s Tahrir Square, where men and women danced, shouting, ?God is great? and ?Long live Egypt.? But clashes erupted in several provincial cities when Islamists opened fire on police, with at least 14 people killed, security officials said. Fears were also growing of further unrest as Islamists took to Twitter to organise a series of rallies to coincide with Friday prayers. That fact that Egypt?s interim president comes from the Constitutional Court adds a symbolic sting to Mr Morsi?s removal. The Islamist leader and his Muslim Brotherhood backers had repeatedly clashed with the judiciary while in power, accusing the judges of being loyalists of former autocrat Hosni Mubarak, who was ousted in a 2011 uprising, and saying they seek to undermine Egypt?s shift to democratic rule. Read the original article with photographs here: