GLOBALPOST LIVE BLOG: MORSI OUT, EGYPT MOVES TOWARD UNCERTAIN FUTURE The United States is monitoring the very fluid situation in Egypt, and we believe that ultimately the future of Egypt can only be determined by the Egyptian people. Nevertheless, we are deeply concerned by the decision of the Egyptian Armed Forces to remove President Morsy and suspend the Egyptian constitution. I now call on the Egyptian military to move quickly and responsibly to return full authority back to a democratically elected civilian government as soon as possible through an inclusive and transparent process, and to avoid any arbitrary arrests of President Morsy and his supporters. Given today?s developments, I have also directed the relevant departments and agencies to review the implications under U.S. law for our assistance to the Government of Egypt. CBC reported that the new president saluted protesters, youth, and the military, and declared the era of dictators in Egypt over. Dr. Mohamed Morsi, President of Egypt, emphasizes that the measures declared by the Chief Command of Armed Forces represent a military coup d??tat, which we categorically reject, in whole or part by all the honest honorable men who struggled for the transformation to democracy. The president stresses, in his capacity as the president of the republic and chief commander of armed forces, that all the citizens, civilians and militarians, leaders and soldiers, are required to adhere to the Constitution and law; not to respond to this coup which will throw Egypt back to the dark ages; and to maintain peaceful behaviors and avoid bloodshed. The opposition group in Egypt, a coalition including the June 30 Front Tamarod and ElBaradei's Dostor party, have released a statement. We are the People of Egypt. We have spoken, and we demand to be heard. Democracy is not merely an election. The President and his supporters have chosen alienation and divisiveness. We the people of Egypt choose another path, a path that has brought together Egyptians from all walks of life, women and men, Christian and Muslim, young and old, conservative and progressive, north south east and west. All of Egypt including the military, the government, the judiciary, the police, Al Ahzar and the Church have come together the serve the people. The people will not be exploited again. When a government?s legitimacy is called in to question, and millions take to the street demanding to be heard, a government of the people would listen. Instead Morsi and the Muslim Brotherhood have chosen to dig in their heels and attempted to paint dissenters as thugs and criminals; a strategy that has served them well in the past, but has brought the nation to the brink. Most of the Islamist bloc has joined the call for early election. Morsi?s support has diminished to only the Muslim Brotherhood, those who will directly profit from his tight grip on power. The people of Egypt have made it clear, they want a government that represents them with all their diversity, and not just a government comprising of a single party. The time of one party rule is gone. The people have come together to put a stop to the policies of the Muslim brotherhood, which threaten to turn Egypt into a failed state and become a breeding ground for Islamic Jihadist. We call on the Military to protect the Egypt?s National Security from the threat of civil war. We call on the police to arrest those who incite to violence, and the perpetrators of violence. We call on the international community to hear the call for across Egypt, we will not be threatened into submission by a President or his men again. The president of the republic was not consulted about the statement issued by the armed forces, Morsi's statement read. The presidency sees that some of the statements in it carry meanings that could cause confusion in the complex national environment.