Les islamistes ont appel? t?t samedi ? de nouvelles manifestations pacifiques en soutien au pr?sident Mohamed Morsi renvers? par l'arm?e, au lendemain d'une journ?e de violences en Egypte au cours de laquelle 25 personnes ont p?ri, dont 19 en marge de manifestations. Army soldiers stand guard near a supporter of ousted President Mohamed Mursi at Cairo University in Giza, on the outskirts of Cairo July 4, 2013. The leader of the Muslim Brotherhood was arrested by Egyptian security forces on Thursday in a crackdown against the Islamist movement after the army ousted the country's first democratically elected president Mursi. At least 16 people have been killed and hundreds wounded in street clashes across Egypt since Mursi's overthrow. The words on the poster read, Yes to legitimacy . REUTERS/ Asmaa Waguih EGYPT - Tags: POLITICS CIVIL UNREST MILITARY - RTX11CMO Ce samedi, la cour criminelle du Caire a entendu les plaidoiries des avocats de la d?fense avant de lever l'audience. Il est jug? pour corruption et complicit? de meurtre de manifestants lors de la r?volte de 2011.? 10h46 : Alors que le procureur a annonc? que des poursuites seraient lanc?es ? l'encontre de neuf dirigeants des Fr?res musulmans pour incitation au meurtre de manifestants, des sources judiciaires indiquent que l'interrogatoire de Mohamed Morsi et des autres d?tenus pourrait commencer lundi prochain.? 10h38 : Au lendemain des affrontements mortels entre pro et anti Morsi, l'heure est au nettoyage dans les rues du Caire.? Les services de nettoyage dans les rues du Caire. - REUTERS/Louafi Larbi 10h11 : Tandis que les v?hicules des forces de l'ordre arborent des portrait d'Abdel Fattah al-Sissi, chef des arm?es et nouvel homme fort du pays, les Fr?res musulmans ont ?tabli des barricades pr?s de l'Universit? du Caire, ?levant des portraits du pr?sident d?chu devant les forces de s?curit?.? 10h02 : Apr?s la nuit de violences, qui aurait co?t? la vie ? 30 personnes, l'atmosph?re demeure tendue dans les rues du Caire.? Un journaliste de l'AFP a constat? la pr?sence des forces anti-?meutes ? plusieurs carrefours et sur des ponts, avec des fourgons et des hommes en armes.? 08h45 : Il faut dire que la l?gislation am?ricaine est on ne peut plus claire. Toute aide militaire ou ?conomique ? un pays dont le gouvernement a ?t? renvers? par l'arm?e doit ?tre annul?e.? Une autre clause pr?cise que l'Egypte doit soutenir la transition vers un gouvernement civil . Mais depuis 2012, les secr?taires d'Etat Hillary Clinton puis John Kerry ont chacun lev? cette condition pour d?geler les cr?dits, au nom des int?r?ts de s?curit? nationale.? Les aides militaires du gouvernement ? l'Egypte s'?l?veraient ? 1,3 milliard de dollars, couvrant 80% des achats annuels en ?quipement de l'arm?e.? 08h41 : Le s?nateur John McCain appelle le gouvernement am?ricain ? suspendre les aides allou?es ? l'Egypte, relate Al Jazeera.? Nous ne pouvons pas r?it?rer les erreurs que nous avons commises dans notre histoire en soutenant le renversement de gouvernements ?lus d?mocratiquement. John McCain, s?nateur r?publicain am?ricain 07h22 : D'apr?s la cha?ne Al Jazeera, ce sont 30 personnes qui auraient p?ri suite ? la journ?e de violences.? Le parti salue les millions d'Egyptiens qui se sont mobilis?s vendredi dans toutes les provinces d'Egypte pour d'?normes manifestations pacifiques exprimant leur rejet du brutal coup d'Etat militaire et leur d?sir de voir le retour du pr?sident Mohamed Morsi ? ses fonctions constitutionnelles , indique le Parti de la libert? et de la justice PLJ , vitrine politique des Fr?res musulmans dont est issu le pr?sident Mohamed Morsi renvers? mercredi par l'arm?e.? Le parti affirme qu'il restera avec tous ses membres et ses sympathisants au c?t? des foules sur les places d'Egypte jusqu'? ce que le pr?sident soit r?tabli dans ses fonctions , poursuit-il, appelant ses partisans ? respecter le caract?re pacifique des manifestations et ? ne pas c?der ? la violence. ? 02h18 : Les ?changes de tirs se poursuivent pas aussi intens?ment qu'avant, mais par vagues dans le centre ville du Caire, indique un journaliste local, affirmant par ailleurs que les islamistes occupent la mosqu?e de Manial et tirent depuis son toit.? I can hear the shooting loud and clear every now and then, not as intense as before but on and off. -- Mohannad Sabry @mmsabry July 6, 2013 01h55 : Une vid?o YouTube montre l'arrestation du num?ro deux des Fr?res musulmans sans violence.? 01h52 : Alors que la tension est extr?me entre pro et anti-Morsi qui se sont affront?s ? travers le pays dans des heurts sanglants, le Parti de la libert? et de la justice servant de vitrine politique aux Fr?res musulmans dont est issu le pr?sident Mohamed Morsi renvers? mercredi par l'arm?e, a insist? sur le caract?re pacifique des manifestations auxquelles il appelle samedi.? 01h48 : Le photojournaliste Jonathan Rashad donne un aper?u des d?g?ts provoqu?s par les tirs de chevrotines, nombreux lors de cette nouvelle journ?e et nuit de violence en Egypte.? 01h16 : Le mot coup d'Etat revenant dans toutes les bouches, les opposants du pr?sident Morsi destitu? mercredi ont ?t? jusqu'? inscrire leur d?n?gation en lettres g?antes sur un b?timent de la place Tahrir ? l'aide d'un laser dans la soir?e de vendredi.? Yes, it is not a coup in #Egypt! pic.twitter.com/MW2uzt1SeF 01h13 : Alors que les heurts entre opposants et partisans du pr?sident Mohamed Morsi, destitu? mercredi par l'arm?e, se poursuivent, faisant des dizaines de morts rien que ce vendredi, le secr?taire g?n?ral de l'ONU Ban Ki-moon a mis en garde les Egyptiens contre toute politique de repr?sailles , ainsi que l'exclusion d'un parti ou d'une communaut? .? 00h56 : Selon cet autre journaliste, les ?changes de tirs se poursuivent aussi sur le pont de l'universit? du Caire.? Je n'arrive pas ? y croire, c'est une bataille totale , commente le reporter dans un autre tweet.? @RashaPress says gunfire sounds continues on CaiUni bridge. -- Mohannad Sabry @mmsabry July 5, 2013 00h53 : Selon ce journaliste bas? au Caire, au moins deux personnes sont mortes dans des affrontements avec des manifestants islamistes dans le quartier de Manial. Les pro-morsi utilisent des armes automatiques sur le pont El-Gamaa. Les r?sidents du Manial n'ont que des plombs pour oiseaux. ? Supporters of Morsi on El-Gamaa bridge are using automatic machineguns. Residents of Manial have birdshot pellets only. #Egypt 00h44 : Les affrontements sur le pont du Six Octobre ont cess? avec l'arriv?e des chars, mais se poursuivent dans les quartiers de l'universit? du Caire et de Manyal, selon ce journaliste bas? dans la capitale ?gyptienne.? Heavy machine gun fire exchange loud and clear coming from Cai Uni and Manyal side. -- Mohannad Sabry @mmsabry July 5, 2013 00h36 : Khairat al-Chater, l'adjoint au Guide supr?me des Fr?res musulmans ?gyptiens a ?t? arr?t? tard dans la nuit de vendredi ? samedi, a annonc? une source au sein des services de s?curit?, se refusant ? donner plus de d?tails.? Mais des cha?nes de t?l?vision locales ont affirm? que Khairat al-Chater -contre lequel les autorit?s avaient lanc? un mandat d'arr?t apr?s le coup militaire qui a renvers? mercredi le pr?sident Mohamed Morsi, issu de la puissante confr?rie- avait ?t? arr?t? dans une maison du faubourg de Nasr City, dans l'est du Caire.? 00h34 : Douze personnes ont p?ri et 200 ont ?t? bless?es lors de heurts entre partisans et opposants du pr?sident d?chu Mohamed Morsi dans la nuit de vendredi ? samedi ? Alexandrie, rapport? l'agence officielle Mena.? Un responsable de la Sant? dans la ville c?ti?re a pr?cis? ? l'agence que la plupart des d?c?s ?taient dus ? des tirs de balles r?elles et de chevrotine.? 00h28 : La journaliste bas?e au Caire Bel Trew se sent chanceuse : J'ai film? toute la journ?e et je n'ai pas ?t? arr?t?e. J'ai travers? des heurts et je ne me suis pas fait tirer dessus .? Feeling a bit jammy, I've been filming all day and have not been arrested, I went through clashes and didn't get shot = result. #egypt -- Bel Trew - ?? ??? @Beltrew July 5, 2013 00h21 : Un journaliste bas? au Caire indique sur Twitter que des checkpoints ont ?t? install?s sur le pont du Six Octobre o? se d?roulaient des affrontements.? Some people managing checkpoints at 6th of October bridge after violent clashes #Cairo #Egypt 00h18 : Le correspondant de CNN au Caire emp?ch? de faire un direct rassure ses auditeurs. En attendant qu'un officier de l'arm?e ne leur rende leur cam?ra comme apparemment promis , l'?quipe va bien. Boit du th? au bord du Nil, profite de la fra?cheur de la soir?e .? Cnn crew in Cairo fine. Sipping tea by the Nile, enjoying the evening cool, waiting for Army officer to return our camera. #Egypt #30June -- benwedeman @bencnn July 5, 2013 23h50 : Sur Twitter, plusieurs m?dias indiquent que les soldats les emp?chent de prendre des images des affrontements. Dans cette vid?o de CNN, on voit leur intervention en direct, pendant que l'?quipe de la cha?ne de t?l?vision am?ricaine tente de rendre compte des ?v?nements.? 23h41 : Alors que les m?dias am?ricains font ?tat de 17 morts dans la journ?e de vendredi, l'agence France Presse indique que les violences ont fait 14 morts dans le pays, dont huit en marge de manifestations.? 23h25 : Dans le Nord-Sina?, les manifestants arm?s sont entr?s dans le si?ge du gouvernorat local, situ? ? El-Arich, qui a ?t? abandonn? par les forces de s?curit? apr?s des ?changes de tirs et ont hiss? leur drapeau.? 23h12 : Alors que plusieurs islamistes avaient publiquement menac? de commettre des violences en repr?sailles ? l'?viction du pouvoir du pr?sident Mohamed Morsi, issu des Fr?res musulmans, cinq policiers ont ?t? tu?s vendredi soir par des hommes arm?s dans le Sina?, au nord-est de l'Egypte peu apr?s la mort plus t?t dans la journ?e d'un soldat dans cette r?gion instable, frontali?re avec Gaza et Isra?l.? On a maintenant la confirmation qu'il s'agit d'une attaque d'islamistes.? 23h01 : Des m?dias am?ricains comme la cha?ne de t?l?vision ABC font maintenant ?tat de 17 morts dans les affrontements ce vendredi en Egypte.? 22h53 : Un total de huit personnes ont p?ri vendredi dans des affrontements entre partisans et opposants du pr?sident Mohamed Morsi, ainsi qu'entre pro-Morsi et forces de l'ordre, ont rapport? les m?dias officiels.? Outre les deux personnes tu?es place Tahrir, on enregistre :? - une personne tu?e et 120 autres bless?es dans des heurts ? Alexandrie entre pro-Morsi d'une part et anti-Morsi et forces de l'ordre d'autre part? - et un quatri?me mort ? Assiout, dans le Sud, lors de heurts entre des partisans de l'ex-chef d'Etat et les forces de l'ordre qui ont ?galement fait 19 bless?s.? Alors que, plus t?t dans la journ?e, quatre manifestants pro-Morsi ont ?t? tu?s lors d'?changes de tirs avec les forces de l'ordre devant le si?ge de la Garde r?publicaine, non loin du palais pr?sidentiel, au Caire.? 22h46 : Nous ne prenons pas parti. Notre mission est de prot?ger la vie des manifestants , a affirm? le colonel Ahmed Ali de l'arm?e ?gyptienne.? 22h13 : L'arm?e va intervenir au Caire pour s?parer pro et anti-Morsi, annonce un porte-parole.? 22h11 : La t?l?vision d'Etat annonce que deux personnes sont mortes et 70 personnes bless?es aux abords de la place Tahrir.? 21h49 : Les heurts entre pro et anti-Morsi auraient fait deux morts pr?s de la place Tahrir, annonce la t?l?vision d'Etat.? Selon l'agence AP, qui cite une source au minist?re de la Sant? egyptien, les affrontements entre pro et anti-Morsi ont fait dix morts et 210 bless?s.? MORE: A Health Ministry official says 10 people have been killed and 210 wounded in clashes around Egypt: http://t.co/zAxIxrS14v -MM 21h46 : Ce journaliste raconte sur Twitter avoir entendu des tirs d'armes automatiques sur le pont du 6 Octobre.? Les 2 camps s'affrontent a moins de 100m les uns des autres. et toujours aucune trace de l'armee pour prot?ger les lieux. #egypte 21h14 : Des combats ? mains nues, plusieurs personnes pi?tinees aux abords de Tahrir , poste un reporter de BFMTV sur Twitter.? 21h11 : Selon plusieurs journalistes pr?sents place Tahrir, l'arm?e et la police n'interviennent pas dans les affrontements entre pro et anti-Morsi.? 21h09 : Selon BFMTV, la circulation est coup?e sur le pont du 6 octobre, des v?hicules sont en feu.? 21h09 : Le correspondant de NBC poste une photo des affrontements entre pro et anti-Morsi sur le pont du 6 Octobre pr?s de la place Tahrir au Caire.? Photo: Car set on fire on October 6 bridge as fighting rages on #egypt pic.twitter.com/coNMA2bluc -- Ayman Mohyeldin @AymanM July 5, 2013 21h07 : Le correspondant de NBC raconte que d'intenses combats se d?roulent depuis une heure maintenant, sans intervention de la police et de l'arm?e. Un h?licopt?re survole la zone tandis que les ambulances n'arrivent pas ? se frayer un chemin jusqu'aux bless?s place Tahrir.? One hour into intense fight. No police or military. One helicopter hovering above. Ambulances unable to access injured #egypt -- Ayman Mohyeldin @AymanM July 5, 2013 20h45 : Selon l'AFP, des tirs sont entendus et les deux camps se jettent des pierres sur le pont du 6-Octobre qui surplombe l'embl?matique place de la capitale ?gyptienne, tandis que des ambulances transportent des bless?s.? 20h43 : Selon un journaliste de Reuters sur place, la corniche au Caire prend des allures de champ de bataille. Les manifestants, arm?s de battes et de pierres, semblent pr?ts ? en d?coudre.? #Cairo's Corniche becoming a battle field: fire on October bridge, people with bats and rocks getting ready for confrontation 20h35 : L'AFP confirme que des affrontements entre pro et anti-Morsi ont lieu aux abords de la place Tahrir au Caire.? 20h34 : Selon une journaliste, les Fr?res musulmans tirent de la grenaille place Tahrir.? Les Fr?res tirent de la grenaille #tahrir -- vanessa descouraux @vdesc July 5, 2013 20h11 : Le procureur g?n?ral ?gyptien a lib?r? Saad al-Katatni, le chef du Parti de la justice et de la libert?, vitrine politique des Fr?res musulmans, et l'adjoint du Guide supr?me de la confr?rie, Rached Bayoumi, a indiqu? l'agence officielle Mena.? 19h24 : Des milliers de partisans du pr?sident ?gyptien d?chu Mohamed Morsi se dirigent vers le b?timent de la t?l?vision d'Etat au Caire selon un journaliste bas? dans la capitale.? Ils croiseraient donc la route des militants anti-Morsi r?unis sur la place Tahrir, faisant craindre de nouveaux d?bordements.? Thousands of pro-#Morsi protesters are now heading to Maspero state TV building in central #Cairo #Egypt 19h19 : Deux policiers post?s devant un b?timent gouvernemental ont ?t? tu?s par des hommes arm?s ? El-Arich dans le Sina? nord , a indiqu? une source au sein des services de s?curit?.? Des hommes arm?s circulant sur une motocyclette ont tir? sur les policiers, tuant deux d'entre-eux, avant de prendre la fuite , a pr?cis? cette source.? 18h51 : L'agence de notation Fitch a abaiss? d'un cran la note de l'Egypte ? B- contre B auparavant, et lui attribue une perspective n?gative.? 18h45 : Le coup d'Etat militaire n'est pas valide ass?ne Mohamed Badie, Guide supr?me des Fr?res musulmans, en plein discours.? 18h22 : Alors que la police ?gyptienne pr?tendait jeudi son arrestation, le Guide supr?me des Fr?res musulmans, Mohamed Badie, appara?t ? un rassemblement de ses partisans. Il promet que les Fr?res musulmans resteront mobilis?s par millions jusqu'? ce que nous portions en triomphe notre pr?sident ?lu .? Nous sacrifierons nos ?mes pour vous a-t-il ?galement adress? au pr?sident d?chu Mohamed Morsi.? Badie to Morsi: We will sacrifice our souls for you -- Mada Masr @MadaMasr July 5, 2013 L'Egypte regrette profond?ment la d?cision du Conseil de paix et de s?curit? de l'Union africaine de suspendre sa participation aux activit?s de l'organisation panafricaine, a indiqu? le minist?re des Affaires ?trang?res dans un communiqu? publi? sur sa page Facebook officielle.? 18h02 : Alors que les manifestations continuent dans les rues du Caire, un responsable des Fr?res musulmans appelle les militants pro-Morsi ? ne pas s'en prendre ? l'arm?e.? L'arm?e ?gyptienne est une ligne rouge qu'il ne faut pas franchir , a affirm? Ahmed Fahmy, selon une d?claration rapport?e par la t?l?vision d'Etat.? 18h02 : Then shots rang out. But multiple witnesses said it was NOT troops firing at civilians -- Alastair Beach @Alastair_Beach July 5, 2013 18h00 : Il y aurait un quatri?me mort lors des manifestations au Caire.? Selon un journaliste correspondant du UK Independant, des t?moins affirment que cette nouvelle victime aurait ?t? tu?e par un homme en civil. L'arm?e n'aurait fait que tirer dans les airs pour disperser la foule.? Two witnesses said the death was caused by men in civilian clothes. Army was firing, but in air. 17h36 : Les Fr?res musulmans d?mentent l'arrestation de leur guide supr?me, Mohamed Badie, cens? avoir ?t? arr?t? par la police militaire ?gyptienne jeudi.? Le num?ro un de la confr?rie doit faire un discours en fin d'apr?s-midi devant les partisans de Mohamed Morsi r?unis pr?s d'une mosqu?e de Nasr City, un faubourg du Caire, a d?clar? ? l'AFP un porte-parole des Fr?res, Ahmed Aref.? le parti des fr?res annoncent le guide supr?me ? la tribune de rabaa, les autorit?s ont dit l'avoir arr?t?. #egypte #respire -- vanessa descouraux @vdesc July 5, 2013 17h30 : Un des leader des Fr?res Musulmans, Mohamed El Beltagi, en plein discours enflamm? devant les manifestants.? MB leader Mohamed el Beltagi giving a fiery address near gates at front of protest pic.twitter.com/JaHH04zRFM 17h22 : Apr?s l'annonce de la dissolution de la Choura, la chambre haute du Parlement domin?e par les islamistes, le pr?sident int?rimaire Adly Mansour vient de nommer un nouveau chef des renseignements, Mohammed Ahmed Farid.? La chambre haute, qui assumait la totalit? du pouvoir l?gislatif apr?s la dissolution l'an dernier de la chambre des d?put?s, ?tait acquise au pr?sident Mohamed Morsi.? 17h12 : Selon l'agence de presse AP, le pr?sident par int?rim a dissous le parlement.? BREAKING: Egypt TV: Interim president dissolves Islamist-led parliament. -BW 17h02 : Longtemps m?connu des Egyptiens, Mohamed El Baradei s'impose comme le porte-parole de l'opposition. La destitution de Mohamed Morsi repr?sente une occasion unique pour l'ex-diplomate lib?ral d'acc?der aux r?nes du pouvoir.? 16h55 : Ironiquement, le journaliste ind?pendant Sharif Kouddous, montre l'une des affiche de campagne publicitaire de l'arm?e, proche du lieu o? s'est d?roul?e la fusillade mortelle.? Selon lui, la situation s'est toutefois apais?e, bien que la foule continue de grossir.? And off to the side where soldiers fired live ammo at citizens is the army's favorite propaganda banner #Egypt pic.twitter.com/R4OALvvUOh -- Sharif Kouddous @sharifkouddous July 5, 2013 16h46 : Beaucoup disent qu'ils sont venus pour protester devant le b?timent de la garde r?publicaine parce qu'ils croient que Mohamed Morsi est ? l'int?rieur. ? 16h35 : Le reporter de la BBC a ?t? lui-m?me touch? ? la t?te mais va bien selon Sharif Kouddous, un confr?re.? Ce dernier a twitt? de nombreuses photos de la manifestation et des victimes. Attention, certaines images peuvent ?tre choquantes.? BBC reporter @BowenBBC hit in the head with birdshot. He's ok. pic.twitter.com/2ihAmOvpDL -- Sharif Kouddous @sharifkouddous July 5, 2013 16h31 : Avant les tirs devant la Garde r?publicaine, Human Rights Watch avait r?clam? une enqu?te rapide et impartiale pour d?terminer les responsables de la cinquantaine de morts d?j? survenues depuis une dizaine de jours.? 16h13 : Toujours selon Jeremy Bowen, les soldats de la Garde R?publicaine auraient envoy? des grenades lacrymog?nes sur la foule qui avait entour?e les corps des victimes de la fusillade.? Tear gas fired by army at crowd that had gathered round the body of dead protestor #cairo -- Jeremy Bowen @BowenBBC July 5, 2013 16h11 : D'apr?s la journaliste de France Inter Vanessa Descoureaux, des rumeurs font ?tat de l'instauration d'un couvre-feu pour ce soir au Caire.? les rumeurs de couvre feu pour ce soir gonflent #egypte Seulement rumeurs pour l'instant -- vanessa descouraux @vdesc July 5, 2013 16h10 : Selon le journaliste de la BBC Jeremy Bowen, de plus en plus de manifestants en col?re rejoignent le cort?ge alors qu'un h?licopt?re de combat Apache fait des passage ? basse altitude pour intimider la foule.? apache helicopter gunship making low passes over demo 16h06 : Les tirs ayant fait trois victimes sont survenus apr?s que des manifestants pro-Morsi aient essay? d'accrocher sur les barbel?s entourant le b?timent de la Garde r?publicaine une photo de l'ex-chef d'Etat, bravant ? deux reprises les avertissements des soldats.? 15h34 : La l?gitimit? ou le martyr , et non pas la libert? ou la mort , c'est ce qu'ont inscrit les manifestants pro-Morsi sur une place du Caire.? La libert? ou la mort sur le sol ? l'entr?e du rassemblement pro-Morsi #?gypte pic.twitter.com/UWgDKQPaKs -- Marie-Eve B?dard @mebedardSRC July 5, 2013 15h31 : Jeremy Bowen est journaliste pour la BBC et sur place au Caire.? Live fire at MB demo at officers club as crowd push forward. Casualties -- Jeremy Bowen @BowenBBC July 5, 2013 15h22 : Des soldats et des manifestants favorables au pr?sident islamiste d?chu ont ?chang? des tirs en d?but d'apr?s-midi au Caire. Le bilan est d?j? de trois morts.? Les tirs ont eu lieu aux abords du si?ge de la Garde r?publicaine, une unit? militaire charg? de prot?ger la pr?sidence ?gyptienne et implant?e dans le quartier du palais pr?sidentiel.? 15h14 : Le chef du gouvernement du Hamas ? Gaza, Isma?l Haniyeh, a appel? vendredi ? garder foi dans le Printemps arabe.? Ne craignez pas pour la cause palestinienne, ni pour la R?sistance, ni pour Gaza. L'Egypte est derri?re nous, tout comme les pays arabes et islamiques , a-t-il assur? dans son pr?che du vendredi.? 15h10 : Des soldats de l'arm?e et des manifestants pro-Morsi ont ?chang? des tirs au Caire.? 15h09 : D'apr?s Amnesty International, malgr? la vigilance d'organisations ?gyptiennes de d?fense des droits humains, les manifestantes ?gyptiennes courent toujours le risque d'agression sexuelle.? #?gypte #Femmes. Les agressions sexuelles contre des manifestantes se poursuivent http://t.co/p0zpDiby3H #EndSH ?#VAW 14h53 : Le cort?ge parti de Guizeh, rejoint par d'autres, a commenc? de se regrouper en d?but d'apr?s-midi devant l'universit? du Caire, autre site habituel des grands rassemblements islamistes.? 14h50 : Nous r?sisterons pacifiquement aux chars , a d?clar? un haut dirigeant des Fr?res musulmans, Mohammed Beltagui, pr?sent devant la mosqu?e Rabaa al-Aadawiya.? Nous ne reconnaissons pas le coup d'Etat et nous ne travaillerons pas avec les nouvelles autorit?s , a-t-il ajout?.? 14h41 : Les Fr?res musulmans ont lanc? un appel ? manifester dans tout le pays ce vendredi contre le coup de force de l'arm?e. Rencontre avec les pro-Morsi.? >> Lire notre reportage: Egypte: chez les pro-Morsi, la col?re gronde? 14h37 : Ailleurs au Caire, des milliers de personnes, dont de nombreuses femmes, ont entam? une marche ? Guizeh, dans le sud de la ville, selon un photographe de l'AFP.? Preuve en image avec la photo de Matthew Cassel, journaliste pour Al Jazeera.? 14h25 : Devant la mosqu?e Rabaa al-Aadawiya, dans le faubourg de Nasr City, les manifestants, dont une partie campent sur place depuis plusieurs jours, priaient ensemble, ? l'appel de l'imam, pour le retour de Morsi au pouvoir et la fin de la fracture entre nous et l'arm?e .? 14h09 : Les principales ONG des droits de l'Homme en Egypte ont d?nonc? vendredi la fermeture de plusieurs m?dias tenus par les islamistes apr?s le coup militaire qui a renvers? mercredi le pr?sident Mohamed Morsi.? Dans un communiqu? commun, sept ONG condamnent l'interruption de la diffusion de Misr 25, la cha?ne des Fr?res musulmans, le mouvement dont est issu Mohamed Morsi, et la saisie d'une ?dition de leur journal Horeyya wal Adala, alors qu'une vaste campagne d'arrestations a ?t? lanc?e contre la confr?rie.? 14h08 : La coalition de l'opposition ? Mohamed Morsi lance un appel urgent ? manifester en masse en Egypte. Le Front du salut national FSN lance un appel urgent ? se mobiliser sur toutes les places d'Egypte en soutien ? la r?volution du 30 juin , a annonc? dans un communiqu? son porte-parole, en r?f?rence aux manifestations monstres de dimanche contre Mohammed Morsi.? 14h07 : Les autorit?s ?gyptiennes ont ferm? vendredi le point de passage de Rafah, ? la fronti?re avec la bande de Gaza, en raison d'attaques lanc?es dans le Sina?. La partie ?gyptienne nous a inform?s officiellement que le point de passage de Rafah ?tait ferm? jusqu'? nouvel ordre en raison de la situation du c?t? ?gyptien de Rafah et ? Cheikh Zouaid , dans la p?ninsule ?gyptienne du Sina?, a indiqu? le minist?re de l'Int?rieur du gouvernement du Hamas, au pouvoir ? Gaza, dans un communiqu?.? 13h15 : Le Conseil de paix et de s?curit? de l'Union africaine a suspendu la participation de l'Egypte ? l'organisation panafricaine, selon un communiqu? officiel.? L'Union africaine a pour politique de suspendre tout Etat-membre o? se produit un changement inconstitutionnel de pouvoir . Cette mesure dure g?n?ralement jusqu'au retour ? l'ordre constitutionnel.? 13h14 : La Haut-Commissaire aux droits de l'Homme des Nations Unies, Navi Pillay, a appel? au respect des libert?s fondamentales en Egypte et s'est d?clar?e pr?occup?e par les informations sur des arrestations en masse de dirigeants des Fr?res Musulmans.? Il ne doit pas y avoir d'autres violences, de d?tentions arbitraires, d'actes ill?gaux de vengeance a-t-elle affirm?. Les Egyptiens m?ritent de vivre dans une soci?t? dont les institutions leur garantissent le respect de leurs droits. ? Elle appelle ?galement au respect de la libert? d'expression et de r?union et demande de s?rieuses mesures pour arr?ter et enqu?ter sur les effarantes violences sexuelles -qui semblent parfois organis?es- contre les manifestantes .? 13h09 : A la fin de la traditionnelle pri?re hebdomadaire musulmane, les partisans de Mohamed Morsi devraient se mettre en route pour manifester ? l'appel des forces islamistes regroup?es au sein du Front national de d?fense de la l?gitimit? .? Elles ont appel? ? un vendredi du refus , tout en demandant aux participants de manifester pacifiquement .? 12h39 : D'apr?s le quotidien isra?lien Y?diot Aharonot, la coop?ration de s?curit? entre l'Egypte et Isra?l s'est renforc?e ces derniers jours.? Selon le journal, quelques heures seulement apr?s la destitution du pr?sident Mohamed Morsi, un repr?sentant officiel isra?lien est arriv? secr?tement au Caire pour des rencontres avec des responsables des services de s?curit? et de renseignement ?gyptiens .? Les liens s?curitaires ?taient bons durant la p?riode Morsi et devraient ?tre encore meilleurs d?sormais , pr?dit le quotidien.? 12h23 : Le procureur g?n?ral ?gyptien Abdel M?guid Mahmoud a annonc? qu'il allait d?missionner, trois jours ? peine apr?s sa r?int?gration, en invoquant de possibles conflits d'int?r?t dans de futures instructions d'affaires judiciaires, selon un communiqu? des ses services.? Car, dit-il, je me sens mal ? l'aise face aux mesures qu'il me sera demand? de prendre ? l'avenir impliquant ceux qui m'ont limog? de mon poste . Il pr?cise qu'il va demander ? la Cour supr?me d'approuver son retour dans les rangs des juges .? 12h22 : Selon Adrien Jaulmes, reporter au service ?tranger du Figaro, l'aviation ?gyptienne continue de c?l?brer la destitution de Mohamed Morsi, en dessinant des coeurs dans le sillage de ses avions. Inhabituel pour le journaliste, au vu du contexte.? #egypte L'aviation ?gyptienne continue ses fantaisies au dessus du Caire. Symbole inhabituel pour un 'coup d'?tat' pic.twitter.com/MhYkK3PZVv 12h15 : Isra?l compte sur l'arm?e ?gyptienne pour r?primer les groupes islamistes dans le Sina? et assurer la stabilit? du pays apr?s la destitution de Mohamed Morsi.? En marge de la consigne de mutisme impos?e aux ministre isra?liens par Benjamin Netanyahu, le d?put? Tzahi Hanegbi, proche du chef du gouvernement, s'est f?licit? de cette destitution.? Durant l'ann?e de pouvoir de Morsi, nous avons constat? des ?volutions inqui?tantes, c'est pourquoi le retour ? une position dominante de l'arm?e et d'un pouvoir la?c capables d'assurer la stabilit? du pays constituent de bonnes nouvelles pour Isra?l a-t-il dit.? Selon lui, l'int?r?t d'Isra?l c'est que l'Egypte reste stable, orient?e vers l'Occident et les Etats-Unis et ne se laisse pas entra?ner par une vague d'extr?misme religieux. ? 10h16 : Apr?s l'appel des islamistes, l'Egypte se pr?pare ce vendredi ? conna?tre de nouvelles vagues de manifestations.? Regroup?es au sein du Front national de d?fense de la l?gitimit? , les principales forces islamistes du pays ont appel? les partisans du pr?sident renvers? ? manifester en masse et pacifiquement pour un vendredi du refus contre le coup d'Etat militaire explique l'AFP.? Les manifestations devaient commencer apr?s la traditionnelle pri?re hebdomadaire musulmane, en milieu de journ?e, au Caire et en province.? 09h30 : Apr?s la chute de Mohamed Morsi, le nouveau pr?sident par int?rim, Adly Mansour, a pr?t? serment jeudi. Pour les Fr?res musulmans, l'avenir est flou, mais ils pourraient bien tenir un r?le important dans les mois ? venir.? >> Lire aussi: Ce qu'il faut retenir apr?s la destitution de Morsi?? 09h00 : Une attaque islamiste a fait un mort et deux bless?s parmi les soldats dans la r?gion du Sina?. L'attaque visait des poste de police et militaire.? 08h30 : Apr?s la destitution de Mohamed Morsi mercredi, l'arm?e a appel? jeudi soir ? l'unit? nationale. Dans la journ?e, la nouvelle pr?sidence avait demand? aux Fr?res Musulmans d'aider ? la reconstruction du pays .? De leur c?t?, les islamistes ont appel? ? des manifestations massives et pacifiques.? 08h15 : Revivez les ?v?nements de la journ?e de jeudi minute par minute dans notre live.? >> L'Egypte apr?s la chute de Mohamed Morsi?