Veteran BBC journalist Jeremy Bowen was shot in the head and the leg Friday in Egypt as thousands of people demonstrated following the ousting of President Mohamed Morsi. Islamist leaders had called for demonstrations following the military-backed removal of the Muslim Brotherhood president. Bowen, 53, was outside Cairo?s Republican Guards Club, where Morsi is believed to be held. Bowen said it was the first time he had been shot during his years covering conflict zones. I think it was a shotgun. I got two pellets in the leg and one in the ear. It came out of nothing,? he told The Mirror. He said the military fired live ammunition rather than using a non-lethal method such as tear gas. ?As the crowd got angrier and angrier, it started to surge forward and someone opened fire straight away from the military side,? he said, adding: ?I?ve been in a lot of hairy situations as a reporter over many years, but I have never been hit by anything.? Bowen's first time reporting from a conflict zone was in El Salvador in 1989. Elsewhere, a CNN crew had its camera apprehended by Egyptian military personnel. CNN senior international correspondent Ben Wedeman was broadcasting live from Cairo when a uniformed man took his crew's camera and could be heard saying ?no cameras.? See the video below. PHOTOS: THR's 35 Most Powerful People in Media 2013 He later tweeted: 	? benwedeman @bencnn July 5, 2013 At least 30 people were reported dead in Friday?s unrest, with more than half of the dead in the city of Alexandria. Among the day?s largest events was a clash between anti-Morsi protesters and those who supported the ousted president. The conflict took place on the 6 October Bridge in Cairo and dissipated after military vehicles arrived on the scene. On June 28, a 22-year-old Dutch journalist was raped in Cairo's Tahrir Square, where CBS News chief foreign correspondent Lara Logan was sexually assaulted and beaten by protesters in 2011 after the departure of President Hosni Mubarak. Morsi, the first democratically elected president of Egypt, was ousted Wednesday after a little more than a year in office.