We most recently updated the top of this post at 2:05 p.m. ET. The death toll from clashes Friday and into early Saturday in Egypt now stands at 36, authorities say. That estimate, released just before 11 a.m. ET, was up from the 30 deaths that had been reported when the day began. More than 1,000 people are said to have been injured during fighting between supporters of ousted President Mohammed Morsi and those who had pressed for his removal from office. Some Morsi supporters were also reportedly killed by gunfire from Egyptian security forces. NPR's Leila Fadel tells our Newscast Desk that as Saturday dawned in Tahrir Square, workers were cleaning up debris and there was relative calm. But, as newscaster Giles Snyder says, the Egyptian capital remains very tense ? angry Morsi supporters and those who called for his toppling remain camped in different parts of the city. It's feared they will clash again and that the Egyptian military will use force to restore some order. As of 2 p.m. ET ? early evening Cairo ? there were still large crowds of pro- and anti-Morsi Egyptians in the streets, al-Jazeera reported. But things were calmer than they had been during the clashes Friday and early Saturday. Peole in the streets had not yet reacted to the news that Nobel Peace Prize laureate Mohamed ElBaradei would become interim prime minister. Here's more about where things stand since our Friday post was last updated: ? The BBC writes that at least 12 died in Alexandria, and eight in two separate clashes in Cairo, the Health Ministry said. In Cairo, tensions escalated when a crowd advanced on the nearby headquarters of the Republican Guard, where Mr Morsi is believed to be held. Troops then opened fire on crowds. Four people were killed and dozens wounded, including the BBC's Jeremy Bowen whose head was grazed by shotgun pellets. ? Combatants used rocks, sticks, fireworks and Molotov cocktails in a battle lasting hours that raged Friday night near Tahrir Square and across a bridge spanning the Nile, part of the most widespread street violence in Egypt since the early days of the 2011 revolution, The New York Times reports. With clashes breaking out late into the night, it was impossible to estimate the full extent of casualties and damage. But early Saturday, security officials said at least 30 people had been killed nationwide and hundreds wounded, many of them in Cairo. ? The most deadly clashes were in the Mediterranean city of Alexandria, says Reuters, where 14 people died and 200 were wounded. In central Cairo, pro- and anti-Mursi protesters fought pitched battles late into the night with stones, knives, petrol bombs and clubs as armored personnel carriers rumbled among them. ? Egypt is a nation divided, CNN observes. The battle over who should lead the country and which government reflects the democratic will of the people may spill into the streets again Saturday. One side is fighting for the reinstatement of Egypt's first freely elected president, Mohammed Morsi, whom the military forcefully removed from office Wednesday. The other applauds the military and is fighting to keep out Morsi over allegations his government was getting closer to autocratic rule.