The operators, Tepco and the Japanese government are finally admitting that their current strategy of simply pouring 100,000 gallons of water a day on the rubble covering the three melted nuclear cores isn't 100% safe.? They have been trying to retrieve the cooling water and store it on site. Millions of gallons on highly radioactive water sits in plastic containers crowding the plant site with no present way of safely processing it. Tepco now admits that not only that some of the storage containers are leaking, but that since 2011 radioactive cooling water has leaked into the local aquifer by and is eventually reaching the ocean. If that's all that was happening it would not be so bad. Some reasonable people are worried that this treading water by Tepco brings the world no closer to a solution to the present danger of that the melted cores of three nuclear reactors represent. It seems clear that the cores of reactor units 1, 2 and 3 did more than just melt inside the reactor containment. The mixture of nuclear fuel, fission products, control rods, and structural materials from the affected parts of the reactor that melted together are called corium. The heart of corium it is the highly radioacive uranium and plutonium fuel. Groundwater laced with radiation from melted reactors at the Fukushima Dai-Ichi atomic plant north of Tokyo has been leaking into the Pacific Ocean, raising concern the toxic water has been flowing into the sea since the disaster at the facility more than two years ago. Backtracking on previous comments, Tokyo Electric Power Co. 9501 confirmed the groundwater leaks last night, earning a rebuke from the government today to stop the leaks that Chief Cabinet Secretary Yoshihide Suga said were ?serious.? Tepco, as the utility is known, suspected the breach after finding water levels in monitoring wells moving in sync with tidal flows, spokeswoman Kaoru Suzuki said by phone today. The operator doesn?t know when the leaks started or how much radiated water has drained into the ocean, she said. Water samples suggest contamination has been contained in the port area near the Fukushima plant, Suzuki said. ?I don?t know why Tepco was so circumspect about acknowledging that there was a leak,? Jota Kanda, a professor at Tokyo University of Marine Science and Technology, said by phone today. ?Most marine experts who have studied the effect of the Fukushima disaster on surrounding ocean areas hold the view that radioactive water has been leaking from the plant. It?s common sense.? Tepco?s announcement angered fishing unions that lost fishing grounds and customers on concern radiation would contaminate catches and enter the food chain. In August last year, the utility found record high levels of radioactive cesium in fish it caught for tests within 20 kilometers of the coast from the nuclear plant. ?Tepco could have told us at least about the possibility of the leaks,? Yoshihisa Kobayashi, an official at the Fukushima Prefectural Federation of Fisheries Co-operative Associations, said by phone today. ?I?ve always suspected there may be leaks because radiation levels inside silt fences have remained high though Tepco told us there is no such leak.? A study of 15 Pacific bluefin caught off San Diego in August 2011 found radioactive cesium 10 times higher than in fish caught in previous years. That provides ?unequivocal evidence? that the radiation came from Fukushima, researchers including Daniel Madigan and Nicholas Fisher said in a study published in May 2012 in the Proceedings of the National Academy of Sciences. The level of contamination was not a danger to humans, the study said. The finding comes in the same month Japan?s Nuclear Regulation Authority told Tepco to speed up completion of a seawall to block contaminated water that it suspected was leaking into the ocean. While reporting elevated levels of cesium 137 and 134 in the plant?s groundwater, the utility had maintained that there had been no apparent effect on the adjacent seawater. The pace of decline in radiation levels slowed in the waters beside the Fukushima plant after June 2011, suggesting that there was a leak, said marine science professor Kanda, whose findings are being reviewed for publication in the journal Biogeosciences. Tepco needs to pinpoint the source of the leak before it can come up with credible measures to stop it, he said. Reports differ on how much radiation escaped into the atmosphere and the sea after the Fukushima disaster. In the same month, the Institute for Radiological Protection and Nuclear Safety, which is funded by the French government, said the Fukushima plant was responsible for the biggest discharge of radioactive material into the ocean in history. Tepco in May last year estimated the total radiation release was about 17 percent of Chernobyl. Human exposure to radiation at moderate to high levels can lead to cancers, such as leukemia, according to the United Nations Scientific Committee on the Effects of Atomic Radiation. The body, known as UNSCEAR, is in charge of the most comprehensive study of the Fukushima disaster and is expected to deliver its report to the UN in October this year. Tepco also said in an e-mailed statement today that steam from an unknown source that was first spotted near the fifth floor of the Fukushima plant?s No. 3 reactor building on July 18 was seen again around 9 a.m. By 1:30 p.m., it was no longer visible, the company said. The steam was probably the result of atmospheric moisture evaporating against the outer wall of the containment vessel, which is warmer than air temperatures, spokesman Yusuke Kunikage said by phone. The utility found no significant changes to the unit?s containment vessel temperature and other readings, it said in the statement. The handling of highly radioactive water is an issue that has vexed Tepco as the utility oversees the plant?s cleanup. Leaks in April raised the prospect the utility would be forced to dump radioactive water in the Pacific. Last month, Tepco said it had found unsafe levels of radioactivity in groundwater at the Fukushima station. The contaminants were found at a monitoring well in a turbine complex at the Dai-Ichi plant. While the current findings marked the first time the utility has acknowledged that contaminated groundwater was seeping into the ocean, it has had other leaks of radioactive water at the plant. In April last year, it said as much as 12 tons of radioactive water had leaked from a pipe and may have poured into the sea. That followed a leak at the same pipeline 11 days earlier. The rising level of tritium measured in kelp samples south of the Fukushima 1 nuclear site is an indicator of intensifying nuclear reactions deep in the soil below the cracked reactors. Following the meltdowns in spring 2011, superheated fuel rods in up to three reactors have penetrated multiple barriers including the core shrouds, containment chambers and concrete foundations, escaping into the porous ground. Now inaccessible and scattered underground, the remnant fuel is getting hot enough to create huge flows of deuterium and radioactive tritium, which are commonly known as heavy water. Apologists for the nuclear industry, including the Wall Street Journal, boldly assert beta radiation emitted by tritium poses no health threat. This irresponsible claim is based on a gross underestimate of the effects of beta rays. While less powerful than gamma radiation, beta radiation can ionize DNA. Externally beta rays can be blocked by a thin sheet of metal foil, but inside human tissues there are no physical barriers to prevent beta particles from rupturing chromosomes. As summarized by the U.S. Environmental Protection Agency: ?The main chronic health effect from beta radiation is cancer. When taken internally beta emitters can cause tissue damage and increase the risk of cancer. The risk of cancer increases with increasing dose.? Tritium is a beta emitter. The argument for tritium safety becomes even more fallacious because heavy water is at a practical level indistinguishable from normal water and readily ingested through beverages, food, bathing and respiration. Beta rays add to the daily exposure level from gamma, alpha, ultraviolet and electromagnetic radiation, significantly raising the risks of cancer and heart failure. Advice for visitors to Fukushima: Don?t drink the water. How prevalent is tritium leaking from Fukushima into the Pacific Ocean? The best estimate, in this early stage of the tritium releases, is based on dosage levels in vegetation at a fair distance from the leaking nuclear site. Beta radiation can be measured with a reasonable degree of accuracy on the border between the coastal villages of Hisanonuma and Yotsukura, inside the exclusion zone 16 kilometers south of the Fukushima No.1 plant. Fern kelp samples were taken from tide pools by this writer in mid-July, about two months after tritium started to spike. Beta radiation accounted for one-fourth to one-third of the total dosage count, as compared with gamma rays. The beta component raised the per-hour dosage to 0.34 microSieverts, a dangerous level that sets off the alarm buzzer. Constant exposure to that level would result in death for humans within 8 years. Compared with my previous measurements along that coast, the gamma level in kelp has been stable and undiminished since the 311 meltdowns, which is due to annual regrowth of kelp. The 12-year half life of tritium means that large quantities will be appearing around the Northern Hemisphere, carried by the jet stream and the North Pacific current. An odd observation among local residents is that the presence of tritium is sometimes visible in a spookily dense fog. Amateur fishermen told me that narrow bands of fog hugging the cliffs are frightening enough to deter them from venturing to the shore. The fog was described by a 78-year-old local resident as ?moya? or miasma. ?Throughout my entire life along this shore, I have never before in summertime seen such an eerie miasma,? he whispered. ?It is as if a ghost has descended on our bay.? Before gathering kelp for Geiger counter and dosimeter measurements, I spotted off in the far distance a band of unseasonable mist lifting in the oppressive heat of noon. Within that fog bank, there were slow-moving clouds, smoldering and tumbling like a witches brew. Too bad that GE and Hitachi executives were not there to take a dip in that bay of beta radiation. Indeed, a solo brave diver was bobbing in the tritium waves. The tattooed swimmer was gathering sea urchins to sell to sushi bars. His tattoos showed him to be a member in good standing of a local self-help group. The hale fellow opened a shopping bag to show me his undersea treasure. Urchins feed on kelp, absorbing cesium, strontium and tritium into their bright orange sperm sacs. Uni is a delicacy now deadlier than poison-laced blowfish, and thus a must-gorge for every fanatic foodie and the connoisseur seeking a delicacy to die for. The expensive, salty, fat-rich globs melt on the palate and are best finished with a chardonnay. The exquisite taste hits like a bullet to the brain. A toast to TEPCO! Nuclear engineers with the Tokyo Electric Power Co. have hewed to the absurdly unscientific belief that hydrogen gas was the cause of the explosion that broke through Reactor 3 on March 15, 2011. Given its relatively low combustion energy, hydrogen cannot possibly crack thick steel alloy. The more probable energy source in that rupture was a fusion reaction between tritium and deuterium. Heavy water produced in abundance inside the reactors, especially during a meltdown. Just a few grams of tritium and deuterium can merge in a fusion reaction that releases a highly energetic neutron, which then greatly smashes into plutonium, greatly amplifying a fission explosion. The hydrogen bomb that annihilated Nagasaki in August 1945 was a plutonium-based device boosted or triggered by tritium. The term ?hydrogen bomb? is derived from the chemistry of heavy water. Natural water is composed of two atoms of hydrogen and one of water, and thus its symbol H2O. Under bombardment by radioactive isotopes, inside a reactor or in radioactive wastewater at Fukushima, the nucleus of a hydrogen atom can absorb one neutron to become deuterium or two such particles to form tritium. The Manhattan Project?s design by Edward Teller required precise geometry to use concave mirrors made of beryllium metal to focus the implosion for an interactive tritium-plutonium blast. Can similar conditions be created ?spontaneously? inside the mass of rocks and dirt underneath Fukushima No.1? The meltdown of mixed oxide MOX fuel, which contains highly enriched plutonium, is suspected of having seared through the shroud, containment chamber and ferroconcrete foundation, thereby escaping into the soil. Steam from vents in the ground, along with tritium releases in leaked water, indicate that the meltdowns are not only continuing but also heating up dramatically. Lumps of corium can melt the surrounding silicate rock to create a glassy bubble, which traps the tritium and deuterium steam and reflects back their radiation. These subterranean pockets resemble a soft-boiled egg, with a ?yolk? of melting nuclear fuel surrounded by the ?egg white? of pressurized tritium-deuterium steam inside a ?shell? of reflective glazed rock. The self-enclosed reaction chamber will gestate and then hatch with a blast wave of sufficient force to trigger other corium pockets to explode. The serial nuclear blasts could blow the ground into the sky, momentarily lifting the Fukushima reactors. Then everything will come crashing down into the gaping pit, ending any hopes of quelling the meltdowns. Needless to say, the nuclear workers and local population would be killed by the blast wave or the lethal emissions. The release of vast amounts of radiation would force the evacuation of nuclear plants in operation across Japan, resulting in dozens more meltdowns. Civilization will become untenable, as hundreds of millions of casualties mount. This is probably a best-case scenario, since the downward blast force could have more dire consequences. The Fukushima nuclear plants rest atop the Abukuma block, a mega-sheet of bedrock uplifted by the subduction of the Pacific plate under the Okhotsk plate. Inside the impact zone, both plates are cracking under enormous pressure, which heats the rock into magma and causes volcanic activity in the region. The hundreds of tons of escaped nuclear fuel beneath the Fukushma No.1 plant exceeds the combined weight of all fissile material in nuclear-weapons testing to date. If this melting mass of uranium and plutonium were to explode, the seams in the tectonic plates could be blown apart, unloosing rivers of magma onto the Earth?s surface. A vast cloud of radioactive particles, toxic gases, sulfur and industrial waste would encircle the globe with more deadly consequences than the 1883 Krakatoa eruption.. The human species, a parasite dependant on other life-forms and vulnerable to oxygen depletion, will be among the first to go extinct. The coming self-destruction of humankind may well be only a minor prelude to a grand finale for the planet. Could a mega-nuclear blast at a geological pressure point like Fukushima puncture the Earth?s brittle crust and release a flow of hot liquefied minerals from the mantle? What the little geologists know about the mantle is based on some ancient rock samples and data from ultra-long frequency waves pulsed through the center of the Earth during nuclear-weapons tests. The dominant opinion among Earth scientists is that below the crust is a thick zone of hot viscous rock, which acts in ways similar to asphalt. It seems highly unlikely that the amorphous layer could be as stable as the tarmac on a road since the mantle is heated from below by molten metal. Torsion is also straining the mantle, due to the difference in the rotational speed between the Earth?s surface and its metal core. The mantle?s fluid dynamics means that a nuclear shock could burst on top of a convection flow, releasing billions of tons of molten mantle onto the planet surface, blanketing the Earth and shooting out fiery lava fountains. If so, the Earth would be propelled out of its orbit like a sputtering and spiraling rocket to the frozen edge of the solar system or, otherwise, into a nosedive toward the Sun. The gravitational disturbance would unhinge the orbits of other planets. Spinning wildly out of control, Earth could collide with another gyrating planet or be pummeled by a horde of asteroids. Ashes to ashes, dust to dust: The violent destruction of our planet will hardly amount to a footnote since nobody will survive to record the event. On a cosmic scale, human history is a tiny and brief experiment in evolution that has gone awry, adding up to nothing more than a blip in an inconsequential solar system. This scenario of our home planet becoming engulfed by molten iron is, by strange coincidence, predicted in Buddhist prophecy as the last stage of ?mappo?, the historical process of moral degradation of humanity. In their shabby defense of a malignant nuclear industry, the political-industrial oligarchy is bringing about this end-of-world prospect. The annihilation of our species, along with all life on Earth, is man?s death wish writ large and his last achievement. Prodigal man has proven himself to be a sworn enemy of God the Father and Mother Nature. Thou shalt kill thy father and mother, demand our global leaders, their regional henchmen and media minions as if they too will not be killed. From either a Judeo-Christian or Buddhist philosophical perspective, the global oligarchs are genocidal criminals, damned in this life and for eternity. Human responsibility, however, means that punishment must not be left to fate. Stern action is required against these diabolical madmen until the last millisecond of the final hour. My spirit grows weary of repeating the same formula to the pack of evil morons known as energy executives, nuclear engineers, government bureaucrats and politicians. But here we go again, preaching to the wicked. The underground corium pockets can be detected by radiation scanners and with blast tomography, which reveals the locations of larger concentrations. Next, steam-injection pumps used at near-exhausted oil fields should be deployed to pump borax solution into those pockets. Borax unlike boric acid, crystallizes in solution, thereby partitioning the underground spaces with neutron-absorbing barriers. Subdivided into smaller cysts, the fissile materials will be deprived of critical mass. It is guaranteed by the sheer inertia of stupidity and greed that none of this will be carried out. So when push comes to shove, my friends, be sure to push them into the Inferno first before it?s your turn to leap into the fire.