Pacific Rim: how and why radiation from Fukushima entered the world?s largest ocean Screencaptures of the NRC FOIA documents?that are seen in the above video may be viewed at your leisure in the gallery below. Important links: 'Alternative' Media does NOT report on Aerosol Engineering of Hurricane Isaac 'Former' CIA and Military asset General Albert Stubblebind owns NaturalNews! 'War on Terror' threads controlled by Pentagon? 100% proof! ChemTrail dump over University of Florida Homecoming 11.9.12 3 Strikes and You?re Out: Ed Chiarini aka: dallasgoldbug blows his cover 7,800 Veterans sue CIA/DOD/Army for experimentation including septal implants to control will and human behavior A MUST READ: Analysis of Selections from the ?Protocols of the Wise Men of Zion? relating to control of the press A MUST READ: Top Ten Reasons why Plume-Gate and the NRC FOIA Transcripts pertaining to Fukushima are being suppressed ALL SECTORS OF MEDIA ARE IGNORING THE WORLD?S LARGEST, PROVABLE COVER-UP AND CONSPIRACY WITH AN ESTIMATED 1.3 MILLION AMERICAN FATALITIES BY 2030!!! Approach, Infiltrate, Influence, Sabotage: Patterns of Deception in the 'alternative' media and 'anti' nuclear movement Are the governments of the world preparing for a return of the Gods? Part 1 Are the governments of the world preparing for a return of the Gods? Part 2 Aurora Shooting: The 3rd Side of the Story Aurora Shooting: Why Gun-Control is NOT the issue BLOCKBUSTER!!! FOIA Documents Reveal NRC Cover-Up, Deception over Fukushima Plume and Fallout Chem Trails, Ghost Planes and H.A.A.R.P. Chem-Trails Demolish Thunderhead: Florida's Drought caused by Aerosol Engineering! Chuck Castro on Mark I Reactors: ?in a station blackout you're going to lose containment. COINTELPRO Crash & Burn: Alex Jones, Mike Adams and Mark Dice are all in full damage control mode Cold Case Files: 5,200 Pentagon Child Porn Downloaders Debunking 'Alternative' media disinformation on Fukushima Unit 4 Spent Fuel Pool Exhibit A 'Days of Blunder!' : Evidence of 'Alternative' Media Malpractice Fumbling on Purpose: why is PrisonPlanet sweeping Plume-Gate under the Rug? Hatrick Penry: I'm calling out The Intel Hub, NaturalNews and PrisonPlanet Holder to Prosecute ?Plume-Gate?; White House, Alphabet Agencies Panic!!! Iran vs. USA: The Fix Is In Is America's largest COINTELPRO operation crumbling? Low, Slow or No Coverage: Top 12 Stories that Deserve more Attention Mike '1984' Adams turns Orwellian: Secretly modifies article NASA Scientist Explains Meteoric Fireball: ??It Does Appear To Be A Contrail.? No Easy Day: The Firsthand Account of the Mission that killed Black Bart Pacific Rim: how and why radiation from Fukushima entered the world's largest ocean Plume-Gate Tales from the Script Part 3: Data Mining, a ?CNN Moment? and ?Teflon? Obama Video: Maybe they are all shills? Video: The Unlucky 13 Top Troll List