Aoyama, M., D. Tsumune, and Y. Hamajima 2012 Distribution of 137Cs and 134Cs in the?North Pacific Ocean: impacts of the TEPCO Fukushima-Daiichi NPP accident. Journal of Radioanalytical and Nuclear Chemistry. doi:10.1007/s10967-012-2033-2 Aoyama, M., et al. 2012 Temporal variation of 134Cs and 137Cs activities in surface water at stations along the coastline near the Fukushima Dai-ichi Nuclear Power Plant accident site, Japan. Geochem. J, 46, 321-325. Aoyama, M., et al. 2013 Surface pathway of radioactive plume of TEPCO Fukushima NPP1 released 134Cs and 137Cs. Biogeosciences Discussions, 10 1 , 265-283. Bu, W. T., J. Zheng, T. Aono, K. Tagami, S. Uchida, J. Zhang, M. C. Honda, Q. J. Guo, and M. Yamada 2013 Vertical distributions of plutonium isotopes in marine sediment cores off the Fukushima coast after the Fukushima Dai-ichi Nuclear Power Plant accident. Biogeosciences, 10, 2497?2511. Buesseler, K., M. Aoyama, and M. Fukasawa 2011 Impacts of the Fukushima nuclear power plants on marine radioactivity. Environmental Science and Technology, 45 23 , 9931?9935, doi:10.1021/es202816c. Buesseler, K. O., S. R. Jayne, N. S. Fisher, I. I. Rypina, H. Baumann, Z. Baumann, C. F. Breier, E. M. Douglass, J. George, A. M. Macdonald, H. Miyamoto, J. Nishikawa, S. M. Pike, and S. Yoshida 2011 Fukushima-derived radionuclides in the ocean and biota off Japan. PNAS, 109 16 , 5984-5988. Choi, Y., Kida, S., and Takahasi, K. 2013 The impact of oceanic circulation and phase transfer on the dispersion of radionuclides released from the Fukushima Dai-ichi Nuclear Power Plant, Biogeosciences, in press . Honda, M. C., Aono, T., Aoyama, M., Hamajima, Y., Kawakami, H., Kitamura, M., Masumoto, Y., Miyazawa, Y., Takigawa, M., and T. Saino 2012 Dispersion of artificial caesium-134 and -137 in the western North Pacific one month after the Fukushima accident. Geochemical Journal, 46, pp.e1-e9 ?????????????pdf???? Honda, M. C., H. Kawakami, S. Watanabe and T. Saino 2013 Concentration and vertical flux of Fukushima-derived radiocesium in sinking particles from two sites in the Northwestern Pacific Ocean. Biogeosciences 10, 3525-3534. Inoue, M., Kofuji, H., Murakami, T., Oikawa, S., Yamamoto, M., Nagao, S., Hamajima, Y. and Misonoo, J. 2012 Spatial variations of low levels of 134Cs and 137Cs in seawaters within the Sea of Japan after the Fukushima Dai-ichi Nuclear Power Plant accident. Appl. Radiat. Isot. in press . Inoue, M., Kofuji, H., Nagao, S., Yamamoto, M., Hamajima, Y., Yoshida, K. Fujimoto, K., Takada, T. and Isoda, Y. 2012 Lateral variation of 134Cs and 137Cs concentrations in surface seawater in and around the Japan Sea after the Fukushima Dai-ichi Nuclear Power Plant accident. J. Environ. Radioactivity, 109, 45-51. Inoue, M., Kofuji, H., Hamajima, Y., Nagao, S., Yoshida, K. and Yamamoto, M. 2012 134Cs and 137Cs activities in coastal seawater along Northern Sanriku and Tsugaru Strait, northeastern Japan, after Fukushima Nuclear Power Plant accident. J. Environ. Radioactivity, 111, 116-119. Inoue, M., Kofuji, H., Nagao, S., Yamamoto, M., Hamajima, Y., Fujimoto, K., Yoshida, K., Hayakawa, K., Suzuki, A., Takashiro, H. and Minakawa, M. 2012 Low-levels of 134Cs and 137Cs in surface seawaters around the Japanese Archipelago after the Fukushima Dai-ichi Nuclear Power Plant accident in 2011. Geochem. J., 46, 311-320. Kawamura, H., T. Kobayashi, A. Furuno, T. In, Y. Ishikawa, T. Nakayama, S. Shima, and T. Awaji 2011 Preliminary numerical experiments on oceanic dispersion of 131I and 137Cs discharged into the ocean because of the Fukushima daiichi nuclear power plant disaster. Journal of Nuclear Science and Technology 48, 11, 1349-1356. Kobayashi, T., H. Nagai, M. Chino, H. Kawamura 2013 Source term estimation of atmospheric release due to the Fukushima Dai-ichi Nuclear Power Plant accident by atmospheric and oceanic dispersion simulations. J. Nucl. Sci. Technol., 50, 255-264. Masumoto, Y., Y. Miyazawa, D. Tsumune, T. Tsubono, T. Kobayashi, H. Kawamura, C. Estournel, P. Marsaleix, L. Lanerolle, A. Mehra, and Z. D. Garraffo 2012 Oceanic dispersion simulations of 137Cs released from the Fukushima Daiichi nuclear power plant. Elements, 8, 207-212. Miyazawa, Y., Y. Masumoto, S. M. Varlamov, T. Miyama, M. Takigawa, M. Honda and T. Saino 2013 Inverse estimation of source parameters of oceanic radioactivity dispersion models associated with the Fukushima accident. Biogeosciences 10, 2349-2363. Oguri, K., Kawamura, K., Sakaguchi, A., Toyofuku, T., Kasaya, T., Murayama, M., Glud, R. N., and Kitazato, H. 2013 Hadal disturbance in the Japan Trench induced by the 2011 Tohoku-Oki Earthquake. Scientific Reports, 3, 1915, doiI:10.1038/srep01915. Otosaka, S., and T. Kobayashi 2013 Sedimentation and remobilization of radiocesium in the coastal area of Ibaraki, 70 km south of the Fukushima Dai-ichi Nuclear Power Plant. Environmental Monitoring and Assessment, 185, 5419?5433, doi:10.1007/s10661-012-2956-7. Povinec, P.P., K. Hirose, and M. Aoyama 2012 Radiostrontium in the Western north pacific: characteristics, behavior, and the fukushima impact. Environmental Science & Technology, 46 18 , 10356-10363. Povinec, P.P. et al. 2013 Cesium, iodine and tritium in NW Pacific waters ? a comparison of the Fukushima impact with global fallout. Biogeosciences Discussion, 10, 6377-6416. Rypina, I. I., S. R. Jayne, S. Yoshida, A. M. Macdonald, E. Douglass, and K. Buesseler 2013 Short-term Dispersal of Fukushima-derived Radionuclides off Japan: Modeling Efforts and Model-data Intercomparison. Biogeosciences MS No.: bg-2012-551, available on line at Biogeosciences Discussions. in press Suzuki, T., Otosaka, S., Kuwabara, J., Kawamura, H., and Kobayashi, T. 2013 Iodine-129 concentration in seawater near Fukushima before and after the accident at the Fukushima Daiichi Nuclear Power Plant, Biogeosciences Discuss., 10, 1401-1419, doi:10.5194/bgd-10-1401-2013. Tsumune, D.,T. Tsubono,M. Aoyama, and K. Hirose 2012 Distribution of oceanic 137Cs from the Fukushima Daiichi Nuclear Power Plant simulated numerically by a regional ocean model. Journal of Environmental Radioactivity, 111, 100-108. Tsumune, D., ?One-year, regional-scale simulation of 137Cs radioactivity in the ocean following the Fukushima Daiichi Nuclear Power Plant accident?, Biogeosciences Discuss. ??????????????????? ?2012? ????????????????????????137??????????????????B2??????, Vol.68, No. 2, p. I_931-I_935. Zheng, J., T. Aono, S. Uchida, J. Zhang and M.C. Honda 2012 Distribution of Pu isotopes in marine sediments in the Pacific 30 km off Fukushima after the Fukushima Daiichi nuclear power plant accident. Geochem. J., 46, 361-369. ???? 2011 ?????????????????. ??????????????2011.11??, 42-45. ???? 2012 ???????????????????????????????????????????2012?4????, 33-38. ????, ????, ?????, ????, ???? 2011 ????????????. ?????, vol.33 3 , 262-272. ???? 2011 ????????????????, RikaTan?????2011?6??, ???????????????-????????????????????51-55. ???? 2011 ?2???????, ???????????250, ???, pp 95. ???? 2013 ???????????????????. ISOTOPE NEWS, 2013?6?? Vol.710 , 12-15. ????, ???? 2013 ??????????????????. ?????? 36, 95-98. ????? 2011 ??????????????????????????????????????????????????????????????????????53 11 , 29-33. ????? 2012 ????????????????. ??????vol.34 3 , 217-230. ?????2012 ??????????????????????????????????, 17, 21-23. ?? ? 2012 ??????????????????. ???????41-2, 35-38. ???? 2011 ??????????????. ???? 2011.8, 446-450. ???? 2011 ??????????????????, ??????2011?12??, 50, 46-50. ????? ????, ???? 2012 2011??????????????????????????????????, ???????????????????????, 31, 227-233. ????? ???????: ???????????????????????137Cs?????????????? ????????????????: ???????????????? ??24?5?14? ???PDF?3,007KB? ????PDF?1,351KB??????PDF?527KB? ?????????????????????PDF?1,055KB?