via OpEdNews.com / June 15, 2013 / Situation Normal, All Fukushima?d Up The first thing to know about the danger from the radioactive mass remaining on site in the three reactors that melted down at Fukushima is that nobody knows how much radioactive material there is, nobody knows how much uranium and plutonium it contains, and nobody knows how to make it safe ? so no one knows how great the continuing danger is. In order to prevent nuclear material from being diverted to use in weapons, the International Atomic Energy Agency of the U.N. requires each country to report regularly on the volume of nuclear materials in its nuclear power plants. At Fukushima, this is currently impossible with the cores of the three reactors that melted down. Diversion of this material to weapons use is not a problem at the moment, since the level of radioactivity is high enough to kill anyone who comes close to it, which is why it hasn?t been moved. On the other hand, it is necessary to move it in order to measure it, and even if it was movable now, the technology to measure it does not yet exist. Cooling the Cores Keeps Them from Burning, but Creates Radioactive Water The Japanese Atomic Energy Agency has joined with the U.S. to develop the necessary new technology, which it hopes to begin using within a decade. The Japanese agency calls this collaboration the ?world?s first? attempt at such technology, since a similar U.S. initiative to measure the melted core from the 1979 Three Mile Island accident failed. As long as Fukushima?s owner, the Tokyo Electric Power Company TEPCO , keeps the three melted cores and the fuel rods in three other storage pools sufficiently submerged in cooling water, the radioactive material will not overheat, burn, and spew radioactive debris as far as wind or water might take it. Watertight fuel pools are used effectively at nuclear power plants around the world, including Fukushima before the March 2011 earthquake and tsunami.? Now the reactor structures are no longer watertight and TEPCO has pumped millions of gallons of fresh and ?least contaminated? into the structures since then, and continues to do so. Radioactive Water Is Dangerous, And It Has To Go Somewhere Water used to cool nuclear fuel and waste becomes radioactive itself, as does the groundwater that infiltrates the structures. This radioactive water continues to reach the Pacific Ocean in varying quantities, as TEPCO attempts to keep it in check. As of May 7, the Japan Times reported that TEPCO had installed 290 huge storage talks at Fukushima to hold more than 78 million gallons 290,000 tons of radioactive water, with another 25 million gallons still uncollected.? Fukushima is generating an estimated 100,000-plus gallons 400 tons of radioactive water every day TEPCO estimates that groundwater is entering the complex at a rate of at least 54,000 gallons per day. In May 2012, the Japanese government ordered TEPCO to build a wall deep into the ground around the plant to keep groundwater out, a plan that might become operational by early 2015. Reader Supported News is the Publication of Origin for this work. First, there is no containment of the 3 melted cores. Either containment was lost during the Great Quake and/or during the meltdowns. Japan can talk about ?cold shutdown? all the want but when cooling water pumped in flows out uncontrollably or groundwater flows in uncontrollably, this means any metal or concrete shell meant to hold the nuclear fuel inside has failed. Cracked, burnt a-hole-through or destroyed via an explosion?there is no containment in three of the reactors simply because they don?t hold water. From there the news dances around the fact there is no containment. Radiation levels rising in ground and sea water?.because there is no containment and the melted radioactive blobs are free to interact with groundwater, ocean water, the atmosphere and continue releasing radioactive poisons non-stop because it has been unchecked for over 2 years with no way of preventing further releases. There is no ?OFF? switch for the after effects of nuclear fission or nuclear waste and melted nuclear blobs wouldn?t be a problem.