Steam seen in Fukushima reactor building - no sign of increased radioactivity TEPCO is struggling to manage the clean-up, which scientists say could take up to four decades to complete. Steam has been spotted in a reactor building at the crippled Fukushima nuclear plant in Japan, its operator said Thursday, but stressed there is no sign yet of increased radiation. The incident, which Tokyo Electric Power TEPCO said was not an emergency situation , is the latest event serving to underline how precarious the plant remains more than two years after it was wrecked by a tsunami. Steam has been seen around the fifth floor of the Reactor 3 building, a spokesman at Tokyo Electric Power Co. TEPCO told AFP. The roof of the building was blown off in a hydrogen explosion in the days after the March 2011 meltdowns, sparked when cooling systems were flooded with seawater after a huge undersea quake. The steam was drifting thinly in the air and it's not like a big column of steam is spurting up, the spokesman said. Neither the temperature of the reactor nor readings at radiation monitoring posts have gone up. We do not believe an emergency situation is breaking out although we are still investigating what caused this. The pool is on the fifth floor and stores devices and equipment removed from the reactor before the disaster as part of regular operations. TEPCO said it had confirmed the reactor remained subcritical at 9:20 am 00:20 GMT , one hour after the steam was first spotted. Criticality is the term used for reactors in which there is a self-sustaining nuclear chain reaction. Workers were continuing to pump water into the reactor and fuel pool as part of on-going cooling efforts, the company said, adding it would measure dust near the building as well as the air above it to gauge radiation levels. A 9.0 earthquake and the resulting massive tsunami in March 2011 knocked out cooling systems at Fukushima Daiichi, causing the meltdowns of reactors. Tens of thousands of people were forced from their homes by the threat of radiation in the planet's worst nuclear accident for a generation. TEPCO is struggling to manage the clean-up, which scientists say could take up to four decades to complete. The steam is the latest in a growing catalog of mishaps that have cast doubt on the utility's ability to fix the world's worst atomic disaster in a generation. A series of leaks of water contaminated with radiation have shaken confidence, as did a blackout caused by a rat that left cooling pools without power for more than a day. The company has admitted in recent weeks that water and soil samples taken at the plant are showing high readings for potentially dangerous isotopes, including caesium-137, tritium and strontium-90. Japan's nuclear watchdog said last week the Fukushima reactors are very likely leaking highly radioactive substances into the Pacific Ocean. Members of the Nuclear Regulation Authority voiced frustration at TEPCO, which has failed to identify the source and the cause of spiking readings in groundwater. NRA officials are urging TEPCO to offer more detailed and credible data and make efforts to better explain to the public what it knows. Most of Japan's nuclear reactors remain off-line, largely due to public distrust of the industry. Prime Minister Shinzo Abe's Liberal Democratic Party, as well as utilities, are hoping to restart them.