?The Fukushima No. 1 plant is filling up with water,? Shunichi Tanaka, chairman of the Nuclear Regulation Authority, told a news conference on July 24. ?Inevitably the contaminated water will have to be discharged into the sea after TEPCO processes it properly and lowers its radioactivity levels below the standards.? When an accident happens, it is just a wee bit more poison exhaled. 'Dilution is the solution' in the view of the pro nuclear apologist. the plant continues to be a hazard to its surrounding environment. On Monday, TEPCO admitted that radioactivity from the plant is leaching into the water table and flowing from there into the Pacific. The admission confirms what many observers had long suspected: that the company has not been able to contain radioactive water that flows out of the melted cores through cracks and broken pipes. The scariest part of this weeks articles is the possibility that the roof of the unit there reactor, is causing atmospheric hear buildup within the fuel pool. The cooling water is in slight circulation, however the air within the facility under the reactors roof is not being properly ventilated? This is why we do not leave animals inside our cars on a summers day, as tepco will need to moderate the hear build up before the fuel becomes unstable in these conditions. Whom ever approved this plan to cap the reactor pool failed to take into account that the air circulation is critical to moderate. Thus is the same extent that the xbox 360 consoles faced. I only hope that multiple backup cooling systems are onsite being tepco. Will burn up Thur engines, and clog the reactors with more sediment in the attempt of keeping this current kamikaze approach. This reminds me of the burgeoning field of Algae Oil, the use of algae oil as a replacement for traditional gasoline. It grows in dead zones of salt water. There is a lot more going on in the Gulf of Mexico than the oils spill. Yes, it would answer some questions. Why has there been no international coalition, no response to this destruction of the earth's oceans? Well, because they wanted it to happen, and this grotesque flailing is merely a performance. That is logical, in a sense. Also, it would explain why they are not as freaked out about the loss of oxygen as I am 70% from the plankton in the oceans, according to my avatar . They are planning to replace with lots of algae farms. Sure nothing could go wrong with that. It would also produce more questions, e.g., how can they be even more psychopathic than I already thought? The elites have been treating the people of Japan and the United States as if They Are Not That Into Us for decades now. The Bank of Japan and the Fed have buried us, while giving all our money to Goldman Sachs, etc. I don't know. Maybe they see us as a liability now, any good mafia boss bumps off those who are no longer useful, right? As I alluded to in another thread, you are trying too hard to be credible. It is way past too late to worry about who, what, when, where, why and how. Future generations, if any, are the ones who will determine the five w's and how. Right now we are seeing our grandchildren's future's dissapear. BTW, thats why I am here, for my grandchildren and whats left of life. I want to like you, patty, and your efforts, but my flags are up full on your intent. I want everyone here to band together in a common direction to force the professionals that are charged with protecting our health, our environment, our food supply, to speak up about the absolute curse that the nuclear industry is placing upon all life. The testing of all food has to start today, especially seafood. Squabbling over bits and pieces simply won't cut it. And I am as guilty as anyone on this. Enough, enough, enough. Well anne, I love what you do, maybe you can help her organize it into a coherent level of information , instead of what it is. I don't claim to be any better than anyone else here or know any more. Take a look at this individual, who has done more than most anyone in getting this complacent world to wake up. Does anyone think that he insn't tired of ignorant and apathetic reception? It's gonna take all of anyone who cares to organize and mak a bunch of noise, no one can ignore.