Foreign nuclear experts on Friday blasted the operator of Japan's crippled Fukushima nuclear plant, with one saying its lack of transparency over toxic water leaks showed you don't know what you're doing . 				 The blunt criticism comes after a litany of problems at the reactor site, which was swamped by a quake-sparked tsunami two years ago. The disaster sent reactors into meltdown and forced the evacuation of tens of thousands of residents in the worst atomic accident in a generation. Earlier this week, Tokyo Electric Power TEPCO admitted for the first time that radioactive groundwater had leaked outside the plant, confirming long-held suspicions of ocean contamination from the shattered reactors. This action regarding the water contamination demonstrates a lack of conservative decision-making process, Dale Klein, former head of the US Nuclear Regulatory Commission NRC , told a panel in Tokyo. It also appears that you are not keeping the people of Japan informed. These actions indicate that you don't know what you are doing...you do not have a plan and that you are not doing all you can to protect the environment and the people. Klein was invited to attend the TEPCO-sponsored nuclear reform monitoring panel composed of two foreign experts and four Japanese including the company's chairman. The utility had previously reported rising levels of cancer-causing materials in groundwater samples from underneath the plant, but maintained it had contained toxic water from leaking beyond its borders. But the embattled company has now conceded it delayed the release of test results confirming the leaks as Japan's nuclear watchdog heaped doubt on its claims. We would like to express our frustrations in your recent activities regarding the water contamination, Klein said. We believe that these events detract from the progress that you have made on your clean up and reform for the Fukushima plant . Barbara Judge, chairman emeritus of Britain's Atomic Energy Authority, said she was disappointed and distressed over the company's lack of disclosure. I hope that there will be lessons learned from the mishandling of this issue and the next time an issue arises?which inevitably it will because decommissioning is a complicated and difficult process?that the public will be immediately informed about the situation and what TEPCO is planning to do in order to remedy it, she said. Decommissioning the site is expected to take decades and many area residents will likely never be able to return home, experts say.