The Wall Street Journal is reporting that radioactive cesium levels in trenches at the Daiichi plant have increased to levels not seen since April 2011. Radiation of 750 million becquerels a liter of cesium-134 and 1.6 billion becquerels a liter of cesium-137 was recorded, Tepco said. The normal limits for the two potentially harmful isotopes are 60 and 90 becquerels, respectively. In April 2011 a combined 1.8 billion becquerels was recorded. ?The level of radioactivity is potentially serious but the impact would depend on where it is found,? a Tepco official said. The sample came from a trench near the No. 2 reactor turbine building, the utility said. This water is leaking into the Pacific. No measures have been taken to stop this outflow of contaminated water. Unit 3, which has been giving off a light show on the Daiichi wecams the past few weeks, has been giving off steam. Nitrogen has been injected into this reactor continuously, in order to prevent a hydrogen explosion. There is a shortfall in nitrogen recovered from the gas management system. This shows that the steam is coming from the reactor, or from the hole in the ground underneath the reactor, with MOX corium down there. According to Fukushima Diary, On 7/26/2013, Tepco announced the ?steam? may be from the inside of the reactor. They have been stating it is the heated rainwater. Tepco is starting to change their stance. According to Tepco, they are injecting 16 m3/h of nitrogen gas into the reactor, but the gas management system takes up only 13 m3/h. The gap of 3 m3/h gas including evaporated water may be coming out from the top of the reactor3 building. Clearly Tepco has been lying about rainwater being the source of steam coming out of reactor 3. The underground corium has encountered water. So there is a risk of a hydrovolcanic explosion with this plutonium-rich fuel. Iodine-131 has been detected from fly ash at the Ota incineration plant in Tokyo, in the period June 20-28. This indicates criticalities have been occurring at the plant. Iodine is being released continuously, so criticalities are also continuous. A huge radiation dose of 562 mSv has been measured at Unit 3. The neutrons from the chain reactions, along with neutron-emitting isotopes like plutonium and curium, interact with the nitrogen injections to cause carbon-14 to be released. There have been no measurements made of this isotope. Along with tritium from neutrons and boric acid injections , this isotope is most deleterious to plant life. Linus Pauling, the two-time Nobel Prize-winning chemist, felt that carbon-14 was the most dangerous isotope of them all. Also, reactor containment pressure has been rapidly increasing at unit 2. The situation at Fukushima is deteriorating rapidly. UPDATE: Radioactive iodine dispersion maps have apparently been released. See comments.