Kyodo News, July 27, 2013: Tokyo Electric Power Co. said Saturday it has detected 2.35 billion becquerels of cesium per liter from water in an underground passage at the crippled Fukushima Daiichi nuclear power plant that is seeping into the sea [...] The trench, which is believed to be the source of the latest water leakage into the sea, is located below the No. 2 reactor turbine building. [...] Asahi Shimbun, July 27, 2013: ?We believe the highly radioactive water is staying within the pit,? a TEPCO official said, adding that the utility will nevertheless check carefully for possible leaks into surrounding soil and seal the ground to block such leaks from reaching the sea. TEPCO has never tried to engineer a solution to this problem as the Russians did because TEPCOs plan has always been to shove the whole mess into the pacific ocean?the cheapest, easiest solution. They never cared what the consequence of that action would be, they never consulted with engineers from other countries to try and minimize the disaster; protect people from harm, because TEPCO never wanted to spend any money solving the problems of these meltdowns. TEPCO has been penny pinching even the workers lacked proper equipment because it wasn't available from the start and throwing the mess into the ocean is an absurd means to dealing with this problem. I could never understand why the world's best and brightest scientists weren't brought? together to figure out how to deal with Fukushima immediately after the meltdowns were made public by TEPCO. Now I suspect that the nuclear industry exerted its influence to prevent it. The world's best and brightest scientists would have found a way to determine the true extent of the disaster and they would have gone public with the info. People around the world would have demanded an end to nuke power. Unit 2 appears to be the worst onsite offender ever since the meltdowns. Like Units 1&3, nitrogen injections never stop. Can't cap the units with concrete for fear of leaving voids. Without containment, can't drain the water away or the melted blobs will vent to the atmosphere. Keep them underwater and wait longer hoping the blobs cool down and don't explode but keep poisoning the Pacific while waiting. Spent fuel removal should start soon at Unit 4. Unit 3, if they keep disturbing it, it will vent to air worse than it is already. Unit 2 inside walls have to be decontaminated before SFP work begins if they can keep it from recontaminating itself. Unit 1 SFP has to be isolated to remove the fuel. Please see Greenroad's petition to use Borox to enshroud it. Here's a PR stunt for attention. After signing Greenroad's petition to stop the melt downs with Borax, we could start a Borax box drive and send them to Tepco, with time sensitive press releases. Night before last C2C broke Fukishima as the most important problem we face. Their stories often break through to mainstream?so I say the time is right to begin a campaign aimed at the populace. What? We're going to ask the fox to protect our chicken house? I believe the science is good to support this use of Boron in the form that will crystallize the corium?anyway I think that's how it works?new to me. I think Boron in the air was one of the ameliorating factors to Japan's radiation exposure because of volcanic release of Boron. Remember the photos of the eruption then?and the orbs around it? What was THAT about? Could the boron not be pumped down to the two coriums? It would seem #3 blew to kingdome come . I've read so many links today, I can't remember which, but one of them said they definitely have equipment to identify exactly where they are. If so, how would that add to fallout, unless sussessful, and then steam, along with fusion reactions would send it back up like rising magma?? I missed your post about other elements that would need to be added. They couldn't be added? Would taking a chance on a Borox fix cause more cancer than unending fallout? These are honest questions about which I have no opinion. what you need to understand? these hole initially were sort-of draining the basements. However: Blasts and such then spew debris up again. The stuff has formed a volcano-like structure that keeps getting taller around the holes. So, the basements are now OVER-filling, and that has the water sitting in some corium again. #2 the hole is under the busted torus-leg. So once it fills.. you get a back-flow into the torus? then it backs-up onto the main plant basement floor! This is why #2 rads have gone off-scale-high! #3 has the entire basement & PCV forming the volcano with the cap of concrete & Steel they made on top! That's now rising in pressure? steam is finding a way to get out! The main recirculation pump housing and line? is where it's pissing-out of now. #1 is a smaller edition of #3? the only difference is that #1 melted-out the bottom, and had less materials that were not laden with Plutonium? like #3 was. #3 had U-235/238, MOX, Pu-239/240/241 breeders, and what we think is Thorium rods in it, samples of that that were found out on the ground, post-blast. They never let us look at, nor test them for the composition of them. You could TRY to pour a slurry of the same stuff the put on Chernobyl down the holes.. Vegemite, boron, some lead, and all the Pu-240 we can round up.. that and anything else we have that would absorb the neutrons and stop the blasts to stop the nuke-quakes.. if not all the rads? it would be a positive step in right direction.. stop total..? +311 for a possible corium behavior theory as any I have read about. I know you have had your doubters among a few of the original Enenewsers and at times I felt your reports were way out in left field myself, but I always respect the right of anyone to offer theories or second hand accounts. Keep up the reports and theories so we can mull them around and see where they lead. Keep the faith Pattie and to other Enenewsers who disagree with her reports and theories, please keep it friendly in your critiques. Pattie is not the enemy?look to Tokyo for the real culprits in this global coverup and mishandling of a massive industry-created ecological disaster. That's all I have to say?stay together folks, for we shall surely die alone. Since no one knows for sure where the blobs are, you get a lot of leeway guessing. TEPCO isn't saying even if they knew where to look. I always thought that tidal interaction with the freshwater tables was a forgone conclusion once Unit 2 was leaking early on but it now comes as a revelation to TEPCO. Those full/new moon tides highest and lowest monthly tides occur on the same day really help the mixing of fresh and salt waters and now radioactive contaminated waters. You want sand around the blobs, well if the blobs traveled below the Units at all, sand will be there and freshwater to moderate. The time for sand was when the meltdowns were occurring to help melt the sand into glass. Concrete has a lot of sand content itself. Chernobyl lucked out because they had sand sandwiched between the walls for shielding and when the meltdown happen it broke the sand free to mix with the corium plus being high dry thus making that glass type mixture that is now failing by turning to dust due to the neutron interactions. No way they are getting boron to the runaway blobs, only to some of the remnants and that is only if surrounded by injected borated water. Splatters in the dry well above any flooded areas must be a problem yet. How they are ever going to dry out and keep dry the site to attempt to encase all the blobs is beyond me. Must be at least 300 tons of melted radioactive materials unaccounted for by now. So, into the sea the contamination goes. The fears of water moderating a sustained fission chain reaction have past. Hydrogen from radiolytic water breakdown is more of a concern because any explosions could expose any fissionable elements to more neutrons but would still only cause them to fizzle as a hardened crust might break open exposing it to water or an earthquake might have the same effect. Even borated water can't get past the crusts to stop fizzling let alone water to moderate. Unit 3's explosion is about as close to a re-criticality as you can get and if it happened, probably happened inside the reactor core. In other words, you need a lot of neutrons flying around at a slow rate of speed to fission. Where are all the neutrons to come from in a diluted melted and cooling mass? Coriums were hot until they encountered water again. Plenty of groundwater available to start the cooling. Neutrons only slow down in water, inside the blobs they speed up. In your scenario, all the fissionable materials would have to be towards the outside skin of the blobs, highly unlikely. Plutonium would have to congeal back to its pure form to sustain itself, again unlikely. Granted plutonium is nasty stuff, this stuff used was not concentrated to begin with. At Chernobyl, they didn't know what would happen for sure if the corium encountered water. They feared the worst. Tunneled under the Unit's base to add more concrete to prevent a melt thru to groundwater, abandoned that idea as unnecessary when the corium cooled faster than anticipated. They went to great lengths to drain water from trenches that the corium might have flowed to. I'm thinking most of the fissionable products went airborne and what was left is like radioactive slag. Chernobyl's corium didn't burn directly down, it flowed and spread around until it cooled. Fukushima didn't have far to travel before finding cooling waters, whether the waters can cause a massive criticality capable of melting holes in planet earth with everything caving into it is another question to be answered. Unit 2's corium undisturbed by massive explosions flowed out and around the drywell containment floor, didn't exactly burn directly down. Open access hatches on 1&3 might have directed the flows to spread? Fission in a controlled environment like a reactor still wastes 30% of the fuel in a year's time and that is with any new plutonium by-product being produced adding to the chain reactions. Need continuous high temperatures to do what you purpose. Here you have decay heat and some fizzling hot spots going on. Prevent them from heating up to remix any fissionable materials is about all you can do. If the blobs can't fission there is only so much heat they can produce. In desperation they used seawater to get the blobs to harden in place to do their cooling. Newer reactor floor mats, in case of meltdowns, are shaped like wide gentle slopes to allow the melts to spread out, provided containment is intact to filter the off gassing. Without containment, both situation are insane: Keeping blobs underwater to leech into the sea or high and dry to leech into open air. High and dry, at least you can redo containment somehow like Chernobyl. Underwater with cracked housings and foundations or worse, there is no way to deal with it to stop it entirely. But don't really care .. you all make up your own minds .. tin hats or not. And I shall disappear again. Don't waste a lot of time flaming .. ain't gonna read it. That is the problem with broken containment, you can't fill the vessels with water because it leaks out so you can't keep the melts covered with borated water. Covered with borated water is preferable to absorb the neutrons and cool the melt at the same time. Not to many choices. 1. Filter the cooling water and store the excess letting the heavily radioactive overflowing groundwater run to the sea or 2. Instead of storing excess filtered water just dump it into the ocean and keep filtering the heavily radioactive water, to keep the water table down, before dumping it in the sea?Both ways, radioactive water ends up in the ocean, more or less. At Chernobyl they think link to link above the elephant's foot portion of corium melted 2 meters about 6 feet deep into the concrete. There was no way to cool it except with the shielding sand that mixed with it on its own. At Daiichi, if the access hatches blew open or melted open, the melts would have flowed out to other parts of the containment floor. Maybe melting into the suppression chambers. Beats staying a massive blob. TEPCO in one of their handouts thinks Unit 2's ? melt flowed out through a blown access door to partially spread out. The methane is a 20-X worse greenhouse gas, and is death to breath as it will displace oxygen. A: Nibiru and other stories about wayward planets are an Internet hoax. There is no factual basis for these claims. If Nibiru or Planet X were real and headed for an encounter with the Earth in 2012, astronomers would have been tracking it for at least the past decade, and it would be visible by now to the naked eye. Obviously, it does not exist. Eris is real, but it is a dwarf planet similar to Pluto that will remain in the outer solar system; the closest it can come to Earth is about 4 billion miles.