On Wednesday, Japan?s Nuclear Regulation Authority NRA revealed that groundwater contaminated by radioactivity at the damaged Fukushima Daiichi nuclear power plant is probably leaking into the Pacific Ocean. The NRA refrained from making a definitive statement on the subject, saying only that a leak is ?strongly suspected? at this point. However, according to the Associated Press, marine biologists studying the area have long warned of the possibility that radioactive water was escaping into the sea through underground channels, citing high levels of radioactivity in samples of fish taken from the waters near the plant as evidence. As we discussed in a previous post, there is a consensus that?groundwater contamination remains rampant?in the vicinity of the plant and workers continue to have trouble preventing water from flowing in and out of the damaged reactor buildings, which remain highly radioactive. TEPCO continues to deny existence of leak Representatives of the Tokyo Electric Power Company TEPCO , which operates the ruined plant, have long denied that radioactive contamination is leaking into the sea. The firm maintains that most of the contamination being detected in seawater has been there since the accident. On Wednesday, company spokesman Noriykui Imaizumi raised doubts about the NRA?s findings and suggested that a spike in cesium levels found in water samples may have been caused by contaminated dust slipping into the samples as they were taken from monitoring wells. Imaizumi asserted that TEPCO remains open to new suggestions from regulators, but the company?s position is that because cesium tends to be absorbed in the soil, it is unlikely that any water contaminated with the element would be able to reach the sea. Containment, harm reduction cited as immediate priorities The NRA contends that testing of water samples taken from coastal areas has shown that substantial quantities of tainted fluids have most likely reached the ocean at this point. NRA Chairman Shunichi Tanaka said that he believes the contamination has been continually spreading ever since the March 2011 meltdown. However, he emphasized that regulators believe the rate of contamination has slowed significantly since the initial days after the crisis. ?What?s most important is to minimize the leak to the outside and reduce the impact on the human society,? Tanaka said. The independent regulatory agency, which was created in the wake of the 2011 crisis, has announced the formation of a panel of experts to determine the extent of the problem and devise new containment strategies. The organization has also urged TEPCO to acknowledge the leak, find its source and begin assessing risks to public health and the environment. Specialized software may aid remediation efforts In this situation, finding out how contamination is being spread and where it is most severe is essential to the creation and execution of a comprehensive cleanup plan. Without accurate information about conditions on the ground and in the water, remediation managers cannot hope to effectively address the problem. Furthermore, because assumptions often prove to be inaccurate and strategies must be changed accordingly, there is a compelling need for companies involved in large-scale environmental restoration projects to have access to enterprise software developed specifically for handling complex services such as remediation. This allows an organization to effectively control the change management process by planning for multiple scenarios and their potential financial impacts. With all core financial and environmental data processes integrated into a single platform, a company will have a high level of visibility into the details of past assumptions and decisions. When data is organized into uniform structures in this way, a streamlined workflow with built-in financial controls can be established, resulting in lower administrative costs and ensuring that managers retain control over all key business processes. The right enterprise tools can significantly reduce the overall cost and risk associated with managing large remediation projects.