More than two years after a magnitude 9.0 earthquake and resulting tsunami devestated northeastern Japan, the Tokyo Electric Power Company TEPCO announced that contaminated groundwater appears to be leaking from the Fukushima Daiichi nuclear power plant into the Pacific Ocean. The Asahi Shimbun reports that TEPCO acknowledged the appearance of the leak at a Monday press conference, stressing that so far it appears confined to the man-made harbor surrounding the plant. Earlier this month, a TEPCO representative stated that we strongly doubt that highly contaminated water is spreading into the open ocean. Until now, TEPCO hadn?t acknowledged the presence of the leak despite numerous independent findings of elevated radiation levels in the nearby seawater. TEPCO says it realized something was up when it noticed that the water level in the underground trench designed to hold wastewater from ongoing cooling operations at the site was rising and falling along with the tide. Earlier this month, Asahi reported on a nearly 100-fold increase in the level of radioactive cesium and strontium in groundwater at the site, which TEPCO said it was unable to explain. Additionally, the Asahi Shimbun reports that TEPCO staff revealed the number of plant workers exposed to thyroid radiation levels above the minimum threshold for elevated risk of cancer was 1,972 ? 10 times the number it had previously quoted. However, the actual health risks to those in the affected area are still considered low, according to the World Health Organization. In February, the UN body released the results of an ongoing study into the health impact of the Fukushima nuclear accident, concluding that in the areas most affected by radiation, the predicted risks are low and no observable increases in cancer above natural variation in baseline rates are anticipated. It noted, however, that certain segments of the population were at elevated risk for certain forms of cancer, particularly females exposed as infants, stressing the need for ongoing monitoring and screening of the affected population.