Le prince William, Kate Middleton et leur fils George de Cambridge quittent Kensington Palace le 24 juillet 2013 pour se rendre chez les Middleton ? Bucklebury. 							Dans cette photo : 				 								Kate Middleton, 				 								Prince William									 			 		 			 					 													 							 							 								 									 La reine Elizabeth II ? Buckingham Palace le 23 juillet 2013 lors du gala du Queen's Award for... 								 														 													 							 							 								 									 Le prince William, Kate Middleton et leur fils le prince George de Cambridge quittent Kensington... 								 														 													 							 							 								 									 La reine Elizabeth II a rendu visite ? son petit-fils le prince George de Cambridge ? Kensington... 								 														 													 							 							 								 									Le prince George de Cambridge, ?g? d'un jour quittant la maternit? de l'h?pital St Mary avec ses... 								 														 													 							 																								 Le prince William, Kate Middleton et leur fils George de Cambridge quittent Kensington Palace le... 																						 													 							 																								Le prince George de Cambridge, ?g? d'un jour quittant la maternit? de l'h?pital St Mary avec ses... 																						 													 							 																								Le prince George de Cambridge, ?g? d'un jour quittant la maternit? de l'h?pital St Mary avec ses... 																						 													 							 																								Le prince George de Cambridge, ?g? d'un jour quittant la maternit? de l'h?pital St Mary avec ses... 																						 													 							 																								 La reine Elizabeth II ? Buckingham Palace le 23 juillet 2013 lors du gala du Queen's Award for... 																						 													 							 																								 Le prince William, Kate Middleton et leur fils George de Cambridge quittent Kensington Palace le... 																						 													 							 																								 La reine Elizabeth II ? Buckingham Palace le 23 juillet 2013 lors du gala du Queen's Award for... 																						 													 							 																								 La reine Elizabeth II a rendu visite ? son petit-fils le prince George de Cambridge ? Kensington... 																						 													 							 																								 La reine Elizabeth II ? Buckingham Palace le 23 juillet 2013 lors du gala du Queen's Award for... 																						 													 							 																								 La reine Elizabeth II ? Buckingham Palace le 23 juillet 2013 lors du gala du Queen's Award for... 																						 													 							 																								 La reine Elizabeth II ? Buckingham Palace le 23 juillet 2013 lors du gala du Queen's Award for... 																						 													 							 																								 Le prince William, Kate Middleton et leur fils George de Cambridge quittent Kensington Palace le... 																						 													 							 																								 La reine Elizabeth II a rendu visite ? son petit-fils le prince George de Cambridge ? Kensington... 																						 													 							 																								 La reine Elizabeth II a rendu visite ? son petit-fils le prince George de Cambridge ? Kensington... 																						 													 							 																								 La reine Elizabeth II a rendu visite ? son petit-fils le prince George de Cambridge ? Kensington... 																						 													 							 																								 La reine Elizabeth II a rendu visite ? son petit-fils le prince George de Cambridge ? Kensington... 																						 													 							 																								 La reine Elizabeth II a rendu visite ? son petit-fils le prince George de Cambridge ? Kensington... 																						 													 							 																								Le prince George de Cambridge, ?g? d'un jour quittant la maternit? de l'h?pital St Mary avec ses... 																						 													 							 																								Le prince George de Cambridge, ?g? d'un jour quittant la maternit? de l'h?pital St Mary avec ses... 																						 													 							 																								Le prince George de Cambridge, ?g? d'un jour quittant la maternit? de l'h?pital St Mary avec ses... 																						 													 							 																								Le prince George de Cambridge, ?g? d'un jour quittant la maternit? de l'h?pital St Mary avec ses... 																						 													 							 																								Le prince George de Cambridge, ?g? d'un jour quittant la maternit? de l'h?pital St Mary avec ses... 																						 													 							 																								Le prince George de Cambridge, ?g? d'un jour quittant la maternit? de l'h?pital St Mary avec ses... 																						 													 							 																								Le prince George de Cambridge, ?g? d'un jour quittant la maternit? de l'h?pital St Mary avec ses... 																						 											 En route pour l'histoire ! A peine plus de 36 heures apr?s avoir vu le jour, accueilli dans le monde ? 17h24 heure fran?aise lundi 22 juillet 2013 par les mains expertes du docteur Marcus Setchell, le prince George de Cambridge encha?nait mercredi les kilom?tres et les rencontres. Apr?s une premi?re nuit en famille au palais de Kensington, le prince William et Kate Middleton n'ont pas tard? ? quitter Londres avec leur prog?niture. Un b?b? qui fait son poids 3,8 kilos et a du coffre , selon les confidences ? la fois fi?res et comiques de son papa lors de la pr?sentation de l'enfant devant la maternit?, mardi soir, 31 ans apr?s que lui-m?me soit pass? par l? dans les bras de Charles et Diana. A ce moment-l?, la reine Elizabeth II n'avait pas encore eu l'occasion de faire connaissance avec son troisi?me arri?re-petit-enfant, futur roi d'Angleterre en puissance, contrairement aux grands-parents du nourrisson - Michael et Carole Middleton avaient ?t? les premiers visiteurs ? l'aile Lindo de l'h?pital St Mary, mardi apr?s-midi, suivis de pr?s par le prince Charles et Camilla Parker Bowles, pass?s en coupe de vent entre deux engagements officiels dans le Yokshire et le Pays de Galles. Et tandis que le prince William s'affairait avec soin ? installer le si?ge auto il s'?tait entra?n? au pr?alable, a indiqu? le palais ? l'arri?re de son Range Rover pour emmener son fils ? la maison, ? Kensington, o? la famille doit s'installer bient?t octobre au plus tard dans le cossu appartement 1A dont feue la princesse Margaret fut locataire, la reine Elizabeth II, qui donnait une r?ception ? laquelle assistaient le comte et la comtesse de Wessex ainsi que les princesses Beatrice et Eugenie d'York , commen?ait ? piaffer d'impatience de d?couvrir le royal baby, apr?s avoir tant souhait? que sa naissance tardive ne se t?l?scope pas avec ses vacances ? Balmoral. Pippa Middleton, elle, avait pris les devant en attendant mardi soir ? Kensington avec son boyfriend Nico Jackson le retour de sa soeur, son beau-fr?re et son neveu. Selon certaines sources, il se peut que le prince Harry, venu sp?cialement de sa base de Wattisham dans le Suffolk, et James Middleton aient ?galement compt? au sein du comit? d'accueil. Mais d?s le lendemain, la monarque faisait sur la route du d?but de ses vacances un crochet par Kensington, arrivant en voiture mercredi peu apr?s 11 heures pour un moment ?mouvant et historique : sa rencontre avec le prince George de Cambridge, la premi?re en 120 ans entre un monarque en fonction et celui qui sera le troisi?me ? lui succ?der la derni?re du genre, rappelle l'AFP, r?unissait en 1894 la reine Victoria et son arri?re-petit-fils, le futur Edward VIII . Alors qu'elle confiait la veille, au cours de sa r?ception, ?tre aux anges , Elizabeth II, qui s'est d?plac?e sans son ?poux le duc d'Edimbourg toujours en convalescence ? Windsor depuis son op?ration ? l'abdomen, n'est toutefois rest?e qu'une demi-heure aupr?s des jeunes parents et du b?b?. Suffisant toutefois pour valider avec eux les pr?noms de l'enfant - George Alexander Louis - que le public apprendrait en fin de journ?e par voie de communiqu?, alors que la petite tribu Cambridge serait d?j? arriv?e ? Bucklebury, chez les Middleton. En d?but d'apr?s-midi, le Land Rover de la famille a en effet quitt? Kensington Palace, o? William et Harry ont grandi, pour le Berkshire, o? le trio doit passer au moins quelques jours chez les grands-parents Middleton, dans la nouvelle maison tr?s confortable un manoir de style georgien d'une valeur de pr?s de 6 millions d'euros, avec court de tennis et piscine discr?tement acquise l'an dernier par les parents de la duchesse de Cambridge ? Bucklebury, le village o? Kate, Pippa et James ont grandi. Et o? la s?curit? a ?t? consid?rablement accru derni?rement. Cette fois, Wiliam, ? nouveau en chemise bleu clair, n'?tait pas au volant mais ? la place du passager, et Kate, en robe ? fleurs, ? l'arri?re avec b?b?. Les jeunes parents ont salu? avec de larges sourires les admirateurs pr?sents aux abords de la propi?t? royale, qui ont assist? ? leur d?part. Le prince William a pris le cong? paternit? deux semaines auquel il a droit mais pas l'allocation qui va avec, a priori et compte en profiter au maximum avant de retourner ? la base de RAF Valley sur l'?le d'Anglesey, au nord du Pays de Galles, et d'?tre r?affect? ? Londres : le duc et la duchesse de Cambridge comptent faire plus ample connaissance avec leur fils, en priv? et dans le calme , ont annonc? leurs services. Kate Middleton, elle, pourrait rester plusieurs semaines dans la campagne du Berkshire, ? une heure de route ? l'ouest de Londres, l? o? elle avait notamment pass? la derni?re semaine de sa grossesse. A moins que le couple se partage entre Bucklebury, o? des conditions de s?curit? particuli?res ont ?t? am?nag?es, et Balmoral, avant de pr?parer le bapt?me du prince George, vraisemblablement en septembre ? Buckingham. Les jeunes parents, qui ont embauch? une ancienne employ?e d'Elizabeth II, Antonella Fresolone, comme gouvernante ? Kensington, n'ont pas l'intention de recourir aux services d'une nounou, ?tant d?cid?s ? ne pas d?l?guer l'?ducation de leur bambin, mais aussi ? mettre ? contribution les grands-parents. Carole Middleton, qui s'est rendue ? la maternit? d?s que possible, est pr?te : elle arborait d'ailleurs un air b?at en ressortant de l'h?pital, confiant ?a revient naturellement ? un journaliste qui lui demandait ses impressions apr?s le premier c?lin ? son petit-fils. G.J.