New mum Kate Middleton is breastfeeding her son ? and she is determined to avoid giving him a dummy, the Sunday People can reveal. In what will be seen as a huge coup for the Breast is Best lobby, royal sources have revealed that Kate, 31, has decided to feed baby George naturally rather than use formula milk in a bottle. After a shaky start, the little Prince has fully taken to breastfeeding. One senior royal source said: ?It would be fair to say that Prince George has a healthy appetite. He is a very hungry little boy. ?I gather there were some difficulties at first ? there often can be, as new mums can get a little tense. ?But after some help from the midwife, they both caught on very quickly. As far as I can tell, Kate finds it very relaxing and George is just like any other little baby. ?He can?t get enough. And they all certainly know when he?s hungry ? his screams are very difficult to ignore. But don?t expect Kate to be photographed breast-feeding. She does not want to become a pin-up for the breast-feeding lobby. ?She feels that it is a matter of personal choice, and that new mums should do whatever feels right for them and their baby.? Kate follows a long line of royal women who breast-fed. Diana breast-fed both Princes William and Harry. And the Queen breast-fed Prince Charles for two months until a case of measles forced her to stop when he was two months old. During her pregnancy, St James? Palace refused to comment on the Kate?s plans to breastfeed. But on Wednesday the Duchess was seen leaving Kensington Palace wearing a Blossom Knot Front Lavender dress by maternity wear specialists Seraphine. The ?50 dress, which has sold out online and now has a four-week waiting list, is designed especially for new mums who are breastfeeding and a description of the dress reads: ?The deep V-neckline enhances your new ?cleavage and provides easy breast-feeding access post birth.? Seraphine, also worn by Halle Berry and Jessica Alba, boasts four of its dresses are worn by Kate.Owner Cecile Renaud said: ?Kate?s ordered a couple of breastfeeding styles from us. ? The Duchess?s decision to breastfeed her son is expected to trigger a trend among new mums keen to emulate the her. The Department of Health recommends mothers exclusively breast-feed their children for the first six months of their lives. But last year figures showed less than half new mums were still breastfeeding by the time they took their newborns for six or eight week check ups. Meanwhile staff at Kensington Palace have been told ? by order of the Cambridges ? not to give little George a dummy Palace sources said the couple wanted to raise their son to be a ?calm and quiet? boy and not reliant on a dummy to soothe him. Since leaving Kensington Palace on Wednesday, Kate, William and George have been staying at the Middleton family mansion in Bucklebury, Berks. William has been doing little more than holding baby George in his arms and gazing at his son and heir. The source said: ?It?s taken a while for it to sink in with William. ?He is spending a lot of time with George and all he does is just stare at the boy with this great big grin on his face. ?Becoming a father for the first time is a big deal for any man. But when you?re the heir to the throne, there?s that little bit more pressure. It?s almost a prince's first duty to provide an heir ? and now William has done that, he can relax a little. William is also said to be keen to see that George is brought up like any other child. The source added: ?William wants to do all those thing that any other dad would do. He wants to push the pram and help with getting his son dressed ? and, of course, change George?s nappies.? He also looks forward to using a papoose, a trendy baby carrier. The source said: ?William dreams of a day when he is walking the ?wonderful beaches in Anglesey ? hand in hand with Kate, their dog Lupo bounding through the surf and George snug in a papoose.? Staff?s nickname is very PC Backstairs staff at Kensington Palace have nicknamed their new royal resident after he spent just one night there. They?re calling him PC, a play on his title, Prince George of Cambridge. And Kate is now known as MC ? Mummy Cambridge. When Wills was little, his late mother Prince Diana nicknamed him ?wombat? on holiday in Australia and the moniker stuck.