He will be known as Prince George of Cambridge and, as third in line to the throne behind his father and grandfather, will one day be King. The name George, the hot favourite, cost Britain's bookmakers a packet - one had to pay out ?250,000. All three names have close royal connections and one commentator said last night that Kate and William's choice of the Queen's late father King George VI's name would give Her Majesty great pleasure . But royal aides said there was no particular significance to the choices as far as they knew. We've just been told that they like those particular names, said one. Kensington Palace said: The Duke and Duchess of Cambridge are delighted to announce that they have named their son George Alexander Louis. The baby will be known as His Royal Highness Prince George of Cambridge. Six Georges have worn the Crown since George I in 1714. The last was George VI. Historian and royal biographer Robert Lacey said: George is obviously a tribute to the Queen's father and will, I imagine, give Her Majesty great pleasure. Prince Charles said the other day he had no idea what it was going to be. My guess is that it was very much the choice of the mother and father, but I'm sure they would have checked it with the Queen. Alexander is a name more closely associated with Scottish monarchs but the female equivalents have long been royal favourites. Queen Victoria's first name was Alexandrina and the Queen's second name is Alexandra. One of Prince William's names is Louis, in a nod to his father's favourite uncle, Lord Mountbatten. So that carries on the tradition, a royal aide said. The announcement of the name was another moment of high drama after an extraordinary three days in which the birth of the royal baby became a global event in the age of the internet. Earlier, the Queen had visited her new great-grandson and William and Kate, both 31, at Kensington Palace. However, Prince Philip, who is recuperating from an abdominal operation, will have to wait to see his greatgrandson. He will remain at Sandringham until joining the Queen at Balmoral next month. The Duke and Duchess and their baby son later left Kensington Palace and travelled to the ?5million home of Kate's parents, Michael and Carole Middleton, in Bucklebury, Berkshire. george a boost for nation? spend time relaxing there. At the village pub, regulars last night drank a toast to their future King. Landlady Briony Stevens, 24, said: George is such a regal name and will be a popular choice. I love it. The young prince, who will one day be King George VII, is expected to be christened in the autumn after the Queen's two-month break at Balmoral. Details of the date and venue are still being worked upon. Prince William was christened in the Music Room at Buckingham Palace and Prince Harry was baptised at St George's Chapel at Windsor Castle. Those two venues remain a possibility but other options under consideration, according to sources, are the Chapel Royal at St James's Palace and the Queen's Chapel across the road.