The third-in-line to Great Britain's throne finally has a name: George Alexander Louis. According to Kensington Palace, Prince William and Kate's 2-day-old son will be officially be known as His Royal Highness Prince George of Cambridge. The news comes one day after the royal couple emerged from St. Mary's Hospital carrying the newborn prince. Should Christians pray for the royal family? For more perspective, 700 Club Producer Sarah Kelly, who is from the United Kingdom, spoke with CBN News, July 23. He's got her looks, thankfully, Prince William told reporters. He's got a good pair of lungs on him, that's for sure. The baby boy was born Monday at 4:24 p.m., weighing in at eight pound, six ounces. It's a wonderful moment for a warm and loving couple who have a brand new baby boy, British Prime Minister David Cameron said. In keeping with tradition, the baby announcement was posted on an easel outside Buckingham palace. But in a sign of the new century the royal baby has been born into, the announcement was made to the world first through an email to the press and social media networks like Twitter. In a brief statement Prince William said he and his wife Kate, couldn't be happier. Celebrations erupted immediately. Famous London landmarks announced the news and fountains turned blue -- as did Niagara Falls. I just got here in time to burst my bubbles and raise a toast to the new prince! one well-wisher said. British papers reflected the national mood, with one announcing the regal has landed. Another newspaper, The Sun, temporarily changed the spelling of their title in honor of the new prince. President Obama joined other world leaders in welcoming the birth of the royal baby. We wish them all the happiness and blessings parenthood brings, he said in a written statement. The Duke and Duchess of Cambridge are soon expected to select a photographer for the baby's first official portrait. Are you seeking answers in life? Are you hurting? Are you facing a difficult situation? Find peace with God, discover more about God or send us your prayer request. Call The 700 Club Prayer Center at 1 800 823-6053, 24 hours a day. A caring friend will be there to pray with you in your time of need. Charlene?Aaron serves as a general assignment reporter and helps anchor for the CBN News Channel.? Follow her on Twitter @CharNews and like her at Facebook.com/CharleneIsraelCBNNews.