Catherine, Duchess of Cambridge,? gave birth Monday to Prince George of Cambridge, weighing 8 pounds, 6 ounces, who is now third in line to the British throne. When the very announcement of your birth ? a mere slip of paper ? merits a royal police escort to Buckingham Palace, you can rest assured the years that follow will be no less rarefied. Once the world?s press and paparazzi have finally decamped from St Mary?s Hospital, Paddington, and exhausted their photo ops outside Kensington Palace, what can Prince George of Cambridge expect from life in the coming years? As third in line to the throne, Prince George will inevitably feel the weight of responsibility from a young age that a life destined to be monarch brings with it, just as the Duke of Cambridge has always been aware that no matter how he forges his own path ? with his military career and his charitable causes ? kingship beckons sooner or later. But speak to any royal aide close to the Duke and Duchess of Cambridge, and they will tell you that they are determined to bring up their firstborn as ?normally? as possible. To do this, much will depend on William?s future career plans beyond his current role as an RAF search and rescue helicopter pilot, a role which will end later this year. He has delayed announcing his next move for several months.? But if, as expected, he will continue to serve in the Armed Forces for a few more years ? most likely with his regiment the Household Cavalry where he could be based in London or nearby Windsor ? then William and Kate?s child can at least hope for an early childhood somewhat shielded from the direct spotlight of having parents who are full-time royals. As a royal aide once told me of William?s parenting plans: ?He is keen to bring his children up as children of a serviceman for as long as possible. He is in no hurry to take up a more prominent role within the Royal Family, and there is absolutely no pressure from the Queen or anywhere within the royal household for him to do so.? So where will Prince George call home? The Moses basket will likely shuttle in between Nottingham Cottage, William and Kate?s small London base within the grounds of Kensington Palace, and the Middletons? family home in Bucklebury, Berkshire, as the couple juggle those first few weeks of sleepless nights and William?s return to work in remote Anglesey while Kate remains in London with the baby. Then, from the autumn, the newest HRH should be happily ensconced in the nursery of Apartment 1A at Kensington Palace, Princess Margaret?s former home which is undergoing a ?1 million renovation, in anticipation of its new tenants who hope to be in from October. As Prince George begins to toddle and then walk and run, a countryside residence will also come in handy for the royal couple, who will make Anmer Hall, a 10-bedroom Georgian mansion gifted to them by the Queen, their rural retreat. The house is on the Queen?s Sandringham estate in Norfolk and is undergoing major renovations. When it becomes William and Kate?s country bolthole in a few years? time, their son can expect weekends and holidays where tennis, horse-riding and swimming are on tap in the back garden. And of course, long walks with Lupo, the royal couple?s beloved black cocker spaniel, which will be on hand for baby Cambridge?s play time. While Prince Charles was often photographed being wheeled in his pram around Buckingham Palace by Mabel Anderson, his no-nonsense nanny, and Princes William and Harry were looked after by royal nanny Olga Powell as small children, and later by Tiggy Legge-Bourke, William and Kate will not necessarily employ a full-time nanny for their newborn. They have adopted the less-is-more approach when it comes to staffing royal life ? they have no staff at their home in Anglesey and have only advertised for a housekeeper for Kensington Palace.? So when Kate returns to part-time royal duties in the autumn, baby Cambridge?s childcare could well be divided between Kate, the Middletons who will certainly prove doting grandparents, and a royal housekeeper-nanny who will offer as much or little help as William and Kate need ? a couple who have indicated they will be ?hands on? parents. For the early school days, Prince George of Cambridge will have plenty of options on the doorstep of Kensington Palace, including the exclusive Acorn Nursery in nearby Notting Hill. He may later be headed for Wetherby, also in Notting Hill, the pre-preparatory school where Princess Diana was often photographed dropping off Princes William and Harry. Prince Charles was packed off to the remote Gordonstoun School in Scotland, where bracing early morning swims and cross-country runs were the order of the day to ?toughen up? royal children. William and Harry attended Eton College because that?s where aristocratic teenagers went, and though Harry struggled with the academic rigors of Eton, he needed to be close to his brother after the death of their mother. But William and Kate are likely to take a more modern approach to Prince George?s schooling.? Unlike previous royal parents, dictated to by tradition and precedent, William and Kate will likely heed their child?s wishes, academic ability and circle of friends, before making their choice. If young Prince George has brains and pedigree, Eton will be a strong contender, as will Winchester College and Harrow School. The son of a serviceman could be drawn to Wellington College, one of Britain?s leading co-educational schools with strong links to the military, or Kate?s own alma mater, Marlborough College. Wherever the royal baby son goes, however, so too will the world?s press, desperate to photograph and debate the latest baby-gro, buggy, lock of hair, milk tooth and smile. And when your great-grandmother is the Queen, your late grandmother was Princess Diana and your mother is the world?s most photographed woman, what else can you expect but a life lived in front of the lens? But as William has demonstrated, when the press overstep the mark with his nearest and dearest, he takes no prisoners. He will be fiercely protective of his new son to ensure he has a chance of a ?normal? family life ? whatever that means in Royal circles. Roya Nikkhah is a writer and broadcaster on the Royal Family and the Arts, former Arts and Royal Correspondent for The Sunday Telegraph. Follow her on Twitter at @royanikkhah This essay has been updated to include HRH Prince George of Cambridge?s name. For the latest entertainment news Follow @WSJSpeakeasy