Announcement puts end to weeks of speculation as bookies' favourite comes through Heather Saul is an online news reporter for www.independent.co.uk The Duke and Duchess of Cambridge have named their son George Alexander Louis, Kensington Palace have confirmed. The announcement puts an end to weeks of speculation as the most recent bookies' favourite for the Prince of Cambridge's first name came through. Britain seemed convinced that the Duchess would choose the traditional moniker George for her son, with odds sitting at 9/4 this morning, according to Ladbrokes. James was also a popular choice at 4/1. Paddy Power had noticed a surge towards the name Spencer, with odds stacked at 8/1 earlier. The country had to wait over 24 hours to hear the name chosen for the heir to the throne, but this was not long compared with previous royal births. Royal supporters waited for a week to hear the name chosen for a newborn Prince William, although Prince Harry's name was unveiled upon his exit from the hospital in 1984. Earlier the couple were seen leaving Kensington Palace by car with their new-born son, as they reportedly headed to Kate's family home in Bucklebury, Berkshire. Prince Harry had visited the Duke and Duchess of Cambridge to see his new nephew, Kensington Palace announced. The Queen also arrived at Kensington Palace earlier in the morning to visit Kate and William and her great-grandson for the first time. The Queen, who arrived in the rear of a dark green Bentley, has said that she is ?thrilled? by the delivery of the future king, who is third in line to the throne. The Queen left Kensington Palace after spending just over half an hour visiting.. Kate and William were welcomed back to the palace by her sister Pippa and other members of the Middleton family, who held a small family celebration to honour the latest addition to their family. Raising the royal baby will continue to be strictly a family affair it seems, as despite both William and Kate having busy schedules due to their official duties, an aide confirmed that the couple will not look to hire a nanny, according to The Telegraph. Earlier yesterday afternoon, the moment the media had been waiting for finally arrived when William and Kate emerged from the private wing of the Lindo hospital, allowing the world to finally catch a glimpse of the third-in-line to the throne. The Duke and Duchess posed on the steps of St Mary?s Hospital and presented the world with the future king, answering questions from the media scrum that has camped outside the hospital for weeks anticipating the birth of the royal baby, alongside thousands of well-wishers. Twitter immediately exploded into a frenzy as soon as the royal baby entered into public view and 18,000 tweets a minute were posted. William and Kate, looking relaxed and happy, brought their baby prince out into the public gaze and joked about their newborn being a ?big boy?. The Duchess, dressed in a light blue Jenny Packham dress cradled her son first and the couple appeared relaxed, smiling broadly as the world's media captured the moment. The baby prince was the star attraction and appeared oblivious to the flashguns of the world's press photographers going off, but did seem to be partially awake during his first public appearance. His hand poked over the white shawl he was wrapped in, prompting many to take to Twitter and comment on the little prince?s royal wave using #royalwave. William later held the future king and walked towards the press with his wife to answer a few questions. He began by joking: ?He's got a good pair of lungs on him, that's for sure. He's a big boy, he's quite heavy. The Duke even promised to remind his child of his 'lateness', as his wife was believed to be at least a week past her due date when she went into labour. ?I'll remind him of his tardiness when he's a bit older because I know how long you've all been sat out here , he said. ?Hopefully the hospital and you guys can all go back to normal now and we're going to look after him... ? Kate, Duchess of Cambridge, holds the Prince of Cambridge ? Asked how he felt, William said very emotional and the Duchess agreed: ?It's such a special time and I think any parent will probably know what this feeling feels like.? He also revealed that no name has been chosen for the future heir to the throne. ?We are still working on a name so we will have that as soon as we can,? he said. ?It's the first time we have seen him really, so we are having a proper chance to catch up.? William and Kate's appearance outside the Lindo Wing harked back to the day the Duke first emerged into the world outside the same hospital in the arms of the Prince and Princess of Wales in 1982. But the atmosphere was very different this time, as the royal couple were casually dressed and appeared to be at ease. The birth of a son was also welcomed as an heir to throne, after a bill to amend the rules of succession was rushed through earlier this year to ensure that if the infant had been a girl, it could have still ascended to the throne. Speculation had been mounting throughout Tuesday that the Duchess would leave hospital that day, after a woman was photographed carrying a car seat into the back entrance of St Mary?s. William and Kate finally departed from the hospital just after 7.15pm, where William carried the infant in a baby seat and carefully placed him in the back of a range rover, before driving their family back to Kensington Palace. The birth of Baby Cambridge, as he had been referred to by the media and social networks, is historic in many ways. The child is the first Prince of Cambridge to be born for more than 190 years. Charles's visit to the hospital was also an historic moment as it is believed to be the first time three male heirs to the throne - Charles, his son William and now George - who are expected to reign, have come together in more than a hundred years. The last time a similar gathering happened was likely to have been before Queen Victoria's death in 1901 when her son, later Edward VII, was with his son the future George V and grandson, later Edward VIII. Prince George, weighing in at a hefty 8lb 6oz, is also the heaviest future king to be born for 100 years. William weighed 7lb 1.5oz when he was born in 1982, whilst the Prince of Wales weighed 7lb 6oz upon his birth. Asked about changing nappies the Duke said: ?We've done that already,? and the Duchess confirmed he had done his first nappy already . Joking again William said: He's got her looks, thankfully, while Kate replied: No, no, I'm not sure about that. And poking fun at his apparent lack of hair the Duke said about his son: He's got way more than me, thank God . The Queen last night revealed she was thrilled at the arrival of her first great-grandson. During a Buckingham Palace reception for recipients of the Queen's Award for Enterprise Louise Butt, of Bath-based science marketing firm Select Science, said: She the Queen said she is thrilled and she said he is a big boy. She said the first born is very special. We agreed. The parents emerge from St Mary's with their newborn son ? In the hours before they left hospital William and Kate had received visits from their son's beaming grandparents - Michael and Carole Middleton and the Prince of Wales and Duchess of Cornwall. Asked how his first grandchild was, Charles replied: Marvellous, thank you very much, absolutely wonderful. A beaming Carole, who was the first to visit her daughter and William with her husband Michael, described her first cuddle with her grandson as amazing .