This afternoon the two Princes and the Duchess returned from private quarters where they stayed Monday & Tuesday evening, to spend the afternoon with other parents of babies about George?s age, 8 months. The function was a playdate for the young ones, but also an opportunity for William and Kate to learn about the Royal New Zealand Plunket Society, simply called Plunket by most. It is another busy day for the William Kate and their newborn baby. Before we get to the day?s activities, we want to share the baby?s name, it was released this afternoon. Quick notes on the significance of the names: Prince Harry also stopped in to meet his new nephew, and then the Duke and Duchess headed to Bucklebury with the newest royal.? They are going to be staying with Kate?s parents at the family?s home. There were celebrations in the village yesterday, as seen in a picture shared by Dan Cooper of Newbury Today, There are photos of Kate and William leaving the Palace, but I am not licensed to use them, the best can probably be seen here in the Daily Mail?s story. Kate wore a dress by British maternity brand S?raphine. She chose the Short Sleeve Knot Front Dress in Lavender. The dress is rayon with a touch of elastene for stretch. S?raphine?s description: You can better see the print design in these pictures. The frock retails at $85 in the US, ?50 in the UK. Kate was also wearing the Givenchy sunglasses we have seen previously. They are available at the Zappos US site $375 . Kate?s hair was up in a very simple ponytail; she looked happy and relaxed. The dress is a pretty design and seems ideal for a casual day in the car and at her parents. I wanted to address some of the emailed/tweeted questions regarding the Prince?s blankets. While this will not become What Prince Cambridge Wore, this is simply the fastest & easiest way for me to respond. I am beyond buried in work at my ?real job?. The white blanket used when the baby was brought out to meet the media is the Superfine Merino Wool Christening Shawl by G.H.Hurt and Son. More from Roya Nikkah of the Sunday Telegraph. This is a classic British brand, products are made in the company?s Nottingham factory. The company?s understated response to its sudden increase in popularity was appealing. The other blanket used is from the Aden and Anais Jungle Jam set of cotton muslin swaddles. The baby?s was the design on the very far left. And the car seat was a Britax B Safe. In terms of what?s next for the new family: A quick note on charitable endeavors. Yesterday we mentioned that William and Kate requested that anyone thinking about sending a gift instead make a donation to the Imperial College Healthcare Charity. It reminded me to mention we are approaching the last month of our Baby Cambridge Fundraiser, with all donations going to EACH East Anglia?s Children?s Hospices , one of Kate?s patronages. Your generosity has helped us generate $5819+ in donations, many, many thanks to everyone who has donated!? We are getting very close to our goal but still have a ways to go. Every little bit helps, if you are able to donate even $2, click here to visit our Just Giving page. Finally, there is a program airing tomorrow night about something we?re familiar with, often called the Kate effect. ?Kate?s Baby Bounce? airs on ITV?s ?Tonight? program at 7:30pm BST, it is hosted by Laura Kuenssberg, the network?s business editor. The show will look at how the Kate effect could impact the British baby industry, and also looks at Kate?s popularity in the US. And?. it?s possible someone you?re familiar with could be part of the broadcast?.as well as a few Kate fashion fans from the Michigan area. I know, I?m a terrible tease. For all of our friends who can see ITV, that is Thursday night at 7:30pm on the Tonight program. For those of us unable to see the show we will effort a link to online viewing or You Tube or whatnot.