Comments? 0 	 The royal baby has been named Prince George of Cambridge, it has been announced. A Kensington Palace spokesman said the Duke and Duchess of Cambridge are delighted to announce that they have named their son George Alexander Louis. The baby will be known as His Royal Highness Prince George of Cambridge. The royal couple are seen here visiting the Fort St George pub in Cambridge when they visited the city last year. George was the most popular name with the bookies with betting firms William Hill, Coral and Paddy Power all offering short odds on the moniker. There has only been one other Prince of Cambridge and he was also called George. The first Prince George of Cambridge was a grandson of George III and the only son of Prince Adolphus Frederick, the 1st Duke of Cambridge. Prince George of Cambridge was born in 1819 and refused to have an arranged marriage. He wed a commoner for love after falling for the actress Sarah Louisa Fairbrother, who was said to be a classic beauty and a graceful dancer. They married in 1847 when she was already the mother of two of his children and pregnant with his third. But the Duke did not seek the sovereign?s approval and the marriage was never recognised, hence his children were not eligible to inherit royal titles. Miss Fairbrother, who generated much scandal including having a portrait painted in which she showed off her bare legs, was ostracised by the royal family and never given a title. Instead, she became known by the nickname Mrs FitzGeorge and this surname was taken by George?s offspring. Despite his marriage, George had a wandering eye and soon after he wed he took up with mistress Louisa Beauclerk, who remained his lover for more than 30 years. He went on to become the 2nd Duke of Cambridge after his father?s death. The Duke was in the Army and served in the Crimean War. He was promoted to Commander-in-Chief in 1887 and an equestrian statue of him stands in the middle of London?s Whitehall. He was said to have been a disciplinarian, who believed Army promotions should be based on social connections rather than ability. He died in 1904. His father, the 1st Duke of Cambridge - who lived from 1774 to 1850 - was never a Prince of Cambridge, but was given the title the Duke of Cambridge by his father George III in 1801 when he was 27. The name George has come to represent the continuity of the monarchy and remained the bookmakers? favourite in the name-guessing stakes from the moment Kate?s pregnancy was announced. Six King Georges have worn the crown throughout history since the German-born George I, the first Hanoverian king of Great Britain, acceded to the throne in 1714. The first name of the last King George - George VI - was actually Albert and he was known to his family as ?Bertie?, but he selected George - his fourth name - to use as Sovereign. He was the much-loved father of the present Queen and the new Prince George of Cambridge?s great-great grandfather. George VI chose George in honour of his father George V and to create the impression of stability after the scandal caused by the abdication of his brother Edward VIII. George is also the fourth name of the Prince of Wales - the baby?s grandfather. Even Edward VIII had George among his seven names. The name means farmer or earth worker. It was the 12th most popular name for boys born in England and Wales in 2011. St George, a fourth-century Christian martyr, is the patron Saint of England and represents honour, bravery and gallantry. The legend of George slaying a dragon and rescuing an innocent maiden is medieval. The name Louis is likely to be a tribute to Lord Louis Mountbatten, the Duke of Edinburgh?s uncle and the last British Viceroy of India before independence in 1947. Mountbatten and William?s father the Prince of Wales were very close, with Charles confiding in his relative. He was known by the Royal Family as Uncle Dickie and was assassinated by the IRA in August 1979. His boat was blown up on a fishing trip off the coast of County Sligo, Republic of Ireland.