Kate Middleton and Prince William left St Mary's Hospital at 7:14 pm BST on July 23 with the royal baby boy in tow. The duchess arrived at the hospital early in the morning on July 22 through a secret entrance. She gave birth to the 8-pound, 6-ounce baby at 4:24 p.m that day, more than a week after his rumored due date. I'll remind him of his tardiness when he's a bit older, Prince William joked to the press waiting outside the hospital. Kate stood beside Will holding her newborn son while wearing a bespoke blue dress by British designer, Jenny Packham. Earlier this morning, it was reported that the duchess' hairdresser had slipped into the hospital, sparking rumors that she would be departing today. Kensington Palace also confirmed that the royal couple wouldn't be leaving until 6:00 pm local time at the earliest. During the brief hospital stay, Carole and Michael Middleton as well as Prince Charles and Camilla paid the new parents a visit. Baby Cambridge's grandfather, Prince Charles, told the press he and wife Camilla were overjoyed at the news of a healthy birth, and dignitaries around the world including President Obama have sent their congratulations. Prince William, Kate and the baby are said to be headed back to Kensington Palace. Follow our liveblog for all royal baby news! See more photos from the big day: Want more? Be sure to check out HuffPost Style on Twitter, Facebook, Tumblr, Pinterest and Instagram at @HuffPostStyle. Your sex life will never be the same. In my day. What, not breast-feeding? From diet tips to little baby, little problems, sleep-deprived and super-stressed new parents have heard it all. And they want you to stop it. As Britain's Prince William and his wife, Kate, move along on their parenting journey, it seems even the queen has had a what-not-to-say moment. According to a special edition of Us magazine on raising royals, she exclaimed soon after William's birth: Thank goodness he hasn't ears like his father! All of a sudden, there's a lot more interest in Carole Middleton, the Duchess of Cambridge's 58-year-old mom and the only biological grandmother of the littlest future king of England. With Kate and her mom extremely close, and the new parents both eager to live somewhat of a normal life, you can be sure Grannie Middleton will want to be very hands-on in her new royal role. Here's what you need to know about Carole. The Telegraph reports that the couple hasn't yet finished decorating a nursery because they are waiting for the completion of their new apartment within Kensington Palace. According to E! Online, this 20-room space, also known as Apartment 1A, will be ready for the growing family in August. Prior to the renovations, this vacant area was serving as an office and storage space. The royal baby is here! Now that we've seen him and his parents have said some sweet words about the birth, we're left wondering... what is his official title? Until Will and Kate choose a first name, the royal baby will officially be titled as HRH Prince of Cambridge. It makes sense, given that his father is titled Prince William, Duke of Cambridge and Kate is titled Catherine, Duchess of Cambridge. In fact, the royal baby's title will be the first time Prince of Cambridge has been used in 194 years! Find out more about his royal title here. Kate Middleton gave birth to a son on Monday afternoon, but the Duke and Duchess of Cambridge have not yet made their baby name choice public -- and if precedent is any indication, it could be a week or even a month before their selection is announced. On leaving the hospital with his wife and newborn on Tuesday, Prince William said the couple are still working on a name, assuring an eager public, We'll have that as soon as we can. In the meantime, the baby name frenzy, that's been brewing since Kate's pregnancy was announced, is at its peak. Find out which royal name is the favorite! Kate didn't fall down the steps while holding her son. I held my breath just in case. After all, she was wearing heels. Kate made absolutely no attempt to appear like anything other than a woman who has just given birth. Okay, her hair looked better than most new mothers, but Kate Middleton and Prince William left St Mary's Hospital at 7:14 pm BST on July 23 with the royal baby boy in tow. The duchess arrived at the hospital early in the morning on July 22 through a secret entrance. She gave birth to the 8-pound, 6-ounce baby at 4:24 p.m that day, more than a week after his rumored due date. I'll remind him of his tardiness when he's a bit older, Prince William joked to the press waiting outside the hospital. Kate stood beside Will holding her newborn son while wearing a bespoke blue dress by British designer, Jenny Packham. See photos here. Though he may never escape the glare of the limelight, we hope the newborn son of the Duke and Duchess of Cambridge will be comforted by his many blessings: a beautiful home, famous friends, thousands of adoring fans and? oh yes, a hefty billion dollar inheritance. Read more about it here.