Edward Snowden shifting his position to meet Russia's asylum conditions, Vladimir Putin says Posted July 16, 2013 09:56:13 Russian president Vladimir Putin says he believes US intelligence leaker Edward Snowden is shifting his position on his future political activity in a bid to comply with Moscow's asylum requirements. Snowden flew to Moscow's Sheremetyevo airport from Hong Kong last month, seeking protection after he divulged details of US government intelligence programs. Mr Putin had warned that if the former US spy agency contractor wanted to stay in Russia he would have to stop activity that hurt the US. He now says he has seen signs that Snowden is moving in that direction. As soon as there is an opportunity for him to move elsewhere, I hope he will do that, Mr Putin said during a visit to Gogland Island in the Gulf of Finland. The conditions for Russia granting him political asylum are known to him. And judging by his latest actions, he is shifting his position. But the situation has not been clarified yet. Snowden, 30, told human rights campaigners on Friday at a meeting in Sheremetyevo's transit area that he was seeking temporary asylum in Russia until he can travel safely to Latin America, where three countries have said they might take him in. He has been unable to reach any of those countries - Nicaragua, Venezuela or Bolivia - because there are no direct flights from Moscow and he would risk having his passage barred by the United States and its allies. The case is an increasingly awkward problem for Mr Putin as Moscow and Washington try to improve relations and he prepares for a summit with US president Barack Obama in Moscow in early September, just before a summit of G20 leaders in Russia. We have certain relations with the United States and we don't want you to damage our ties with your activity, Mr Putin said, referring to Snowden. Asked to comment on what comes next for Snowden, the Russian president, a former KGB spy, said: How do I know? It's his life, his fate. He went on to distance Russia from Snowden and his political activities. He came to our territory without invitation, we did not invite him. And we weren't his final destination. He was flying in transit to other states. But the moment he was in the air ... our American partners, in fact, blocked his further flight, Mr Putin said. They have spooked all the other countries, nobody wants to take him and in that way, in fact, they have themselves blocked him on our territory, he said. Washington has revoked Snowden's passport and wants him extradited to the United States to face espionage charges. 	Topics: 	 	world-politics, 	 	defence-and-national-security, 	 	crime, 	 	law-crime-and-justice, 	 	russian-federation, 	 	united-states