MOSCOW ? Senior Kremlin officials said Saturday that Russia?s Federal Migration Service had not yet received a formal appeal for asylum from Edward J. Snowden. And the Russian foreign minister, Sergey V. Lavrov, insisted that the government had had no contact with him ? a curious statement given the government?s clear role in arranging a meeting at Sheremetyevo airport here in Moscow on Friday between Mr. Snowden and lawyers and human rights advocates. At the meeting on Friday, Mr. Snowden, the former intelligence contractor who is on the run from American authorities and faces criminal charges of disclosing classified information, told the lawyers and rights advocates that he was requesting shelter in Russia because the United States and its allies were illegally preventing him from traveling to Latin America, where three countries have expressed a willingness to take him in. The verbal maneuvering seems to signal that Russia?s political position vis-?-vis Mr. Snowden has been complicated further by his now publicly professed desire to stay here. Although President Vladimir V. Putin has insisted that Mr. Snowden must stop harming American interests, the Obama administration has made clear that it believes those interests are being harmed so long as Mr. Snowden is on the loose. Mr. Snowden on Friday appealed to the human rights advocates to intervene on his behalf with the Russian government, though it is unclear how influential they can be, given that at least two of the groups represented ? Amnesty International and Human Rights Watch ? have had their Moscow offices raided by the authorities in recent months, and some of their local representatives have faced personal threats apparently aimed at curtailing their work. ?I ask for your assistance in requesting guarantees of safe passage from the relevant nations in securing my travel to Latin America, as well as requesting asylum in Russia until such time as these states accede to law and my legal travel is permitted,? Mr. Snowden said Friday in his remarks, according to a text released by WikiLeaks, the antisecrecy group that is helping him. ?I will be submitting my request to Russia today, and hope it will be accepted favorably,? he said. On Saturday, however, the director of Russia?s Federal Migration Service, Konstantin Romodanovsky, told the Interfax news agency that no request had been received. ?At the present time, there have been no applications from Snowden,? he said. ?If we receive an application, it will be considered in due process of law.? Mr. Lavrov, who was in Cholpon-Ata, Kyrgyzstan, for a meeting of the Shanghai Cooperation Organization, told reporters, ?To be granted political asylum, Russian law presumes a certain procedure, and the first step is the filing of an application with the Federal Migration Service.? Mr. Lavrov added, ?We have no contacts with Snowden,? and said the issues raised by Mr. Snowden during the meeting at the airport were ?extensively covered by the media, and I learned about them just as anybody else.? Since Mr. Snowden?s arrival in Moscow from Hong Kong on June 23, apparently with advance clearance from the Kremlin, Russian officials have engaged in an elaborate theatrical exercise, at times insisting that they are following all legal technicalities while simultaneously making clear that he is under official protection. There is nothing remotely normal about his situation ? a purgatory in the airport transit zone with no clear end in sight. Mr. Putin most recently had seemed to urge Mr. Snowden to stop releasing information about the classified American surveillance programs. ?He must stop his work aimed at harming our American partners, as strange as that sounds coming from my lips,? he said ? a condition that the presidential spokesman Dmitri S. Peskov reiterated on Friday and that Mr. Snowden appeared willing to accept. But Mr. Putin had also indicated some desire to be rid of Mr. Snowden, calling him a free man and saying, ?The sooner he chooses his final destination, the better it will be both for us and for him.? Mr. Lavrov?s assertion that the government has not had contact with Mr. Snowden was notable given that numerous government agencies appeared to have had a role in Friday?s meeting, including the Federal Customs Service and the airport administration. Several of the participants in the meeting are also close to the Kremlin, including Russia?s human rights ombudsman, Vladimir P. Lukin, and Vyacheslav A. Nikonov, a member of the Duma, the lower house of Parliament. People invited to attend the meeting received instructions from airport management, and reaching the transit zone required special passes to get through the customs control zone. At one point, a bus brought the lawyers and rights advocates from one part of the terminal to another, and several said they met Mr. Snowden in a room with a door marked ?Staff Only.? Mr. Snowden, in the meeting, said that the official offer of asylum that he had received from Venezuela should be regarded as giving him clear protection under international law and that he should be permitted to travel. He accused the United States and its allies of acting illegally in blocking him from traveling there. The Russian government has itself shown little regard for the international asylum process when it has pursued fugitives abroad. In a case last fall, a political opposition leader wanted by the Russian authorities who fled to Kiev and requested asylum was kidnapped when he stepped outside of his lawyer?s office for lunch. He was put in a van by masked men and driven back to Moscow, where federal officials insisted he had surrendered.