The Russian President claims the former CIA computer technician turned down an offer of asylum contingent on him leaking no further classified information Oscar Quine is a writer, reporter and editorial assistant across The Independent titles NSA whistleblower Edward Snowden, who leaked information revealing the extent to which the US government monitored private individuals, has applied for temporary asylum in Russia, according to his lawyer. The former computer technician for the CIA and US National Security Agency has reportedly been living in the transit zone of Moscow's Sheremetyevo airport for the past three weeks and has so far been unsuccessful in applications for asylum. He is wanted by the US to face criminal charges related to his leaking of classified information revealing the country's wide-reaching internet surveillance program. On Friday, he said he was in the process of applying for temporary asylum in Russia, with the ultimate aim of seeking refuge in South America. President Obama has been in talks with Russian President Vladimir Putin to try to prevent Russia from granting Snowden asylum, while also putting pressure on countries such as Venezuela and Nicaragua to not take him in. Speaking to students, Putin said that the United States was effectively to blame for trapping Snowden in Russia by intimidating other countries who may have granted him asylum. ?He arrived on our territory without an invitation,? Putin said. ?He didn?t fly to us; he flew in transit to other countries. But only when it became known that he was in the air, our American partners, in fact, blocked him from flying further. ?They themselves scared all other countries; no one wants to take him, and in this way they themselves in fact blocked him on our territory.? Putin made the comments while on a visit to Hogland Island in the Gulf of Finland to review projects being carried out by the Russian Geographical Society. He claimed that Russia had invited Snowden to apply for asylum on the condition that he stop his political activities, presumed to mean the leaking of classified information taken from the United States. ?Initially, we offered him, ?If you want to stay, please, but you have to stop your political activities. We have a certain relationship with the US, and we don?t want you with your political activities damaging our relationship with the US? ?He said ?No, I want to continue my work. I want to fight for human rights. I believe that the United States violated certain norms of international law, interfered with private life.? Wikileaks, the whistleblowing website which has been supporting Snowden confirmed the news on Twitter, posting: Edward Snowden today has filed for a temporary protection visa with Russia's ministry of immigration. The application will be seen as a PR coup for Russia which, despite Putin's show of support, still has a frosty relationship with the US.