None of the below is to comment on whether Putin?s rule is democratic or his refusal is the correct course of action from either a moral, ethical, or practical point of view. Rather, it is to say that Western actions of the past have mattered greatly in Russian-Western relations, ?and secondly that Russia remains a great power with its own interests which are increasingly defined by an antagonism towards the West??in significant part created by Western actions. Similar Russians of questionable repute have received refuge in other Western countries, including the U.S. ?During the 1990s, Boris Berezovskii was regarded throughout the West as a mafia-like Russian criminal, who at a minimum was a mastermind of criminal activity in the new Russia, and at a maximum was the originator of numerous murders in Moscow. Upon Vladimir Putin becoming president, Berezovskii turned against him??and the U.S. and the West at that time began to tout Berezovskii as a paragon of democracy of sorts. The latter exiled himself to the UK for asylum when it became obvious that he would have to stand trial in Russia. Berezovskii carried out a long and publicized campaign to smear and remove Putin from his presidential role.? Berezovskii's recent dismal suicide in a London hotel after requesting Putin?s forgiveness and permission to return home was a disastrous final outcome for the alienated likes of ?Boris the democrat? in the West. His suicide probably was related to the ?British Justice?s crumbling case against Russia for the strange poisoning of Aleksandr Litvinenko which was championed by the British government and Western media. Litvinenko's death probably had more to do with Berezovskii, Litvinenko, and Akhmed Zakaev's running weapons and polonium to the Caucasus Emirate jihadists and/or their Al Qa`ida or other jihadi allies. Zakaev is a known radical nationalist guerrilla who fought against Russian forces in the first post-Soviet Chechen war. ?He was wounded in the second Chechen war and then fled to Britain for safe haven. Russian prosecutors say he was involved in the Al Qa`ida-Chechen hostage-taking industry aided and abetted by criminals and other unsavory elements. However, Zakaev?s checkered history did not stop with the end of the conventional phase of the second war waged by the ?Chechen Republic of Ichkeriya? ChRI . Next, the Chechens went underground and came under even greater influence from Chechnya jihadists, AQ and other North Caucasus republics??and Zakaev went with them. As the jihadists? gained the upper hand, Zakaev refused to break with them. Personal ambition to maintain some foothold in the resistance back home held sway over the ChRI?s connections with the perpetrators of horrific October 2002 Dubrovka theatre hostage-taking in Moscow, the August 2004 twin passenger plane hijacking and explosions over Moscow, and the September 2004 Beslan school massacre in North Ossetia??along with hundreds of other attacks on Russian soil between 2001-2007. Zakaev maintained official positions within the ChRI leadership while living in London throughout all of these events. Only in late 2007 did Zakaev and the ChRI part ways at the latter?s initiative after it finally rebranded itself the ?Caucasus Emirate? CE to reflect the reality of its jihadist orientation. Moreover, when the Chechen network briefly split in 2010, Zakaev came out and declared his allegiance to the breakaway wing, even though the latter explicitly stated that they had broken with CE amir Doku Umarov because of his bad leadership not because they rejected global jihadism . Zakaev also acknowledged that he had maintained contact with the CE?s Chechen network and maintained fighters attached to them who were attacking Russians in the North Caucasus. Since the CE split was patched up in July 2011 and Umarov 2010 and the CE 2011 were included finally on the U.S. State Department?s list of international terrorist organizations, Zakaev has quieted down but even now is still enjoying living out his life in London. ?The U.S. also has harbored radical Chechen nationalists who took up arms against Russia in the 1990s and early 2000s. So when U.S. analysts write that the matter is simple; Snowden broke U.S. laws and the U.S. returns Russia's criminals, so should Russia return Snowden, ?readers have not been told the whole story. One writer claimed: ?The Snowden case should be relatively straightforward. He has violated the laws of the U.S. His passport has been cancelled, and he cannot legally leave the transit area of Moscow?s Sheremetyevo Airport. The U.S. has asked for his return. In the last five years, the U.S. has returned 1,700 Russian citizens says journalist Satter, in ?So Much for the Reset,? New York Post, 29 June 2013. Of course, there are those who are worse than others ? such as terrorists fighting along with AQ operatives in the North Caucasus. Russians have long memories and do not easily let bygones be bygones. So when Mr. Snowden flew from Hong Kong, Moscow saw an opportunity to return past Western ?favors?, tweak Uncle Sam?s nose, and perhaps even gain some added intelligence. Snowden probably has nothing of much interest for Russian intelligence, but the dalliance is sweet revenge for recent revelations about US intelligence listening in on then President Dmitrii Medvedev?s phone at the G-8. And so it goes; beginning in the 1990s with the mistaken U.S. support for NATO expansion toward Russia's borders, continued attempted NATO expansion up to recently, remaining efforts to place missile defense near Russia's borders, harboring Russian terrorists and criminals and providing refugee status, in addition to other mistaken Western policies. ?Unfortunately, the overall trajectory of Russian-American relations has been one of steady decline.?These facts played no small role in the formation of what Satter and others invoke as ?the nature of the Russian system and the psychology of the Russian leaders? Satter, ?So Much for the Reset? . The result from now on will be an increasingly distrustful, anti-Western, and anti-democratic Russia, with all the ensuing consequences regarding non-proliferation and the struggle of the West against the rising tide of global Islamism and its violent companion ? global jihadism.