SOURCE: AP/Evan Vucci President Barack Obama meets with Russian President Vladimir Putin on June 17, days before American analyst-turned-leaker Edward Snowden applied for political asylum to remain in Russia. By Cory Welt | July 17, 2013 The curious case of Edward Snowden?s stay in the Sheremetyevo airport transit zone in Russia has highlighted both the promise of U.S.-Russian security relations and their limitations. Whether the issue is extraditing Snowden, or tackling more significant concerns such as political transition in Syria or nuclear arms reductions, Russian cooperation would be of great benefit to the United States in matters of national and international security. But there is only so much the United States can do to turn the potential for Russian cooperation into practice. Russian authorities often have interests that militate against cooperation, interests that the United States is unwilling or unable to counter. At the same time, the United States needs to keep the significance of Russian intransigence in perspective. While security cooperation with Russia can be valuable, limits to this cooperation are not an overriding obstacle to achieving U.S. objectives; the challenges lie at least as much in the implementation of our own policies. As importantly, efforts to overcome the limits of Russian cooperation need not come at the expense of other aspects of U.S. policy toward Russia. Edward Snowden is wanted on U.S. federal charges of espionage and theft of government property, but he remains in limbo in a Russian airport. As this story has played out over the past few weeks, one question has dominated U.S.-Russian relations: Will Russia respond positively to the U.S. request to extradite Snowden, or will they grant him asylum? In an initial television interview, U.S. Secretary of State John Kerry expressed the administration?s hope that the Russians would ?understand this should not be taken lightly? and ?do the right thing.? He said the extradition request was a reasonable one coming from a ?partner nation? working with Russia in other security and law enforcement matters. At the same time, increased domestic discontent with Russia?s authoritarian governing system has suggested that the Kremlin might be wary of championing the cause of a government whistleblower, potentially encouraging copycat activity at home. Russian President Vladimir Putin, however, quickly dispelled any notion that Russia would deliver Snowden to the United States, stating that the American citizen could remain in transit until he was able to arrange transportation elsewhere. Yet in a nod to Russia?s interest in seeming to be cooperative, Putin downplayed this decision. He expressed hope that it would ?not in any way affect our normal business relations with the United States.? He later stated that Snowden should ?stop his work aimed at harming our American partners? if he wanted to stay in Russia. Snowden withdrew his asylum application to Russia the next day, although he has since requested ?temporary? asylum given the trouble with arranging safe passage to a third country. The timing of the Snowden affair helps explain Russia?s relatively subdued reaction to Snowden?s asylum case. U.S.-Russian relations hit their lowest point since the August 2008 Russia-Georgia war last winter, when the United States imposed human rights sanctions against Russian officials and Moscow began eliminating a variety of government and civil society linkages to the United States. Since then, relations have been on a mild upswing, reflected in the wide-reaching agenda of President Obama?s two-hour meeting with Putin at the G-8 summit on June 17. The two governments announced new mechanisms for ?enhanced? high-level engagement, a bilateral summit in September, an economic dialogue between Vice President Joe Biden and Russian Prime Minister Dmitry Medvedev, and three new cooperative agreements on nuclear nonproliferation, counterterrorism, and cybersecurity confidence-building measures. With U.S.-Russian relations having returned to a more cooperative mode, Moscow does not see fit to openly trumpet the Snowden affair as an anti-American triumph. Still, Russian authorities have countervailing interests that dictate against extraditing Snowden. They do not wish to appear subservient to Washington in front of domestic or international audiences. They also cannot pass up the opportunity to give the United States?which considers itself a protector of human rights in Russia?a dose of its own medicine. The Obama administration has taken the Russian response in stride, with the president observing that it is not worth it ?to start doing wheeling and dealing and trading on a whole host of other issues simply to get [Snowden] extradited.?The administration?s response reflects two aspects of U.S.-Russian relations beyond the Snowden affair. First, there are limits to the United States? ability to persuade the Russian government to cooperate on all issues. Neither requests, nor deals, nor pleas, nor appeals to interests, reciprocity, or partnership?let alone threats?can guarantee Russian cooperation. Second, Russia?s stance is not the only barrier. In the case of the Snowden affair, Hong Kong also refused to extradite Snowden, there has been far greater tolerance internationally?and even among the U.S. public?toward Snowden, and Amnesty International even called on governments around the world to reject the extradition requests. At the same time, there has been increasingly less tolerance toward the U.S. government?s own actions, reflected by angry European reactions to alleged National Security Agency, or NSA, spying of European Union offices. Ending Syria?s civil war This same dynamic is on display in the efforts to end Syria?s civil war. At the start of the Syria crisis, Russia could have contributed to a resolution if it had voted for U.N. Security Council sanctions against Syrian President Bashar al-Assad?s regime. Even now, it would be helpful if Russia were to openly turn its back on Assad and work alongside the United States and other nations to achieve a transition away from the regime. But Moscow refuses to do so for a variety of reasons, including its aversion to Western-sanctioned overthrows of authoritarian leaders and the conviction that what would follow would be at least as bad as what came before, and likely worse. Russia?s obstinacy is a source of frustration for the United States and other nations that support a transition away from the Assad regime. But the Obama administration has not treated it as an insurmountable obstacle to achieving political transition. In May the administration acknowledged Russia?s refusal to adopt an openly anti-Assad position and agreed to renew a diplomatic effort to end the conflict by convening a conference, ?Geneva II,? bringing together representatives of the regime and opposition forces to negotiate the establishment of a transitional governing body. As Deputy National Security Advisor Ben Rhodes explained in a press briefing after the Obama-Putin meeting: Others have lent their support to a political process. In an op-ed, former NATO Secretaries General Javier Solana and Jaap de Hoop Scheffer called Geneva II ?the best?and perhaps the only?chance of averting even greater suffering, radicalization and regional implosion.? The fighting in Syria has drawn in Iranian, Hezbollah, and Al Qaeda-linked fighters; it has led to a massive refugee crisis; and the United States and others have determined that the Assad regime has used chemical weapons against its own people. As a result, many are skeptical that Geneva II will ever be convened, let alone achieve positive results. The responsibility for producing a political solution, however, is not Russia?s alone. In fact, Moscow claims representatives of the regime have agreed to participate in the conference. This may or may not be true, but the claim remains untested. While the Obama administration and other supporters of the opposition are in favor of Geneva II, they have not exactly twisted the arms of opposition forces to participate. They have instead promised increased weapons shipments and agreed that the transitional government will exclude not only Assad but all ?central? members of his regime. These might be viewed as incentives to get opposition forces to come to the negotiating table, but they appear to have had the opposite effect, helping to persuade them to hold out in the hopes of getting enough military and diplomatic support to change the balance of power on the ground. Last week, the new president of the opposition Syrian National Coalition, Ahmad Jarba, said that the coalition would not participate in Geneva II unless opposition fighters strengthen their military position. The Obama administration moved on to a ?Plan B? in the face of limits to Russian cooperation on Syria. But it has yet to do so in the sphere of nuclear arms reductions. In a June 19 speech in Berlin, President Obama announced new presidential guidance on U.S. nuclear employment strategy, saying ?we can ensure the security of the United States and our allies and partners and maintain a strong and credible strategic deterrent? while reducing deployed strategic nuclear weapons by up to one-third from New START Treaty levels. A Department of Defense, or DOD, report to Congress on the strategy, however, repeats the finding of the DOD?s 2010 Nuclear Posture Review that ?large disparities in nuclear capabilities ? may not be conducive to maintaining a stable, long-term strategic relationship, especially as nuclear forces are significantly reduced.? Cooperating with Russia on nuclear arms reductions accordingly remains a priority in the new strategy. The president announced in Berlin the administration?s intent ?to seek negotiated cuts with Russia,? as well as to ?work with our NATO allies to seek bold reductions in U.S. and Russian tactical weapons in Europe.? There is just one problem: The Russian government is not interested in pursuing another round of nuclear arms control talks at this time. They have linked further arms reductions to, among other things, U.S.-Russian agreement on missile defense. The Obama administration has worked to persuade the Russians of the long-term technical limitations of missile defense, offered to reinforce these with a political commitment not to target Russian missiles, and proposed a slew of new transparency measures. Russian authorities have rejected all of this, insisting that new talks would require, at a minimum, a new anti-ballistic missile treaty that imposes limits on missile defenses?a nonstarter in Washington. It is becoming increasingly difficult to make the case that this is merely an opening gambit in negotiations. In recent remarks to domestic audiences, President Putin and other officials have acknowledged Russia?s inability to prevent the United States and NATO from moving forward with missile defense. This has not led them to embrace arms control, however. They have instead emphasized the importance of developing missile defense countermeasures and sustaining and modernizing Russia?s nuclear arsenal. The Obama administration still hopes to persuade Russia to agree to a new round of arms reductions. If it cannot, it will have to consider the alternative of unilateral reductions. Whether or not Russia reciprocates should be irrelevant. The new presidential guidance does not state that the United States can safely reduce the number of its deployed nuclear weapons only if Russia does so as well?although it acknowledges that ?large disparities in ? capabilities? may be problematic. In any case, if the United States were to unilaterally draw down its arsenal, financially strapped Russia might very well follow suit. But contemplating a unilateral reduction makes clear that the limits to Russian cooperation in this sphere are not the main challenge. The administration does not need congressional approval to unilaterally reduce the U.S. nuclear arsenal. It would, however, still have to deal with the potential political fallout of slashing the arsenal at a time when Iran and North Korea show no sign of slowing down efforts to become nuclear-weapon states, when the scope of China?s nuclear ambitions remains unclear, and when the specter of nuclear weapons falling into the hands of extremist governments in South and Central Asia still provokes great concern. Twenty-four Republican senators have already sent a letter to Secretary Kerry expressing firm opposition to unilateral reductions. Even if Russia were to agree to a new round of arms talks, such political opposition would remain. The fate of a new?or amended?treaty would be even less certain than that of the New START treaty, which the Senate only ratified after a bruising fight. And if the administration sought to avoid a ratification battle by pursuing reductions with the Russians outside of a treaty framework, those opposed to further arms reductions would still view the process as illegitimate. In the Snowden affair, as on other issues such as Syria and nuclear arms reductions, greater Russian cooperation could help the United States achieve some of its national and international security objectives. At the same time, limits to the willingness of Russian authorities to cooperate with the United States are not an overriding obstacle to achieving these objectives. Achieving a political transition in Syria requires a coordinated strategy that can successfully bring opposition forces to the negotiating table, regardless of whether or not Russia commits itself in advance to a full transition away from the Assad regime. Achieving further nuclear arms reductions requires convincing domestic skeptics that further cuts are the right way forward, whether or not Russia is on board. Limits to Russian security cooperation with the United States should therefore not be cause for consternation. The United States should continue to work with Russia where possible and not treat Moscow?s refusal to cooperate across the board as an indication of a nonfunctional relationship. As importantly, the United States also need not unduly prioritize efforts to overcome the limits of Russian cooperation at the expense of other aspects of U.S. policy toward Russia. In the end, a real U.S.-Russian partnership depends not only on the success of our security cooperation but also our cultivation of civil society and business relations, as well as on the freedoms and quality of governance needed to sustain them. Cory Welt is an Adjunct Fellow at the Center for American Progress and associate director and research professor at the Institute for European, Russian and Eurasian Studies of the George Washington University?s Elliott School of International Affairs.