FILE - In this image provided by Human Rights Watch, NSA leaker Edward Snowden, center, attends a news conference at Moscow's Sheremetyevo Airport with Sarah Harrison of WikiLeaks, left, Friday, July 12, 2013. Russian state news agency said Wednesday, July 24, 2013 that US leaker Edward Snowden has been granted a document that allows him to leave the transit zone of a Moscow airport and enter Russia. Snowden has applied for temporary asylum in Rusia last week after his attempts to leave the airport were thwarted. The United States wants him sent home to face prosecution for espionage. AP Photo/Human Rights Watch, Tanya Lokshina MOSCOW AP ? Edward Snowden emerged from weeks of hiding in a Moscow airport Friday, still defiant but willing to stop leaking secrets about U.S. surveillance programs if Russia will give him asylum until he can move on to Latin America. Snowden's meeting with Russian officials and rights activists cleared up uncertainty about where the former National Security Agency systems analyst is, but left open the big question: What comes next? Snowden said he was ready to meet President Vladimir Putin's condition that he stop leaking secrets if it means Russia would give him shelter that could eventually help him get to Latin America. There was no immediate response from Putin's office, but speakers of both houses of the Kremlin-controlled parliament spoke in support of Snowden's plea. Vyacheslav Nikonov, a senior lawmaker with the main Kremlin party, described Snowden as a bit nervous but smiling and noted his perfect haircut. He said that when asked to describe his stay at Moscow's Sheremetyevo airport, Snowden answered with one word: Safe. Snowden is believed to have been stuck in the airport's transit zone since his arrival on June 23 from Hong Kong, where he had gone before his revelations were made public. He booked a seat on a Cuba-bound flight the next day, but did not get on the plane and had remained out of the public eye until Friday. Putin has said Snowden stayed in the transit zone and thus technically didn't cross the Russian border. He also insisted that Russian special services haven't contacted the NSA leaker ? a claim that drew skeptical winks from some security analysts who noted that Russian intelligence agencies would be all too eager to learn the secrets in his possession. Sergei Nikitin of Amnesty International's Moscow office said that plainclothes men who looked like officers of Russian special services attended the meeting, which was held in a cordoned section of a corridor. The exact location was unclear as hundreds of journalists were left in a hallway outside the meeting area, behind a gray door marked staff only. Nikitin said participants were asked not to take photos and video. Snowden himself requested that, saying his pictures would give too much information to the U.S. special services, Nikitin said. Human Rights Watch's Tanya Lokshina posted a photo of Snowden at the gathering on her Facebook page, the first new image of him since the Guardian newspaper broke the story of widespread U.S. Internet surveillance based on his leaks. A brief video of the meeting's opening also appeared on the Russian news site Life News, showing Snowden speaking, then being interrupted by a flight announcement on the airport's public address system. I've heard that a lot in the past weeks, Snowden said, smiling ironically. In an opening statement released by the secret-spilling group WikiLeaks that adopted his case, Snowden said he wanted to accept all asylum offers and travel to the countries that have made them to extend my personal thanks to their people and leaders. He also denounced the United States for what he said was pressuring its allies to block him from their airspace. Snowden could be hoping that Washington would not risk trying to block a flight he was on if he had Russian asylum. In the short term, he could also be seeking asylum in Russia simply as a way to get out of the airport and move freely. Snowden made an initial bid for Russian asylum, but Putin said he would have to agree to stop leaking secrets before the request would be considered. Snowden then withdrew his bid. Venezuela, Bolivia and Nicaragua recently have offered Snowden asylum, but it is unclear if he could fly to any of those countries from Moscow without passing through the airspace of the United States or its allies. Some European countries reportedly refused to allow Bolivia's President Evo Morales to fly through their airspace on his way home from Moscow last week because of suspicions that Snowden was on his plane. I ask for your assistance in requesting guarantees of safe passage from the relevant nations in securing my travel to Latin America, as well as requesting asylum in Russia until such time as these states accede to law and my legal travel is permitted, Snowden said in his statement. Snowden also defended his leaks, saying the massive, pervasive U.S. surveillance he disclosed violated the U.S. constitution and many statutes and treaties. He shrugged off the Obama administration's argument that the surveillance was permitted by secret court rulings, saying the immoral cannot be made moral through the use of secret law. He told meeting participants that he already has accomplished what he intended and thus sees no problem in agreeing to Putin's condition that he stop leaking. He said he hasn't damaged U.S. interests in the past, that the media frenzy wasn't his fault and that he has no intention to damage the U.S. government interests as he considers himself an American patriot, Nikonov told reporters. Glenn Greenwald, the Guardian journalist who closely communicated with Snowden, has suggested the media organizations involved already had all the material Snowden wanted to make public. Greenwald indicated it was up to the newspapers what to publish and when. Nikonov said that he expects the Kremlin to offer asylum to Snowden, and speakers of both houses of the Russian parliament, Sergei Naryshkin and Valentina Matviyenko, also quickly spoke in support of his plea. While granting asylum to Snowden would further damage U.S.-Russian ties already strained by U.S. criticism of Putin's crackdown on the country's opposition and differences over Syria, such a move could allow Putin to portray Russia as a principled defender of human rights and openness, even though it allows its security agencies to monitor the Internet. Some said the Kremlin may not be too concerned about upsetting Washington because relations are already at a freezing point. We may expect a new surge of anti-Russian campaigning in the U.S., but such surges have occurred regularly even without Snowden, said Alexei Pushkov, the Kremlin-connected chief of the foreign affairs committee in the lower house of parliament. So there will be no dramatic change in the situation. Putin's spokesman, Dmitry Peskov, said Russia has yet to receive a new asylum request from Snowden and that Putin would continue to demand that Snowden stop leaking information. It was unclear how long a decision could take. Anatoly Kucherena, a member of a Kremlin advisory body who attended the meeting, said it could take two to three weeks. But Putin's imprimatur could accelerate the process, as it did when French actor Gerard Depardieu was granted Russian citizenship in a matter of a few days. Snowden got support from the top U.N. human rights official who urged nations to offer him the same international rights that all asylum seekers are due. U.N. High Commissioner for Human Rights Navi Pillay said all nations must respect the internationally guaranteed right to seek asylum and also are obliged to make any such determination in accordance with their international legal obligations. Pillay said in a statement that nations must respect the right to privacy and protect individuals like Snowden who reveal alleged large-scale surveillance programs. She said the case raises concerns that surveillance without adequate safeguards to protect the right to privacy may infringe on basic rights such as freedom of expression. In Washington, U.S. State Department spokeswoman Jen Psaki said the U.S. was disappointed' that Russia helped to facilitate what she termed a propaganda platform for Snowden. We are disappointed that Russian officials and agencies facilitated this meeting today by allowing these activists and representatives into the Moscow airport's transit zone to meet with Mr. Snowden despite the government's declarations of Russia's neutrality with respect to Mr. Snowden, Psaki said at a briefing. She added that we still believe that Russia has the opportunity to do the right thing and facilitate his return to the United States. Although Friday's meeting left Snowden's fate still uncertain, it at least confirmed where he was; speculation had swirled that he had been spirited out of the country. We found for ourselves that he is real, he's no phantom, said Genry Reznik, a lawyer who participated in the meeting. Jim Heintz and Nataliya Vasilyeva in Moscow, Deb Riechmann in Washington and John Heilprin in Geneva contributed to this report.