Edward Snowden 'trapped in Russia by US', says Vladimir Putin - Trunews: Trunews: 		 			 			 							 			 						 							 					 	 	 	 		 			 				HOME RADIO LISTEN NOW 	RADIO AFFILIATES ABOUT HISTORY 	RICK WILES 	MISSION 	BELIEFS PRAYER CONTACT CAREERS SUPPORT DONATE 	MY DONATIONS 	GIVE STOCKS 	BEQUESTS 	PRECIOUS METALS 			 			 				 				HOME RADIO LISTEN NOW 	RADIO AFFILIATES ABOUT HISTORY 	RICK WILES 	MISSION 	BELIEFS PRAYER CONTACT CAREERS SUPPORT DONATE 	MY DONATIONS 	GIVE STOCKS 	BEQUESTS 	PRECIOUS METALS 			 		 	 	 				 			 				 					 						 														 													 						 							 Follow @trunews 						 					 				 				 					 						TOP NEWS 						Western nations want to chain ?the Russian bear? 														U.S. Weighs Response to Sony Cyberattack, With North Korea Confrontation Possible 														Evidence in Sony hack attack suggests possible involvement by Iran, China or Russia, intel source says 														North Korea Planned Attacks on US Nuclear Plants 														High-level British paedophile ring may be linked to murders, boy?s disappearance 35 years ago 														China Tests ICBM With Multiple Warheads 														Iran to hold major naval drills at end of December 													 					 						 							 														 																					 							 								 									 										 										 								 							 						 				 	 				 			Home ? > ? International ? > ? Edward Snowden ?trapped in Russia by US?, says Vladimir Putin 		 		Edward Snowden ?trapped in Russia by US?, says Vladimir Putin 		 			 				By Trunews Admin on July 16, 2013			 		 		 			 					 				 				 					Tweet 				 				 					Pin It 				 				 				 			 		 			 				 			 			 				Tweet 			 			 				Pin It 			 			 				 				 			 		 		 											 					 										 	 	 	 	 	 	 Vladimir Putin accused the United States of trapping intelligence whistleblower Edward Snowden in Russia yesterday [MON] and ?spooking? other countries who wanted to give him refuge. Asked about the future of the American, who has reportedly been living in the transit zone of Moscow?s Sheremetyevo airport for the last three weeks, the Russian president said: ?How do I know? It?s his life, his fate.? Mr Putin added: ?He came to our territory without invitation, we did not invite him. And we weren?t his final destination. He was flying in transit to other states. But the moment he was in the air ? our American partners, in fact, blocked his further flight. ?They have spooked all the other countries, nobody wants to take him and in that way, in fact, they have themselves blocked him on our territory.? Mr Snowden, 30, a former computer technician for the CIA and the US National Security Agency, flew in to Sheremetyevo from Hong Kong after leaking details of US surveillance. On Friday, he said he was applying for temporary asylum in Russia, with the eventual aim of seeking refuge from US espionage charges in South America. Read full article 				Edward Snowden NSA spying Vladimir Putin			 						 			 	Related Posts 			 		 										 										 						Assad: Russia creating multi-polar world 					 				 				 					Assad: Russia creating multi-polar world 				 			 		 			 		 										 										 						?Crimea is ours, and that?s that?: Russia pulls back battalion from Ukraine border 					 				 				 					?Crimea is ours, and that?s that?: Russia pulls back battalion from Ukraine border 				 			 		 			 		 										 										 						World War? 					 				 				 					World War? 				 			 		 			 		 										 										 						Vladimir Putin signs treaty for Russia to take Crimea from Ukraine 					 				 				 					Vladimir Putin signs treaty for Russia to take Crimea from Ukraine 				 			 		 			 			 	 	 			 	 		 	 		Latest 			Popular 			 			 		 			 										 						 					 					 						Western nations want to chain ?the Russian bear? 						Western nations want to chain ?the Russian bear,? pull... 						 							Posted 7 hours ago 								0 							 					 									 								 										 						 					 					 						U.S. Weighs Response to Sony Cyberattack, With North Korea Confrontation Possible 						A White House official said on Thursday that the... 						 							Posted 7 hours ago 								0 							 					 									 								 										 						 					 					 						Evidence in Sony hack attack suggests possible involvement by Iran, China or Russia, intel source says 						The U.S. investigation into the recent hacking attack at... 						 							Posted 7 hours ago 								0 							 					 									 							 		 						 										 						 					 					 						TRUNEWS Exclusive: Pope Francis Meets Evangelical Delegation 						By Rick Wiles | June 27, 2014 Two prominent... 						 							Posted 6 months ago 								1,106 							 					 									 								 										 						 					 					 						Wednesday, May 21, 2014 ? Bishop Anthony Palmer 						Topic :?Today?s guest is Evangelical Episcopal Bishop Anthony Palmer.... 						 							Posted 7 months ago 								551 							 					 									 								 										 						 					 					 						U.S. anti-gay activist Peter LaBarbera arrested in Regina 						U.S. anti-gay activist Peter LaBarbera and a Saskatchewan man... 						 							Posted 8 months ago 								301 							 					 									 							 		 				 						 							 						 						caliwebman says: Abby, do you not agree that each of us are fr... 						 					 				 					 						 							 						 						caliwebman says: lol! thanks, i think!?!?! : ... 						 					 				 					 						 							 						 						John B says: Tt is you my friend who has a 'version' of ch... 						 					 								 	 		 	 			 		 	 	 		 			Tags 				 				Barack Obama NSA spying Syrian war Russia Israel China Edward Snowden Iran ObamaCare TN Archive japan build up to world war 3 united nations homosexual agenda UK-Great Britain Chemical Weapons bashar al assad christian persecution al qaeda North Korea Vladimir Putin Germany nuclear weapons gay marriage				 		 ARCHIVES 		 Subscribe To RSS News Feed Receive Trunews on Twitter 			Follow Trunews on Twitter for the latest news, show updates, and commentary. @TrunewsRadio 		 		 		 	 	 		 			 				HOME BREAKING NEWS ABOUT LISTEN NOW RADIO AFFILIATES ARCHIVES SIGN UP PRAYER SUPPORT CONTACT CAREERS 			 			 				 			 			 				? 1999-2013 TRUNEWS?.com - All rights reserved. -