NSA leaker & former CIA employee Edward Snowden has asked for political asylum in Russia, saying he could not fly to Latin America, according to human rights activists who met the whistleblower at Moscow's Sheremetyevo airport. According to Tatyana Lokshina of Human Rights Watch, Snowden seeks to stay in Russia as he ?can?t fly to Latin America yet.??? When asked if the NSA leaker has any more revelations, Lokshina responded: ?He says that his job is done.? Snowden asked the human rights activists to petition the US and European states not to interfere with his asylum process, she said. The former NSA contractor also asked to intervene with President Putin on his behalf, Lokshina added. Snowden said he is ready to ask Russia for political asylum and that he ?does not intend to harm the US,? according to Russian State Duma MP Vyacheslav Nikonov. ?No actions I take or plan are meant to harm the US... I want the US to succeed,? Snowden said.? ? Rundschau @Rundschau July 12, 2013 Snowden said he does not rule out moving to live in a Latin American country. However, the recent incident in which the Bolivian President Evo Morales? plane was grounded in Austria on suspicion that the NSA leaker was on board discourages Snowden from going there now. ?First, he said that he was dissatisfied with European countries after the Bolivian president?s plane was inspected. He wants to seek political asylum, at least temporary shelter, in Russia. But his further actions are unclear,? Nikitin said.? ? WikiLeaks @wikileaks July 12, 2013 According to human rights lawyer Anatoly Kucherena, the request for political asylum has already been written by Snowden. Kucherena said he will provide legal support for the former NSA contractor seeking asylum.? The Russian authorities should be able to decide on Snowden?s asylum request in two to three weeks? time, he added.? Meanwhile, Russia?s presidential human rights ombudsman Vladimir Lukin suggested that it would be better for Snowden to ask the UN or the ICRC for refugee status instead of seeking asylum in Russia. That way it won?t harm Russian-American relations, he added.? The US Embassy called several rights activists before their meeting with Snowden, asking to deliver the official American stance on his actions. ?It is true that I received a call from the American Embassy in the name of [US Ambassador to Russia Michael] McFaul, in which I was asked to deliver to Snowden the US official stand, which says he is not considered a rights activist, that he broke the law and therefore must be made accountable,? Lokshina confirmed to RIA Novosti.? However, Washington denied that US diplomats asked Human Rights Watch to deliver a message to Snowden. ?We simply explained our position on Snowden to a representative of Human Rights Watch,? a source at the US Department of State told Interfax. Thirteen Russian and international human rights advocates and lawyers have gathered at Moscow Sheremetyevo Airport for a meeting with Snowden. The whistleblower said the living conditions were fine at the airport and he felt safe there, but he knows he can't stay there forever, according to Lokshina. Rights advocates who received letters from Snowden and agreed to come to the meeting included representatives of Amnesty International, Transparency International, Human Rights Watch and other organizations, as well as well-known Russian lawyers.? The meeting started behind closed doors in an undisclosed area of Sheremetyevo?s Terminal F.? Meanwhile, several hundred journalists have surrounded a gray ?staff only? door guarded by airport security, awaiting for comments from the meeting participants.? Watch RT's special coverage of the event The Russian president?s spokesman Dmitry Peskov responded by saying the Kremlin has not yet received any formal asylum request from Snowden. The conditions for his staying in Russia remain the same as voiced by Vladimir Putin earlier, he added.? Should Snowden apply for asylum, Russia will consider his request, Peskov said. Russia was one of over twenty countries to which Snowden sent asylum request according to Wikileaks. President Vladimir Putin said then Snowden may stay in Russia, if he wants to, but only if he stops activities aimed against the United States. ?There is one condition if he wants to remain here: he must stop his work aimed at damaging our American partners. As odd as it may sound from me,? Putin told a media conference in Moscow.? In Putin?s opinion, Snowden considers himself ?a fighter for human rights? and it seems unlikely that he is going to stop leaking American secret data. However, Russia is not going to extradite Snowden, the president underlined. ?Russia has never extradited anyone and is not going to do so. Same as no one has ever been extradited to Russia,? Putin stated. ?Snowden, by sincere conviction or for some other reason, considers himself to be a human rights activist, a fighter for the ideals of democracy and human freedom. Russian human rights activists and organizations, as well as their colleagues abroad acknowledge this. For this reason, extraditing Snowden to a country like the US where capital punishment is enforced is impossible,? Peskov explained to press.