On Tuesday, National Security Agency leaker and former Booz Allen Hamilton employee Edward Snowden found himself one step closer to ending his 24 days of diplomatic limbo at the Sheremetyevo International Airport in Moscow when, as part of his application for asylum to Russia, he agreed to President Vladimir Putin?s condition to stop harming the United States by releasing intelligence secrets. Citing Snowden?s lawyer, ABC News reported that Snowden finalized the asylum application inside the airport?s transit zone. A spokesperson for the Russian president indicated that Putin is aware of the application but offered no immediate reaction, saying the Russian Federal Migration Service will make its own determination. On Monday, Putin expressed his desire for Snowden to leave Russia. ?As soon as there is an opportunity for him to move elsewhere, I hope he will do that,? Putin said during a visit to Gogland Island. ?The conditions for Russia granting him political asylum are known to him. And judging by his latest actions, he is shifting his position. But the situation has not been clarified yet.? The Snowden case has proven tiresome for Russia, which is desperate to improve its relations with the United States prior to a Moscow summit between Obama and Putin in September. ?We have certain relations with the United States and we don?t want you to damage our ties with your activity,? Putin said, speaking about Snowden. ?He came to our territory without invitation, we did not invite him. And we weren?t his final destination. He was flying in transit to other states. But the moment he was in the air ? our American partners, in fact, blocked his further flight,? Putin said. ?They have spooked all the other countries, nobody wants to take him and in that way, in fact, they have themselves blocked him on our territory.? Russia has made it a point not to antagonize the United States on the Snowden issue. Previously, Russia has accused the United States of being hypocritical in its advocacy of human rights abroad given its violations of human rights at home, and Putin has felt that the United States has actively lobbied against him personally. ?Well, it can only be bad, and it comes at a bad moment,? said New York University professor Stephen Cohen to Russia Today, ?because for the last month or so there?s been an opportunity for Russia-American cooperation of the kind we haven?t had a in a long time. It began with the Boston bombings when our anti-terrorist forces and Russian anti-terror forces began to work together. And then, was the announcement that Russia and America would co-sponsor a renewal of the conference in Switzerland on Syria. Those are absolutely fundamental issues that affect all of us.? ?Snowden?s personal saga has taken the oxygen out of that, and still worse, it has created ? particularly in Washington, where there?s a lot of political opposition to any improvement in relations with Russia ? it?s enhanced, it?s encouraged that opposition. So it?s a bad development in terms of American-Russian relations,? Cohen continued. Snowden indicated on his asylum application that he fears torture or death if he is extradited to the United States. While the maximum sentence Snowden can face for his charges is 40 years, many have reasons to think that the Obama administration has no incentive to see Snowden tried in a conventional court. ?I can?t believe that the United States actually wants to put Snowden on trial, because if it was a fair trial, a legal trial, Snowden would have the right to subpoena American officials who have knowledge of all this intelligence he?s exposed,? Cohen said to Russia Today. ?That would not be good. So I think there?s a vested interest, both with Obama and Putin, to find a way to solve this problem so that neither is damaged politically. So we?ll now see what kind of leaders they are.? When asked by Russian media about Snowden?s future, Putin reportedly quipped, ?Such a present to us. Merry Christmas.? Snowden indicated to human rights advocates Friday that he is interested in obtaining temporary asylum in Russia until he can safely travel to Latin America. Snowden?s passport was annulled by the U.S. State Department, denying him passage across international borders. While Nicaragua, Venezuela and Bolivia have extended offers of asylum, none of these countries offer direct flights to Russia. A flight to Latin America would require a layover in the United States or in Cuba, exposing Snowden to the possibility of detention and arrest. Raul Castro, the president of Cuba, has expressed support for Cuba?s Latin American allies that offered asylum to the whistleblower. It is possible that Castro would have permitted Snowden to pass through Cuba undisturbed. President Barack Obama has stated, however, that any country that offers safe haven to Snowden ? who is wanted by the federal government for four charges of theft and unauthorized distribution of controlled government documents ? will face serious repercussions from the United States. This created an international incident on July 3 when the plane of Bolivian President Evo Morales was denied entrance into the airspace of France, Portugal, Italy and Spain, allegedly on suspicions that Snowden was a passenger. The plane was ultimately routed to Austria, where it was discovered that Snowden was not on board. Portugal has since argued that Morales had permission to fly through, but not to land in Portugal, due to unexplained ?technical issues.? France has apologized for the delay in granting Morales permission to enter French airspace, and Spain has indicated that it was told by an unidentified official that Snowden was on board. The incident seems to directly contradict President Obama?s insistence that capturing Snowden will not be a high priority. ?I?m not going to have one case with a suspect who we?re trying to extradite suddenly be elevated to the point where I?ve got to start doing wheeling and dealing and trading on a whole host of other issues, simply to get a guy extradited so he can face the justice system,? the president said in a joint press conference with Senegalese President Macky Sall.