President Obama spoke Friday with Russian President Vladimir Putin amid escalating tensions between the two countries over NSA leaker Edward Snowden but there was no indication they reached any accord on the fugitive's future. Snowden, surfacing for the first time in weeks, held a meeting with human rights groups earlier Friday at the Moscow airport, where he's been stuck in the transit zone since he left Hong Kong last month. White House Press Secretary Jay Carney said the meeting amounted to a propaganda platform for Snowden, and criticized Russia for its handling of the affair. It's also incompatible with Russian assurances that they do not want Mr. Snowden to further damage U.S. interests, he said. The Russian government so far has rebuffed calls to return Snowden to the U.S. to face multiple federal charges. Carney said the phone call on Friday between Obama and Putin has been scheduled for days. A brief White House readout of it later said, The two leaders noted the importance of U.S.-Russian bilateral relations and discussed a range of security and bilateral issues, including the status of Mr. Edward Snowden and cooperation on counter-terrorism in the lead-up to the Sochi Winter Olympics. Snowden announced Friday that he plans to seek temporary asylum in Russia and ultimately hopes to take refuge in Latin America. But the Interfax news agency quoted Russian migration service head Konstantin Romodanovsky as saying no asylum request had been received as of Saturday. A spokesman for Putin reportedly said, in response to the asylum reuqest, that Snowden must stop harming the U.S. if he wants to stay in Russia. Putin previously has made such a demand, though Snowden has continued to leak sensitive documents about U.S. intelligence activities to major media publications. Venezuela has offered asylum to Snowden, while Bolivia and Nicaragua have also floated that possibility. A number of other countries have turned him down. The meeting on Friday came as Snowden and his advisers continue to try and find a way for him to leave the Moscow airport transit zone -- where he's been stuck ever since fleeing Hong Kong -- and travel to a country that will offer him asylum. Snowden made an additional statement in a letter posted on a Human Rights Watch Facebook page. Never before in history have states conspired to force to the ground a sovereign President's plane to effect a search for a political refugee, Snowden was quoted as saying in the letter. This dangerous escalation represents a threat not just to the dignity of Latin America or my own personal security, but to the basic right shared by every living person to live free from persecution. The Associated Press contributed to this report.