NSA controls global Internet traffic via private fiber-optic cables July 8, 2013 Deals brokered between federal agents and foreign corporations have allowed the United States government to easily intercept and interpret a vast swath of communication data sent around the world, new documents reveal. In a National Security Agency slideshow obtained by The Washington Post and attributed to NSA leaker Edward Snowden, the US government encouraged analysts to tap into an array of underwater, fiber-optic cables that serve as conduits for around 99 percent of the world?s Internet and phone traffic. The report, published by the Post?s Craig Timberg and Ellen Nakashima, explains how NSA slides leaked by Snowden reveal yet another surveillance program undertaken as an alleged counterterrorism measure but at the cost of putting the privacy of millions, if not billions, of people at risk. According to that report, the US government sent a team of attorneys from a number of alphabet soup agencies ? including the Federal Bureau of Investigation and the Departments of Defense, Justice and Homeland Security ? to oversee post-9/11 efforts that would ensure most intelligence sent throughout the world could be collected by American agents. ?Among their jobs, documents show, was ensuring that surveillance requests got fulfilled quickly and confidentially,? the journalists wrote. That much, the Post alleges, was accomplished by maintaining ?an internal corporate cell of American citizens with government clearances? within the ranks of the foreign companies that control the fiber-optic cables carrying most telecommunications data around the world. One of those entities was Asia?s Global Crossing, and the US moved quickly to infiltrate its roster of employees shortly after 9/11. The post writes that the ?Network Security Agreement? signed between Global Crossing and the US in 2003 was one of the first major contractors giving the US the power to tap into these major telecom pipes, and in the decade since countless others have been authorized. In that instance and others, federal attorneys cooperating under the name ?Team Telecom? compelled foreign owners of these cables to comply with American requests for information. In the case of the Global Crossing contract, the US had the firm sign off on a deal that assured American intelligence agents could call up the company and be at a US-based ?Network Operations Center? in only 30 minutes time to monitor and collect data. And while laws exist in order to allegedly provide safeguards to protect the privacy of Americans, the Post says that doesn?t stop American agencies from being able to collect that data nonetheless. ?As people worldwide chat, browse and post images through online services, much of the information flows within the technological reach of US surveillance. Though laws, procedural rules and internal policies limit how that information can be collected and used, the data from billions of devices worldwide flow through Internet choke points that the United States and its allies are capable of monitoring,? the Post writes. Along with the PRISM program disclosed by Snowden last month, tapping into these cables gives the US the ability to monitor essentially any communication that passes near the US. The Post notes that both PRISM and the ?Upstream? program that pulls from underwater cables intend to only target communications in which one part is believed to be outside of the US, but government agencies are unwilling to say how many Americans have incidentally or inadvertently entered the radar of the NSA. Previously, though, members of the United States Senate have used phrases like ?profoundly appalled? to predict how Americans would likely react if they knew the full extent and scope of their country?s surveillance programs. In the wake of Mr. Snowden?s disclosures that first began surfacing last month, the NSA, President Barack Obama and his administration have all celebrated the surveillance programs as necessary implements in the war against terror. The White House maintains that the practices are legally authorized through both the Foreign Intelligence Surveillance Act and the post-9/11 PATRIOT Act, but continue to draw criticism from the public and politicians alike. Snowden, 30, is seeking asylum to avoid prosecution in the US where he is accused under the Espionage Act. No, no, no sillies. He cancelled it because he is a pussy, and doesn?t have the guts to look Putin in the eye and tell him that there are going to be consequences for his actions. In fact, there aren?t going to be any consequences; none, nada.? Obama couldn?t care less about your gay rights, unless of course it gives him votes. Let this be an example to every other country in the world, you can do anything you?d like because Obama wont do anything to stop you. When William Averell Harriman, who served as Secretary of Commerce under President Truman, mentioned ?Soviet imperialism? in a speech in Seattle, writer Ilya Ehrenburg wasted no time airing his disgust on the pages of the Soviet publication Pravda. American warmongers want to drop bombs on the Soviet Union because they don?t like its social order, Ehrenburg wrote, but the Soviet people, though they consider U.S. laws on race to be insulting to human dignity, ?do not intend on that account to turn modern weapons against Mississippi or Georgia,? the Christian Science Monitor described in a 1947 story. The exchange is indicative of a rhetorical strategy known as whataboutism, which?occurs when officials implicated in wrongdoing whip out a counter-example of a similar abuse from the accusing country, with the goal of undermining the legitimacy of the criticism itself. In Latin, this rhetorical defense is called?tu quoque, or ?you, too.? ? More than a month after NSA leaker Edward Snowden landed in Moscow?s Sheremetyevo airport, Russia has finally granted him yearlong asylum, and it seems these kinds of cold-war-era swipes are back ? but in a subtler way. Brushing aside pleas and warnings from President Obama and other senior American officials, Russia granted Edward J. Snowden temporary asylum and allowed him to walk free out of a Moscow airport transit zone on Thursday, ending his legal limbo there after more than five weeks. Russia?s decision, which infuriated American officials, significantly alters the legal status of Mr. Snowden, the former intelligence analyst wanted by the United States for leaking details of the National Security Agency?s surveillance programs. Even as those leaks continued, Mr. Snowden now has legal permission to live ? and conceivably even work ? anywhere in Russia for as long as a year, safely out of the reach of American prosecutors. Mr. Snowden, 30, departed Sheremetyevo Airport unexpectedly at 3:30 in the afternoon after his lawyer, Anatoly G. Kucherena, delivered to him a passport-like document issued by the Federal Migration Service on Wednesday and valid until July 31, 2014. Mr. Kucherena said he would not disclose his whereabouts, though he expected Mr. Snowden could make a public appearance soon. ?I cannot give out details,? he said. Mr. Snowden left the airport?s transit zone alone, an airport official said, but the anti-secrecy organization WikiLeaks later announced that he had left accompanied by one of the organization?s representatives, Sarah Harrison, who apparently had remained with him since his flight began in Hong Kong in June. His asylum in Russia almost certainly will sorely strain relations with the United States, where lawmakers have called for harsh retaliation against Russia, even a boycott of the Winter Olympic Games to be held in Sochi. Although President Vladimir V. Putin and President Obama both sought to avoid a direct diplomatic clash over Mr. Snowden, Mr. Putin and other officials here made clear they would under no circumstance extradite him, despite direct appeals from Secretary of State John Kerry and Attorney General Eric H. Holder Jr. Russia has granted fugitive National Security Agency leaker Edward Snowden permission to remain in the country for three more years, Snowden?s attorney said Thursday, a measure that promised to further strain U.S.-Russian relations. The decision gives the former NSA contractor the option to remain in Russia through August 2017 and, potentially, to take up Russian citizenship should he extend his stay for one year beyond that, lawyer Anatoly Kucherena told reporters. The decision last year to grant asylum to Snowden for a year was a major factor in the souring of U.S.-Russian relations, which have deteriorated to Cold War lows over the conflict in Ukraine. The decision to extend Snowden?s stay, although not a surprise, represents another political dig by the Kremlin at the Obama administration, which made Snowden?s return to U.S. territory a high priority. The announcement came on the day that Prime Minister Dmitry Medvedev said Russia would?ban all meat, produce and milk imports?from the United States, the European Union, Australia, Canada and Norway for a year. ?Starting August 1, 2014, Edward Snowden has received a residence permit for a three-year term,? Kucherena said. He said his client has not been granted official political asylum, which would allow him to stay in Russia permanently and must be decided through a separate process. Kucherena said Snowden has not decided whether to try to remain in Russia permanently.