MOSCOW ? Edward Snowden said Friday that he has no regrets over leaking details about U.S. electronic spying networks and is seeking temporary asylum in Russia until he can reach one of the Latin American countries that has offered to take him in. That moral decision to tell the public about spying that affects all of us has been costly, but it was the right thing to do and I have no regrets, he told a group of human rights activists and other public officials at a meeting at Moscow's Sheremetyevo airport, where he has taken refuge since June 23. The 30-year-old former defense contractor, who fled first to Hong Kong and then Russia, said he did what he believes was right to go public with information on the National Security Agency's surveillance and data-gathering networks in an effort to correct this wrongdoing. I did not seek to enrich myself. I did not seek to sell U.S. secrets, he said in a statement released through WikiLeaks. I did not partner with any foreign government to guarantee my safety. Instead, I took what I knew to the public, so what affects all of us can be discussed by all of us in the light of day, and I asked the world for justice. Snowden, whose U.S. passport has been revoked, said he has formally accepted an offer of asylum from Venezuelan President Nicolas Maduro, as well as all others which have expressed support and a ll others that may be offered in the future. He said he would ask Russia for permission to remain in the country until he resolve his travel problemss I will be submitting my request to Russia today, and hope it will be accepted favorably, he said. Dmitry Peskov, spokesman for Russian President Vladimir Putin, told Russian news agencies that Russia had not received a new bid for asylum from Snowden and that Putin would continue to insist that Snowden stop leaking information. In Washington, White House spokesman Jay Carney said Obama has a pre-scheduled call Friday with Russian counterpart Vladimir Putin, and the topic of Snowden would likely come up. The meeting included Vyacheslav Nikonov, chairman of the Russian state Duma State Education Committee, Sergei Nikitin, head of Amnesty International Russia, Vladimir Lukin, Russia's presidential human rights ombudsman, attorney Genri Reznik, and Tanya Lokshina, of Human Rights Watch. WATCH: A clip from a video of Snowden's remarks READ: Full statement by Edward Snowden Nikonov told Rossiya 24 that he asked him about Putin's previously stated conditions, and that Snowden told him he had. He does not w ant to harm U.S. interests because he is a law-abiding citizen and a patriot, the Russian lawmaker said. Carney also said granting even temporary amnesty to Snowden would run counter to Moscow's assurances that it did not want the Snowden affair to damage U.S.-Russia relations. Providing a propaganda platform for. Mr Snowden runs counter to the Russian government's previous declarations of Russia's neutrality, Carney said. It's also incompatible with Russian assurances that they do not want Mr Snowden to further damage U.S. interests. Snowden, in his remarks at the meeting, said governments in Western Europe and North American are acting outside the law by preventing him from traveling and called on the rights activists to intervene with Putin on his behalf. He also indicated that his world had turned upside down since he went public in May in leaking information that published in The Washington Post and The Guardian. A little over one month ago, I had family, a home in paradise, and I lived in great comfort, Snowden said. I also had the capability without any warrant to search for, seize and read your communications. Anyone's communications at any time. That is the power to change people's fates. RELATED STORY: NSA fears Snowden saw details of China spying Snowden said the U.S. government and intelligence agencies have tried to make an example of him as a warning to all others who might speak out as I have. I have been made stateless and hounded for my act of political expression, he said. He also invoked the principles declared at the Nuremberg trial of Nazis in 1945 that individual citizens have the duty to violate domestic laws to prevent crimes against peace and humanity from occurring. Snowden complained that he had been placed on a no-fly list and that countries had been threatened if they offered him support. Snowden also said the U.S. had taken the unprecedented step of ordering its military allies to ground a Latin American president's plane in search of a political refuge. He was referring to a decision by some European countries to deny airspace to the plane of the Bolivian president who was flying home last week from Russia. The plane eventually landed in Austria, where it was searched in an apparent belief that Snowden was on board. This unlawful threat makes it impossible for me to travel to Latin America and enjoy the asylum granted there in accordance with our shared rights, Snowden said. The American Civil Liberties Union, meanwhile, issued a statement Thursday asserting that the former defense contractor has serious claims for asylum and has a legitimate right to seek asylum irrespective of the human rights record of the country that he ultimately ends up in. The statement charges that the USA has interfered with Snowden's right to seek asylum by revoking his passport and appears to have prevented him from receiving fair and impartial consideration of his application in many of the countries to which he has applied. Jamil Dakwar, director of the ACLU human rights program, and Chandra Bhatnaqar, senior attorney for the program, also warn that by infringing on Snowden's right to asylum, U.S. actions also create the risk of providing cover for other countries to crack down on whistle-blowers and deny asylum to individuals who have exposed illegal activity or human rights violations. That's a very dangerous precedent to set, the statement says. Contributing: Stanglin reported from McLean,Va., The Associated Press