Russian President Vladimir Putin said Monday that NSA leaker Edward Snowden would leave the country at the earliest opportunity, RT.com reports. As soon as there is an opportunity for him to move elsewhere, I hope he will do that. He is familiar with the conditions of granting political asylum, and judging by the latest statements, is shifting his position. The situation is not clear now, Putin said, according to the Russian news site. Putin's remarks indicated that it is increasingly unlikely that Russia will offer political asylum to the 30-year-old former defense contractor. Snowden, who remains in the transit area of Moscow main international airport, has been charged under the Espionage Act for allegedly disclosing secret U.S.government anti-terrorism programs, particularly details of the National Security Agency's surveillance and data-collection network. Putin said Snowden was initially offered an opportunity to apply for asylum in Russia, but only if he stopped his political activity. The Russian president said Moscow officials had told Snowden that they did not want him to engage in activity that would harm the United States while he was in Russia and he refused. He said, 'I want to continue my activity, to fight for human rights and think that U.S. is violating certain regulations, international, intervene in private life and my goal to fight this,' Putin said, according to RT.com. Putin made his remarks in response to questions from reporters while on an island in the Gulf of Finland. The Russian leader emphasized that the U.S. basically blocked the former defense contractor from leaving Russia, where he arrived from Hong Kong June 23. He arrived on our territory without an invitation, he was not flying to us --- he was flying transit to other countries, Putin said. But as soon as he got in the air it became known, and our American partners, in fact, blocked his further flight. Putin is quoted by one Russian news agency as saying, Such a present to us. Merry Christmas. Putin was referring to the U.S. revoking Snowden's passport shortly after he arriveed at Moscow Sheremetyevo Airport. They themselves scared other countries; no one wants to accept him, he added, according to RT.com. When asked about what was next for Snowden, Putin replied: How should I know? That's his life, his fate.