Edward Snowden, the former contractor who provided journalists with details of the National Security Agency?s intelligence and surveillance operations, told activists and lawyers today that he would seek asylum in Russia. He has been staying in Moscow?s Sheremetyevo Airport for several weeks, unable to travel since the United States revoked his passport: ?He feels it is impossible to travel anywhere, so for the time being he is asking for asylum here,? said Human Rights Watch activist Tatyana Lokshina, who was at the meeting with Snowden. Eventually, she added, the 30-year-old former contractor for the National Security Agency still hopes to be granted asylum in Latin America. Lokshina said Snowden was not concerned about a demand from Russian President Vladimir Putin that he refrain from releasing harmful information about the United States while on Russian soil. ?He has no problem with Putin?s condition, because he does not believe he damaged the United States or is damaging it? by revealing classified information about U.S. data surveillance, Lokshina said. Snowden originally said he would apply for asylum from Russia about 11 days ago. But Putin spokesman Dmitri Peskov said Snowden later decided not to apply, after Putin made clear there would be limits placed on what he could do and say. Russia?s Federal Migration Service has not yet received an application for political asylum from Snowden, agency spokesman Zalina Kornikova told Interfax on Friday. ?The starting point? for such a request, Peskov told reporters, is that ?Mr. Snowden hypothetically could stay in Russia if he, first, fully stops activities causing damage to our American partners and Russian-American relations. Second, if he asks for this himself.? Snowden arrived here from Hong Kong three weeks ago, after revealing classified information about data collection programs run by the NSA. The United States wants him returned to America to face criminal charges. Snowden?s argument that his actions have not harmed the United States might not satisfy the Kremlin: Worryingly for Snowden, he and Putin seem to be speaking past one another. Putin said that Snowden would have to ?stop his work? that was damaging the United States; Snowden says he?s never damaged the United States. Clearly, they don?t agree about what does and does not qualify as allowed under Putin?s conditions for stay. It?s possible that Snowden believes he can technically adhere to the terms because he may have already passed all of his information on to WikiLeaks or other sources; in this thinking, perhaps, any future leaks sourced to him are not his responsibility. It?s not clear whether or not Putin would see it this way. Snowden, or at least WikiLeaks representative Sarah Harrison who is working with him, might already see hints of these potential contradictions. Snowden asked the attendees at Friday?s Moscow airport meeting to try to intervene with Putin on his behalf, Lokshina told the New York Times. And Russia, unlike three Latin American countries, has not yet offered Snowden asylum, beyond Putin?s earlier conditional statement. Vyacheslav Nikonov, a member of parliament with Putin?s political party, United Russia, told The Post that he believes Snowden will stay at the airport until a decision is made. A National Security Agency internal review of damage caused by the former contractor Edward Snowden has focused on a particular area of concern: the possibility that he gained access to sensitive files that outline espionage operations against Chinese leaders and other critical targets, according to people familiar with aspects of the assessment. The possibility that intelligence about foreign targets might be made public has stirred anxiety about the potential to compromise the agency?s overseas collection efforts. U.S. officials fear that further revelations could disclose specific intelligence-gathering methods or enable foreign governments to deduce their own vulnerabilities. ?We?re deeply concerned,? said one senior intelligence official, who, like others interviewed for this article, was not authorized to speak on the record. ?The more that this gets made public, the more capability we lose.? Snowden was able to range across hundreds of thousands of pages of documents on NSA networks, said one former official briefed on the issue. Another intelligence official cautioned that, at this point in the investigation, he did not appear to have obtained ?collected data,? or the raw intelligence that results from hacking and other collection operations. ?He got a lot,? the official continued, but it was ?not even close to the lion?s share? of what the NSA is engaged in. Still, the official said, harm to the efforts ?is a concern.? According to Air Force officials, one of Snowden?s former employers, Booz Allen Hamilton, was not responsible for the breach: ?At this time, we have no indication of any wrongdoing on the part of the Booz Allen Hamilton corporation,? said Lt. Col. John Dorrian, an Air Force spokesman.?.?. The company has faced allegations of improper contracting behavior in the past, including last year when the Air Force temporarily suspended a division of the company. Booz Allen had hired a Pentagon official who brought ?non-public information,? which was shared with the company to help it win a contract, the Air Force found. The Air Force lifted Booz Allen?s temporary suspension in April of last year after the firm agreed to implement ethical and other reforms as well as pay $65,000. Under the agreement reached in that case, Booz Allen was required to report the Snowden incident to the Air Force. ?The Air Force?s suspending and disbarring official is monitoring Booz Allen?s handling of the Snowden? case, Dorrian said. So far, the Air Force has found that ?they?re meeting the obligations that they?ve agreed to in the ?administrative agreement.? Observers briefly wondered Thursday whether a commercial flight from Moscow to Havana on an unusually circuitous trajectory might have been carrying Snowden, but the detour was simply a response to turbulence over Greenland. For past coverage of Snowden and what he revealed, continue reading here.