By Gregory J. Wallance Edward Snowden?s press conference last Friday may have generated sympathy for the youthful-looking 30 year old without a country, but Snowden was merely a prop. The purpose of the press conference was not to humanize him, but to humanize Vladimir Putin?s government as a haven for human rights activists fleeing governments that abuse human rights read, United States . But haunting the transit lounge was the ghost of a real whistleblower, Sergei Magnitsky, the Russian lawyer who in 2008 uncovered a $230 million tax fraud scheme by Russian interior ministry and tax officials. In Kafkaesque fashion, prosecutors charged Magnitsky with the crimes he had exposed and sent him to one of Russia?s most notorious pre-trial detention centers. He was then tortured, denied medical care, and, in 2009, died an excruciating death at age 37. Nonetheless, Russian officials tried the dead man in Tverskoy District Court and, the day before Snowden?s press conference, convicted the corpse of masterminding the tax evasion scheme. The verdict was retaliation against the United States government for adopting the ?Magnitsky list,? banning officials involved in the tax fraud from entering the United States or maintaining bank accounts here Moscow had also retaliated by banning Americans from adopting Russian children . The Putin government followed up the dead man?s guilty verdict with the Snowden press conference. The Magnitsky-Snowden events are hardly without precedent in Russia. Together, they echo the 1930s Soviet show trials, where surviving Old Bolsheviks, supporters of exiled communist Leon Trotsky, and senior Red Army commanders, were convicted in highly publicized ?trials,? often with the aid of confessions obtained by torture thousands were executed or sent to the gulag . The purpose was to purge Stalin?s enemies and terrorize potential opponents, while presenting the trials as fair and just proceedings. Recently, Nina Khruscheva, the great grand-daughter of Soviet Premier Nikita Khruschev, whose famous 1956 speech to the Communist Party?s Twentieth Congress exposed Stalin?s brutality, wrote in Foreign Policy magazine that ?Russia?s legal institutions are still run along the lines of Stalin?s ?show trials.?? These legal proceedings include the prosecutions of anti-corruption lawyer, opposition activist, and blogger, Alexey Navalny; former Yukos CEO Mikhail Khodorkovsky; and the punk band Pussy Riot. Some human rights activists were simply murdered, including Chechen Natalia Estemirova in 2009 and Dagestan publisher Gadzhimurat Kamalov in 2011. And, in no small irony, Leonid Razvozzhayev, a political activist, was abducted in Kiev last year while seeking advice on political asylum from the UN High Commissioner on Refugees. Magnitsky was a courageous whistleblower. Unlike Magnitsky, Snowden cannot claim to have revealed that American officials behaved corruptly or illegally. In fact, the government surveillance programs had been approved by all three branches of the American government, two of them democratically elected. The programs represented a balance between two compelling, but not easily reconciled interests, national security and privacy. Based only on his internal moral compass, Snowden disagreed with the balance struck by the Obama administration. It may or may not have been the right balance, but nothing in Snowden?s background his most advanced degree apparently was a high school equivalency suggests that he was qualified to select a better one in the name of, as he put it, ?intellectual exploration and creativity.? Snowden?s morality play, in which he casts himself as the lonely fighter against the ?victimization of global privacy,? is more an exercise in self-realization than whistleblowing. At the very least Snowden is hard-pressed to claim the mantle of human rights defender. The press conference masked the horrendous treatment of Russian citizens who dared oppose an oppressive government. Tellingly, neither Snowden or anyone else at the press conference mentioned Magnitsky or the other Russian murder victims who made the ultimate sacrifice for acting on their consciences, as Snowden claims to be doing. Snowden cannot afford to antagonize Russia since he cannot get to the South American countries who have offered asylum unless he first gets out of the transit lounge. Estemirova and Kamalov ran far greater risks in daring to speak against Russian violations of human rights in the North Caucuses. Snowden could return to the United States to face a trial, in which case he would have a platform to explain to an attentive American public why he disagreed with how the American government balanced privacy and security interests. Instead, Snowden likely will live out his days in either Venezuela, Nicaragua, or Bolivia, countries with poor human rights records. Like Russia, one of those countries will use Snowden as a propaganda tool. He will not protest human rights abuses in his host country, including intrusive surveillance programs, for fear of being thrown out. He sooner or later will realize that, while the American system does not always get it right, his host country?s personal freedoms, especially those that foster ?intellectual exploration and creativity,? cannot compare with the freedoms enjoyed by Americans. And then he will find himself doubting, if not regretting, his choice. Gregory J. Wallance, a former federal prosecutor, is a lawyer and writer in New York City.? He has been to numerous countries to investigate human rights violations, including the former Soviet Union.?