* Putin wants former U.S. spy agency contractor to go * Blames U.S. for blocking Snowden's passage * Signals Snowden shifting towards main asylum requirement Adds more quotes and detail By Alexei Anishchuk GOGLAND ISLAND, Russia, July 15 Reuters - President Vladimir Putin said on Monday he wanted Edward Snowden to leave after three weeks holed up at a Moscow airport, but also signalled that the former U.S. spy agency contractor was moving towards meeting Russia's asylum conditions. Snowden flew to Moscow's Sheremetyevo airport from Hong Kong on June 23 in the hope of travelling on to a country that would offer him protection from the United States after he divulged details of U.S. government intelligence programmes. Putin said Washington had trapped Snowden by preventing him from reaching other countries that might shelter him but, wary of upsetting Moscow's former Cold War enemy, has said Russia will grant him political asylum only if he stops actions that could be harmful to the United States. As soon as there is an opportunity for him to move elsewhere, I hope he will do that, Putin said during a visit to Gogland Island in the Gulf of Finland. The conditions for Russia granting him political asylum are known to him. And judging by his latest actions, he is shifting his position. But the situation has not been clarified yet. Snowden, 30, told human rights campaigners on Friday at a meeting in Sheremetyevo's transit area that he was seeking temporary asylum in Russia until he can travel safely to Latin America, where three countries have said they might take him in. He has been unable to reach any of those countries - Nicaragua, Venezuela or Bolivia - because there are no direct flights from Moscow and he would risk having his passage barred by the United States and its allies. The case is an increasingly awkward problem for Putin as Moscow and Washington try to improve relations and he prepares for a summit with President Barack Obama in Moscow in early September, just before a summit of G20 leaders in Russia. We have certain relations with the United States and we don't want you to damage our ties with your activity, Putin said, referring to Snowden. Asked to comment on what comes next for Snowden, Putin, a former KGB spy, said: How do I know? It's his life, his fate. UNINVITED GUEST He went on to distance Russia from Snowden and his political activities and, as on previous occasions when he has spoken about the case in public, avoided taking the opportunity to gloat at the United States' failure to catch him. He came to our territory without invitation, we did not invite him. And we weren't his final destination. He was flying in transit to other states. But the moment he was in the air ... our American partners, in fact, blocked his further flight, Putin said. They have spooked all the other countries, nobody wants to take him and in that way, in fact, they have themselves blocked him on our territory, he said. Washington has revoked Snowden's passport and wants him extradited to the United States to face espionage charges. Russia often accuses the United States of failing to practise at home what it preaches on human rights abroad, and many pro-Kremlin politicians have cast Snowden as a defender of civil rights. Putin has also accused the United States of backing protesters who have demanded an end to his long rule. But the Kremlin has avoided parading Snowden before cameras and has repeatedly avoided embarrassing the United States over the young American's flight from U.S. justice. Tatyana Lokshina of the American-based campaign group Human Rights Watch said after meeting Snowden on Friday that he saw no problem with Putin's asylum conditions because he believed he had done no harm to the United States. Putin did not say what prompted him to believe Snowden's stance was shifting. Russia has made clear it regards the transit area between the airport runway and passport control as neutral territory and signalled it does not want to upset the United States further by allowing Snowden to step onto what it considers Russian soil. Writing by Gabriela Baczynska; Editing by Timothy Heritage and Kevin Liffey