Yves Smith: The fact that economic distress has moved pretty high up the food chain is a sign that this recovery isn't all that it is cracked up to be. The US Security State seems to be in a panic over Edward Snowden?s leaks.? Secretary of State John Kerry, along with UN nominee Samantha Powers, is threatening acts of war with Venezuela. The US has already violated international law by forcing down the plane of the Bolivian president. And now, President Obama is saying he may derail talks with Russian President Putin over Snowden. With every act the US Security State draws more attention to whistleblower Edward Snowden and the dragnet surveillance program he unveiled.? Every act is an act of self-destruction with their abuse of power showing signs of their weakness. Snowden struck a nerve with the security state.? The US likes to project an image of freedom and democracy but Snowden has proven the US does not have a real democracy and the people of the US are not free.? Snowden shows that the people of the United States have been lied to and the political leadership of the country does not respect our freedom, privacy or constitution. If Venezuela or Russia were proven to be recording every Internet post and chat, every piece of mail, as well as monitoring all telephone activity of its citizens, US politicians and corporate media?hacks like David Gregory?would be jumping up and down accusing those countries of being totalitarian. Of course, when Snowden shows the same is happening in the US, we hear approval from the bi-partisans in Congress and too many in the corporate media defend the US while?attacking journalists like Glenn Greenwald?for letting the truth out. It is clear now that the ?emperor has no clothes,? that our claims of democracy and freedom are fairy tales. The?US surveillance?state has over-reached and been caught. ?In the aftermath of Snowden?s revelations, it seems we are learning almost daily of new ways we are being spied upon. Which path will the US take: further invasions and repression or full accountability and respect for the Constitution and rule of law? The State Department Prefers Threats to Diplomacy Over Snowden Secretary of State John Kerry, who is proving to be a?hawk among hawks?in the Obama administration, is threatening Venezuela with what amount to acts of war. In a conversation with the Venezuelan Foreign Minister?Kerry reportedly ?threatened?to ground any Venezuelan aircraft in America?s or any NATO country?s airspace.?? He made it clear that the Venezuelan president could suffer the same fate as?Bolivian President Evo Morales.? Kerry also threatened that all 26 NATO countries would block the airspace of Venezuelan flights. And, he added additional threats, promising to revoke US entry visas to Venezuela for officials and business people associated with former President Hugo Chavez.? And, threatened the US would also begin to prosecute prominent Venezuelans on allegations of drug trafficking, money laundering and other criminal actions. Beyond that the Kerry warned that fuel supplies needed for the Venezuelan oil industry would be halted if President Maduro continues to offer to protect Snowden with political asylum. He is essentially telling Venezuela to expect a virtual economic blockade if they protect the whistleblower Edward Snowden. These are all quite embarrassing comments, showing the US flailing around using any threat they can think of to stop support for Snowden. They were so embarrassing that US State Department deputy spokeswoman?Marie Harf denied?that Kerry ever touched upon the possible nature of US response to Venezuela granting asylum to Snowden in his conversation with Foreign Minister Jaua. She dismissed the report that Kerry has threatened Venezuela as??utterly wrong.?? Kevin?s personal experience with Kerry leads us not to trust his spokesperson. When he worked with Ralph Nader in 2004 we met with Kerry and his spokespersons lied to the media saying we did not discuss the war in Iraq, when it was the first thing discussed at the meeting. The nominee for US Ambassador to the UN, Samantha Power, echoed Kerry?s conflict-escalating rhetoric in her confirmation hearings before the Senate Foreign Relations Committee.?Power?promised?to stand up against ?repressive regimes? and said that meant ?contesting the crackdown on civil society being carried out in countries like Cuba, Iran, Russia, and Venezuela.? While this rhetoric probably works with most Americans who have been?indoctrinated with falsehoods about Venezuela, her comments are in fact far from reality.? Reuters reports that President Maduro appropriately called on Power to retract the ?despicable? statement. The?Foreign Ministry of Venezuela put Power?s statements in context of reality?saying??her comments were ?interventionist,? and that the UN had often recognized Venezuela?s ?solid system of constitutional guarantees? that ensured its citizens? fundamental rights. ?By contrast, the whole world is constantly expressing its concern over repressive practices carried out by the?United States,? the ministry said. ?They include the violation of human rights at the illegal prison in Guant?namo, the killing of civilians by drones, and the lamentable persecution unleashed against?Edward Snowden.?? In fact, when the US threatened to remove ?preferential trade status? with Ecuador for its consideration of granting asylum to Snowden,?Ecuador withdrew?from the trade agreement and offered the $23 million it would lose from doing so to the US to use for human rights training. Snowden Highlights Hypocrisy at the Obama White House If the Secretary of State?s and UN Diplomat?s freak out wasn?t embarrassing enough, President Obama and the White House are now weighing in, in ways that highlight their panic and hypocrisy over Edward Snowden. The?New York Times is reporting?that President Obama is threatening to cancel a trip to Moscow to meet with President Putin this September. Obama will be in Russia for the G20 meeting, which President Putin currently chairs, but is considering canceling a one-on-one meeting with Putin because of his protection of Snowden. Jay Carney, White House spokesman made this statement about Russia: ?We call on the Russian government to cease its campaign of pressure against individuals and groups seeking to expose corruption, and to ensure that the universal human rights and fundamental freedoms of all of its citizens, including the freedoms of speech and assembly, are protected and respected.? Those comments coming from the United States, a country that has had?coordinated efforts to shut down dissent?in the US, with the Department of?Homeland Security,?FBI?and Federal Protective Service working with state and local police to arrest,?undermine?and shut down the Occupy Movement; a country that leads the world in mass incarceration of its own people; and, now we know, a country that spies on every American seizing our phone records and all of our Internet communications; cannot be seen as anything but hypocrisy. The hypocrisy of the White House was noted by Moscow, ?the talk of human rights rang hollow to the Kremlin given the Snowden case. Mr. Putin has suggested that Washington is being hypocritical in complaining about Russian actions while seeking to prosecute a leaker who exposed American surveillance programs.? Is silencing Edward Snowden more?important than the relations between the US and Russia?? Putin does not think so, but perhaps Obama does. Among the agenda items between the two countries are reduction of nuclear weapons and their differences over Syria.? What kind of signal will Obama send if he cancels his meeting with Putin?? ?Canceling the summit, announced in June, would deal a blow to Obama administration efforts to smooth relations with Russia,??says Roger Runningen at?Bloomberg. Bloomberg also reports two U.S. Senators, Republican Lindsey Graham of?South Carolina?and Democrat?Charles Schumer?of?New York, introduced a non-binding resolution urging Russia to turn over Snowden to the U.S. If it doesn?t, the resolution says Obama should consider recommending that the G-20 economic summit be held elsewhere. Does the US Really Want a Trial of Edward Snowden? Has the United States thought this conflict with Edward Snowden through?? Already they are damaging relations with two of the most important nations in the world, China and Russia, because they will not respect the sovereignty of nations or Snowden?s legal right to political asylum.? They are creating major conflicts with the countries of Latin America with threats to Bolivia and Venezuela and?uniting Latin American countries against the United States.? All of these actions expose US insecurity about their global spying program. But, do they really want a public trial of Edward Snowden?? The trial of Edward Snowden would be an international spectacle that would put the US on trial. Do they want the whole world to watch the US prosecute someone who exposed a global dragnet surveillance program?? President Obama has said we need a debate on this program, but how does that comport with prosecuting the person who started the debate? Former?President Carter said?the leaks are ?beneficial? to the United States and show the?US does not have a real democracy.? A trial will highlight the NSA spying program and do more damage to the United States? reputation. If the trial is limited by the courts so Snowden cannot present a defense of his actions, it will highlight the faults of the US justice system, further driving the reputation of the United States down in the eyes of the world, and among the American people. Snowden has proven that the US is conducting a dragnet surveillance program of the American people ? and the people of the world whether they are allies or perceived as enemies. When Jimmy Carter says this is ?beneficial,? he is saying it presents an opportunity for the US to correct its ways, rethink its national security state approach to foreign and domestic policy; and a chance to get the country on a different track that respects the constitution and human rights. President Obama and elected officials should seize this opportunity, rather than trying to seize Snowden. They should acknowledge the country has gone too far, announce special commissions to review intelligence and national security policies, and question the US Empire approach to foreign policy. It is an opportunity for Congress to get control of the national security state which has spied on judges, generals and politicians as well as citizens.? Snowden has created an opportunity for the complete rethinking of intelligence gathering ? the immense bureaucracy of the US intelligence state.? Do we really need for the NSA, CIA, FBI, Homeland Security and military intelligence activities conducted through a vast network of military-industrial corporate contractors? The US should let Snowden go to Venezuela, respect his right to political asylum and look in the mirror at itself. It?s time to rethink the US national security state which has obviously gotten out of hand and needs dramatic curtailment. The US Security State seems to be in a panic over Edward Snowden?s leaks.? Secretary of State John Kerry, along with UN nominee Samantha Powers, is threatening acts of war with Venezuela. The US has already violated international law by forcing down the plane of the Bolivian president. And now, President Obama is saying he may derail talks with Russian President Putin over Snowden. With every act the US Security State draws more attention to whistleblower Edward Snowden and the dragnet surveillance program he unveiled.? Every act is an act of self-destruction with their abuse of power showing signs of their weakness. Snowden struck a nerve with the security state.? The US likes to project an image of freedom and democracy but Snowden has proven the US does not have a real democracy and the people of the US are not free.? Snowden shows that the people of the United States have been lied to and the political leadership of the country does not respect our freedom, privacy or constitution. If Venezuela or Russia were proven to be recording every Internet post and chat, every piece of mail, as well as monitoring all telephone activity of its citizens, US politicians and corporate media?hacks like David Gregory?would be jumping up and down accusing those countries of being totalitarian. Of course, when Snowden shows the same is happening in the US, we hear approval from the bi-partisans in Congress and too many in the corporate media defend the US while?attacking journalists like Glenn Greenwald?for letting the truth out. It is clear now that the ?emperor has no clothes,? that our claims of democracy and freedom are fairy tales. The?US surveillance?state has over-reached and been caught. ?In the aftermath of Snowden?s revelations, it seems we are learning almost daily of new ways we are being spied upon. Which path will the US take: further invasions and repression or full accountability and respect for the Constitution and rule of law? The State Department Prefers Threats to Diplomacy Over Snowden Secretary of State John Kerry, who is proving to be a?hawk among hawks?in the Obama administration, is threatening Venezuela with what amount to acts of war. In a conversation with the Venezuelan Foreign Minister?Kerry reportedly ?threatened?to ground any Venezuelan aircraft in America?s or any NATO country?s airspace.?? He made it clear that the Venezuelan president could suffer the same fate as?Bolivian President Evo Morales.? Kerry also threatened that all 26 NATO countries would block the airspace of Venezuelan flights. And, he added additional threats, promising to revoke US entry visas to Venezuela for officials and business people associated with former President Hugo Chavez.? And, threatened the US would also begin to prosecute prominent Venezuelans on allegations of drug trafficking, money laundering and other criminal actions. Beyond that the Kerry warned that fuel supplies needed for the Venezuelan oil industry would be halted if President Maduro continues to offer to protect Snowden with political asylum. He is essentially telling Venezuela to expect a virtual economic blockade if they protect the whistleblower Edward Snowden. These are all quite embarrassing comments, showing the US flailing around using any threat they can think of to stop support for Snowden. They were so embarrassing that US State Department deputy spokeswoman?Marie Harf denied?that Kerry ever touched upon the possible nature of US response to Venezuela granting asylum to Snowden in his conversation with Foreign Minister Jaua. She dismissed the report that Kerry has threatened Venezuela as??utterly wrong.?? Kevin?s personal experience with Kerry leads us not to trust his spokesperson. When he worked with Ralph Nader in 2004 we met with Kerry and his spokespersons lied to the media saying we did not discuss the war in Iraq, when it was the first thing discussed at the meeting. The nominee for US Ambassador to the UN, Samantha Power, echoed Kerry?s conflict-escalating rhetoric in her confirmation hearings before the Senate Foreign Relations Committee.?Power?promised?to stand up against ?repressive regimes? and said that meant ?contesting the crackdown on civil society being carried out in countries like Cuba, Iran, Russia, and Venezuela.? While this rhetoric probably works with most Americans who have been?indoctrinated with falsehoods about Venezuela, her comments are in fact far from reality.? Reuters reports that President Maduro appropriately called on Power to retract the ?despicable? statement. The?Foreign Ministry of Venezuela put Power?s statements in context of reality?saying??her comments were ?interventionist,? and that the UN had often recognized Venezuela?s ?solid system of constitutional guarantees? that ensured its citizens? fundamental rights. ?By contrast, the whole world is constantly expressing its concern over repressive practices carried out by the?United States,? the ministry said. ?They include the violation of human rights at the illegal prison in Guant?namo, the killing of civilians by drones, and the lamentable persecution unleashed against?Edward Snowden.?? In fact, when the US threatened to remove ?preferential trade status? with Ecuador for its consideration of granting asylum to Snowden,?Ecuador withdrew?from the trade agreement and offered the $23 million it would lose from doing so to the US to use for human rights training. Snowden Highlights Hypocrisy at the Obama White House If the Secretary of State?s and UN Diplomat?s freak out wasn?t embarrassing enough, President Obama and the White House are now weighing in, in ways that highlight their panic and hypocrisy over Edward Snowden. The?New York Times is reporting?that President Obama is threatening to cancel a trip to Moscow to meet with President Putin this September. Obama will be in Russia for the G20 meeting, which President Putin currently chairs, but is considering canceling a one-on-one meeting with Putin because of his protection of Snowden. Jay Carney, White House spokesman made this statement about Russia: ?We call on the Russian government to cease its campaign of pressure against individuals and groups seeking to expose corruption, and to ensure that the universal human rights and fundamental freedoms of all of its citizens, including the freedoms of speech and assembly, are protected and respected.? Those comments coming from the United States, a country that has had?coordinated efforts to shut down dissent?in the US, with the Department of?Homeland Security,?FBI?and Federal Protective Service working with state and local police to arrest,?undermine?and shut down the Occupy Movement; a country that leads the world in mass incarceration of its own people; and, now we know, a country that spies on every American seizing our phone records and all of our Internet communications; cannot be seen as anything but hypocrisy. The hypocrisy of the White House was noted by Moscow, ?the talk of human rights rang hollow to the Kremlin given the Snowden case. Mr. Putin has suggested that Washington is being hypocritical in complaining about Russian actions while seeking to prosecute a leaker who exposed American surveillance programs.? Is silencing Edward Snowden more?important than the relations between the US and Russia?? Putin does not think so, but perhaps Obama does. Among the agenda items between the two countries are reduction of nuclear weapons and their differences over Syria.? What kind of signal will Obama send if he cancels his meeting with Putin?? ?Canceling the summit, announced in June, would deal a blow to Obama administration efforts to smooth relations with Russia,??says Roger Runningen at?Bloomberg. Bloomberg also reports two U.S. Senators, Republican Lindsey Graham of?South Carolina?and Democrat?Charles Schumer?of?New York, introduced a non-binding resolution urging Russia to turn over Snowden to the U.S. If it doesn?t, the resolution says Obama should consider recommending that the G-20 economic summit be held elsewhere. Does the US Really Want a Trial of Edward Snowden? Has the United States thought this conflict with Edward Snowden through?? Already they are damaging relations with two of the most important nations in the world, China and Russia, because they will not respect the sovereignty of nations or Snowden?s legal right to political asylum.? They are creating major conflicts with the countries of Latin America with threats to Bolivia and Venezuela and?uniting Latin American countries against the United States.? All of these actions expose US insecurity about their global spying program. But, do they really want a public trial of Edward Snowden?? The trial of Edward Snowden would be an international spectacle that would put the US on trial. Do they want the whole world to watch the US prosecute someone who exposed a global dragnet surveillance program?? President Obama has said we need a debate on this program, but how does that comport with prosecuting the person who started the debate? Former?President Carter said?the leaks are ?beneficial? to the United States and show the?US does not have a real democracy.? A trial will highlight the NSA spying program and do more damage to the United States? reputation. If the trial is limited by the courts so Snowden cannot present a defense of his actions, it will highlight the faults of the US justice system, further driving the reputation of the United States down in the eyes of the world, and among the American people. Snowden has proven that the US is conducting a dragnet surveillance program of the American people ? and the people of the world whether they are allies or perceived as enemies. When Jimmy Carter says this is ?beneficial,? he is saying it presents an opportunity for the US to correct its ways, rethink its national security state approach to foreign and domestic policy; and a chance to get the country on a different track that respects the constitution and human rights. President Obama and elected officials should seize this opportunity, rather than trying to seize Snowden. They should acknowledge the country has gone too far, announce special commissions to review intelligence and national security policies, and question the US Empire approach to foreign policy. It is an opportunity for Congress to get control of the national security state which has spied on judges, generals and politicians as well as citizens.? Snowden has created an opportunity for the complete rethinking of intelligence gathering ? the immense bureaucracy of the US intelligence state.? Do we really need for the NSA, CIA, FBI, Homeland Security and military intelligence activities conducted through a vast network of military-industrial corporate contractors? The US should let Snowden go to Venezuela, respect his right to political asylum and look in the mirror at itself. It?s time to rethink the US national security state which has obviously gotten out of hand and needs dramatic curtailment.