Because it happened in America, the trial of George Zimmerman for shooting and killing Trayvon Martin was all about race. And because it happened in America, the people who benefit politically from the same invidious forces that led both to Trayvon Martin?s killing, and the acquittal of his killer, will deny that race had anything to do with either the killing or the verdict. Suppose Trayvon Martin had been a 230-pound 30-year-old black man, with a loaded gun in his jacket. Suppose Zimmerman had been a 150-pound 17-year-old white kid, who was doing nothing more threatening than walking back from a convenience store to his father?s condo. Suppose Martin had stalked Zimmerman in his car, until Zimmerman became afraid and tried to elude him. Suppose Martin had gotten out of his car and pursued Zimmerman. Suppose this led to some sort of altercation in which the big scary black man ended up with a bloody nose and some scratches on the back of his head, and the scared skinny and unarmed white kid had ended up with a bullet in his heart. How do you suppose the big scary black man?s claim of ?self-defense? would have gone over with a jury made up almost entirely of white women?? But of course this is America, which means that the scary figure in this story is the skinny unarmed teenager, because in America pretty much any black male over the age of 12 in this sort of situation is going to be presumed? to be the ?aggressor,? the ?thug? ? in short,? the real criminal,? until he?s proved innocent, which he won?t be, even if he?s now a dead, still unarmed teenager. And his killer is a grown man who provokes a fight with an otherwise harmless kid, starts losing it, and then shoots the kid dead. Because this is America, pointing out that a black boy can be shot with impunity by a more or less white man because many white Americans are terrified by black boys and men is called ?playing the race card.?? The race card is what the people who benefit politically from the fact that many white Americans are terrified by black boys and men call any reference to the fact that race continues to play an overwhelmingly important, and overwhelmingly invidious, role in American culture in general. And in the criminal justice system in particular. Trayvon Martin was stalked by George Zimmerman because he was black. Trayvon Martin is dead because he was black. George Zimmerman was acquitted of killing Trayvon Martin because the boy Zimmerman killed was black.