JUDY WOODRUFF: And we come back to the Zimmerman verdict and some of the questions resonating in the wake of the decision. We get four views. Christina Swarns is director of the criminal justice practice at the NAACP Legal Defense and Educational Fund. Jelani Cobb is a contributor to TheNewYorker.com and director of the Institute of African-American Studies at the University of Connecticut. He has been writing on the trial. Jonathan Turley is professor of law at George Washington University Law School. And Carol Swain is a professor of political science and law at Vanderbilt Law School. We thank you, all four. And I want to ask each one of you the same question, starting with you, Christina Swarns. Was justice done here? CHRISTINA SWARNS, NAACP Legal Defense Fund: No. I think that?s quite clear. Justice wasn?t done. I don?t think you can say when a child is walking down the street, doing nothing wrong and buying candy and ice tea, and gets shot and killed in the street largely because he is African-American and there no one accountable for that death is justice. I think it?s quite clear that, no, justice wasn?t done in this case. JUDY WOODRUFF: Carol Swain, how do you see it? Was justice done? CAROL SWAIN, Vanderbilt University: I think our legal system worked the way it was supposed to work and that there are many facts about the case that?s not being discussed in the media because it doesn?t fit with the race agenda. JUDY WOODRUFF: Well, we can get to some of those factors that you think are not being discussed in just a minute. But, let me ask you, Jelani Cobb, do you believe justice done? JELANI COBB, contributor to TheNewYorker.com: Absolutely not. I don?t think justice was done. We do have this right, the right to ? Fourth Amendment right, freedom from unconstitutional search and seizure, which we generally think applies to the police, but what we have in Florida is a state of affairs where people have effectively been deputized in light of this verdict to stop African-American youth anywhere under any circumstances and demand to know what they?re up to and what they?re doing and possibly at the penalty of death. JUDY WOODRUFF: And, Jonathan Turley, hearing what the other three have said, how do you answer the question? JONATHAN TURLEY, George Washington University: I think the problem is that this case has become a vehicle for issues that go far beyond what happened in the courtroom. I think when we talk about justice, we are talking about often overriding questions of race in America and these issues that have been unresolved for decades. But if you look at justice as to whether due process occurred, whether a fair trial occurred, the answer I think is clearly yes. This isn?t Scottsboro 1931 Alabama. This was a determined prosecution. Many people felt were ? actually overplayed the case to try to get a conviction. I think it was a fair trial. And the result I think was predictable. JUDY WOODRUFF: Christina Swarns, pick up on that and size up for us the ? whether you think the prosecution did the job that it should have done in handling the case. CHRISTINA SWARNS: Well, I would want to first pick up on the point that was just made. You know, it?s quite clear that Mark O?Mara did a good job representing his client. He obviously out-lawyered the prosecution in this case. So, in that regard, the outcome is predictable. And with respect to what the prosecution did in this case, I think there were several serious errors made, the first being that it allowed ? it was ? the issue of race was taken out of the courtroom and then ultimately, in closing, said that it wasn?t a question of race in this case. And I think that was a significant error and a significant false fact, really. The second thing I would point out is, you know, the jury selection in this case, I don?t understand how the prosecution believed that a jury of six white women was going to be favorable to its case against Mr. Zimmerman. So I think that was another error. Several of the witnesses that they presented clearly appeared to be unprepared or underprepared to present a strong case against Mr. Zimmerman. So I think there are a lot of issues and errors in terms of how the prosecution handled this case. JUDY WOODRUFF: Carol Swain, how do you see that, what the prosecution did and whether mistakes were made? CAROL SWAIN: I think that everything was set up to be favorable for the prosecution, and that the six women were selected because it was assumed that they would be favorable, and at times it seemed as if the judge leaned towards the prosecution. So, I think that there was a fair trial. It probably wouldn?t have been brought to court at all if ? certainly, race was always a part of it. So there?s no way to pretend that it wasn?t about race. It was always about race. If it had been the same case involving two black men or two white men, it wouldn?t be national news. And so it was racialized from the very beginning. If we had focused on the fact that this was a confrontation between two ethnic minorities that tragically ended in a death, we wouldn?t be here discussing it right now. JUDY WOODRUFF: Well, to you, Jelani Cobb, on that point about whether race was clearly a part of this trial. We know the judge said at the outset that the attorneys were not to use the term racial profiling. JELANI COBB: Right. If I can just respond to Carol Swain?s previous point about this being racialized, as opposed to race actually being an integral element of it from the beginning, one, there is the case of Marissa Alexander, which some people may be familiar with, who was in a situation where ? a domestic violence situation, she fired a warning shot and has been sentenced to 20 years, despite the fact that she deployed a stand your ground defense. And so ? also, had this been two white men or two black men, it?s doubtful that it would have required 44 days before someone was actually investigated or there were charges brought. And, so, no we can?t escape ? and finally the fact of the matter is, Mr. Zimmerman had called the police 46 times in previous six years, only for African-Americans, only for African-American men. And so if we just look at who he thought was suspicious, and if this was a kind of arbitrary element of calling, since 20 percent of that population of that subdivision is African-American, what his problem seemed to be was with the presence of African-Americans there, not with the presence of crime, or the incapacity to differentiate between African-Americans and crime. JUDY WOODRUFF: Carol Swain, you want to pick up on that point? CAROL SWAIN: Unfortunately, unfortunately, if you look at the crime rate of African-Americans, it works against blacks. And it bothers me a lot that we?re not talking about the black-on-black crimes that are taking place in urban cities. We should be concerned about the young men that are dying across America. And the civil rights community ought to be out there marching in those communities, demanding that something different be done. JUDY WOODRUFF: What about that point, Christina Swarns? CHRISTINA SWARNS: You know, with ? I obviously agree. Young black men shouldn?t be getting killed across this country. But what happened in Florida to Trayvon Martin was that Mr. Zimmerman looked at him walking down the street with a bag of Skittles and a bottle of iced tea and determined that based on factors that he could see this young man was a criminal. He warranted a call to the police, he warranted being followed, he warranted being followed ? Mr. Zimmerman getting out of his car and following him down the street on foot, notwithstanding the fact that the police department told him not to get out of the car, and notwithstanding the fact that everyone agrees that this young man was doing absolutely nothing wrong. There was nothing criminal about what he was doing. There was nothing apparently criminal about what he was doing. The only thing ? CHRISTINA SWARNS: ? about him was that he was black. CAROL SWAIN: We know from other evidence that the school had apprehended him and found jewelry. CHRISTINA SWARNS: Mr. Zimmerman knew none of that. Mr. Zimmerman didn?t know a single thing about that. All he knew at that moment was that Mr. ? he didn?t know anything about this child. This was a teenager walking down the street. CAROL SWAIN: Well, it certainly doesn?t justify the murder. JUDY WOODRUFF: All right, we?re not going to be able to rehear the case here. So, we hear that both of you have a different perspective. Jonathan Turley, do you want to comment on what they have just been going back and forth on? JONATHAN TURLEY: Well, think it?s indicative of how much has been piled on this case. What was striking on this case is how people looked at the same events and came away with surprisingly different views in terms of how effective witnesses were. I think this case was fatally undermined by Angela Corey when she overcharged the case and made it a second-degree murder case. If she had gone with manslaughter, it could have come out differently. I think that was a major legal flaw, a bad decision, because the evidence just didn?t support it. And it got worse and worse for the prosecutors. They led with a very weak witness who was conflicted and gave testimony that worked heavily towards Zimmerman?s favor. JUDY WOODRUFF: Let me try to broaden this out. Jelani Cobb, does this verdict speak in any way to the ability of minorities in this country to get a fair trial? JELANI COBB: Well, I think this verdict doesn?t tell us anything about race and the justice system that we didn?t already know. And what?s disturbing about this is, you know, regarding Professor Swain?s previous comment, is we have said that the amount of crime in African-American communities somehow or another works against someone, that?s endorsing the very logic of racism. Like, no amount of white crime would allow us to simply make a blanket prima facie assumption that a white person is a criminal. And so each individual is supposed to be regarded on their own merits. I thought that is what was key to the Constitution and its guarantee of individual rights. And so in endorsing this kind of profiling, this kind of blanket profiling, the only thing that we will be guaranteed of is more incidents like Trayvon Martin?s tragic death in the future. JUDY WOODRUFF: Jonathan Turley, you?re shaking your head here. JONATHAN TURLEY: No. Where I disagree is, is that once again, we seem to be detached from what the evidence was. This jury at the end of this process knew nothing more of what happened at that fateful night than at the beginning of the trial. There were no witnesses to tip the balance. Essentially, the situation was in equipoise. You had two narratives that had support from different witnesses. The jury is not there to make a guess and it?s certainly not there to make social judgment calls. They didn?t have enough to convict. And I know people are frustrated by that. But the system worked. This was a fair trial. JELANI COBB: May I please respond? JUDY WOODRUFF: Yes, go ahead. JELANI COBB: Well, so this wasn?t a situation of equipoise, because the fact of the matter is, whatever the conflict was, it was precipitated by Mr. Zimmerman. The police ? the dispatcher told him not to get out of his vehicle. He proceeded to get out of his vehicle. This is a person who followed someone by car and on foot. And if there was a conflict, if there had been a physical conflict that evolved out of that, it would have been because Mr. Martin felt threatened, which is a justifiable, reasonable presumption. If anyone is walking down a dark street at night in the rain and someone has followed them in a car and on foot, you might presume that you are actually at risk. And so if Trayvon Martin struck him first, if Trayvon Martin struck him numerous times, this would be the action of somebody who reasonably feared for his life. JUDY WOODRUFF: We?re going to let Jonathan Turley respond. And then I have a final question for all of you. JONATHAN TURLEY: Sure. Mr. Cobb, where I disagree with you ? and we can?t say that the jury believed Zimmerman or even liked Zimmerman in this decision. They simply didn?t have enough to convict Zimmerman. But the actions you described were legal. He?s allowed to get out of his car. He?s allowed to follow someone. He?s even allowed to be armed. And I think that people are investing so much in the case that they don?t recognize that these were lawful acts, and you have to presume things in this case that a jury?s not supposed to presume when there?s a presumption of innocence. JUDY WOODRUFF: I want to come back to all of you with this final question, starting with you, Christina Swarns. Should the are civil grand jury pursue a case now against George Zimmerman? CHRISTINA SWARNS: I believe that they should. I think there?s a lot of focus on ? we can pick and pick apart this trial. And we can say this happened and this didn?t happen and this went well and this didn?t go well and the justice system worked. But you know what? The truth of the matter here is that a young ? innocent young man was shot dead in the street and no one has been held accountable. And whether or not there was a fair trial in the terms of the structure of the law, that is not justice. It may have been a fair trial, but that is not justice. And so I think there needs to be a further review. And we need to think about whether the system is working if this is a fair outcome in the four corners of our justice system. And so I certainly believe that the federal government should look at it and see what its laws provide, whether, for example, the Matthew Shepard-James Byrd Hate Crime Act provides an opportunity for further federal prosecution in this case, because whether or not that trial was fair under the law, justice wasn?t done in that case. JUDY WOODRUFF: Carol Swain, should the attorney general pursue a civil case in this matter? CAROL SWAIN: Absolutely not. The state has tried the case. We have the rule of law in this country. And the attorney general shouldn?t pick and choose, and when there?s an outcome that doesn?t fit the political narrative of the day, where people have been racialized, they shouldn?t jump into that and stir the pot. They should be educating people about the criminal justice system. They should be educating people, not stirring the pot. JUDY WOODRUFF: We are going to leave it there. But we want to thank all four of you for joining us, Carol Swain, Christina Swarns, Jelani Cobb, and Jonathan Turley.