Organizers of Monday?s downtown rally in front of the Hennepin County Government Center estimated the peaceful crowd of all ages and ethnicities at between 3,500 and 4,000 people. ?I?m supposed to be here with my people, elbow to elbow and cheek to cheek, side by side,? proclaimed local poet Tish Jones, who was among a host of speakers addressing the crowd before marching down South Sixth Street to Hennepin Avenue and returning to the Center. Another protest is scheduled for Saturday as part of a national day of protest over the Zimmerman verdict. For more information about Monday?s demonstration, go to the MSR website at www.spokesman-recorder.com. Similar marches are being held all across the country. And despite last weekend?s jury verdict, the national NAACP has requested that the U.S. Justice Department resume its investigation in the Trayvon Martin murder case. After the not-guilty verdict was handed down last Saturday, over 100,000 persons signed within a 90-minute span an NAACP petition that the organization posted on its website. ?The Department of Justice can still address the violation of Trayvon?s most fundamental civil right ? the right to life ? and we are urging them to do so,? declared NAACP President Ben Jealous after the trial that lasted three weeks. The trial, which consisted of nearly 60 witness testimonies and 16 hours of deliberations, took place over a year and a half after Martin was killed in February 2012 by Zimmerman, who claimed self-defense. The debates that took place on news shows, websites and social media about the trial before the verdict was usually split along racial lines. ?This is about lynching a White man,? wrote someone on the Detroit News website. Zimmerman was brought up on trumped-up charges because the State was afraid the ?African American Community? was going to riot.? Former federal prosecutor Pamela Pierson, now a University of Alabama law professor, pointed out on NPR?s Tell Me More that race ?permeates the case?from the very beginning.? Still, when the Zimmerman not-guilty verdict came down last weekend it elicited ?same old story? comments mixed with angry emotions, mainly from Blacks. ?A price of a Black life still means nothing,? said a Black woman to Joe Madison, who broadcast a two-hour show Saturday night on Sirius XM satellite radio. Madison?s broadcast was carried live immediately after the verdict. The host invited his mostly Black listening audience to call and express their raw emotions. Pretty much everyone who got on the air was in agreement: Justice again was denied when it comes to Blacks in this country. As expected, the social media also was on full alert: ?I am just disgusted,? tweeted a Sanford, Fla. resident. ?Zimmerman had no other option but to shoot,? claimed a person who commented on the Orlando Sentinel?s website. Several NBA athletes tweeted as well: ?Someone make sense of this verdict for me right now,? wrote Dwyane Wade. ?[The verdict] sets an ugly precedent,? said Nazr Mohammed. ?Living in a world where [if] you fight dogs, you could lose everything. If you kill a Black man, you?re not guilty,? observed Stevie Johnson. ?American justice system is a joke,? commented Kendrick Perkins. Among the notables who also called in to Madison?s show Saturday night were NAACP Chair Roslyn Block and Rev. Jesse Jackson. ?This is old-style justice,? said Jackson, who argued that finding Zimmerman legally not guilty does not make him innocent, because he did in fact kill Martin. ?I know I am not alone in my outrage, anger and heartbreak over this decision,? added Jealous. ?When a teenager?s life is taken in cold blood, and there is no accountability for the man who killed him, nothing seems right in the world.? At Black churches on Sunday, the Zimmerman verdict was discussed as much as the sermon. No one was in a forgiving mood. At some churches, the verdict was the subject of the sermon: Rev. Brian Herron, pastor of Zion Baptist Church, told the MSR he ?preached about [the racist U.S. justice system] and basically talked about that this is the time for us to come together as a community, and to continue the fight for struggle for justice.? Personally, when the news was announced, this reporter was almost anesthetized to the outcome. I didn?t expect a different result, nor did many others who basically conducted a parallel trial that had Zimmerman tried, convicted, and measured for prison togs. Sadly, it?s a ?What do you expect?? type of feeling that most Black men share in this country, an ever-present fact that no White person in this country can appreciate. It?s the painful reality that a Black father lives with and a Black mother forever fears: Your Black male child could be shot and killed for doing nothing at all. ?It?s open season on Black boys,? declared Center for American Progress? Alisa Moodle-Miles on MSNBC Sunday. ?Young Black men don?t get the benefit of the doubt,? added The Blaze?s Amy Holmes on the same cable program. This was the case for Trayvon Martin, who was born Black and male, who wore the wrong clothing, and who unfortunately took a walk on the wrong side of town. He was on trial instead of Zimmerman, who was cleared by one of America?s most basic judicial institutions ? a jury of his peers. The jury members all came from the same Sanford community as the defendant and, if pressed, probably shared Zimmerman?s views about Black teenagers who are seen as persons up to no good. They didn?t pull the trigger because one of their own did it for them. ?It?s been a very painful trial to watch,? admitted St. Paul NAACP President and local lawyer Jeffry Martin. ?Not only because of the event that led up to this man being charged, but to see how the justice system can be manipulated.? Martin as a practicing attorney noted that a defense attorney often must do whatever it takes to defend a client, even if means putting the victim on trial, as was the case when Zimmerman?s lawyers seemed successful in portraying Trayvon Martin as the bad guy in order to win an acquittal. ?Some of the things that were done [during the Zimmerman trial] were right on that line of ethics. It was more a show than a trial,? believes the St. Paul lawyer, who added that the evidence seemingly pointed to the defendant?s guilt. However, the jury didn?t see it the same way. ?If they turn their backs on this young man and his life, they?re basically turning their backs on our whole generation,? Martin said of the tragic death of Travyon Martin on February 26, 2012. He?s this generation?s Emmett Till, the Black teenager who, while visiting his relatives in Mississippi, was killed in 1955 supposedly because he looked at a White woman. ?This is a young man that all of our kids have identified with.? Even sadder is that now a new expression has been added to the national lexicon: Racial profiling is now ?being Zimmerman.? The NAACP petition can be found at http://www.naacp.org/sign-the-DOJ-petition. Charles Hallman welcomes reader responses to challman [at] spokesman-recorder [dot] com. Related stories: