Fourteen-year-old Abryana Cohen started crying softly when she told me her age and I commented that she?s around the same age as Trayvon Martin, who was killed by George Zimmerman last February and whose memory was paid tribute to Monday evening at a protest in the People?s Park outside the Hennepin County Government Center in downtown Minneapolis. ?I?ve got four little brothers, and I don?t want this to happen to them,? said Abryana, sitting with her mother, Lashonda, as speakers screamed for justice in the wake of Zimmerman?s acquittal ?on Saturday. Two or three thousand people filled the square for the ?Hoodies Up!? protest ? so-called for Martin?s vilified choice of clothing the night of his shooting?and organized by MN Neighborhoods Organizing For Change?? and then marched through the streets of downtown Minneapolis chanting ?No justice, no peace!? A sign draped over the top of the government center read ?Prisons = Slavery,? as little African-American boys holding signs festooned with photos of Martin and ?This is going to be me next? walked alongside little African-American girls holding signs that read, ?End racial profiling now.? Speakers at the rally called for an end to racism and police harassment, and justice in the name of Martin and Terrance Franklin, the young Minneapolis man who was killed by a SWAT team in the basement of an Uptown home after a chase last spring. On the minds of all concerned was the future of how we get along: MinnPost photo by Jim Walsh Branden Moss, Minneapolis. ?It doesn?t feel right that African-American teenagers can be murdered, without any consequences. It?s really different in Florida, because the law there says that someone can provoke you and you can kill them in self-defense, and that?s not right.? MinnPost photo by Jim Walsh Regina Cuellar, Asa Edwards, Kaos Edwards. ?If this was a small white boy walking through a predominantly black neighborhood and it was a black man who shot him, I think it would?ve been a whole different verdict,? said Asa. ?We?re here to stand for him, because we have a son right here who is wearing a hoodie, and he is Trayvon Martin. We had a son in Trayvon, and someone took him from us, and all we got is a ?not guilty? verdict and George Zimmerman is free to go. I mean, if that was our son, who would stand for us? We want to stand for something. We want to stand for him.? MinnPost photo by Jim Walsh Sarah Northrup, St. Paul, Mindy Mattson, Shoreview, and Curtiss DeYoung, Minneapolis. ?I think this kind of crime affects all of us,? said DeYoung, a professor who teaches reconciliation studies at Bethel University. ?This is about Trayvon, but it?s about a much bigger issue in our society, which is the ability to talk about race and how to talk about it and how it affects people.? ?My liberation is tied up with people who are being discriminated against,? said Northrup, ?and it?s a direct result of institutionalized racism, and it?s not just one instance, this is happening all over America and it?s a systemic issue that is not being addressed and is just starting to come to light right now, and it?s a time to mobilize and live together.? MinnPost photo by Jim Walsh David Pierre, Minneapolis. ?The legal system made it look like homicide is legal. Homicide has just been legalized in America, that?s what it feels like. I?m just being honest.? MinnPost photo by Jim Walsh Abryana and Lashonda Cohen, Minneapolis. ?It?s like Trayvon?s life was just worth nothing,? said Lashonda. ?Racial profiling and stuff like that, it seems like it?s never gonna end. When I go to the store, the security guards always watch me like they don?t watch other people, and it gets old.? ?It was kind of disappointing that Zimmerman wasn?t found guilty, because I have four little brothers and I wouldn?t want that to happen to any of them,? said Abryana. ?Like, how would it feel to lose one of my brothers? That?s the position I put myself in. It just brought me to tears, the case of it, and it?s kind of sad that we get no justice whatsoever.? MinnPost photo by Jim Walsh Larisa Garski, Shoreview, Cicely Kaul, Afton, and Cameron Snyder, St. Paul. ?We?re cousins,? said Kaul. ?It?s important for us to be here today because we think that an injustice has been done. We?ve been following the case the whole time and we just feel like it?s something we need to stand up for because Stand Your Ground is a horrible law and we?re a family so we decided to come out here as a family and protest.? MinnPost photo by Jim Walsh Robert and Tamara Lyles, Minneapolis. ?I think Trayvon was killed for the color of his skin, and I think justice needs to be served and George Zimmerman needs to be found guilty of something. Hopefully we can get some kind of civil suit going to prosecute him with something.? MinnPost photo by Jim Walsh Jack Stoltz, Bloomington, and Peter Olson, Bloomington. ?I just have slowly begun to see the massive amount of racism that?s present in America, and this case really shows it, and the verdict shows how the legal system is tilted to the whites,? said Stoltz. ?It?s probably happened before,? said Olson, ?but this is the first trial I?ve ever paid attention to, and I thought it was strange that George Zimmerman was on trial, but the only person they ever seemed to talk about was Trayvon Martin. It just seems weird that the person who was murdered was the one that was on trial.? MinnPost photo by Jim Walsh Kristina Gronquist, Minneapolis. ?I?m running for City Council, the 3rd Ward, endorsed by the Green Party, and I knew Terrance Franklin personally. He was a good friend of my daughter?s, he went to Marcy Open School, he grew up in my neighborhood. I?ve been strong in this campaign for Terrance since the beginning, because it?s a totally unacceptable killing. The police let the situation escalate to the point where they needed to put a SWAT team in the basement of a house? I believe it was an execution, and we need answers.? Photo for Minnpost by Gretchen Seichrist ?My name is James Holyfield from the planet, I?m a natural human being. This is cold-blooded, because everybody on the jury could hear the tape. The dispatcher is telling him, ?Back off. Slow down. We?re going to meet you over there, don?t follow him.? How can you hear that tape and not find him guilty? The kid was a child, and he didn?t have a weapon, so there?s no need for him to follow him. But he was the lone gangster. He was angry. He was an angry assassin, looking for somebody to kill.? Photo for Minnpost by Gretchen Seichrist Jesse Phenow, Richfield, Caden Sager, Minnetonka, and Josh Phenow, Richfield. ?I wanted to show support for Trayvon and his family,? said Jesse, ?and make an act of denying and challenging my privilege as a white male; someone who benefits from the system in a variety of different ways.? ?What happened to Trayvon Martin was a damn shame, and we need to make some changes,? said Sager. ?I came here today to be in solidarity with young black males my age that are often targeted off of looks and skin,? said Josh. ?I walk the streets and I don?t have to think twice about someone finding me suspicious or a police officer stopping me.? ?If this was a small white boy walking through a predominantly black neighborhood and it was a black man who shot him, I think it would?ve been a whole different verdict,? said Asa. Asa, that is not what happened in the Zimmerman-Martin case. After the evidence was presented in a lengthy trial televised to the nation, a jury determined that the 17-year-old, 5-11, 160-pound Martin attacked the neighborhood watch volunteer Zimmerman, threatened to kill him, and began pounding him unmercifully as he screamed for help until he had no choice but to fire his gun for his own safety. Even the liberal legal commentators conceded during the trial that the prosecution's case was weak. This was an instance where the liberal media and their allies saw an opportunity to discredit a Florida gun law they did not like, as well as advance the impression of racial injustice that caters to their most reliable constituency. They created political pressure for the charges to be brought. Thankfully, because of the evidence and the jury system, their despicable strategy backfired. Yeah, all white and Hispanic women, not men, and it seemed to me in the one jury interview I listened to, that the lawyers on both sides seemed more interested in who was going to take care of her pets, than in her opinions on, say, the Stand-Your-Ground law. The law which, by the way, does NOT cover leaving your car and provoking a person into an attack. In all the interviews I've heard since, the racism is so ingrained, so entrenched, nobody even seems aware that they're doing it. They've gotten used to thinking of seventeen year old black boys yes, I said BOYS as men, capable of rational decision making when confronted by a grown man who, incidentally, outweighed the kid by a good thirty pounds, so Trayvon's height and weight are not particularly relevant. Mr. Zimmerman had plenty of choices that night. He could have chosen to stay in his car, as he was instructed by the dispatcher. He could have chosen not to let his blind hatred of the *******s who always get away with it drive him. He could have stopped chasing Trayvon when he lost sight of him. he could have, but he didn't. You may not like to admit it, but the whole incident--regardless of the jury's determination of criminal liability--was Zimmerman's fault. He provoked the fight. If he had just stayed in his car after he reported the hoodie-wearing marauder to the police, like he was supposed to do, the incident would never have happened. If he had walked away when he couldn't see him anymore, there would have been no problem. The reliable constituency you sneer about we know who THEY are, right? Not that race has anything to do with it are justifiably upset. The travesty is not Florida's gun law Did anyone mention that? What is it about guns that makes a person see threats so readily and clearly? . The travesty is that the whole incident was going to be overlooked. walking home in FL being followed by a large man in a car, then stalked on foot, scared out of her wits, in unquestionable fear of her safety and life, and as he reaches her she turns and delivers a martial arts kick, and then looking prepared to deliver another one, the stalker in turn fears for his safety and life from this young woman who has potentially deadly hands and feet. Now realizing she could literally kick the crap out of him, and she is clearly hopped up on adrenalin and in fear of her life, her heart in the right place as there'd been a rape in the area recently, and she's prepared to avoid being overtaken by this creepy guy with an offensive kick start, is he then justified in using excessive force with her, and allowed to pull his weapon and shoot her to death to ensure she cannot further hurt or kill him? Would she have gotten what she deserved for striking him? Are we all able to pick any fight in public, create fear, antagonize and threaten their lives, and once the other party angrily stands up and we realize they are bigger and stronger and we will be on the losing side of a struggle that appears to be imminent, and we're now in fear of bodily harm or death for what we have just said, justified to use a firearm for the fear of safety at that moment? The conversation, sadly should almost go like this, You're 14 now so we are going to get you a conceal and carry license. If you ever feel like a car is following you, and then the driver comes walking towards you, shoot him. We are in a stand your ground state and you have no duty to retreat. If you don't shoot him, this individual may confront you and later claim that at some point during the confrontation, your right to self defense transferred into his right to self defense. Let's just off strangers who are coincidentally in the same area we are. We don't need to know what they're doing, or if they're even a threat to us. You need to shoot. Never mind basic strategies like removing yourself from a place you feel threatened, Never mind that this advice might escalate the situation, because the stranger might be packing and might be threatened by you. We are in a stand your ground state, and we should all be willing to kill, or to die with our boots on. That's not the kind of injury that gives you a few scratches. That's the kind of injury that gives you a severe concussion or even kills you. Furthermore, let's do a thought experiment. Let's just assume that Zimmerman's story is true and that Martin really was on top of him, pounding his head into the pavement. All right, how does he react? You'd think that his first reaction would be to push his assailant away with his arms. Certainly that would be the sensible thing to try before reaching for one's gun. Well then, how does Zimmerman go for his gun if his arms are restrained? Unless he has a freakily flexible radius and ulna, I can't see it. Apologists have used all kinds of excuses--that Martin was high on marijuana which would make him slow and apathetic, not aggressive--have these people ever seen anyone high on marijuana? , that he was more muscular than Zimmerman, that he had been in fights with other teens. They want to turn Trayvon Martin into the thug of Zimmerman's imagination. They want to portray Zimmerman as in fear of his life. Did it ever occur to them that Martin was in fear of his life--justifiably so, it turns out. Now some have noted that the neighborhood had suffered robberies committed by black youth. So a random black youth minding his own business is a natural born suspect ? If the perpetrators of the robberies had been known to be white, would Zimmerman have taken off after a white youth walking home wearing a hoodie?