Many people are trying to make sense of a case that sparked a national conversation on race and gun laws. Longtime civil rights leader Rep. John Lewis, D-Ga., said in a statement he was ?deeply disappointed by the verdict? and that it seemed to ?justify the stalking and killing of innocent black boys and deny them any avenue of self-defense.? The NAACP was, coincidentally, holding its annual conference in Orlando as the verdict was announced Saturday night in nearby Sanford, Fla. Dominique Tuggle, who was attending the conference, said: ?A completely innocent verdict was the last thing that I thought the jury would come back with, so it was shocking and very upsetting. I couldn?t bring myself to watch the news or to go on any social media networks.? Wes Hall, another conference participant, pointed out that juries often hear things the public isn?t privy to: ?We don?t know all the evidence. We can watch the trial, but when you get in that deliberation room and all those facts are laid out in front of you, that?s when the true justice happens. And it?s not over. Just because we have a verdict now does not mean that this story is over.? Granted the evidence, this case should have never been brought in front of a court. Zimmerman followed the exact protocol taught to us, by police officers, in our carry permit classes during and after the shooting: He shot and killed the suspect so there wouldn?t be an opposing testimony later on; he holstered his gun directly after the incident; he did not tamper with any evidence; and he maintained that he was justified in using deadly force after the incident. Fortunately or unfortunately, his testimony was supported by forensics found at the scene. Agree with it or not, that is the protocol and it worked out in his favor. A small background to the justifiable use of deadly force: It is when there is an imminent threat of either death or great bodily harm. What is key here is that great bodily harm is legally defined as anything that can cause major organ damage. For example, if someone is wielding a baseball bat, then the THREAT alone would be enough to justify the use of deadly force. The act of swinging it does not need to take place in order for it to be considered a justifiable shooting. For the Zimmerman case, having his head allegedly slammed against the pavement is more than enough reason to justifiably shoot the attacker; as this could create great bodily harm. In legal terms, the state never had a case against him beyond a reasonable doubt. Now what happened prior to the shooting is important as well; but again, granted the evidence and Zimmerman?s statements, he cannot be contested beyond a reasonable doubt without a credible witness or victim to testify against him. It is certainly not illegal to follow a suspicious individual while on the phone with a 911 operator; although, I think this incident shows exactly why it wouldn?t be advisable if you are in fact a gun owner. The bottom-line: this was just a horse and pony show to appease public outcries which was initiated by misinformation from media. Pat yourselves on the back NPR; I read your non-sense as this case went on? You preach responsible media reporting, but you couldn?t have been more premature than a 14 year old boy looking at a nudie magazine for the first time. To satisfy your question and to clarify?. if an unrecognized individual is roaming around a gated community at night? it is easy to deem that person a suspicious individual. He doesn?t need to commit a crime or be black to be deemed suspicious. Now what started the fight is unclear? that is why I said either fortunately or unfortunately the forensics supported Zimmerman?s testimony. I am not bold enough to pick a side when you, me, nor anyone else has a clue what happened. The only two people that knew that are the shooter and the victim. Granted the evidence.. Zimmerman followed the protocol legally; he could show a justifiable need to use deadly force; and his statements were supported by the forensics.. ?Isn?t that why we have police?? Absolutely. This is a gray that all gun owners undertake though; and any permit class worth its grain of salt would go through several mistaken-identity ?don?t shoot? scenarios. The last thing anybody wants to do is to shoot another permit holder due to brash judgment, an innocent person, or god forbid the victim in an ongoing crime/assault. But within this case; none of us can make a credible leap from the facts given to who/what actually initiated that fight. Perhaps Zimmerman was lying that he got attacked, perhaps not. I can definitely give you moralistic and legal answers to either scenario, but both are speculative and highly irresponsible for any of us to base our outrage over. This is where the District Attorney and the media dropped the ball; and they did it for political reasons and monetary reasons. You know as well as I do that no MSN network would keep me on week after week saying ?I am not going to rush to judgment until the facts come out.? There is no chaos in that, there is no divisiveness.. it?s boring.. change the channel. I will say this though, and I have argued it from the day that I got my permit: We need clearer laws for carry permit holders to abide by, in order to alleviate the gray areas, for a lawful shooting. I am not nearly as familiar with Florida laws as I am with Minnesota?s, but even here we have a lot of gray area when it comes to a justifiable shooting. Case-in-point: Minnesota is technically a ?No Duty to Retreat? state when it comes to self-defense or residing in your own home. BUT, there are 3-4 cases where this defense did not stand up in court? so it is a gray area without our state. Because of this; I would personally air the side of caution; but it is something that needs to be eventually be cleared up within our state laws. I would urge everyone who is legally qualified to go out and get attempt to get a permit to carry; or at least get acquainted with the laws in our state; because then you would not only understand the laws and have a greater vestment in this debate, but you would also understand the responsibility that those of us who do choose to carry go through. We aren?t bad people who are gung-ho about fighting crime? I am a scientist not police officer.. we were told from day 1 to expect to be put under scrutiny or expect to be at the very least be sued if you ever discharge that weapon at someone. This is serious matters; and very few of us take that lightly. Minnesota is a no duty to retreat, but once the threat no longer exists, that duty is absolute. If, as a permit holder, you continue to advance even after the threat has passed, you are liable. My outrage comes from the law in Florida, not that the jury acquitted. That someone could use deadly force, absent any evidence of a crime is an abomination. That someone can claim, absent evidence, that a young man, doing nothing illegal can be gunned down, because as Zimmerman told the police ?Fucking punks. These assholes. They always get away?. Before conceal and carry, we were allowed to defend our residences with lethal force. After conceal and carry, we are allowed to defend ourselves, anywhere, with lethal force. The difference in immense, and was not particularly discussed when conceal and carry fever was sweeping the nation. People who are disappointed about the Zimmerman verdict should have been paying more attention a few years ago, or should rally around revisiting the whole conceal and carry thing. Zimmerman was found ?not guilty? because the Stand your Ground law in Florida allows armed vigilantes to follow, confront, and kill others they deem a danger to themselves or their neighbors. This same type of law was passed by a Republican Legislature and fortunately vetoed by our Minnesota Governor, Mark Dayton. One thing is for sure; I won?t be visiting Florida or any other state that has these racist laws on their books. These are not states I want to visit, vacation in, or do business with. These laws remove the most fundamental civil right from an individual: the ?right to life.? Trayvon was targeted not because of his behavior, which was walking through a gated community, but because he was a black man walking through a gated community. These laws allow bigots to target their victims, follow or pursue, and shoot dead the one witness which would tell a very different story. This is pretty much the sad history of many parts of our country that once practiced slavery, a racist institution. The national press?Star/Tribune et al?and national TV news should be arrested for fomenting racial violence and chaos following the Zimmerman verdict. They?ve been at it for months. Every specious exhortation to discourage rioting is really a not-so-subliminal call to riot. This case has become a media-led circus where the race card can be played over & over by the usual race baiters until Z gets strung up. If it were reverse?Zimmerman on top of Martin, MMA-style, who then shot Z?self-defence would be obvious and there would have been no trial. And the attorney general and his boss are equally guilty of spending tax dollars to bus protesters to Florida a year ago to pressure local authorities to charge Z despite evidence that didn?t justify charges. Finally, if Obama had a son, he might well have looked like Zimmerman since Obama is as white as he is black, though he never identifies with that side of his family; if he did, what a different country we might be living in. You can either have an even handed Justice System or you can have vigilante sanctioned lawlessness which promote gun sales with ?Stand Your Ground.? This ALEC ?law? was promoted by Republicans and hawked by the NRA with their typical fear and loathing for the sole purpose of increased gun sales. It worked. It also yielded increased funerals. Not so ironically, individuals pleading Stand Your Ground in Court usually have a significant criminal background involving violence. The same judge that presided over Zimmerman?s trial, sent an African American woman to prison for 20 years for firing warning shots into the air to warn off her abusive ex-husband who she had a restraining order on. She pleaded Stand Your Ground but apparently there is an African American clause in there somewhere. the same headline followed lynchings in the south on a regular basis in the 50?s and 60?s. Endemic cultural ?fears? are not perceived that way by those in the that ?soup?. For them, George would have to have a Confederate flag tattoo, a pick up truck with a C-flag on the back window, gun rack and a penchant for drinking on his front lawn and yelling at every non-white that came by. Cause ? that behavior couldn?t be denied. Untrained, self-appointed neighborhood watch patrol disobeys police instructions, stalks, confronts and then kills an unarmed young black man. The DA didn?t want to charge GZ in the first place, didn?t want to face a challenge to Florida?s gun laws, and only did so after pressure from multiple sources. They then assigned a Jr. staff lawyer to this most high profile of cases, and essentially put the victim on trial following the lead of certain media sources . The witnesses called by the prosecution seemed to testify on behalf of the defense. Of course there was an acquittal ? it was a forgone conclusion. Do you think this would have turned out differently if GZ had killed a woman? An elderly white male? Was GZ sober? We will never know, as he wasn?t tested in violation of SOP by the police. TM was . Was GZ profiling? Unquestionably ? by his own words to the police. Perhaps not by race alone, but by the combination of race, gender and clothing. Does this change the standard for self-defense? Absolutely. The court has confirmed that it is legal in Florida to initiate a conflict and then kill your opponent if they defend themselves. A sad, sad day for all of us. That?s exactly what Brotha Malcolm X preached along with the Black Panthers, and whites kept arguing these brothers were racist. Maybe now, they?ll finally understand why these brave heroes said and acted just as you suggested in your post. You get tired, REAL TIRED, of being fed a bunch of BS about rights, the law, moral and ethical obligations, etc., only to see white males do this over and over and over and over again and again WITHOUT PUNISHMENT. This is ridiculous! It is the year 2013, and Zimmerman acted as if this was 1865 and he wasn?t about to recognize slavery ended. Malcolm was right folks. Its taking too long for us to achieve FULL CIVIL RIGHTS. Just to be clear, the jury did not actually find that GZ acted in self defense. They found that the prosecution hadn?t proved he didn?t act in self defense. I?m sure the jury followed Florida law very carefully. From my perspective, it?s Florida law that was on trial, and I find Florida law guilty of murder. If you?re going to plead self defense, you should have to prove that the preponderance of the evidence supports your claim just like it is for an insanity plea . In Florida, if the prosecution can?t prove it wasn?t self defense, the killer walks. Let?s be EXTREMELY CLEAR about this: George Zimmerman DID NOT want Trayvon Martin in his neighborhood. George thought he had the right and the power to stop and question Trayvon as a member of a neighborhood watch group, which he didn?t have. George didn?t take the stand which should tell us all something, right OJ? and he never apologized to the family for taking Trayvon?s life, before, during, or after the trial. His acquittal means Florida residents HAVE THE JIM CROW POWER to keep people out of their neighborhoods simply by saying he/she/or they scared me so I shot them down, regardless of what they were doing, in self defense. That?s what?s really happening here people. This trial may seem like it is about self defense, but the broader implication for blacks is clear?.stay out of Zimmerman?s neighborhood, especially after dark, or you will be killed. That? straight out of the Jim Crow/lynching playbook. So many people are misinformed, Zimmerman never used the stand your ground defense since it didn?t apply. He was on the ground, he couldn?t retreat even if he wanted to?even in this state he could have claimed self defense. I?m so tired of all the misinformation on this case, people stopped listening to facts and are now using emotion to determine that Zimmerman is guilty. Well you?re wrong, plain and simple and a jury who sat and heard the facts agrees with me. Sometimes people need to be told they were and are wrong and this situation is one of those times.