By Daily Mail Reporter Published: 14:32 EST, 14 July 2013 | Updated: 23:54 EST, 14 July 2013 Barack Obama issued a statement today on the George Zimmerman not-guilty verdict saying that the fatal shooting of Trayvon Martin was a tragedy but a 'jury has spoken'. The President described the teenager's shooting death in Florida last year as a 'tragedy for America' while using the opportunity to renew his calls for tighter gun legislation across the U.S. Obama said: 'The death of Trayvon Martin was a tragedy. Not just for his family, or for any one community, but for America. I know this case has elicited strong passions. Scroll down for video 'And in the wake of the verdict, I know those passions may be running even higher. But we are a nation of laws and a jury has spoken. 'I now ask every American to respect the call for calm reflection from two parents who lost their young son. 'And as we do, we should ask ourselves if we?re doing all we can to widen the circle of compassion and understanding in our own communities. 'We should ask ourselves if we?re doing all we can to stem the tide of gun violence that claims too many lives across this country on a daily basis. We should ask ourselves, as individuals and as a society, how we can prevent future tragedies like this. As citizens, that?s a job for all of us. That?s the way to honor Trayvon Martin.' George Zimmerman was found not guilty of second-degree murder in the fatal shooting of Trayvon Martin, an unarmed black teenager. Before a special prosecutor assigned to the case ordered Zimmerman's arrest last year, thousands of protesters had gathered in Sanford, Miami, New York and elsewhere, many wearing hoodies like the one Martin had on the night he died. They also carried Skittles and a can of iced tea, items Martin had in his pocket. President Obama also had weighed in at the time, saying that if he had a son, 'he'd look like Trayvon'. Zimmerman, a 29-year-old Hispanic, looked visibly relieved at the Seminole court on Saturday evening after the jury of six women reached their conclusion that he had justifiably killed the unarmed black 17-year-old last February. Martin's killing in February 2012 in Florida unleashed debate across the U.S. over racial profiling, self-defense and equal justice. Protesters nationwide lashed out against police in the Orlando suburb of Sanford after it took 44 days for Zimmerman to be arrested. Many, including Martin's parents, said Zimmerman had racially profiled the unarmed black teen. Zimmerman identifies as Hispanic. Demonstrations, from Florida where the trial took place to Atlanta, DC and New York, remained largely peaceful last night- although pockets of violence had erupted in Oakland, California. Oakland, long a hotbed of racial tension, some protestors turned violent - vandalizing police cars, breaking windows and setting fire to garbage cans. One photo from the protests in the city shows men dousing a flag in lighter fluid and setting it alight. More demonstrations are planned today under the banner of 'Justice 4 Trayvon.' At least three separate protests are scheduled for New York City alone - one in lower Manhattan, one in Harlem an a third in Brooklyn. Churches also made note of the verdict on Sunday morning, with many leaders speaking about the case and urging peace in the aftermath. Some congregants wore hooded sweatshirts, as Martin had when he died, or shirts with the teen's picture. Further protests had been scheduled for Sunday as police and Martin's parents themselves appealed for peace. Distress: A mother who was listening to the end of the Zimmerman trial with her children weeps at the jury's decision