In South Florida's African-American communities, reactions ran strong and deep on Sunday to an acquittal in the killing of teenager Trayvon Martin. But their anger and disappointment was expressed not in street demonstrations or noisy protests but in the pews and pulpits of churches, where many called for changes in the justice system. The verdict reminds us that as a people we lean on the law, trust the law, embrace the law, but it seems the law doesn't embrace us, said the Rev. Arthur Jackson III, of Antioch Missionary Baptist Church of Miami Gardens, where the 17-year-old often worshiped with his mother Sybrina Fulton. We will not allow Trayvon's death to be a death in vain. Fulton was not present Sunday, but Jackson said he talked to her by phone early that morning. They are upset, he told a packed sanctuary of 1,300 worshiper's. They are very heartbroken over losing a child, as any parent would be. But she has faith in God. In the wake of the not guilty verdict delivered late Saturday in the Sanford trial of neighborhood watch volunteer George Zimmerman, the changes that Jackson and others spoke of were hard to pinpoint. Although the state's controversial Stand Your Ground law was not invoked in Zimmerman's defense, that statute and the widespread perception that the 29-year-old had racially profiled Martin helped heighten the profile of the nationally-televised case. The verdict is not the end, but the beginning of a necessary discussion about the intersection of race, racial profiling, and the law, Yolanda Strader, president of the Wilkie D. Ferguson, Jr. Bar Association, a group representing black lawyers in Miami, said in a statement. In Boynton Beach, Nathaniel Robinson, pastor of Greater Saint Paul African Methodist Episcopal Church, urged his congregation to do more than hold street protests to change the legal system. Holding up a picket sign doesn't do much, he said. We want to partner with different service organizations that are already on the move and petition for a civil suit. A student-run group called Dream Defenders, which advocates non-violent civil disobedience, issued a call for continuing public protest, without announcing any planned actions. We must hold on to our anger in the face of the injustice and let the feelings of love for our community push us forward in fixing our broken society, the group said. There was anger over the verdict, for sure. I am trying to put it in God's hands, said Evelyn Johnson, 69. But Zimmerman got away with murder. And Trayvon is at peace. Despite the frustration felt by many, the calm response to the decision was lauded, including by Martin's relatives. This is a tragedy, said Trayvon's cousin Iesha Felton, 35, after one of the three services at Antioch Missionary Baptist Church. But there is no reason this should happen to any other family. Young people, stay strong in your faith. Be peaceful. That message was apparently heeded. Law enforcement agencies reported no outbreaks of violence in response to the verdict. In Fort Lauderdale, Pastor Rasheed Baaith of Christ Resurrection Community Church urged worshipers to turn the other cheek. We pray that [the Lord] lifts this deep hurt off from us, he said in his sermon. While I'm tremendously disappointed and in pain for Trayvon's parents, I'm also praying for Zimmerman. Church member Rickey Bradwell, 59, said his faith has kept him grounded despite a verdict he believes is unjust. It was a bad decision because there should be some type of justice for Trayvon Martin, whether it be a murder or manslaughter conviction, he said. A lot of negativity and violence was expected, but we are a different folk today. We can embrace peace. he said. Miami Gardens Mayor Oliver Gilbert said the verdict disappointed many in his community. We're all sad, he said. Seventeen months ago Trayvon was killed and we believe the verdict did not go the way we wanted it to. He said the expectation of violence voiced by many were the same expectations Zimmerman had that night he saw Trayvon walking the neighborhood. Laniah Smith, 15, of Christ Resurrection Community Church, said an eruption of violence would only have deepened the anguish. I think it's good people didn't waste their time being violent, because even if they did, Trayvon Martin would still not be here, she said. At the New Jerusalem First Baptist Church in Hollywood, the Rev. James Bernand noted that being angry is natural, but it's important to channel it through non-violence. We cannot sit back and do nothing ? We need to fight back, but we need to do it in a constructive way not a destructive way ? If there is a peaceful constructive protest, we need to join it, he said. What: Community Peace Rally, in response to the acquittal of George Zimmerman in the fatal shooting of Trayvon Martin. When: Tuesday, 7 p.m. Who: Senior Pastor Marcus Davidson, elected officials and law enforcement officers.