Calm is prevailing. For now. At least, that's something. However, in theory, at least, here is what is now possible. Some night very soon, if he so chooses, George Zimmerman can load his piece, tuck it into the back of his pants, climb into his SUV, and drive around Sanford, Florida looking for assholes and fucking punks who are walking through neighborhoods where he, George Zimmerman, defender of law and order, doesn't think they belong. He can drive around Sanford, Florida and check out anyone who is dressed in such a manner as might frighten the average citizen who has been fed a daily diet of Scary Black Kids by their local news and by their favorite radio personalities, and who is dressed in such a manner as might seem inappropriate to their surroundings as determined by George Zimmerman, crimebuster. He can drive around Sanford, Florida until he spots an asshole or a fucking punk and then he can get out of his SUV, his piece tucked into the back of his pants, and he can stalk the asshole or the fucking punk, the one who is in the wrong neighborhood, or who is dressed inappropriately, at least according to George Zimmerman, protector of peace. If the asshole, or the fucking punk, turns around and objects to being stalked -- or, worse, if the asshole, or the fucking punk, decides physically to confront the person stalking him -- then George Zimmerman can whip out the piece from the back of his pants and shoot the asshole, or the fucking punk, dead right there on the spot. This can happen tonight. That is now possible. Hunting licenses are now available and it's open season on assholes, fucking punks, and kids who wear hoodies at night in neighborhoods where they do not belong, at least according to George Zimmerman, defender of law and order, crimebuster, and protector of the peace, because that is what American society has told George Zimmerman, and all the rest of us, is the just outcome of what happened on one dark and rainy night in February of 2012. The judgment, when it finally came, was a dull and predictable thing. Pictures of Trayvon Martin showing off on his Facebook page trumped pictures of him on the ground, blank-staring at the night sky, a hollow point through his chest, the way so many of us hoped they wouldn't, but suspected they would. It was hard at that moment, when the jury gave George Zimmerman back his gun, to remember that this trial wasn't supposed to happen at all. The Sanford P.D. was ready to hand Zimmerman back his gun with a fast shuffle until people got into the streets and suggested, loudly, that maybe the circumstances required another look. This is something that should be remembered now by all those sharp guys who talk about how the evidence cut both ways, and about how the prosecution overcharged the defendant, and about how well the defense mounted its case. There wasn't supposed to be a trial at all. In theory, George Zimmerman could have been back, standing his post, watching for assholes and fucking punks, the very next night, according to the original assessment made by local law enforcement. Instead, people who filled George Zimmerman's fevered definition of assholes and fucking punks roamed free, wearing their hoodies at will. The gated communities of Sanford have had to do without his watchful eye, and his ready aim, for longer than the Sanford police thought was suitable a year ago. I am glad the gated communities managed to survive the siege. Thought experiments are useless now. Of course, if the races of the two participants were reversed, Trayvon Martin already would have been doing time. Of course, black kids have to walk through a world in which how they're dressed is evidence against them, and how they behave when profiled by sanctioned and manifestly incompetent quasi-vigilantes is different from how all the rest of us are entitled to behave. They are prima facie assholes and fucking punks. Of course, black kids can't win fights without getting shot through the chest. They are supposed to act very politely, speak when spoken to and, maybe, just get off the sidewalk when they come in contact with people like George Zimmerman, who is out on that wall because we want him on that wall. We need him on that wall. And, of course, this was not about race because nothing is ever about race. The prosecutors even told us that it wasn't about race. The defense won its case because this was not about race. The sharp guys and pundits will spend all weekend explaining how race was an element of the events that night, but that the case, ultimately, was not about race. And because this case was not about race, nothing out of our history counts, because our history, here in the land of the free, is not about race, either. Because our history is not about race, a few weeks ago, when the Supreme Court gutted the Voting Rights Act, what happened on the Edmund Pettus Bridge was not relevant. Because our history is not about race, last night, Emmett Till was not relevant, even though a few people inconveniently brought him up. But that was years ago, and the country has changed, and it is John Roberts' Day Of Jubilee, and this trial was not about race because nothing is about race any more. Calm is prevailing. For now. At least, that's something. There will be much for George Zimmerman to do. Things may be a little rough back home, but there will be the victory tour on Fox. And the inevitable book deal. There will be the long career as a hero to the people in the communities that feel themselves besieged by assholes and fucking punks in their hoodies. There will be a long, lovely ride surfing the strange and wonderful celebrity that will befall him now because he stood up to the people who defend the rights of asshoes and fucking punks to walk in their hoodies through neighborhoods where they don't belong, according to him, George Zimmerman, American hero. But, sooner or later, what American society has told him he can do, what it has now made possible, is that George Zimmerman can load his piece, tuck it into the back of his pants, climb into his SUV, and cruise the rainy streets of Sanford in the night, all of his senses a'tingle, all his instincts honed, on the lookout with his hunter's eye for assholes and fucking punks. There's one down the block. What the hell's he doing here? Asshole. Fucking punk. Better pull over and check this out. Nothing good has come of this whole situation. Nothing. And the last word, as it so often does in situations like this, belongs to John Dos Passos. All right we are two nations.