Reading the 250-plus reader letters so far on the George Zimmerman trial hasn't exactly been an uplifting experience. This isn't to say the letters lacked insight; on the contrary, most were earnest and well reasoned. The problem was the subject matter: Not even the most talented of writers could put a positive spin on the needless death of Trayvon Martin, the unarmed teenager who was shot and killed by Zimmerman last year in Florida following a brief altercation between the two. But even among this depressing lot was a subset of letters that especially stung. Roughly 10 of the submissions offered on observation similar to this letter's whose writer's name I'll withhold : It is interesting to note the outrage over the Zimmerman verdict as compared to the lack of outrage over the O.J. Simpson verdict. Racism must only be a one-way street. If you'll recall, Simpson was accused of killing his white wife and her white friend. Where to start giving the lie to this comparison? If memory serves, the outrage over Simpson's acquittal had more to do with money than race -- that one wealthy celebrity was able to buy a get-out-of-jail-free card. Sure, Simpson's lawyers played the race card, but their audacity and deftness in doing so was an outgrowth of their client's ability to afford their talents. What was upsetting was the feeling that Simpson got away with murder, not the murder of two white people. And as a colleague reminded me, many African Americans were upset that other, less wealthy blacks endured far harsher punishments for much less serious crimes than the one Simpson was accused of committing. But with regard to race, there's a key difference between the two trials: Simpson claimed complete innocence in his ex-wife's murder, whereas the question in the Zimmerman case was whether the defendant was justified in killing Martin. The entire trial was, in essence, about whether Martin was responsible for his own death, and Zimmerman's lawyers pushed more than a few racial buttons to make their case. Zimmerman's defense team presented a cutout of a swaggering, hoodie-wearing Martin, giving a visual reminder of just how menacing the teenager appeared in the dark. The prosecution's key witness, Rachel Jeantel, was not-so-subtly shamed by Zimmerman's lawyers for speaking in a way that makes some white people wince. In short, it was never implied in the Simpson trial that his wife was behaving in a way that all but required her death; Zimmerman's defense was to convince jurors that they too would find Martin suspicious enough to get out of their car and pursue him. Not surprisingly, many African Americans and others are upset not just at the verdict but at the process that punished no one for shooting and killing an unarmed black teenager.