When George Zimmerman was pronounced not guilty, many celebrities and supporters of Trayvon were upset with the outcome. I'm white, I voted for Obama just to let you know that I am NOT racist, HOWEVER, this is wayyyyyyyyyy over the top with this one death. What about all the horrible other deaths going on that are unaccounted for. I'm tired of everything that isn't to do with race being made out to be about race. BTW, probably a lot of the people who were elated with the UN-just ruling over acquitting OJ Simpson are now upset ted by the legal system unfairness. Tit for tat I guess and life isn't fair! The comments from white folk & self hating blacks on here are insane! Self Defense!? George Zimmerman followed a unarmed teenager with a loaded gun for no other reason than the color of his skin and his clothing! If a strange man followed you in a car, then jumped out and came after you? Wouldn't you be defensive? Wouldn't YOU whoop his arse and defend yourself? If you follow me at night, I'm gonna bear your arse too! Zimmermans life was not in danger! He picked a fight and got beat up and shot him cause he's was a trigger happy pig! None of this is Trayvons fault! None of it. And sorry but hoodies pulled over your head DO make you look like a hoodlum, do make you appear to be hiding something, just like someone walking around wearing a ski mask would incite more suspicion. Maybe just maybe Trayvon wasn't 100% INNOCENT in this case. Think about all the people who are killed/murdered innocently and completely randomly all the time in this country, without the benefit of all of this ?fanfare?, so therefore what makes this case so special?.. Ironically, I AM on the side of Trayvon, however I find it unjust observing this over-reaction to one case that was fairly tried in front of a jury, and how this is all about race AGAIN is getting to be annoying and has an element of bias to it. Everyone should just shut up they are making it all about them and their life and who cares that Trayvon is dead, right? Oh no let's not talk about the 17 year old boy who was killed let's talk about how this affects the NAACP and celebrities with stupid t-shirts and protesters who didn't even know him. And let's make this all about how Trayvon is a symbol to the entire black community. What about Trayvon? And his life and who he was no one talks about him like he's a real person they only talk about him in order to forward their agenda. Am just tired of it all! Re: mikal ? uuuuuh stfu.'I'm not white? oh?. blah'. So? And!? Neither is Zimmerman. The law told this man not to follow that boy . THE MOTHER F???ING LAW! ANDTHIS EXCUSE OF A MAN DISOBEYED IT! If you're in an environment where you know they judge, are following you and may attack you, what would you do? Goerge was aggressive enough in his pursuit for Trayvon to tell a friend over the phone that he was being followed. Trayvon did the right thing in trying to get this aggressive thug away from him. If Trayvon was following George, I would side with Zimmerman. If Trayvon had just committed a crime and George was playing hero, I would side with Zimmerman. Trayvon was going home to his dad and this motherfucker shot him for no reason. If you enter a neighbourhood to visit a loved one, and some random person starts following you, wouldn't you at least turn around to find out why? With all these crazies running around? I'm not getting shot in the back. Both men should be home with their families. ZIMMERMAN DONE F??KED UP. America has the ridiculous law of stand your ground, which gives people the right to kill other people in the event that they THINK their lives are in danger. This ridiculous law does every thing to protect people Zimmerman except those who are genuinely in danger Treyvon . It is an entitlement for people who want to take the law into their own hands and are able to avoid danger. George Zimmerman took out his frustration on a teenager who was innocent against the advice of law enforcement when he could've easily avoided potential danger. But he chose to racially profile this child and make all sorts of judgements about his character without knowing him because he looked like a criminal. Modern racism has been incorporated into law and made to appear appropriate because it appeases the fears of white people. I find it awful that a person can go unpunished for murdering an armed 17 year old, and then America says its great? The systematic slaughter of black children by people who believe their lives are in danger because other people are a threat to them. Racism is alive and well in America, and the comments on this website are proof of it, racism also lives in the youth of America. African Americans better heed that Treyvon Martin is not the last black child to make a white person feel threatened and thus cause his own death. Zimmerman is White, his ethnicity is Hispanic. you morons who are saying that zim had no right to follow trayvon are beyond the stupidest people on the earth. ZIMMERMAN WAS AN APPOINTED AND VOTED IN NEIGHBORHOOD WATCHMAN. there were already several crimes by these black thug losers and so yea, who wouldn't be watching some black creep in the night walking around with his hoodie on? neither are a crime but zim had every right to keep an eye on this kid. and zim was the one who called 911. if martin was so worried about it and so innocent, why didn't he do the same, or knock on a neighbors door if he felt threatened. in florida we have EVERY RIGHT BY LAW to carry a loaded gun if you have a concealed weapons permit - which zimmerman did. you are all morons. travyon jumped the wrong dude. I'm sorry it happened but folks need to be careful who they decide to attack. I would have done the EXACT same thing if someone attacked me and especially if they were bashing my head into the concrete - what part about that would not make you feel your life was in danger. black people are racists - that's all this is. because just recently another black man came up to some people to rob them and antoher black man had a gun and shot him - he wasn't physically even touched but it was considered self defense. not a peep. where is the outrage? hyprocrites and liars - all of you. Re: miek ? If you would do the same thing, then you're the stupidest moron! Okay, so it's your job to follow people. Follow him, call the cops, and let them handle it. The cops will come, realize he's just visiting his dad, maybe inform the watch about who Trayvon is so they know him. Everyone lives, no trial. That's it! It was that simple. I'm glad you posted this, it's stupid people like you who'll get murdered by your own race, because you'll never suspect them. Where I'm from, the white kids wear hoodies, they're the ones running out of Macy's with people's shit. YOU make it about race, but you better open up your eyes to the world we live in. Beyonce is an idiot. Promoting cuba and now this! She obviously doesn't do ONE ounce of investigating before she jumps on anything she thinks will get her publicity. YEAH let's go to Cuba and show everyone what a great place it is! Aside from the dictator who has ruined that country and treats it's people like crap. Now let's jump on the bandwagon of Martin who was shown to have attacked zimmerman and got shot in self defense. Would she have been doing any of this is it had been the other way around- A Black guy who shot and killed a white kid? NOPE!