Thousands of demonstrators have been marching in cities across the United States after the acquittal of a man accused of shooting dead an unarmed black teenager. A Florida jury found George Zimmerman not guilty of the murder of Trayvon Martin. Lawyers for Zimmerman had argued he was acting in self defence. The case has sparked a fierce debate about race relations and racial profiling in the country. In February 2012 Zimmerman saw 17 year old Trayvon Martin outside a gated community in the central Florida town of Sanford. He called police to report him, then approached with a pistol in his waistband. There was a fight between the two and Zimmerman shot Martin once in the heart. The teenager had no criminal record and had been walking back from buying sweets and a soft drink. In New York civil rights demonstrators gathered in Union Square. One activist, Kelly King, said: ?There is a larger problem in our country. We still have people being discriminated against based on how they look. We are in a democracy and everybody should have the same rights.? Another protester, Dave Schleicher, added: ?It?s just a complete gross miscarriage of justice and I feel everybody white, black from all backgrounds really should be concerned and horrified by this situation ? In Martin?s home town of Sandford in Florida, many tried to find solace in church services. Reverend Lowman Oliver told the congregation at St. Paul Missionary Baptist Church to ?Get up from where you are. And we need to get together, and do something about it.? President Obama has appealed for calm, saying the death was a tragedy for America, but that ?a jury has spoken?. 2 What will you ask US Senator John McCain? | euronews, world news 3 Watch: Passengers ?push-start? frozen plane in Siberia | euronews, world news 6 Which countries in Europe cause the most air pollution damage? | euronews, world news 8 Grenoble: Europe?s first ad-free city | euronews, world news 13 Crude awakening: Romania?s Black Sea oil and gas finds fuel Europe?s energy hopes | euronews, reporter