NEW YORK AP ? Thousands of demonstrators from across the country ? chanting, praying and fighting tears ? protested a jury?s decision to clear neighborhood watch volunteer George Zimmerman?in the shooting death of an unarmed Black teenager, and organizers say they?ll try to maintain the momentum with vigils next weekend. Rallies on Sunday were largely peaceful as demonstrators voiced their support for 17-year-old Trayvon Martin?s family and decried the verdict. Police in Los Angeles said they arrested six people, mostly for failure to disperse, after about 80 protesters gathered in Hollywood on Sunset Boulevard and an unlawful assembly was declared. New York police said at least a dozen people were arrested on disorderly conduct charges during a rally in Times Square. Advocates want federal civil rights charges against Zimmerman, who was acquitted Saturday in Martin?s 2012 shooting death. The Rev. Al Sharpton said Monday that his organization will hold vigils and rallies in 100 cities Saturday in front of federal buildings. The Justice Department has said it?s considering whether federal prosecutors should file criminal civil rights charges now that Zimmerman?has been acquitted in the state case. The department opened an investigation into Martin?s death last year but stepped aside to allow the state prosecution to proceed. Sunday?s demonstrations, held in cities from Florida to Wisconsin, attracted anywhere from a few dozen people to a more than a thousand. At a march and rally in downtown Chicago attended by about 200 people, 73-year-old Maya Miller said the case reminded her of the 1955 slaying of Emmett Till, a 14-year-old from Chicago who was murdered by a group of white men while visiting Mississippi. Till?s killing galvanized the civil rights movement. ?Fifty-eight years and nothing?s changed,? Miller said, pausing to join a chant for ?Justice for Trayvon, not one more.? In New York City, more than 1,000 people marched into Times Square on Sunday night, zigzagging through Manhattan?s streets to avoid police lines. Sign-carrying marchers thronged the busy intersection, chanting ?Justice for Trayvon Martin!? as they made their way from downtown Union Square, blocking traffic for more than an hour. In San Francisco and in Los Angeles, where police dispersed an earlier protest with beanbag rounds, police closed streets Sunday. President Barack Obama, Sharpton and the Rev. Jesse Jackson have urged calm. In Oakland, Calif., during protests that began late Saturday night, some angry demonstrators broke windows, burned U.S. flags, vandalized a police squad car and spray-painted anti-police graffiti. Los Angeles Mayor Eric Garcetti urged protesters to ?practice peace? after rock- and bottle-throwing. Later, more than 100 officers in riot gear converged and ordered people to disperse. A handful of people were given citations, mostly for blocking a street or jaywalking. National People?s Action, a network of grassroots organizations that work for social justice, joined others in the country on Monday in expressing outrage and sadness at the decision. ?The fact that the man who committed the crime will go unpunished is?without question a symptom of a deep sickness in our country,? Bree Carlson, a program director for the Chicago-based group, said in a statement. ?It cannot be understood outside of the context of hundreds of years of institutionalized racism that produce racial inequity in every aspect of our society. It is clear we have much work to do to realize the promise of fairness that is at the core of our shared values as a country.? Asian Americans Advancing Justice | Los Angeles also shared the sentiment, saying that that the ?struggle for racial justice is far from over.? The group, which works on legal advocacy and civil rights, said the Martin case echoes the 1982 death of Vincent Chin, who was Chinese American. Chin, Asian Americans Advancing Justice | Los Angeles said in a statement, was killed by men who exhibited racial prejudice against Japanese and Japanese Americans. ?During the trial, Chin?s killers argued that?Chin was the aggressor and that they were merely exercising self-defense against him, despite the fact that the killers hunted down?Chin before beating?him to death with a baseball bat in a parking lot. Chin?s death invigorated the Asian American civil rights movement that continues to this day,? the group said in a statement. In San Francisco, where there also were marches, Rand Powdrill, 41, of San Leandro, Calif., said he showed up with about 400 others to ?protest the execution of an innocent Black teenager.? ?If our voices can?t be heard, then this is just going to keep going on,? he said. Earlier, at Manhattan?s Middle Collegiate Church, many congregants wore hooded sweatshirts similar to the one Martin was wearing the night he was shot. Hoodie-clad Jessica Nacinovich said she could only feel disappointment and sadness over the verdict. ?I?m sure jurors did what they felt was right in accordance with the law but maybe the law is wrong, maybe society is wrong; there?s a lot that needs fixing,? she said. At a service in Sanford, Fla., where Zimmerman?was tried, teens wearing shirts with Martin?s picture wiped away tears during a church sermon. Protesters also gathered in Atlanta, Miami, Milwaukee, Philadelphia and Washington, D.C., along with a host of other cities. In Miami, more than 200 people gathered. ?You can?t justify murder,? read one poster. Another read ?Don?t worry about more riots. Worry about more Zimmermans.? Carol Reitner, 76, of Miami, said she heard about the vigil through an announcement at her church Sunday morning. ?I was really devastated. It?s really hard to believe that someone can take the life of someone else and walk out of court free,? she said. In Philadelphia, about 700 protesters marched through downtown to the Liberty Bell, alternating between chanting Trayvon Martin?s name and ?No justice, no peace!? ?We hope this will begin a movement to end discrimination against young Black men,? said Johnathan Cooper, one of the protest?s organizers. ?And also to empower Black people and get them involved in the system.? In Atlanta, about 75 protesters chanted and carried signs near Centennial Olympic Park. ?I came out today because a great deal of injustice has been done and I?m very disappointed at our justice system,? said Tabatha Holley, 19, of Atlanta. ?I?m just disappointed in America.? Associated Press writers Suzette Laboy in Miami, Terence Chea in San Francisco, Keith Collins in Philadelphia, Pete Yost and Eric Tucker in Washington, Luisa Leme and Equal Voice News contributed to this report.