? Invalid Email Address 			 ? Must enter an email address 			 ? Separate multiple address with commas 			 ? You can't enter more than 20 emails. Recipient's Email Address Separate multiple address with commas Send me a copy You must enter the verification code below to send. 			 Invalid entry: Please type the verification code again. 			 Trayvon Martin supporters blocked traffic at a rally in Times Square after marching from another rally for Mr. Martin in Union Square in Manhattan on Sunday. Getty Images Sam Hill, 11, wiped away tears during a youth service at the St. Paul Missionary Baptist Church in Sanford, Fla., Sunday. George Zimmerman was acquitted on Saturday of all charges in the shooting death of Mr. Martin. Phelan M. Ebenhack/Associated Press Protesters gathered at Union Square in support of Mr. Martin on Sunday. Adrienne Grunwald for The Wall Street Journal A man held a cardboard cutout of Mr. Martin during a demonstration in New York on Sunday. Stan Honda/AFP/Getty Images Thomas Bouldin, left, of Jacksonsville, Fla., and Sabrina Cochran, of Smiths Station, Ala., listened to a speaker during an open forum to discuss the Mr. Zimmerman second-degree murder trial and verdict at Melon Park in Sanford, Fla. Steve Nesius/Reuters Demonstrators protested the verdict. Scott Olson/Getty Images Arny Soejoedi, 19, of Atlanta, center with arm up, chanted during a protest on Sunday in Atlanta. David Goldman/Associated Press A demonstrator wore a hoodie during a protest in Atlanta. David Goldman/Associated Press People gathered in support of Mr. Martin in front of a statue of Adam Clayton Powell Jr. on West 125th Street in New York. Claudio Papapietro for The Wall Street Journal People wore hoodies during services honoring Mr. Martin at Middle Collegiate Church on Sunday in New York. Mario Tama/Getty Images Allison Mickelson, with watery eyes and her jacket over her head, attended a service for Mr. Martin in New York. PJ Smith for The Wall Street Journal Roger Smith waited with his family for services to begin for Mr. Martin. PJ Smith for The Wall Street Journal Kenya Moore performed a dance to the memory of Mr. Martin at the Allen Chapel AME Church in Sanford, Fla. Steve Nesius/Reuters Aesha Felton, Roberta Felton and Milton Felton, cousins of Mr. Martin, stood outside of the Antioch Missionary Baptist Church in Miami Gardens, Fla., on Sunday. Angel Valentin/Getty Images A man threw a trash can at a window in Oakland, Calif., Sunday after learning that Mr. Zimmerman was found not guilty in the shooting death of Mr. Martin. Anda Chu/MCT/Zuma Press A protester marched in the Leimert Park area of Los Angeles after a Florida jury acquitted Mr. Zimmerman on Saturday. Reuters Demonstrators reacted to the not guilty verdict at the Seminole County Criminal Justice Center. Brian Blanco / European Pressphoto Agency Protesters held signs as they rallied in response to the acquittal of Mr. Zimmerman in the Harlem neighborhood of New York on Sunday. Keith Bedford/Reuters People watched a news ticker in Times Square deliver the news that Mr. Zimmerman was found not guilty on Saturday. Carlo Allegri/ Associated Press A demonstrator reacted to the not guilty verdict in the trial of Mr. Zimmerman at the Seminole County Criminal Justice Center in Sanford, Fla., on Saturday. Brian Blanco /European Pressphoto Agency Deputies tried to maintain calm after a shouting match erupted into pushing outside the Seminole County Criminal Justice Center on Saturday. Joe Burbank/MCT/Zuma24 Mr. Zimmerman left court with his family after his not guilty verdict was read. Joe Burbank, Pool/ Associated Press Demonstrators gathered as they waited for a verdict in the trial of Mr. Zimmerman at the Seminole County Criminal Justice Center on Saturday. Brian Blanco/European Pressphoto Agency A Seminole County Sheriff's deputy carried Mr. Martin's hooded sweatshirt as trial evidence was moved out of the courtroom on Saturday. EPA The moment the verdict was read, George Zimmerman, far right, looked down as his defense co-counsel, Don West and Lorna Truett looked at Mr. Zimmerman's lead defense attorney Mark O'Mara, far left, as he was found not guilty. Joe Burbank / European Pressphoto Agency Mr. Zimmerman's wife celebrated with family and friends following her husband's not guilty verdict. Gary W. Green / Reuters