Sunday, July 14th, 2013 @ 8:25AM If a young black male cannot take a walk in a residential neighborhood without losing his life to a man who the police told to stand his ground, then what do we tell young black males about their chances of making it in America? ?The jury obviously bought the defense?s story that Trayvon Martin was the aggressor?that George Zimmerman feared for his life when he pulled the trigger of his automatic handgun and fired the bullet that ended the life of another young black male.? At the risk of being labeled another disaffected black male in the American society, I must speak out about this verdict because it is the very reason why I have this platform today. Two decades ago, I was working in a black church in East New York Brooklyn.? The police nicknamed the neighborhood ?the killing fields? because it had the highest rate of homicides in the nation.? Young black males were killing each other at an alarming rate.? That happens when kids grow up in an environment where they believe that nothing good will ever happen for them in life. The pastor of Saint Paul Community Baptist Church, Rev. Johnny Ray Youngblood, had begun a ministry to black males that was helping black men to turn their lives around.? Men, in large numbers, gravitated to a place where they could believe that God, if not society, had not given up on them.? I was one of those men who, at the age of 42 years, went back to school to finish my undergraduate degree.? Psychotherapy had helped me and I believed that with proper training, I could come back and be more effective working with these men and boys. I opted to pursue a degree in social work because I was convinced that I could develop the best knowledge and skills to help people.? While working on my M.S.W. degree, I realized that more attention was needed on the policies that impacted people and practice.? I decided to train myself to be someone who could work to influence social welfare policy. ?Columbia University School of Social Work seemed to offer the best experience. I earned a Ph.D. at Columbia University.? That?s right, I earned it.? Nobody gave it to me.? It took four years of grueling work.? I got no affirmative action help.? If you don?t believe me, look at the student loans I am paying back in order to get my doctorate.? My professors certainly did not give me a break because I was black.? I sought the opportunity to get the Columbia pedigree because I believed it was the only way a black man could get proper respect in America.? I believed that if I was awarded a Ph.D. from Columbia, people would say that I earned the right to participate and be heard. There are some remarkable examples of great achievement by African American males?none more exceptional than Barack Obama?s ascendancy to the office of President of the United States.? But even he is viewed by too many as incapable of handling the job.? The point is these stories should not be remarkable.? The day must come when black male achievement is ordinary. The lives of African American males do matter, yet countless amounts of human capital are discarded everyday by systems that expect little from young black males.? Too many are branded as criminals before they reach the age of personal responsibility.? Too many are shunted off to special education classes because teachers are incapable of engaging them in an effective manner.? Too many lives are wasted before they are given a chance to make something of themselves. My father did not abandon me; he died when I was sixteen years old.? My mother had died during childbirth when I was five years old and I found myself rudderless in a world where the deck was stacked against black men.? It took me a long time to get my act together, but I gained my footing before it was too late.? Unfortunately, for Trayvon Martin, he will never have that opportunity.? What was his motive for being in that neighborhood?? What was his motive for attacking a man who was much larger than he?? The jury believed he was a young black male out looking for trouble. Categories: Let's Talk Policy Tags: Columbia University, social work, special education, Trayvon Martin, young black males Thank you for a swift response to a national tragedy. It is time for the social work profession to develop a uniformed response to the inequities that exist in our society. We see it everday. The verdict must be a wake up call for our profession. We can not just sit by and shake our heads, we must write editorials, demand that out legislators state and federal enact laws that guarantee that all Americans no matter what their age, color, class, sexual orientation, religious belief, or dress can go to a store purchase a drink and candy and return home safely. Dr. Lewis, I am so excited to be able to collaborate with you regarding The National Center for Children and Families? efforts to grasp the implications of this tragedy for both policy and practice, for advocacy and for fundamental change. I did not know your story, but now I fully understand why our lives have intersected. CRISP fills a void in the social work world, and is long overdue. Social justice is an agenda appropriate for all of us, not simply people of color. Your willingness to share, to be vulnerable, is a strength that further provokes my passion and commitment to advocacy! Thank you so much; I share your vision. ?The day must come when black male achievement is ordinary.? Only then will we find Trayvons of the world to be safe and living with a quality of life worthy of their humanity.