1 How old was Trayvon Martin and how much size difference was there between him and Zimmerman? Initially, old photos of Trayvon Martin were shown in the media that made him appear to be about twelve years of age and Zimmerman's weight has fluctuated dramatically. This has given many people the erroneous impression that a grown man was fighting a child. In actuality at the time of the incident, Trayvon Martin was a 17 year old, 6?2, 160 pound football player while according to his friend Joe Oliver, Zimmerman was 5'8 and 170 pounds. In other words, Martin was younger, 6 inches taller, more athletic and the more imposing of the two men. 2 Why was George Zimmerman not initially arrested?: According to the Sanford Police Chief at the time, Bill Lee, who has since lost his job over this case, When the Sanford Police Department arrived at the scene of the incident, Mr. Zimmerman provided a statement claiming he acted in self defense which at the time was supported by physical evidence and testimony. By Florida Statute, law enforcement was PROHIBITED from making an arrest based on the facts and circumstances they had at the time. Additionally, when any police officer makes an arrest for any reason, the officer MUST swear and affirm that he/she is making the arrest in good faith and with probable cause. If the arrest is done maliciously and in bad faith, the officer and the City may be held liable. Lee has since added, The police department needed to do a job, and there was some influence ? outside influence and inside influence ? that forced a change in the course of the normal criminal justice process. In other words, had this case not become a political hot potato, Martin's death would have been considered self-defense and Zimmerman would have likely never gone to trial. 3 Did George Zimmerman use a racial slur to refer to Trayvon Martin?: George Zimmerman muttered something under his breath when he was talking to the 911 dispatcher that some people initially said were the words, F***ing coons. Although the audio is difficult to hear, the words Zimmerman used are now generally believed to be, F***ing punks, although it may have also been F***ing goons, which is slang for gang members in that part of Florida. In any case, the FBI concluded more than a year ago that race wasn't a factor in the shooting. 4 Did George Zimmerman continue to follow Trayvon Martin after a police dispatcher told him not to do so? Keep in mind that George Zimmerman was a neighborhood watch captain and there had been 8 burglaries there in the preceding 14 months. Additionally, most of those crimes were committed by young black males. Furthermore, while there are no indications that Martin was doing anything illegal when he ran into Zimmerman, it's worth noting he had been suspended from school for possession of a 'burglary tool' and a bag full of women's jewelry. Given all of that, it doesn't seem remarkable that Zimmerman may have initially followed Martin. However, after calling the police and reporting what he believed was Martin's suspicious behavior, the 911 dispatcher told Zimmerman he didn't need to continue to follow Martin. It's worth noting that the dispatcher had no legal authority to tell Zimmerman what to do and even if Zimmerman continued following Martin, it wouldn't be a crime. Regardless, Zimmerman says he obeyed and began walking back to his truck to meet with a police officer when Martin confronted and then attacked him shortly afterwards. While it's impossible to prove one way or the other with the evidence available, Zimmerman's story is consistent with the facts presented at trial. 5 Could Trayvon Martin have gotten away? Since Martin was being followed by someone he didn't know, it would be perfectly understandable if he was alarmed by that and worried about his safety. Given that, while he was not legally obligated to flee, it should be noted that Martin had at least two opportunities to do so. In fact, his friend Rachel Jeantel, who famously noted that Martin referred to Zimmerman as a creepy ass cracker, admitted that she suggested he run away. Had he done so or had he even just walked home, he would have made it before Zimmerman ever arrived at the spot where they had their final confrontation. Although it is impossible to know for sure who threw the first punch or how the fight started, Martin had a second opportunity to break off his conflict with Zimmerman. When eyewitness John Good saw Martin on top of Zimmerman, raining blows down on him, he told him to cut it out and then said, I'm calling 911. At that point, Martin was in physical command of the situation, was obviously winning the fight and there was a witness. If he wanted to end things, he could have broken off the fight at that point and asked Good for help. Instead, he chose to keep on beating Zimmerman. 6 Who was yelling for help? Given the conflicting testimony from experts, along with the friends and family of Martin and Zimmerman, it's probably not possible to say with 100% certainty who was yelling for help. That being said, given that the back of Zimmerman's head was lacerated, he claimed Martin was slamming the back of his head into the cement, and the best eyewitness, John Good, said Martin was on top of Zimmerman attacking him ground and pound style, it seems much more likely Zimmerman was the one calling for help. 7 Why did Zimmerman shoot Trayvon Martin? By the time the final gunshot was fired, John Good had gone back inside to call 911; so no one saw what happened. According to Zimmerman, Martin attacked him, was beating him and hammering the back of his head into the concrete. Then, Martin saw the gun that Zimmerman had, said You're going to die tonight, and reached for the gun. At that point, Zimmerman feared for his life, shot up at Martin and killed him. John Good has already testified that Martin was on top of Zimmerman striking down at him, which verifies that part of his story. According to Dr. Vincent DiMaio, a former chief medical examiner in Texas, who testified in Zimmerman's defense, Zimmerman... Dimao also noted that the trajectory of the bullet was, consistent with somebody leaning over the person doing the shooting, which also buttresses Zimmerman's claims. In other words, Zimmerman's testimony is consistent with the facts and entirely plausible, although of course, Trayvon Martin isn't around to give his side of the story. Conclusion: It's sad that this case has become polluted with politics, racial grievances and wild speculation in the media because the evidence in this case overwhelmingly suggests that it should be considered a tragedy, not a crime.