Months of intense media coverage, weeks of courtroom testimony and hours of jury deliberations boiled down to a not-guilty verdict for George Zimmerman, delivered by a jury of six women late Saturday. The decision came 17 months after Zimmerman, a self-styled volunteer watchman, fatally shot unarmed black teen Trayvon Martin during a confrontation in a Sanford, Fla., community. Zimmerman showed no emotion as the verdict was read at about 10 p.m. ET. Judge Debra Nelson ordered his GPS restraint removed and the former defendant walked away a free man. Zimmerman didn't talk to the media after his exoneration, but his lawyers did. We're ecstatic with the results, lead defense attorney Mark O'Mara told reporters after the verdict. Was it fair? It was a little bit David and Goliath. But we won, he said. Asked if he had a message for Trayvon Martin's parents, O'Mara repeated something he's said before, that their son's loss is a tragedy ? that it's always a tragedy when a young person dies. Outside the courthouse, justice looked differently to Martin family supporters. They chanted, System has failed. Others yelled, No! No! Martin's father, Tracy Martin, took to Twitter to say that he was broken hearted over the verdict, but he thanked everyone who will make sure this doesn't happen again. The public at large also reacted on social media. NPR's Gene Demby, host of our Code Switch blog, asked how families were reacting to the verdict. You can see some of the responses here. NPR's Tell Me More also encouraged its own Twitter discussion. But the worst fears of authorities in Sanford ? that a not-guilty verdict could spark violence or possibly riots ? went unrealized Saturday night. Elsewhere, the anger was contained to mostly peaceful demonstrations ranging from a few dozen to a few hundred in places such as Portland and Philadelphia, as well as San Francisco and Los Angeles, where news of the verdict broke earlier in the evening. In Oakland, Calif., however, about 100 protesters broke windows, started fires and vandalized a police car. During the weeks of testimony and arguments, prosecutors portrayed Zimmerman as a wannabe cop who saw Martin from his car, assumed he was a criminal, and forced what ultimately became a deadly confrontation. Zimmerman's attorneys maintained that their client acted in self-defense after Martin knocked him to the ground and repeatedly bashed his head into a sidewalk. The verdict indicates jurors were convinced that Zimmerman was justified in fearing for his life when he shot Martin. The jury was permitted to consider second-degree murder or a lesser charge of manslaughter. During Saturday evening's deliberations, a few hours before the verdict was announced, the jurors asked the judge for clarification on the manslaughter charge. NPR's Greg Allen, who has covered the weeks-long trial in Sanford, reports that the prosecution acknowledged that it had always known the case would be a tough one to prove. Even so, special prosecutor Angela Corey said she was proud her team had made good on a promise she made when she took the case: That we would get all of the facts and details of this very difficult case before a jury, she told reporters. And that we chose to do it that way because we felt that everyone had a right to know everything about his case. Her assistant, Bernie de la Rionda, the lead prosecutor in the case, took the verdict harder. He said he accepted it but was disappointed. What it boils down to is you got a 17-year-old kid, who is minding his own business, wearing a hoodie, and gets accosted ? gets followed by an individual who wants to be a cop, de la Rionda said. Benjamin Crump, the lawyer for the Martin family, said he believes the 17-year-old will be remembered alongside civil rights-era heroes Medgar Evers and Emmett Till as a symbol of the fight for equal justice. We would be intellectually dishonest if we didn't acknowledge the racial undertones in this case, he said. So we have to have very responsible conversations about how we get better as a country and move forward from this tragedy and learn from it. Update At 3:15 p.m. ET: President Obama Weighs In On The Verdict President Obama, in a statement released Sunday afternoon said: The death of Trayvon Martin was a tragedy. Not just for his family, or for any one community, but for America. I know this case has elicited strong passions. And in the wake of the verdict, I know those passions may be running even higher. But we are a nation of laws, and a jury has spoken. I now ask every American to respect the call for calm reflection from two parents who lost their young son. And as we do, we should ask ourselves if we're doing all we can to widen the circle of compassion and understanding in our own communities. We should ask ourselves if we're doing all we can to stem the tide of gun violence that claims too many lives across this country on a daily basis. We should ask ourselves, as individuals and as a society, how we can prevent future tragedies like this. As citizens, that's a job for all of us. That's the way to honor Trayvon Martin. For those readers who might want a refresher on the case leading to Saturday's verdict, The Two-Way's Mark Memmott last week compiled a timeline of the story based on our headlines: Trayvon Martin was shot and killed in Sanford, Fla., on Feb. 26, 2012. George Zimmerman had called police that evening to report a suspicious person in his neighborhood. After the shooting, he told investigators that Trayvon attacked him. When authorities failed to arrest Zimmerman, Trayvon's family and supporters began a campaign that led to protests in cities across the nation. Our headlines form something of a timeline of the story: ? March 19, 2012: Killing Of Fla. Teen Trayvon Martin Becomes National Story About Race. ? March 20, 2012: Trayvon Martin Killing To Be Investigated By Florida Grand Jury. ? March 21, 2012: 'Million Hoodie March' Planned In New York To Protest Killing Of Trayvon Martin. ? March 23, 2012: Obama: 'Absolutely Imperative' That Trayvon Martin's Death Be Investigated. ? March 29, 2012: Three Key Moments As Trayvon Martin's Story Went Viral. ? April 11, 2012: Zimmerman Arrested On Murder Charge In Martin Case; Will Plead Not Guilty. ? June 1, 2012: George Zimmerman's Bond Revoked, Must Surrender Within 48 Hours. ? July 5, 2012: Zimmerman's Bail Set At $1 Million. ? Oct. 17, 2012: June Trial For George Zimmerman, Accused In Trayvon Martin Death. ? June 10, 2013: Trayvon Martin Killing: 2 Sides Want Very Different Jurors. ? June 24, 2013: George Zimmerman Trial: 3 Highlights From The First Day. ? July 5, 2013: That's 'My Son Screaming' On 911 Call, Trayvon's Mother Says. ? July 8, 2013: At Murder Trial, Friends Say It's Zimmerman's Voice On Tape. ? July 10, 2013: Defense Rests In Zimmerman Trial; Race 'Permeates The Case'. ? July 11, 2013: Zimmerman Jury Can Consider Lesser Charge, Judge Says. ? July 13, 2013: Jury Acquits Zimmerman Of All Charges.