The Egyptian army has removed President Mohammed Morsi, and has placed him under house arrest. Meanwhile, a group of military and religious leaders are laying out a roadmap for the country's future, which will include the suspension of the Constitution, an interim government led by the chief justice of the Supreme Court and new presidential and parliamentary elections. But there were reports of gunfire at rallies in support of the ousted president. Morsi himself denounced what some have called a coup. He remained defiant and insisted he was still Egypt's president. The world is looking at us today, he said in a taped statement given to Al Jazeera. We by ourselves can bypass the obstacles. We, the sons of Egypt, the sons of this country -- this is the will of the people and cannot be canceled. Shortly after his statement aired, Al Jazeera reported its Cairo studios were raided during a live broadcast on Wednesday and its journalists, producers and guests were arrested, CNN reported. The Muslim Brotherhood, the movement that brought Morsy to office, said its broadcast outlets had been shut down. In a White House written statement released late on Wednesday evening, President Obama said that the U.S. is deeply concerned by the decision of the Egyptian Armed Forces to remove President Morsi and suspend the Egyptian constitution.? Obama called on the Egyptian military to move quickly and responsibly to return full authority back to a democratically elected civilian government as soon as possible and avoid any arbitrary arrests of President Morsi and his supporters. Meanwhile, U.K. Prime Minister David Cameron issued a written statement urging all parties in Egypt to end violence. ?It is not for this country to support any single group or party. What we should support is proper democratic processes and proper government by consent,? Cameron said, according to the Guardian. U.K. Foreign Secretary William Hague also issued a statement, saying, ?The United Kingdom does not support military intervention as a way to resolve disputes in a democratic system.? Hague also cautioned citizens of the U.K. against traveling to Egypt during this crisis. The foreign minister for the United Arab Emirates, a U.S. ally that does not support the Muslim Brotherhood, and had openly criticized Mohamed Morsi?s ascent to power last year, issued a statement Wednesday night expressing ?satisfaction? over the Egyptian army?s move to seize power from Morsi and depose his government, the Emirates News Agency reported. Saudi Arabia?s King Abd al Aziz, on Thursday, sent a congratulatory message to Adly Mansour, chairman of Egypt?s Supreme Constitutional Court, who is set to become the interim president, Turkish news agency Anadolu reported. Mansour was sworn in Thursday, putting the polarized nation on a path to what he referred to as a ?brighter? future, Bloomberg reported. Mansour assumes the top post in a country reeling from a sluggish economy and a government that?s now back where it was a couple of years ago following the events that led to the removal of Hosni Mubarak from office. ?The greatest thing accomplished on June 30 is that it has united all of the people, without differentiation or discrimination,? Mansour said, regarding the first of few days of rallies that preceded Morsi?s ouster. Amid the turmoil, state-run Al-Ahram News reported that Egypt's stock market had surged 7% in the first hours of trading Thursday to a near two-month high, according to CNN. Refresh this page for live updates. Update 6:10 p.m.: Thousands continue to gather in Cairo Square, many cheering the ouster of? Morsi's presidency. Some in the crowd have been setting off fireworks to celebrate. Meanwhile, at 6 p.m. in Washington, D.C., President Obama delivered a brief July 4 speech and hosted a barbecue and concert on the White House South Lawn. The U.S. president, accompanied by First Lady Michelle Obama, didn't mention anything about the ousting of Morsi and the events that have taken place in Egypt since then, despite having met with aides about the crisis. Obama and? national security team members met in the White House Situation Room a day after the Egyptian military toppled Morsi's presidency, installed a new government and called for new elections, USA Today reported. Many news organization are focusing on the fact that the Obama administration has been avoiding referring to Morsi's ousting as a coup. Democratic Sen. Patrick Leahy, D-Vt., had noted that the more than $1 billion a year in military aid to Egypt would be severed if the overthrow of Morsy's government was deemed a military coup, according to CNN. U.S. law restricts certain types of aid to nations where an elected government's head is toppled by a military coup, the news outlet added. The U.S. president did not use the word coup in his statement, but instructed relevant departments and agencies to review implications for aid to Egypt. Update 6 p.m.: Egypt's top prosecutor, Gen. Abdel Maquid Mahmoud, opened an investigation into claims that ousted President? Morsy and Muslim Brotherhood leaders incited violence and the killing of protesters, CNN reported. Mahmoud issued an order that prevented Morsy and 35 others from leaving the country, the state-run Middle East News Agency and EgyNews reported Thursday, according to the prosecutor's office. The news from MENA and EgyNews seem to contradict reports that Morsy refused an offer by the armed forces to leave Egypt for Qatar, Turkey or Yemen, CNN added. Update 3:30 p.m.: The sweep against the Muslim Brotherhood leadership included the group's top leader, General Guide Mohammed Badie. Badie was arrested late Wednesday from a villa at a Mediterranean coastal city and taken by helicopter to Cairo, security officials said, the Huffington Post reports. Update 1:50 p.m.: A huge crowd has again gathered in Cairo Square as Egyptian security forces move to arrest Muslim Brotherhood leaders and silence their communications outlets, CNN reported. Muslim Brotherhood spokesman Gehad El-Haddad told CNN that the ousted president was under house arrest at the presidential Republican Guard headquarters in Cairo, but the military hasn?t commented on Morsy's whereabouts. Former Muslim Brotherhood chairman Mahdi Aakef and his bodyguards were arrested Thursday in Cairo with four weapons in their possession, according to state-run Middle East News Agency, which cited security sources, the CNN report noted. The Muslim Brotherhood?s supreme leader, Mohamed Badei, and the former supreme leader Mohamed Mahdi Akef have been arrested, state broadcaster Nile TV said. In addition, warrants have been issued for Badei's deputy, Khairat el-Shater, and other Brotherhead leaders on charges of inciting the killing of peaceful protesters in front of Brotherhood headquarters in Cairo's Moqattam neighborhood, according to CNN. Another 300 members of the Muslim Brotherhood are being sought by police, state-run newspaper Al-Ahram reported. State-run EgyNews said that Morsy and eight other Brotherhood members were put on a no-fly list and were to be charged with insulting the judicial authorities and its men. Update?4:30 a.m. EDT Thursday: Adly Mansour, chairman of Egypt?s Supreme Constitutional Court, was sworn in as interim President in Cairo, CNN reported. He will retain his position as chief justice, the report added, citing Egyptian state media. ? Update 10:15 p.m.: The office of the Egyptian military spokesman released a complete English translation of the televised statement by Gen. Abdul Fattah el-Sisi, Egypt?s defense minister, declaring that President Mohamed Morsi had been confined and that a transition to democracy will start, according to the New York Times. The statement focused on a description of the army?s 10-point ?road map? for restarting a transition. The general said: The participants have agreed on a future road map with initial steps to bring about a strong and cohesive Egyptian society that excludes none of its members and trends and terminates the state of conflict and division. This road map includes: a ? The temporary suspension of the constitution. b ? The Chief Justice of the Supreme Constitutional Court to take the constitutional oath before the SCC General Assembly. c ? To hold early presidential elections with the SCC Chief Justice being in charge of the caretaking of the State during the transitional period until a new president is elected. d ? SCC Chief Justice to be entitled to issue constitutional declarations during the transitional period. e ? To form a strong and capable national government of technocrats enjoying all authorities to manage the current period. f ? To form a commission that includes the full spectrum and experiences to revise the proposed amendments to the constitution, which is temporarily suspended. g ? To urge the Supreme Constitutional Court to expedite the approval of the draft electoral law of the House of Representatives and commence the preparatory procedures of the parliamentary elections. h ? To draw up a media code of ethics that provides for the freedom of the media and ensures professional rules, credibility, impartiality and elevation of the higher interests of the State. i ? To adopt executive measures empowering and merging youths in the State establishments to become partners in the decision-making, as assistants to ministers and governors and various executive posts. j ? To form a higher commission for national reconciliation from figures, who represent all orientations and enjoy credibility and acceptance of all national elites. The spokesman?s office also posted a video set to music with a series of photographs of the various participants in the meetings with the military on Wednesday. The video begins and ends with the camera zooming in slowly on the face of the defense minister. Update 8:00 p.m.: On Twitter, Muslim Brotherhood spokesman Gehad El-Haddadjust said Mohamed Morsi and the majority of his senior aides were under house arrest, according to the New York Times. El-Haddadjust reported that Brotherhood members were detained or prevented from leaving Egypt. Before that, due to the political upheaval and possibility of extreme violence, the U.S. raised its travel warning, posting an updated warning on the websites of the State Department and the American Embassy in Cario. The State Department said it ordered the evacuation of ?nonemergency U.S. government personnel and family members from Egypt due to the ongoing political and social unrest,? according to the Times. Update 7:00 p.m.: Egyptian security forces interrupted a live broadcast from the Cairo studio of Al Jazeera Mubasher Misr -- a channel dedicated to live coverage of Egypt -- to arrest journalists, producers and guests, the Qatari network?s live blog said, according to the New York Times reported. Viewers of the channel were suddenly able to hear a disturbance amid the broadcast that was show images of celebration in Tahrir Square. A background voice said, ?Come with us, if you may,? revealed video footage posted on YouTube, according to the Times. Update 5:25 p.m.: Al-Arabiya reported that four people died and seven wounded in clashes in Marsa Matrouh on northern coast of Egypt. BBC noted that there were clashes in Sidi Bishr in Alexandria and in Minya and Qena in upper Egypt. Update 5:15 p.m.: Clashes, looting and destruction of police vehicles reported in southern city of Aswan. U.S. Senator Patrick Leahy, D-Vt., warns that financial/military aid to Egypt should be cut off in light of coup. Update 5:10 p.m.: Four people reportedly killed in Muslim Brotherhood stronghold near Libyan border, as army tries to prevent Morsi supporters from marching to presidential palace in Cairo. US govt has ordered non-essential diplomatic personnel to depart Egypt. Update 5:00 p.m.: Video released of Morsi, whose exact whereabouts are unknown, calling for Egyptian people to reject military coup. Muslim Brotherhood member tells Al Jazeera that country at risk of sinking into civil war. Newly appointed president Adli Mansour, former head of constitutional court, is a virtual unknown to public. Marwan Bishara, analyst, noted that Morsi won greater percentage of votes in his election than Obama did in his. Update 4:40 p.m.: No official statement on Egyptian coup from US White House. Morsi?s whereabouts still unknown. Update 4:30 p.m.: Adli Mansour, Egypt?s new interim president, will be sworn in on Thursday. Reports of police arresting employees of TV stations linked to Muslim Brotherhood. Morsi says he is only ?legitimate president? of Egypt. Fawaz Gerges of London School of Economics warns al Jazeera that the coup undermines the whole idea of democracy, noting that Morsi was democratically elected with 51percent of vote. He asks what will happen if in next election, a Muslim Brotherhood candidate wins again? Update 4:20 p.m.: ?Syria?s President Bashar al-Assad, who opposed Morsi, said in a statement that whoever uses religion for political aims, or to benefit some and not others, will fall.? He also told state-controlled paper: You can't fool all the people all the time, let alone the Egyptian people who have a civilization that is thousands of years old, and who espouse clear, Arab nationalist thought. Update 4:05 p.m.: Morsi makes statement asking all Egyptians to honor constitution and to ?avoid bloodshed.? The Nour Party, an Islamist organization that opposes the Muslim Brotherhood, said it supports the political transition in Egypt. Adli Mansour, chief justice, named interim president. Update 3:55 pm: ?Morsi denounces army?s coup and called for restoration of constitution. Muslim Brotherhood spokesman warns Egypt has entered into ?another military coup cycle.? Update 3:45 p.m.: Twitter account of The Egyptian Presidency said that the measures announced by Armed Forces leadership represent a full coup categorically rejected by all the free men of our nation. Also, Muslim Brotherhood spokesman said that army has taken pro-Morsi TV stations off the air. Update 3:35 p.m.: ?Opposition leader Mohammed El Baradei says removal of Morsi is what the Egyptian people demanded. Reports of heavy gunfire at pro-Morsi rally at Nasr City, Cairo. Update 3:25 p.m.: ?The sheikh of Al-Azhar mosque, following army chief Sisi, said he supports army, calls on Egyptian people to end their conflicts. Pope Tawadrus, head of Coptic church, calls for unity. Morsi supporters now chanting slogans against military. Update 3:20 p.m.: Adil Mansour, chief justice, will lead Egypt during interim. Egyptian army commander Abdul Fatah Khalil Al-Sissi said in speech that technocratic govt will be formed ahead of new presidential elections. Huge crowd delirious and jubilant in Tahrir Square. Unclear if Morsi is under arrest or not. Update 3:10 p.m.: Egyptian army commander Abdul Fatah Khalil Al-Sissi says no political party will be marginalized. Constitution will be provisionally suspended, new parliamentary and presidential election will be held. During interim, chief justice of Supreme court will run the government and hold presidential powers. Morsi has been overthrown. Update 3:05 p.m.: Egyptian army commander Abdul Fatah Khalil Al-Sissi now making official statement before country. Military has closed all roads around presidential palace. Update 3:00 p.m.: Al Ahram newspaper reports that the army told Morsi at 7 p.m. local time that he is no longer the president. Muslim Brotherhood claims some of its senior members have been placed under arrest. Morsi?s whereabouts remain unknown. Update 2:45 p.m.: Heath ministry reported at least 50 people wounded in clashes taking place in six parts of Egypt between supporters and opponents of Morsi. Prominent Muslim Brotherhood member Mohamed Beltagy warned Al-Jazeera that military coup will destroy faith in democracy. Update 2:40 p.m.: MENA news agency reports that the statement by the Egyptian army on the country?s future will be made in presence of figures from anti-Morsi Tamarod group as well as senior Muslim and Coptic religious leaders and prominent opposition figure Mohammed ElBaradei. Update 2:38 p.m.: ?Egyptian security source told BBC that Muslim Brotherhood figure Mohammed Badie was barred from crossing into Libya. Unclear if Badie is under arrest or not. Also, Morsi?s whereabouts are unknown ? conflicting reports say he is still at presidential palace, others claim he?s in army barracks. Update 2:35 p.m.: Egyptian army denies accusations that it fired shots at a pro-Morsi rally. Update 2:30 p.m.: ?The army?s roadmap for Egypt's future reportedly includes plans for new presidential elections, suspension of new draft constitution and the dissolution of parliament. State media says period for interim govt. will be short. Update 2:15 p.m.: Key opposition leader Mohammed ElBaradei and leader of Coptic church will participate in unveiling new ?roadmap? for Egypt?s future. Muslim Brotherhood official tells Al-Jazeera that a full military coup is underway in Egypt, but US State Department cannot confirm that coup has occurred. Egyptian military saying this is not a coup. Update 2:10 p.m.:? Egypt military to issue statement on unrest and future ?roadmap? in about an hour, as fireworks are heard in Tahrir Square. BBC says private TV channels side with anti-Morsi forces, while state TV praised military. AP reports army in virtual control of Cairo. Update 2:00 p.m.: U.S. state department spokeswoman Jen Psaki says Obama administration very concerned about unrest in Cairo and that Morsi must do more to be responsive to concerns of the Egyptian people. Democracy is not just about being elected through the ballot box. It's also about allowing the voices in your country to be heard. Update 1:38 p.m.: ?Syrian govt. urges Morsi to quit. Update 1:35 p.m.: ?Crowd at Tahrir Square described as ?electrifying, joyous? by Haaretz correspondent. Demonstrators cheer army helicopters flying overhead. Update 1:25 p.m.: ?Reuters says that Egypt?s military has put up barbed wire around the barracks where Morsi is working in. They have also sent armored vehicles and soldiers to stop Morsi supporters from marching to presidential palace for a rally. Update 1:15 p.m.: Soldiers blocking bridge that leads to Cairo University: Al Jazeera. Update 1:11 p.m.: ?BBC says Morsi refused to step down, while Cairo airport is under orders to prevent any Muslim Brotherhood members from leaving country. Army has increased presence outside pro-Morsi rally at Raba'a el Adaweya Mosque and at site of clashes in Nasr City. Update 1:02 p.m.: Still no statement from army, as Morsi reportedly ?working normally? at presidential office in compound of Republican Guard in suburban Cairo. Army has control major streets and bridges in city. However, other reports claim Morsi is still at presidential palace. Update 12:55 p.m.: Army tanks approaching Tahrir Square. Update 12:54 p.m.: Associated Press reports that Morsi and two senior Muslim Brotherhood officials are under travel ban, citing Cairo airport officials. Update 12:52 p.m.: Al Jazeera says that all aides of president have fled presidential palace, with only Morsi left. Update 12:50 p.m.: Muslim Brotherhood spokesman, Mona al-Qazzaz, in UK tells BBC: My main fear is to go back to a military state. The military should not be part of the political scene. Update 12:45 p.m.: Pentagon said U.S Defense Secretary Chuck Hagel spoke with leader of Egyptian army, Gen Abdul Fattah al-Sisi, on Tuesday. Details of conversation were not divulged. Update 12:40 p.m.: BBC reports army tanks moved into Cairo University to separate opposition factions who were rallying. Military presence on streets growing. Update 12:30 p.m.: Morsi aide says President is working in Republican Guard barrack in Cairo. Uncertain if he?s allowed to leave the military compound. Update 12:28 p.m.: Aide to Morsi tells Reuters that president?s plea to public to resist coup is a call of non-violence Update 12:25 p.m.: Egypt?s national security advisor calls what is happening is a military coup, citing that no ?military coup can succeed against popular resistance without considerable bloodshed.? Update 12:20 p.m.: Hundreds of thousands of anti-Morsi protesters in Tahrir Square, Cairo, as Muslim Brotherhood officials warn that removal of Morsi would amount to a military coup. Update 12:01 p.m: Agence France-Presse and NY Times report that Egyptian security officials have imposed travel ban on President Morsi and other senior Muslim Brotherhood figures, including Morsi?s deputy Khairat el-Shater. Update 11:52 a.m.: Essam al-Haddad, senior aide to Morsi, wrote on his Facebook page: ?As I write these lines I am fully aware that these may be the last lines I get to post on this page. For the sake of Egypt and for historical accuracy, let?s call what is happening by its real name: Military coup. It has been two and a half years after a popular revolution against a dictatorship that had strangled and drained Egypt for 30 years. ?That revolution restored a sense of hope and fired up Egyptians? dreams of a future in which they could claim for themselves the same dignity that is every human being?s birthright.? Update 11:50 a.m.: Israeli paper Haaretz claims Morsi is under house arrest and that crowd in Tahrir Square cheered over hearing news. But this is unconfirmed. Update 11:45 a.m.: Tamarod, anti-Morsi movement, calls of youth of Muslim Brotherhood to ?avoid bloodshed. Do not get entangled in civil war. We call upon them to join us.? Update 11:37 a.m.: Guardian reports that senior Muslim Brotherhood officials relaxed and jovial. Update 11:32 a.m.:? Anti-Morsi demonstrators outside Republican Guard headquarters allegedly chased and shoved bearded man believed to be Morsi supporter. Update 11:21 a.m.: Large rally for Morsi supporters at Raba'a el Adaweya Mosque in East Cairo. Update 11:15 a.m.: More from President Morsi?s statement: ?These people who believe that imposing their legitimacy by force on the great Egyptian people, the Egyptian people who were so eager for freedom and sacrificed blood for it, those people cannot accept that imposition.? Update 11:03 a.m.: Egypt?s President Morsi statement according to David Hearst of Guardian : ?A scenario that some people are trying to impose on the Egyptian people, has no consensus amongst the Egyptian people and there are large masses who do not accept it. It will cause chaos in the process of building institutions that has already started. those who believe that Egypt can go back and destroy the legitimacy are mistaken.? Update 10:57 a.m.: Egypt?s President Morsi repeats that he is the legitimate leader of country, refuses to step down. Update 10:53 a.m.: A spokesman for the Muslim Brotherhood, Gehad El-Haddad, suggests the Egyptian military is trying to impose senior liberal opposition figure Mohammed ElBaradei as a ?unity figure.? Update 10:45 a.m.: Muslim Brotherhood & Islamist Freedom & Justice Party again reject call for talks with military. Islamist source reportedly declared: In what capacity are you [military] calling for talks? Egypt still has a legitimate president. Update 10:32 a.m.:? The yield on Egypt?s seven-year sovereign bond climbed Wednesday to a record 10.65 percent, another sign that the Morsi government is having increasing difficulty borrowing money to keep the country functioning. Update 10:32 a.m.: Statement from Egyptian military: The General Command of the Armed Forces is currently meeting with a number of religious, national, political and youth icons ... There will be a statement issued from the General Command as soon as they are done.? Update 10:29 a.m.: The Egyptian military leadership has reportedly talks with anti-Morsi opposition figures and some senior religious leaders and will soon make a statement, according to Reuters. Update 10:22 a.m. EDT : Cairo's Tahrir Square is filling up with people as the army reportedly prepares to make a statement.