The supreme justice of Egypt's Supreme Constitutional Court was sworn in as interim president earlier today after President Mohammed Morsi was ousted from power by the military. Egypt's chief justice, Adly Mansour, assumed power in a ceremony broadcast live on state television less than 24 hours after the military placed Morsi under house arrest. Morsi denounced the military's decision and called the action a full coup. Gehad el-Haddad, a spokesman for the Muslim Brotherhood party, said Morsi was under house arrest at a presidential guard facility where he had been residing, and 12 presidential aides were also under house arrest. Mansour was appointed to the court by President Hosni Mubarak but elevated to the chief justice post by Morsi. Mansour will serve until new elections are held. No date has been given on the elections. Mansour takes over as Cairo has turned into a tale of two deeply divided cities, which could set the stage for a violent civil war between Morsi's supporters and anti-Morsi protesters. U.S. Students Warned to Evacuate Cairo The anti-Morsi protesters celebrated into the early morning hours with fireworks in Tahrir Square after the announcement came that Morsi was ousted Wednesday night. Fearing a violent reaction by Morsi's Islamist supporters, troops and armored vehicles deployed in the streets of Cairo and elsewhere, surrounding Islamist rallies. A major question now is whether the Muslim Brotherhood, which strongly supports Morsi, and other Islamists will push back against the new, military-installed regime. The ouster of Morsi throws Egypt on an uncertain course, with a danger of further confrontation. The Muslim Brotherhood has worked in the shadows for more than 80 years before gaining power. Now Morsi and his backers have been ousted after only one year in office by the same kind of Arab Spring uprising that brought the Islamist leader to power. There's been a lot of very angry rhetoric, talk about the Brotherhood martyring themselves for the sake of democratic legitimacy. And so I think there is a real fear about violent opposition to this military takeover, said Tamara Wittes, director of the Saban Center for Middle East Policy at the Brookings Institution. Egyptian President Morsi Forced Out of Power Some of Morsi's Islamist backers, tens of thousands of whom took to the streets in recent days, have vowed to fight to the end. The Muslim Brotherhood did not want this outcome at all. They feel they won fair and square through the ballot box and they should have been allowed to rule, said Wittes. It's quite possible that they're going to rely on that sense of democratic legitimacy and try to oppose this military decree in the streets. Deadly clashes in Cairo have left 40 people dead since Monday when the military gave Morsi an ultimatum to find a solution to meet the demands of anti-government demonstrators in 48 hours. Stabilization in Egypt - the largest Arab country - is of vital concern to the U.S. and the rest of the Middle East. One in every four Arabs lives in Egypt. It sits on top of the Suez Canal, which is how U.S. naval forces get in and out of the Persian Gulf and the world's oil gets to global markets. The region has been in constant turmoil with Syria's deadly civil war, the nuclear threat from Iran and a still unstable Libya and Iraq. What happens next in Egypt is of grave concern to the U.S. and the rest of the region. The U.S. is watching the events in Cairo closely and forcing the government to do a careful diplomatic dance around calling Morsi's ouster a coupe. The U.S. gives Egypt $1.3 billion in military aid annually. United States foreign aid law states that, in general, the U.S. cannot give direct military funding to any country that is being run by a military government, particularly after a coup has overthrown a democratically elected leader. President Obama said in a statement the U.S. is monitoring the very fluid situation in Egypt, and we believe that ultimately the future of Egypt can only be determined by the Egyptian people.