CAIRO // Egypt's army commander and Islamist President Mohammed Morsi each pledged to die for his cause as a deadline neared today that will trigger a military takeover backed by protesters. Military chiefs, vowing to restore order in a country racked by demonstrations over Morsi's Islamist policies, issued a call to battle in a statement headlined the final hours . They said they were willing to shed blood against terrorists and fools after Mr Morsi refused to give up his elected office. Less than three hours before an ultimatum was due to expire for Mr Morsi to agree to share power or make way for an army-imposed solution, the president's spokesman said it was better that he die in defence of democracy than be blamed by history. In an emotional, rambling midnight television address, Mr Morsi said he was democratically elected and would stay in office to uphold the constitutional order, declaring: The price of preserving legitimacy is my life . Liberal opponents said that showed he had lost his mind . Two army armoured vehicles took up position outside state broadcasting headquarters on the Nile River bank and most staff were evacuated from the building, security sources said. The state news agency MENA said civil servants were occupying the cabinet office and would not let Prime Minister Hisham Kandil enter the building. The official spokesman of Mr Morsi's Muslim Brotherhood movement said supporters were willing to become martyrs to defend him. There is only one thing we can do: we will stand in between the tanks and the president, Gehad El-Haddad told Reuters at the movement's protest encampment in a Cairo suburb that houses many military installations and is near the presidential palace. We will not allow the will of the Egyptian people to be bullied again by the military machine. The Egypt25 television station owned and run by the Brotherhood was continuing to broadcast live split-screen coverage of pro-Morsi demonstrations. The state-run Al Ahram newspaper said Mr Morsi was expected to either step down or be removed from office and the army would set up a three-member presidential council to be chaired by the head of the Supreme Constitutional Court. A military source said he expected the army to first call political, social and economic figures and youth activists for talks on its draft roadmap for the country's future. Political sources said armed forces commander General Abdel Fattah El Sisi met the main liberal opposition leader, Nobel peace laureate Mohamed ElBaradei, the heads of the Muslim and Christian religious authorities and leaders of smaller Islamist parties on Wednesday. A military source denied that Gen El Sisi and ElBaradei were meeting. The Brotherhood's political arm, the Freedom and Justice Party, refused an invitation to meet Gen El Sisi, saying it only recognised the elected president. A military spokesman said there was no time set for an official statement or speech by the armed forces command. A mass of revellers on Cairo's Tahrir Square feted the army overnight for, in their eyes, saving the revolutionary democracy won there two years ago when an uprising toppled autocratic President Hosni Mubarak in 2011. Large crowds were gathering in the square again on Wednesday afternoon. But Mr Morsi's backers denounced the army's intervention as a coup. At least 16 people, mostly supporters of the president, were killed and about 200 wounded when gunmen opened fire overnight on pro-Morsi demonstrators at Cairo University campus. The Muslim Brotherhood accused uniformed police of the shooting. The Interior Ministry said it was investigating. Central Cairo was quiet by day. Many stores were shuttered and traffic unusually light. The stock market index fell 1.7 per cent on fears of bloodshed. The Egyptian pound weakened against the dollar at a currency auction, and banks said they would close early, before the army deadline. For the first time in many months, uniformed police were back patrolling the streets, and the Interior Ministry said in a statement it would confront all forms of violence . I could tell that the police are back with their full power on the streets like the old days before the Jan 25 revolution, said Amir Aly, 25, a protester outside the presidential palace. Military sources told Reuters the army had drafted a plan to sideline Mr Morsi, suspend the constitution and dissolve the Islamist-dominated upper house of parliament after the 5 p.m. 1500 GMT deadline passes. Coordinated with political leaders, an interim council would rule pending changes to the Islamist-tinged constitution and new presidential elections, the military sources said. They would not say what was planned for the uncooperative president, whose office refused to disclose his whereabouts. The Dustour constitution party led by Mr ElBaradei, a former head of the UN nuclear agency, appealed for military intervention to save Egyptian lives, saying Mr Morsi's speech showed he had lost his mind and incited bloodshed. The opposition National Salvation Front, an umbrella group of liberal, secular and leftist parties, and the Tamarud - Rebel! youth movement leading the street protests nominated ElBaradei to negotiate with army leaders on a transition. In his 45-minute address to the nation, Mr Morsi acknowledged having made mistakes and said he was still willing to form a national unity government ahead of parliamentary elections and let a new parliament amend the constitution. But he offered no new initiative and rejected calls to step aside, saying it was his sacred duty to uphold legitimacy - a word he repeated dozens of times. The president accused remnants of Mr Mubarak's former regime and corrupt big money families of seeking to restore their privileges and lead the country into a dark tunnel. Liberal opposition leaders, who have vowed not to negotiate with Mr Morsi since the ultimatum was issued, immediately denounced his refusal to go as a declaration of civil war . We ask the army to protect the souls of Egyptians after Mr Morsi lost his mind and incited bloodshed of Egyptians, the Dustour Party said in a statement. The youth movement that organised the mass protests urged the Republican Guard to arrest Mr Morsi immediately and present him for trial. We ask the army to intervene to prevent the bloodshed of the Egyptian people, Tamarud's founder Mahmoud Badr told a news conference. This is a people's coup against a dictator and tyrant president and the army of the Egyptian people has to respond to the people's demands and act upon them.