An Islamist coalition led by the Muslim Brotherhood is calling on their supporters to peacefully protest the removal of former Egyptian President Mohammed Morsi in a Friday of Rejection, after the Egyptian military arrested top Brotherhood figures as part of a major crackdown against the group. The National Coalition in Support of Legitimacy called on the Egyptian people to take to the streets and mobilize peacefully after Friday prayers to say 'No' to military detentions, 'No' to the military coup, according to Reuters. We are being headhunted all over the country, Muslim Brotherhood Spokesman Gehad el-Haddad said Thursday, according to The Guardian. We are holding a mass rally after Friday prayers to take all peaceful steps necessary to bring down this coup. The call to protest came after Egypt's military moved swiftly Thursday against senior figures of the Muslim Brotherhood, targeting the backbone of support for ousted President Mohammed Morsi. In the most dramatic step, authorities arrested the group's revered leader, Mohammed Badie, from a seaside villa and flew him by helicopter to detention in the capital. Officials, who spoke on condition of anonymity, said Mohammed Badie was arrested Wednesday night in a resort village in Marsa Matrouh, a Mediterranean coastal city west of Cairo not far from the Libyan border. He had been staying in a villa owned by a businessman with Brotherhood links. State prosecutors said that Morsi would face an investigation next week into claims that he insulted the presidency. ? The prosecutor's office, a day after the overthrow, ordered Badie's arrest, and his deputy Khairat el-Shater, sources told Reuters. The two were reportedly wanted for inciting the killing of protesters in front of the Brotherhood's headquarters in Cairo's southern neighborhood called Mokattam, the AFP reported. Al Ahram, a major state newspaper, reported that eight protesters were killed while attacking the headquarters, The New York Times reported. Publicly, the Brotherhood urged members to avoid violence during the most recent upheaval. Yet, there are widespread fears of Islamist violence in retaliation for Morsi's ouster, and already some former militant extremists have vowed to fight. Suspected militants opened fire at four sites in northern Sinai, targeting two military checkpoints, a police station and el-Arish airport, where military aircraft are stationed, security officials said. The military and security responded to the attacks but there was no word on casualities in the ongoing clashes. In addition to the two high-ranking leaders, Al-Ahram reported that arrest warrants were issued for 300 other members of the Brotherhood, Reuters reported. Some of the Brotherhood members were reportedly placed in the same prison holding Hosni Mubarak, Egypt's former president ousted in 2011. Badie and el-Shater were widely believed by the opposition to be the real power in Egypt during Morsi's tenure. As of Wednesday night, Badie was last known to be holed up at a tourist resort on the Mediterranean coast near the Libyan border, with security forces surrounding the building.? The leader of the Brotherhood's political arm -- Freedom and Justice Party -- and another of Badie's deputies have been detained. The arrests and warrants against Brotherhood leaders signal a crackdown by the military against Islamists who have dominated the political scene in Egypt since the ouster of Mubarak. Embattled Syrian President Bashar al-Assad told a state-run newspaper that Morsi?s fall means the end of political Islam. ? The Brotherhood's television station, Misr 25, has been taken off the air along with several TV networks run by Islamists. Morsi's critics have long accused the stations of sowing divisions among Egyptians and inciting against secularists, liberals, Christians and Shiite Muslims with their hard-line rhetoric. Adi Mansour, Egypt?s interim leader, made overtures to the Brotherhood in his inauguration. The Muslim Brotherhood are part of this people and are invited to participate in building the nation as nobody will be excluded, and if they respond to the invitation, they will be welcomed, he said, according to Reuters. Still, Morsi?s ouster is seen by many as a blow to the Brotherhood?s push for influence in North Africa just two years after the fall of Mubarak. The Wall Street Journal reports that the change of tides may push some Islamists to take a pass on democracy and turn to violence. The Brotherhood has hemorrhaged support. Under Brotherhood rule, crime has spiked, the economy has tanked and the country's politics have grown dangerously polarized, the Journal?s report said. The popular swell of discontent with the Brotherhood and the movement's governing shortcomings has been acknowledged even by the movement's most defiant leaders. This is the first time in the history of the Brotherhood that it is the people and not the regime that are acting against the movement, said Ibrahim al-Hudaibi, a prominent former member of the group, told the paper. Morsi was ousted in what was described by the presidential palace as a complete military coup. The White House has not labeled Morsi ouster a coup. Doing so would have U.S. aid implications. Ahmed Aref, a spokesman for the Muslim Brotherhood party, told Reuters both Morsi and an aide were being held but he didn't know their location. A security official said they were at a military intelligence facility, Reuters reported. Morsi said on his presidential Facebook page that the military's action presents a military coup and it is unacceptable. At least 14 people were killed in clashes between Morsi's supporters and opponents following the announcement, Reuters said, citing the state news agency MENA. Egyptian troops, including commandos in full combat gear, were deployed across much of Cairo, including at key facilities, on bridges over the Nile River and at major intersections Eight of the dead were reported to be in the northern city of Marsa Matrouh, with three killed and at least 50 wounded in Alexandria. Another three were killed in the southern city of Minya. A U.S. official said nonessential diplomats and embassy families had been ordered to leave Egypt amid the unrest. The State Department issued a warning urging U.S. citizens in the country to leave. The Associated Press contributed to this report.?