Obama has consistently supported oppressive Islamic regimes, while throwing liberation movements under the bus: from Iran's Green Movement to Turkey's Kemalists. MB infiltrated Obama govt. UPDATE: This blog is primarily about the Obama-Muslim Brotherhood nexus and how it played out in Egypt. On a more general level, the updates continue on this live blog. Jan. 22, 2014 The U.S. State Department is refusing to comment days after it emerged that they ordered the Department of Homeland Security to give members of a Muslim Brotherhood delegation traveling to the United States VIP treatment so they could bypass airport security. The story first emerged on Friday last week after the Investigative Project on Terrorism obtained a document PDF as a result of a FOIA request proving that Muslim Brotherhood members traveling through Minneapolis Airport, New York?s John F. Kennedy Airport and Dulles Airport were handed ?port courtesies,? with the State Department telling the DHS to ensure the men ?not be pulled into secondary upon arrival at a point of entry.? ... Could America?s security have been put at risk by people working inside the State Department? Earlier this month, retired U.S. Air Force Gen. Tom McInerney made the explosive claim that there were ?at least 10 or 15? Muslim Brotherhood sympathizers working for the State Department. Source Recently posted: Dec. 28, 2013 U.S. Army Lieutenant General Ret. William ?Jerry? Boykin, in a recent World Net Daily radio interview, confirmed that people with high security clearances connected to the Muslim Brotherhood hold important positions in every major federal agency including the Pentagon and the Department of Defense. The Muslim Brotherhood is a radical Islamist organization that has vowed the destruction of America from within. Click here to hear radio clip. Source Dec. 25. 2013 According to Egyptian newspaper El Watan, a group of Egyptian lawyers has submitted a complaint charging U.S. president Barrack Hussein Obama with crimes against humanity at the International Criminal Court. The complaint charges Obama of being an accessory to the Muslim Brotherhood, which incited widespread violence in Egypt both before and after the June 30 Revolution. Along with Obama, the complaint reproduced by El Watan mentions several Brotherhood members by name, beginning with the leader of the organization Muhammad Badie, and other top ranking leaders such as Mohamed al-Beltagy, Essam al-Erian, and Safwat Hegazi, adding that ?Obama cooperated, incited, and assisted the armed elements of the Muslim Brotherhood in the commission of crimes against humanity in the period from 3/7/2013-8/18/2013, in the Arab Republic of Egypt.? Source Oct. 13, 2013 In a deal brokered by the Egyptian military just before they took over, the Saudi's agreed to make up the balance of US aid that would be withheld by the Obama regime.? Oct. 9, 2013 In the early hours of Saturday Oct. 5 US forces in Tripoli/Libya seized a militant known as Abu Anas al-Libi, a long-sought al-Qaeda operative indicted in the 1998 bombings of US embassies in Kenya and Tanzania. ... Al-Libi, whose real name is Nazih Abdul-Hamed al-Ruqai, has a deeply complicated personal history which includes ties with Osama bin Laden, al-Qaeda?s current leader Ayman al-Zawahiri and an Egyptian-American double agent name Ali Mohamed who became a U.S. Army instructor at Ft. Bragg before training extremists for bin Laden. ? ... Clare Lopez provides a detailed account of the historical background behind al-Libi in an article in The Clarion Project. The in-depth information also includes his close working relationship with Christopher Stevens who was killed with three other Americans in a raid in Benghazi last year. Benghazi Live Blog As Lopez points out, al-Libi is expected to be interrogated about al Qaeda operations in Libya by the FBI aboard the USS San Antonio where he is being held. On the surface that sounds encouraging until you realize that Chris Stevens had been sending cables back from Libya since June of 2008. You can read Stevens messages in Die Hard in Derna to learn even greater insights into the events leading up to the Benghazi attacks. Which then begs the question, why get al-Libi now? John Kerry said, ?You can run but you can?t hide.? The problem is, al-Libi wasn?t hiding. They captured him out in the open in his driveway. So, why now? It?s a legitimate question that just doesn?t pass the smell test. Source Oct. 4, 2013 In spite of its demise in Egypt, Tunisia and the dire situation now in the failed state of Libya and war torn Syria, the advancement of the Muslim Brotherhood continues unabated. Millions of American taxpayer dollars will be spent promoting the Muslim Brotherhood brand of Islamism to counter the Al-Qaeda brand of Islamism. The U.S. is teaming up with the Islamism-promoting governments of Turkey and Qatar to try to influence Muslim youth in a more positive direction. The U.S. and the Islamist government of Turkey have announced a $200 million fund for programs that will supposedly promote non-violence among Muslims in terrorist hotspots like Pakistan, Somalia and Yemen. The total is to be raised over 10 years, with the U.S. provided $2-3 million at first , along with Turkey, Canada, various European countries and ?private sources.? The only other Muslim country mentioned as a partner besides Turkey is Qatar. As the sole Muslim participants in the fund, Turkey and Qatar will be the ones crafting the Islamic message against Al-Qaeda. ... The thinking behind this fund is the same flawed thinking that upholds the Muslim Brotherhood as the moderate, democratic, non-violent alternative to Al-Qaeda. This logic was articulated by Director of National Intelligence James Clapper in testimony on January 31, 2012?testimony that came after his previous embarrassingly inaccurate explanation of the Brotherhood: ?Al-Qaeda probably will find it difficult to compete for local support with groups like the Muslim Brotherhood that participate in the political process, provide social services and advocate religious values. Non-violent, pro-democracy demonstrations challenge Al-Qaeda?s violent jihadist ideology and might yield increased political power for secular or moderate Islamist parties.? Source Sept. 23, 2013 An Egyptian court has banned the Muslim Brotherhood from operating and ordered that all its assets be seized. Because the ruling applies to any organisation derived from it, the order also could affect the Brotherhood's political arm, the Freedom and Justice Party. Brotherhood officials promise to appeal the ruling. The Brotherhood has been outlawed in Egypt for most of its 85-year existence. That prohibition failed to stop it from becoming Egypt's largest and best organized political movement, however, as the group swept into power in the first elections after President Hosni Mubarak was forced from power in 2011. Source Sept. 3, 2013 More conspiracy, as was to be expected after McCain's visit to Al Shater: Al-Jazeera is reporting on two tweets from a man named Shadi Hamid. The first tweet is a reference to an Egyptian newspaper that identifies Barack Obama as a member of the International Muslim Brotherhood? Source August 12, 2013 What did McCain do and say in Egypt to earn the ire of millions of Egyptians? First, most offensive to Egyptians?and helpful to the Brotherhood's cause?is McCain's insistence on calling the June 30 Revolution a military coup. ... ?Further angering Egyptians is McCain's insistence that all arrested Brotherhood members be released from prison. ... McCain's call to release Brotherhood leadership validates the widespread belief in Egypt that America is a fellow conspirator with the Brotherhood. ... McCain also personally visited Khairat al-Shater, the multi-millionaire deputy chief of the Brotherhood who is currently incarcerated on charges of treason and terrorism. Interestingly, Shatter was not even a member of Morsi's government. Why is McCain visiting a civilian? Shater's status as a major figure in the largest Islamist organization in the world is leading Egyptians to connect the dots. Even Shater himself, understanding the awful visuals, asked McCain to visit the legitimate president Morsi instead. U.S. media has said little about the administration's ties to al-Shater; however these ties are well-known among Egyptians: ambassador Anne Patterson was frequently seen going to Shater's residence. ... in short, McCain's remarks and actions in Egypt have further confirmed the popular narrative?as memorably displayed by countless anti-Brotherhood and anti-Obama placards raised during the June 30 Revolution?that U.S. leadership is aligned with the Brotherhood, and thus ultimately a supporter of terrorism. Americans can no longer afford to ignore this serious accusation with broad implications. ... Egyptians believe the U.S. fears that Morsi and others, if tried, would reveal the nature of their cozy relationship with the U.S. government, leading to any number of ugly revelations?treasonous ties and conspiracies, the exchange of billions of dollars, and Sinai issues. Hence, McCain wants them freed. Source Aug. 7, 2013 Brilliant! Senators John McCain and Lindsey Graham did their best to prop up the Muslim Brotherhood and attack political leaders during their short visit to Cairo. In response, military leaders lashed out at McCain for interfering with the country?s internal conflict. McCain and Graham also said the country was near ?all-out bloodshed.? The two US senators exacerbated anti-US feelings in the country. Nice work, guys. It?s hard to see what the two were hoping to accomplish with their public statements. What a disaster. Source July 30, 2013 Increasingly the Western establishment, including politicians, media and NGOs are shifting from a wait-and-see attitude to open alignment with the ousted Islamist president. The EU's Foreign Policy Czar, former communist Baroness Ashton has had a two hour?midnight?meeting with ousted Muslim Brother Morsi at an undisclosed location.?Prosecutors formally remanded Morsi into custody on Friday for 15 days, charging him with murder and espionage.?Ashton's meeting comes amid rising expressions of concern from lawyers, human-rights activists and foreign diplomats for information on Morsi's location and welfare. Some human-rights researchers said the charges suggested a politically motivated attack. Some reports have Ashton saying that Morsi has access to TV and news papers. French Foreign Minister Laurent Fabius said on Tuesday that Egypt's deposed leader, Mohamed Mursi, should be released, calling the country's political situation very critical. France calls for the rejection of violence and for the release of political prisoners, including former president Mursi, Fabius told journalists in Paris. July 27, 2013 Police began firing teargas after the arrival of thousands of opposition protesters who had been attending the funeral of the assassinated secular politician Mohamed Brahmi. Protesters threw stones back at police and there were several injuries. Secular opposition parties are demanding the dissolution of the parliament and the Islamist-led government. The people want to topple the regime! and With our blood and with our souls we will sacrifice ourselves for the martyr! people in the crowd shouted. Ghannouchi, assassin, criminal, others chanted, referring to Rached Ghannouchi, leader of the ruling Islamist Ennahda party that Brahmi's family says was behind the killing. Source Erdogan is showing himself the Muslim Brotherhood dictator that he is. The world is waking up to the fact that Islamists and democracy are inherent contradictions. Arab Spring was a lie that had to collapse in the face of reality. After Turkey and Egypt, now Tunisia, Libya and Syria are rejecting their rule. As we see what Erdogan is doing to the foreign press, watch what he's capable of with the media at home! Turkey's prime minister has threatened legal action against a UK newspaper for publishing an open letter criticising his handling of recent protests. Recep Tayyip Erdogan accused the The Times of renting out its pages for money . Hollywood celebrities and academics were among those who signed the letter this week accusing Turkey's government of dictatorial rule . Source July 26, 2013 The country that first broke into 'Arab Spring' is going up in flames. Tunisian opposition leader Mohamed Brahmi, a secular, socialist nationalist, has been assassinated outside his home in Tunis, in the second high-profile political killing this year. In February the killing of prominent opposition figure Chokri Belaid triggered mass protests and the resignation of several government ministers. The shooting dead of Mr Brahmi, the 58-year-old leader of the nationalist Movement Of The People Party, has prompted new protests in Tunis and other cities across the country. Source includes video Hillary Clinton?s protege, Deputy Chief of Staff and closest advisor ? has close ties to the Muslim Brotherhood. Huma Abedin has much fewer than six degrees of separation 1 or 2 depending on your interpretation from Egypt?s ousted Muslim Brotherhood president ? Mohammed Mursi. One year ago, when Walid Shoebat discovered the names of 63 leaders who make up the Muslim Sisterhood ? which is essentially nothing more than the female version of the Brotherhood ? we learned that Huma?s mother, Saleha, was one of those leaders. Little attention has been paid to the other 62 leaders, however. One of them is Najla Ali Mahmoud, the wife of Mursi. Both are members of the Guidance Bureau, which proves fallacious, the claim that Najla is just an innocent and na?ve spouse. This would make Huma?s mother a close, personal colleague of the wife of a virulently anti-Semitic racist who has officially been declared the first president-elect of post-Mubarak Egypt. Mursi also sat behind a Muslim cleric at a presidential campaign rally before the first round of elections, nodding in approval as the cleric enthusiastically informed the crowd that under Mursi, Jerusalem would become the new capital of the next Caliphate. Source Huma Abedin is married to NYK mayoral candidate Anthony Weiner July 19, 2013 One of the least commented aspects of ousting Egypt?s Morsi is the defiant act of the Saudi Royal House in backing the ouster of the Brotherhood and supporting the military restoration. The Saudi move is unprecedented in its open defiance of White House declared backing for the Muslim Brotherhood. The implications of the split are huge.? Source The Saudis had given secret assurance to Defense Minister and Chief of the Army, General Abdul Fattah al-Sisi, that the Saudis along with other conservative Gulf oil states including Kuwait and UAE would guarantee financial support should the Obama Administration cut the ?1 billion annual aid to Egypt?s military in retaliation for ousting their man, Morsi. On July 17, the Egyptian transitional government confirmed that it has received ?6 billion in grants, loans and fuel from Saudi Arabia and the UAE. Saudi Arabia approved ?4 billion in aid to Egypt and the UAE has offered ?2 billion. ... Within minutes of the Saudi and UAE backed Egypt coup, the Emir of Qatar took note of the implications and announced his abdication in favor of his son, Tamim. Hamad bin Jassem al-Thani, who had shaped Qatar?s pro-Muslim Brotherhood foreign policy, has been silenced, replaced by a military man who had been serving as deputy interior minister. The new Qatar leadership is now using words like ?reassessment?, ?recalibration? and ?corrections? to discuss their foreign policy. ... The Saudi decision to take bold action to stop what it saw as a disastrous US Islamic strategy of backing Brotherhood revolutions across the Islamic world has dealt a blow to the mad US strategy of believing it can use the Brotherhood as a political force to control the Islamic world ... July 17, 2013 Former UK Ambassador?Charles Crawford @CharlesCrawford?says Obama's Cairo speech set the stage for the disaster in Egypt. Source July 16, 2013 According to Al- Watan News and Fox News the International MB organization held a secret meeting in Istanbul and considered latest developments in Egypt. The source based the news on some Turkish sources claiming that many of MB top leaders and leaders of other Islamist groups were placed in a hotel near Istanbul?s Ataturk Airport ... Turkey has stood against Egyptian army measure to resign Morsi. Repetition of its stance has forced Egyptian Foreign Minister to summon Turkish ambassador in Cairo to announce its opposition with the views of Turkish government and diplomatically warn Ankara against the negative impacts of its stances. Source Here's?Part 2 of The Glazov Gang The Gang members gathered to discuss The Brotherhood-Benghazi Connection, analyzing Morsi?s fall and the revelations it may yield. The episode also featured a segment entitled Longing for the Brotherhood, focusing on why Obama is missing Morsi and still backing him after his overthrow. H/T JihadWatch July 15, 2013 An Egyptian magazine claims that six American Islamist activists who work with the Obama administration are Muslim Brotherhood operatives who enjoy strong influence over U.S. policy. The Dec. 22 story published in Egypt?s Rose El-Youssef magazine read an IPT translation here suggests the six turned the White House ?from a position hostile to Islamic groups and organizations in the world to the largest and most important supporter of the Muslim Brotherhood.? The story is largely unsourced, but its publication is considered significant in raising the issue to Egyptian readers. The six named people include: Arif Alikhan, assistant secretary of Homeland Security for policy development; Mohammed Elibiary, a member of the Homeland Security Advisory Council; Rashad Hussain, the U.S. special envoy to the Organization of the Islamic Conference; Salam al-Marayati, co-founder of the Muslim Public Affairs Council MPAC ; Imam Mohamed Magid, president of the Islamic Society of North America ISNA ; and Eboo Patel, a member of President Obama?s Advisory Council on Faith-Based Neighborhood Partnerships. Source The downfall of the Muslim Brotherhood regime in Egypt has raised fears in Jordan that the Islamists may try to export their crisis to the Hashemite Kingdom of Jordan, one of the first Arab countries to voice support for the bloodless coup that toppled the regime of Mohamed Morsi. Although King Abdullah appears to have been relieved by the collapse of the Muslim Brotherhood regime in Egypt, he nevertheless has good reasons to be concerned about increased attempts to undermine his monarchy. Signs of the impending trouble awaiting King Abdullah emerged in the past few days as supporters of the Muslim Brotherhood recruited Syrian refugees in Jordan to take part in pro-Morsi rallies in Amman and other cities. Source H/t @metzada3833 Nice bit of light hearted Middle Eastern gossip to start the week off. Muslim Brotherhood media spokesman, Gehad Al Haddad?@gelhadded has a British passport and his LinkedIn profile mentions he was the Clinton foundation's man in Egypt for a couple of years as well. Check twitter status?for more LOL Obama can't define what's a 'military coup' In his article,?Mahmoud Salem @Sandmonkey?is ? setting the record straight ? regarding the legitimacy issue brought by the Muslim Brotherhood and its supporters. In other words, if the process by which a 'legit' government came to power was fatally flawed, is its ouster by the military still to be considered a coup? In these pages we have argued that Morsi's regime was illegitimate because every Sharia based government is, since it violates individual rights. U.S. law states that we can?t send military and other types of aid to any country whose duly elected head of state is deposed by a coup. U.S. law clearly says that we cannot send such aid where the military plays a decisive role in the coup. This law allows no presidential waiver. Aid cannot be reconsidered or restored until a democratically elected government is elected. Yet, as President Obama has so often done with other laws and even the Constitution, he ignores it. The Obama administration has refused to acknowledge that the military takeover in Egypt is a coup. When asked directly to spell out the State Department?s definition of a coup, spokeswoman Jen Psaki refused, saying only that, ?I?m happy to get you that, but I wouldn?t ascribe, you know, specific words. Each scenario is different. And if you need our specific, formal, government definition, we?ll get that around to everybody.? The State Department has yet to send a response.?? Thursday morning, it was reported that this relationship included delivering four F-16 fighter jets to Egypt in the next few weeks in addition to the eight we sent in January. Another eight are scheduled to ship later this year. It should also be noted that when the Egyptian military helped oust Mr. Mubarak ? the classic definition of a coup d?etat ? the Obama administration also declined to acknowledge even then that a coup had taken place. When we continued giving F-16s to Mr. Morsi and the Muslim Brotherhood after Mr. Mubarak, I offered an amendment to stop military aid to Egypt. It was defeated 79-19. The United States has cut off weapons aid in the past after military officers overthrew civilian governments in the Ivory Coast, the Central African Republic, Fiji, Honduras and Mali. In Egypt, however, where the regimes are constantly changing, our foreign-aid policy never does. This week, I introduced legislation again that would cut off foreign aid to Egypt. We either have a nation of laws, or we don?t. If we are a nation of laws, foreign aid to Egypt should immediately end. ... Source July 12, 2013 State Department spokeswoman Jen Psaki called Friday for the release of ousted Egyptian President Mohamed Morsy from detention, marking the first time the United States has made such a call. Psaki said the detentions of Morsy and members of the Muslim Brotherhood were politically motivated ;- and urged the military to let them go. Source July 10, 2013 Egypt's Daily News has an excellent piece by Farid Zahran why the US is supporting the Muslim Brotherhood, and explains why it is a grave mistake. Does the United States not know what?s happening in Egypt? July 5, 2013 Evidence that the Obama administration is unhappy with the Egyptian people?s liberation from Muslim Brotherhood rule continues to emerge. As reported today by Youm 7, according to Muhammad Heikal ? ?the Arab world?s most respected political commentator? and for some 50 years a political insider ? soon after the overthrow of Morsi, U.S. ambassador Anne Patterson assured Hisham Qandil, who hours ago was Egypt?s Prime Minister, that ?there are many forms of pressure, and America holds the keys to the Gulf.? ... Thus, and once again, the Obama administration makes indubitably clear that its primary interest in Egypt is to see the Muslim Brotherhood stay in power, the Egyptian people?s will ? the will of tens of millions of secularists, liberals, moderates, and Christians ? be damned. Source July 4, 2013 Morsi is the most hated man in Egypt, a close second is US President Obama, a close third is US Ambassador to Egypt Anne Patterson photos . While Obama scored points with the Egyptian people by helping to ease Mubarak out, he was seen as abandoning the plight of the people with his strong support of Morsi while ignoring the Muslim Brotherhood's repression of the people. Patterson, had continually refused to meet with the opposition. On June 18 the ambassador made a speech discouraging street protests: Some say that street action will produce better results than elections, Patterson said. To be honest, my government and I are deeply skeptical. Source July 3, 2013 The New York Times is spinning with all the might it can muster! Egyptians firmly lay the blame for Morsi?s calamitous year in office at the feet of the White House. As the photos below illustrate, Egyptians are fully cognizant of the fact that the Obama administration played a key role in contriving the revolution that toppled former President Mubarak. Signs held by protesters include, ?Wake up America, Obama backs a fascist regime in Egypt,? ?Obama Supports Terrorism,? and ?Obama Your Bitch is Our Dictator.? The signs also condemn the role of Anne Patterson, the US Ambassador to Egypt. As we previously highlighted, the 2011 revolution in Egypt was far from a grass roots uprising given that its organization was aided by establishment NGOs like Freedom House linked to the CIA and National Endowment for Democracy NED . Source