Keeping it simple again this moar-ning. Below charts are ALL THE SAME. I am just drilling down into my minis chart and giving you the technical breakdown from where we started to yesterday. All the same chart, so pay attention to the flow as I drill down and try and connect things so you at least the novices get it. Ask questions below if necessary. Glad to answer anything. I may work up the same for cash soon. Minis Weekly - Blue channel off the 2009 lows, look for the upper blue resistance diagonal in the charts below. At this time we're only concerned about the upside resistance. Hopefully one day soon we'll be concerning ourselves with that channels support. You also need to note the yellow ascending triangle where the E touch is in a major overthrow. It is a bit hard to see, but I've been showing it for over a year now so you know what's up with that. The apex of that triangle is in January, which may or may not concern us. Time will tell. Minis Daily - The upper right of the above chart. The beige channel off the November lows. This is the main driver of everything right now. Price drove up through upper yellow triangle resistance in the rising beige channel. The market made a serious statement when support of this beige channel broke during the taper on conversations. Because of this minor emergency BSB rather quickly made his infamous statement that if they stop easing the market will crash and that created the move back into the beige channel, the higher high and the red channel we're now in. Note the lower red - not the channel - support diagonal here as well Minis 4hr - note the proximity of the upper blue long tern market resistance line here near 1730 The red channel back into the beige channel has been dominated by two intermediate channels, white and green. We lost green support yesterday and closed on critical red channel support. My call of 1602 and then 1635 as critical points were spot on. The call that if 1635 went down 1700 would be in the cards has not been all that bad either. Minis 60m - Here focused on the green channel and the breakdown to red channel support yesterday. Minis 15m - a closer look at yesterday. Bottom line, the condition is critical if the red channel breaks down. As always, you know I prefer to see a backtest of busted prior support before further weakness. The way they have been playing this game, odds of that happening are pretty good but not a necessity. When they put on irrational ramps like these they leave massive support less areas and they know it. If red support goes then beige should eventually be the next stop. Other than the two minor support points 72 and 66 there is nothing to stop it to 1655 area and the beige support. Below that is the red support diagonal formed off the November low and the last taper off low near 1600. Below that? Well now price will be back into the yellow triangle and 1500 becomes one of the last serious supports left. So there you have a complete breakdown of the minis, how we got here, where we are and the support points that lie below. Let's not put any carts ahead of any horses quite yet. These assholes are not finished yet. They have a lot of money they still need to get out. I have discussed the volatility surrounding major tops for months now and we've seen some good and surprising action so far. Bull traps, bear squeezes, taper on/off, all sorts of battles are being waged up here as desperation sets in on team manipulation. That upper blue market resistance has not been hit yet and the 1700 bogey is still out there. That upper blue channel sits near 1730. I have not touched on bonds, gold, dollar, economics or any of that here. This is just the technical side. I did not forget the negative divergences, they are there on almost any time frame you want to look at. This market is at a point it could top any moment if it has not already. I've been incredibly patient NOT having called a top to the market since the QE2 end I'm one of the few if any left . My secret is having learned that this is their market. They drive the liquidity that drives the machine, and as long as that flows unhindered which it is beginning to be restricted they will levitate and raise as long as possible. Event , we may just have to wait for it. We're close. Very close. Remain patient and diligent. Look for their clues. They will be out there. Be ready, cause when this thing finally turns for good it will be like no other move in history as true capitulation explodes when everyone heads for the gates at the same time. More to come below as usual. I'll get some more specific and timely stuff up around the open. Note to the noobs in the comment section - please remain polite and courteous. You may disagree all you want with others, but you need to do it in a respectful manner. No name calling or threats or bets, just be sensible and use your facts to back up your point and may the best man win. Blatant, non-supported statements don't cut it. If you have the ability and knowledge bring it. The challenge will be welcomed. Bottom line is we want a peaceful place. Disruptions are not tolerated, Note, some arguments have been beat to death ie: PnF - and I mean beat to death that you may not have been around for. Some truly appreciate such information and some simply tolerate others positions or strategies at this point. That is just the way it is. We've got a good thing going here. Noobs are welcome to comment, discuss and share but attacks are not welcomed. If you've got an issue, bring it up, just do it in a respectful manner. If I have to get involved, it usually ends abruptly. ?Thanks, The Management.