Does a fish know that its nose is wet? Probably not. It swims in water, and assumes that is the only way any animal lives. We live in an economic world. Economic models that were developed years ago were created based on observations of how the economy seemed to work at the time. As time goes on, it is becoming clear that early economists missed important connections. The most important of these is the role of energy and its connection to the economy. It takes energy to make anything, from a piece of steel to a loaf of bread. It takes energy to transport anything. Humans need energy in the form of food to continue to live. Clearly, energy should have a place in economic models. In this post, I explain some of the basic principles as I see them: 1. Humans have evolved to be dependent on external energy. 2. Humans now supplement their own limited energy supply with external energy of various types. In general, the more external energy used, the more humans are able to control their environment. 3. Over the 1 million+ years during which humans have been able to control fire, humans have generally been in situations with favorable feedback loops, due to increasing efficiency in producing goods and services required to meet basic needs. Such loops allowed continued population growth and economic growth. 4. We are now reaching limits on these feedback loops. The result is feedback loops that are changing from favorable feedbacks to contraction. 5. Part of the change in feedback loops relates to the cost of energy sources, such as oil. A rise in the price of oil tends to reduce salaries of workers because of layoffs as well as reduce discretionary income because of higher price of food and commuting , contributing to the trend toward contraction. All of this is very concerning, because in the past, adverse feedback loops of this type ?seem to have led to collapse. The Many Types of Energy The most basic type of energy, at least from a human perspective, is human energy. This is the energy we as humans have that allows us to move our own bodies and allows us to think. Each of us is given approximately the same amount of energy, with males having somewhat more energy for lifting and pushing objects, and females having the special ability to give birth to new humans. In order to use human energy, humans need to eat food of appropriate kinds. Most of this food is from plants and animals that we process in some way for this purpose. This processing normally requires some type of energy. The only food that is not from plants and animals is mother?s milk. Women need to increase their own intake of food from plant and animals, in order to produce enough milk for their babies. Humans are able to leverage their own energy with many types of external energy. One very old source of external energy is burning wood and other plant matter. Such energy is used in keeping warm, cooking food, making sharper tools, and warding off predators. Another very old source of external energy is energy from dogs, trained to help with hunting, and from draft animals, trained to help with plowing and grinding tasks. Humans have learned to harness various other forms of other energy, such as wind, water, and geothermal energy. In the last 200 years, the use of fossil fuels coal, natural gas, and oil has greatly expanded the amount of external energy available to humans. Fossil fuels are important, not just because they can be burned directly, but because they enable the use of electricity from a wide range of sources?including hydroelectric, nuclear, and solar photovoltaic. While we think of these latter sources as non-carbon fuel sources, they are today available only within a system powered by fossil fuels. It takes fossil fuels to create metals in the quantity needed for electrical transmission; it takes fossil fuels to make and transport the type of concrete used in hydroelectric dams and wind turbines; it takes fossil fuels to purify silicon and other materials used in making solar PV. While people talk about a system that does not require fossil fuels, no one has mapped out how the world could in fact transition from a system that uses fossil fuels to capture these types of energy to a system that would work without fossil fuels. The best we can hope for within the next 100 years is to use fossil fuels more sparingly. One specialized form of energy is embedded energy that has been stored up in goods for the long term. Examples of early embedded energy includes heat-sharpened stone ax blades, used by hunter gatherers, and clothing, whether made by hand or machine. Today, there is much embedded energy in roads, pipelines, and electrical transmission systems. The vast majority of today?s embedded energy is derived from fossil fuels. External Energy as a Human Need Most animals seem to get along fine without external energy, other than the sun?s rays. They live in the parts of the world where they are adapted. They more or less live in balance with their predators. The number of a given species may rise for a while, but if the number grows too much, the species will exhaust its food supply, leading to population decline. Humans have moved to a different model. The change came when humans or predecessors to humans first learned to control fire, over 1,000,000 years ago. Being able to control fire gave humans many advantages over other animals. Humans were able to cook part of their food. This had many advantages: It greatly reduced chewing time, allowing time for other activities, such as making tools and clothing. It improved nutrition, by making food more digestible. It allowed the human body to evolve in ways that used more energy for brain development, and less for chewing and digestion. [i] The way the natural order works is that each species gives birth to far more offspring than is needed to survive to adulthood. ?Natural selection? determines which of these offspring will survive. If humans had been like apes, chimpanzees, or gorillas, total population might have reached a plateau of perhaps 3,000,000, based on historical animal populations . This limit would be reached because of competition with other species, and because climate is less hospitable outside of a narrow range. With the help of external energy, such as the controlled use of fire and the use of dogs for hunting, humans were able to gain an advantage over other species and spread to all areas of the globe. This is what allowed population to grow, and continues to help it grow. The natural order assures that far more human offspring are born than are needed to survive to adulthood. If humans are intelligent, they desire to extend their own lives and the lives of their offspring. The result of this dynamic is that there tends to be continual upward pressure on population. There is a second dynamic as well. Because of humans? intelligence, humans have the ability to over-consume at least some of the wildlife in the areas. For example, we learned on our recent visit to Iceland that when Vikings first discovered the island, there were both walruses and the flightless bird, the auk, on the island, but both disappeared soon after humans moved to the island. Because of these dynamics, there has been tendency to need more food, and more energy supplies of other types, over time. To meet the need for greater food supply, humans began using agriculture about 10,000 years ago. With the advent of agriculture, the amount of human food available per acre was greatly increased. The availability of agriculture added to the two dynamics noted previously for hunter-gatherers. As before, 1 population tended to increase, because the natural order provides for far more births than are needed for replacement, and because humans, with their intelligence, now had a way to provide more food per acre. Also, 2 there was a tendency of the amount of food available from a given acre of land to degrade over time, because the methods used for agriculture were less than perfect. Erosion was a problem, especially when planting was done on slopes. If irrigation was used, salt deposits often became a problem. Rising population combined with degrading resources led to a need recurring need for additional energy, since supplemental energy could indirectly add to food supply. In situations when additional energy was not found, populations had a tendency to collapse after many years of growth. Besides the two basic dynamics of rising population and degrading resources leading to a need for additional resources, there were other forces that tended to add to the need for increasing amounts of energy: a. Cheapest resources used first. Soon after agriculture began, humans began to use resources of other types, such as wood from forests and metals such as iron and bronze. With any of these resources, there is a tendency to use the ?cheapest? easiest to extract, closest at hand, highest ore concentration first. If extraction is to continue, increasing amounts of energy per unit extracted are likely to be required for later extraction. b. Increased disease transmission when population is packed more closely together. This issue can be overcome with techniques that kill germs and that keep humans separated from waste products of other humans. The need for these techniques adds to the need for external energy. c. Deforestation. Without fossil fuels, there was a severe tendency to overuse forests. Deforestation occurred as early as 4000 B. C. E., according to Sing Chew. Historian Norman Cantor writes, ?By 1500 Europe was on the edge of a fuel and nutritional disaster [from] which it was saved in the sixteenth century only by the burning of soft coal and the cultivation of potatoes and maize.??The use of coal allowed more energy per person, and took pressure off of limited forest resources. d. Pull of Technology. The availability of fossil fuels, starting around 1800, has allowed much of what we now call ?technology.? Without fossil fuels, our ability to make materials such as metals and glass is severely restricted. Without fossil fuels, we are also lacking for the basic building blocks for plastics, synthetic fabrics, and even modern medicines. Technology provided ways to use fossil fuel resources in ways that helped overcome many human limits. The desire to use more technology led to increasing use of fossil fuels in the 19th and 20th centuries. Hunter-Gatherer Economies There were no doubt many different types of economies in the over one million years when humans and pre-humans were hunter-gatherers. One documented approach is the gift-economy. With this approach, those who killed animals shared what they obtained with others in their group. Status was gained based on how much an individual was able to provide to others in the group. Members of the group played different roles?some were involved with caring for children, or too old to work, but what was available was shared with the group as a whole. In the days of hunter-gatherers, the function of the economy was not too complicated. There was little need to ?save for tomorrow,? because it was difficult to carry anything during travels. The amount of food an individual could eat was pretty much limited by appetite, so having ?more food? for one individual wasn?t particularly helpful. If one person was the leader, he or she might have special adornment. If population rose too high, relative to resources, this may not have been apparent in ?normal? times?when weather was good, and when a particular hunter-gatherer group had an area to itself. But if there was a major weather problem or an encounter with another group needing space as well, population pressure could lead to a crisis. It seems likely that die-offs occurred from time to time, especially during natural ?bottle-necks.? A Simple Agricultural Economy Thinking about a simple agricultural society gives us some insight as to how early economies must have operated. Consider a simple economy in which some members produce barley; others produce fish. The fish can be salted and dried, so both the fish and the barley can be stored, if desired. The big issue in such a system is how efficient the barley and fish operation is. If in order to feed the group, half of the group must work full time growing barley, and half of the group must work full time catching, salting, and drying fish, then no matter what kind of economic system is in place, the result will simply be trading fish for barley. Everyone will continue to have to work at either producing fish or barley. The economic system will simply move some of the fish to the barley producers, and some of the barley to the fish producers. Let?s suppose instead that the barley and fish producers are much more efficient. Suppose that with 10% of the population working at barley production and 10% of the population working at fish production, the population can provide enough food for the full population, leaving 80% of the population 100% ? 10% barley producers ? 10% fish producers to pursue other activities. How the remaining 80% of the population will spend its time will depend on resources available and the desires of the citizens. Perhaps 30% of the citizens would make goods of various types build homes, make clothing, and make furniture and 20% of the citizens would provide services of various types education, health, artwork, and hair cutting . This would leave 30% for government and finance. The government portion would include pay for government officials and police and transfer payments to the elderly and disabled. The total wealth of the community is then the sum of all of the goods and services in this community. The financial system will redistribute the goods and services produced among the members of the community, perhaps allowing some ?savings? for future consumption. Those producing goods and services will expect to be included in the redistribution, but so will others, if this has been the tradition in the community. If the economy operates without fossil fuels, the quantity produced is limited by the speed with which biomass regrows. Thus, unless the community is willing to live with deforestation, it can?t use much wood each year. This puts a severe limit on the amount of goods produced. Printing more money does not change this dynamic. In the example above, I suggested an efficient economy might need only 20% of its population for food production. In fact, the percentage of the population involved in food production varies greatly across economies. Before fossil fuels use, typically 80% of the population of a country was involved in agriculture. With so many involved in agriculture, the number who were involved in manufacturing and services of all types including government services was necessarily very limited, because they needed to be ?squeezed into? the remaining 20% of the economy. If, in our hypothetical community, population rises because more children live to maturity, this adds a new dynamic. There is a need for more food, clothing, and housing for the growing population. Unless land area keeps increasing, there becomes a need to grow more barley per acre. In a world without fossil fuels, increasing grain yields becomes difficult. More farmers can be added to a given plot, but the additional yield for additional manual effort perhaps picking off insects that might eat the crop is not very high. This dynamic tends to lead to what we think of as falling wages of the common worker, when population becomes high relative to resources available. As I have mentioned in previous posts, based on the book Secular Cycles by Turchin and Nefedof, collapse often occurs in such situations. Governments have promised significant services, but it becomes difficult to collect enough taxes to pay for these services, with falling wages of the common worker. The dynamic is similar if energy supplies of types other than food such as oil and coal does not rise as fast as population. The amount of goods produced using these energy supplies will tend to fall, unless technology advances are able to offset the decline in energy consumption per capita. Such technology is normally fossil fuel dependent. If goods per capita falls, this will be reflected in what we think of as falling inflation-adjusted wages, since it is not possible for workers to have more than what is produced. Adding Fossil Fuels If metal tools can be used?say metal plows?these metal tools can greatly ramp up efficiency of farming, allowing fewer people to work in the agricultural sector. If we think about the result in the last section, this situation allows a greater proportion of the population to be employed in producing discretionary services, and thus more wealth for the community as a whole. The problem with making metals such as iron using renewable resources is that huge amounts of charcoal are needed to make even small amounts of iron. If one wants reasonable quantities of metal, or modern alloys such as steel used in plows and trucks, a person needs fossil fuels. If a person wants to add fossil fuels and the things that fossil fuels can make to a community that does not have fossil fuels, the question becomes how to pay for the new goods using fossil fuels. As an extreme example, if farmers have always planted barley with a stick, the amount of barley each farmer produces is tiny, and the population is likely mostly farmers. If a farmer can use a new tractor, with the latest equipment, a single farmer can perhaps feed the whole community. The tractor will provide the improved efficiency needed to free up a whole community of workers for other purposes. The secret to adding fossil fuels or any kind of energy source that can improve efficiency, and allow fewer people to produce essential goods and services is debt. While the farmer cannot pay for the new tractor with his earnings from growing barley using a stick, the farmer can indeed pay for the tractor with all of the goods and services that the whole community can produce, as the result of the tractor handling work that now takes many workers to do. By growing much more grain, and selling that grain to all of the workers who are now freed up to provide discretionary services, the farmer will have enough funds in the future to repay the loan for the equipment which will allow much greater efficiency. The problem is that the tractor requires a huge amount of embedded energy from fossil fuels. Workers who have been working without fossil fuels will not be able to earn enough to pay for this embedded energy without debt. Salaries of Workers In my imaginary simplified economy, there is only one country. In such a country, the amount of salaries that workers receive then is closely related to the amount of goods and services that the economy produces. There will be part of the production that goes to the owners of factories, farms, and other sources of production, but they cannot eat any more than anyone else, or sleep in more than one place at a time. If they get paid much more than others, some of it must be in the form of ?paper income? that they can theoretically use at some time in the future, but does not involve current consumption. In general, the more goods and services produced relative to the population, the more workers will receive in inflation-adjusted salary. If the economy is so distorted that most of the goods are made with machines, the government must play a much bigger role, providing transfer payments to those who cannot find employment unless the government is prepared to handle uprisings by citizens . If workers are not receiving adequate wages to pay the taxes, taxes will need to come from some other source?possibly from the owners of the sources of production. To see how a rise in oil prices will affect the economy, lets consider what can be expected to happen to a manufacturing company. Suppose that for a particular manufacturer, costs are distributed as follows the actual percentages aren?t important?just the point that wages tend to be a big piece of the total : If the cost of oil doubles and the manufacturer is not able to raise prices, the higher cost will wipe out profits. In fact, the cost of other raw materials is likely to rise as well, because oil is used in extracting and transporting raw materials. This will make the impact on profit even worse than the oil-only comparison would suggest. To ?fix? the problem, the manufacturer has to make some sort of adjustment, and the adjustment will almost certainly lead to less dollars being paid for wages. One such approach is to ?make a smaller batch,? with the amount produced equal to what can be sold at the higher price. If this is done, the manufacturer will employ fewer workers. It will also cut back on oil consumption, other raw materials, electricity consumption, and rent. The result will look like recession. Thus, a rise in oil prices, such has happened since the early 2000s, can be expected to affect feedback loops for countries that use very much oil. The Positive-Feedback Loop When can an economy grow? If an economy can grow in efficiency?that is, fewer and fewer people employed creating the basic requirements for life, then more of the population can be employed in providing discretionary services. In total, the wealth of the economy will grow. Historically, this has happened as increasing amounts of fossil fuel energy is added to supplement human energy. If an economy can increase its debt, and that debt can finance equipment or infrastructure that will allow greater efficiency in producing basic services, this will also allow an economy to grow. In economic analyses, increases in population are counted as part of economic growth. The problem with population growth is that it leads to more population per acre available for cultivation, and more population relative to external energy sources of all types. This sets up a competition: can enough external energy be added to maintain and even increase goods and services per capita? Economies of scale are also important as producing positive feedback loops. Once an energy investment, such as a road, is made, it can be used for an increasingly large population, often without much additional cost. Businesses also find growth beneficial, since they can build a factory, and operate it more hours, with little additional cost. The combination of all of these favorable feedbacks leads to the pattern of growth that economists seem to think always occurs. What Can Go Wrong? The big ?oops? that takes place happens when we start hitting natural limits: 1. The cost of oil extraction goes up, because we pulled the easy-to-extract oil out first. This means that workers start having less discretionary income, rather than more, because they now needed to spend more on commuting to work and on food. Wages tend to stagnate or decline, for reasons described above. A larger percentage of the population needs to work in oil extraction, and more fossil fuels of various types must be used in oil extraction, leaving fewer workers and less energy supplies for other purposes. 2. The economies of countries consuming large amounts of oil are disproportionately affected by rising prices, and oil consumption begins to drop in these countries, even though world oil consumption in total is still rising. 3. Debt added to produce oil tends to produce fewer and fewer barrels of oil per dollar invested, as the cost of oil extraction rises. With fewer barrels of oil produced per dollar of investment, less goods are transported per dollar invested. If other energy products also rise in cost of extraction, or if the cost of making metals increases, we reach a situation where increasing debt, in general, starts adding a smaller and smaller quantity of goods per dollar of investment. Substituting a different high-cost source of energy does not fix the situation. Eventually, so little benefit is gained from additional debt that huge defaults occur. These huge defaults are likely to lead to higher interest rates and more layoffs. Of course, during favorable feedback loops, the economic growth that comes with increasing energy consumption plays a major role in permitting debt to be paid back with interest. If energy consumption, in fact, starts contracting, this contraction will contribute to debt defaults. 4. As the economies of individual countries got richer and richer, the natural tendency was to add more government services. Pensions and health care were promised, based on what looked possible when the economy was growing rapidly. Now, the economy is not growing as rapidly, and increasing wage disparity is occurring. There is no way to tax the common people enough to pay for the benefits promised to people. People become very unhappy when told that the government cannot pay promised pension benefits. The tendency is toward increasing unhappiness with government status quo, perhaps even leading to new cheaper forms of government. 5. Because of energy limits, we find a need to conserve, but in the process discover that we are inadvertently hitting ?diseconomies of lack of scale? instead of ?economies of scale?. Instead of continually adding new jobs based on construction of new infrastructure, job opportunities for young people start to disappear. This adds to the dynamic of contraction, even if changes are planned. 6. All the time, natural forces are eroding the huge amount of infrastructure that has been built. Hurricanes and earthquakes cause destruction that must be fixed, if the current system is to be maintained. Lesser forces, such as freezing and thawing and roots of trees growing tend to ruin roads over time, and cause buildings to need repairs. While this has always happened, if the government is poorer, the cost becomes an increasing burden. As a result of these influences, the natural feedback loop is now changing to contraction, instead of continually adding a positive increment. This is an unknown situation relative to what we are used to. There is no ?reverse gear? on the economy. We know that in the past, economies that have hit these adverse feedback loops have tended to collapse. The situation is indeed worrisome. This path-breaking volume explores cultures of energy, the underlying but under-appreciated dimensions of both crisis and innovation in resource use around the globe. Theoretical chapters situate pressing energy issues in larger conceptual frames, and ethnographic case studies reveal energy as it is imagined, used, and contested in a variety of cultural contexts. Contributors address issues including the connection between resource flows and social relationships in energy systems; cultural transformation and notions of progress and collapse; the blurring of technology and magic; social tensions that accompany energy contraction; and sociocultural changes required in affluent societies to reduce dependence on fossil fuels. Each of five thematic sections concludes with an integrative and provocative conversation among the authors. The volume is an ideal tool for teaching unique, contemporary, and comparative perspectives on social theories of science and technology in undergraduate and graduate courses. As I see it, the big problem with ?Limits to Growth analyses? is that they does not consider financial factors. In particular, they look at the oil issue as an ?oil supply? problem. Thus, the issue is one of spacing out the huge amount of oil supply still seen to be in the ground. This is part of the reason why Jorgen Randers is now concerned about climate change, rather than oil limits. The analysis back in 1972 was better, because at least then, the amounts were fairly close to reasonable, and the lack of financial feedbacks was not such a problem. The big thing the Limits to Growth analyses miss is the fact that issue is not an oil supply problem, it is an oil demand problem. Workers are not rich enough to afford the high priced oil that is being put on the market. It is actually the lack of demand that causes the feedbacks that we see. Lack of demand comes from the fact that we are talking about an economic concept?a person who is unemployed has no demand for oil, or for that matter, food and water. Of course, in the real world, such people riot when there is not enough food and water, indirectly because of lack of oil. So the economic concept does not explain the physical reality that people need food even if grown using oil , whether or not they can pay for it. There are also many other feedback loops. We are now very dependent on debt. Without economic growth coming from ever-increasing oil supply , it is very difficult to repay debt with interest. Once debt defaults start in earnest, it is hard to maintain demand for oil. Banks create money not out of thin air with debt, but by getting people to promise to use energy and other resources in the future. The current debt load is collectively promises to burn up a thousand times as much oil as is available to create the wealth to pay the debts. Gail, I?ve enjoyed your commentary in the past, but you kinda went off on more tangents than I could follow in this one, and missed the tax system as part of the economic feedbacks. All of the manipulations of income tax are basically positive feedback mechanisms along with debts designed to accelerate the impossible idea of perpetual growth by deceiving people into taking on more and more debt promises to produce/consume in the future . Readers come from a lot of different backgrounds. If you are coming from a modeling background, and understand that the simplest models are best, the article makes perfect sense. I got some very nice e-mail comments from people working in the field, who think about things from my perspective. I am showing how current economic assumptions are wrong. If you come from a different background, my comments probably sound strange?not quite understandable. Sorry about that! Civilization involves substituting external energy for human energy. This can result in people being unemployed, and being treated as if they don?t matter. Governments have traditionally been they ones to ?even out? what goes wrong, partly by making rules for businesses to operate under, and partly by using the tax system for redistribution of funds. But at this point, they are becoming increasingly powerless. Their tax revenue is increasingly coming from wages, because businesses have escaped to overseas tax havens, and because the tax code has been written to reduce tax rates for non-wage income. At the same time, wages of the common worker are falling when one considers unemployed plus those with low wage jobs . Governments have figured out that increased debt can in some ways substitute for lack of wages?for example, if you get a loan for a new car you really can?t afford, you can buy it. Since the government doesn?t have any other way to fix the system, they are trying to fix it in ways they can?holding down interest rates, giving government backed loans for things like higher education, and keeping the mortgage interest deduction in the tax code. Thanks for taking so much time to be nice and not say ?you?re not an economist, so you can?t understand my models?. I?ll go with two points: Wendell Berry, when addressing the agronomists? view that there were too many farmers and that?s why the family farms were dying, said ?The agronomists say there are too many farmers, but you won?t hear an agronomist say there are too many agronomists.? Second point is that what makes a human being a human being IS their ability to make a model of the universe and move the ego into that model, avoiding reality at all costs. The simplest models are the ones that least reflect the actuality of the universe, and in doing so, they work well for a specific purpose but fail in the complexities of nature. The simplest nature model is going to be one that considers what it is that allows a species to exist or go extinct, and THAT is the model of its usefulness to its own future vs. its consumption of resources. Prior to civilization, we can safely say that humans were a cooperative part of the environment, and their activities added something net useful or they would have gone extinct instead of persisting however harsh that existence was . In another tack, we have spent the last 100 years or so replacing the usefulness of people on the land with petroleum and pesticides so that less than 1% of the population produces all of the food. Meanwhile, that same ?efficiency? has allowed the 99% to become too fat and stupid to produce their own food. It is an irreversible process of evolutionary laziness and denial. I didn?t mean to be at all disparaging to your wonderful attempts to show the wrongs inside the economic models. I am just trying to push a little toward the outside of the money and bullying box that capitalism has used to encapsulate and homogenize civlization. The question that should be asked along with all of the other questions related to what is good for civlization is ?Should everyone be civilized?? I submit that the land says ?no?, and the actual ?middle? class should be somewhere between the ?uncivilized? land dwellers and the civilized money slaves. Right now, we have two classes: those who have to work themselves to death in order to eat, and those who never have to worry about eating. Excluded are the somnambulant public that doesn?t know it is working itself to death or extinction via the use of ?efficient? energy products. I sent you some scribblings on that very matter Gail. It very much is my extension on your premises. Namely that we wont actually run out of fossil fuel, simply that it will price itself out of the energy market. That leaves plenty for the chemical industry. Working on my own premise, than renewable energy is overall far far more expensive than nuclear, and cannot actually be constricted operated and maintained without huge use of fossil energy in portable maintenance that it needs. that leads to a gradual and natural translation to more or less all nuclear as the dominant source of primary energy over the next 50 years. Anything that can be done with electricity will be, and anything that can?t ? well in the limit one can synthesise hydrocarbon fuels, albeit at a price that makes them pointless as a source of *primary* energy, but a very useful energy-dense and portable way of *storing* energy for mainly portable applications. That plus the possible development of lithium air batteries, which also are potentially just good enough to be used for transport off grid, looks likely to be the only way we will preserve society at anything like its current levels. The final conclusion I reached, is that there is really no need to panic. Stripped of government interference and green lunacy, we will continue to burn fossil until it becomes uncompetitive with nuclear, at which point investment in nuclear will happen naturally ? as it is doing in some developing and oil rich but not for long states. whilst we still have relatively cheap fossil and a massively anti-nuclear regulatory system, we don?t need to/won?t find it economic to build nuclear. I suspect we have around 30-50years of unconventional gas to run electric generating sets off.And 5 years more of renewables to arrive at the conclusion they are not a viable solution. Having run the numbers, I think that really we barely need to talk about the issues. Governments can distort markets, but not forever. In the end there is only one generic replacement for fossil, and that?s nuclear of one sort or another. Nations who fail to rise to the challenge will be economically disadvantaged and ease to be globally significant. The USA is sitting on vast reserves of coal. It need not worry. Where the USA is however far more vulnerable is its utter dependence on the automobile. Coal to gasoline is not cheap. And the distances involved in the USA make it dependent on cheap long distance transport, and it lacks rail infrastructure of any quality. A huge social transition away from car use will therefore have to take place, unless cheap safe reliable long lived and high capacity batteries can be developed. I wont be holding my breath though. But there is no need to panic. I see the transition away from fossil as a gradual thing taking 30-50 years to happen, with many false alleys explored before the inevitable transition to the only real alternative happens. Panic helps the rent seekers push their snake oil solutions, but that is in the end just commercial froth on the tide that is sweeping us away from where we are to a less known future. The transition from coal to oil was really a 50 year process in the UK, with the first cars appearing at the turn of the century, the first aircraft a decade later, and then a period of rapid development of a petroleum based economy really achieving maturity in the 1960s when the last steam locomotives were decommissioned and mostly scrapped. Remember that nuclear power was a by product of military developments of nuclear weapons. To cook up plutonium generated a lot of heat, and using that to generate electricity was an obvious solution. Which is why the communist inspired hard left was always so anti-nuclear of course. That movement morphed into the Green movement, or at least infiltrated it and took it over. Ecology was an ideal way to promote the agenda of the Big State and a centralised command and control approach to economic management. But in the end, as the collapse of the USSR demonstrated, you can?t run a command and control economy as efficiently as a free market one. There are too many and too diverse a set of variables to cover them all efficiently by a centralised decision making process. Political pragmatism that allow local solutions to local problems are in the end, better. Europe is slightly ahead of the curve here, with a tremendous experiment in what amounts to a neo communist state being constructed, and huge investment in ?5 year plans? of renewable energy., but the writing is already on the wall ? huge sums spent, huge profits made, no effective reduction in fossil fuel usage. Whilst the French experience of 80% nuclear and lower electricity prices than most places, stands as te ideal counter example. Even here, in the bastion of renewable fluff and BS, the EU is being forced to re-think its strategy as too many member countries need or want active nuclear programs. The UK?s admittedly insane ?carbon plan? document calls for no less than more nuclear power than the entire UK grid capacity at the moment, and three times as much renewable capacity as that, by 2050. This is to reach the almost 100% incompatible targets of a ?zero carbon? nation, and ?30% of that by renewable energy?. The total insanity of spending a fortune on nuclear, which could do the job alone, and then spending the same amount three times over, in order to make it have a ?renewable? component, is never addressed . I am less interested in arguing with committed ideologues about this or that. These days I write it down, show the premises on which the arguments are based, and the logical extrapolations of those arguments. When the mist trouble ridden nuclear plant ever, in Finland, is still on target to beat, gigawatt for gigawatt, the latest and most lauded offshore windfarm in the UK, in terms of cost per megawatt *capacity*, and when you then understand that it will last three times longer and produce in its life more than ten times the power without needing backup from fossil plant, its not hard to refute the proposition that nuclear is more expensive than renewable energy. It?s still twice as expensive as coal, though. And with the climate change agenda in tatters as the climate stubbornly refuses to actually change at anything like an alarming enough rate to justify the enormous sums being spent on not making the slightest difference to emissions, its more than likely that coal will be the US backbone of power generation for the next 50 years. For completeness, I suggest a few more feedback loops. 1. Both natural evolution and human thinking can foster the phenomenon we observe and call The Constructal Law. That Law is described in Adrian Bejan?s book Design In Nature: How the Constructal Law Governs Evolution in Biology, Physics, Technology, and Social Organization. I?ll just quote two jacket blurbs: Scott Turner: The most amazing thing about life is that it exists at all. The second most amazing thing about life is that living things eem to be so very good at it. In his bold new book Bejan asks why, and his answer cuts to the very core of what life is?organized flows of heat, electricity, matter, and energy. From this deceptively simply idea, Bejan takes us on an incredible expedition through life?s vast scope, from the tiniest cell to organism to societies to ecosystems to the entire planet. It is a bracing journey. Steven Vogel: Thought provoking! Thermodynamics may determine where you?re going: here?s a rule that tells how you get there. And so simple?the more efficient the pathway, the more likely is its persistence, whatever the mechanism behind that persistence. This is science at its biggest and boldest. So the first feedback loop is the continual tinkering by the natural world and also by human intelligence to find a more efficient path. As an example, modern computers would not be possible with 1960s heat dissipation technology. Bejan has been one of the leading innovators designing new ways to disperse the heat from chips. 2. Humans are motivated primarily by hormones which Bejan ignores . We want to feel good e.g., flood our bodies with oxytocin . Economies as we understand them today are quite crude machines in terms of producing favorable hormonal outcomes. I recommend the Sara Gottfried, MD book The Hormone Cure: Reclaim Balance, Sleep, Sex Drive & Vitality, Naturally With The Gottfried Protocol. This can be seen as another example of The Constructal Law, but the implications are so huge I think it deserves its own entry. Why do we need to ?reclaim? all those good things that Dr. Sara asserts that we have lost? Well?it?s because we live the way we do. If we are going to reclaim them, then we have to find more efficient ways to manage those hormones. As examples, she urges stress reduction, pesticide free food, a life without endocrine disrupters e.g., BPA , and more practice of some of the aspects of Positive Psychology. So one revolutionary possibility is that humans learn that hormonal balance is really what it is all about, that Corporations and the Global Economy give us only the illusion of hormonal balance, and that much simpler living arrangements will give us much more payoff. 3. Finally, and building on Bejan and Gottfried, we may learn to appreciate the world as it is rather than as we initially think we would like for it to be. For example, Thoreau at Walden Pond spent quite a bit of time stretched out on the ice covering the pond and closely observing it. It is hard to imagine a TV show where the host of a party tells the invited guests to ?dress for some ice examination on the pond?. Yet Thoreau?s 175 year old idea may be quite efficient in terms of generating the sort of positive hormonal feedback loops that we desire. The Constructal Law is fundamentally destructive of existing structures and methods. So if one starts with the assumption that ?we have to keep everything just as it is? Jody Tishmak?s Law , then we will continue to do everything the hard way. We will continue to tax people to support governments which administer terribly inefficient solutions to give us things we think we want but which are actually quite harmful. We will continue to patronize corporations which peddle faux solutions. We will continue to design our built environment in inefficient ways. And we will continue to destroy the natural world which can provide us with endless entertainment. Here I go with my first post on this blog and I can only hope that what I write is as thought provoking and sensible and relevant as the many articles presented by Gail, along with the many posts by Don, Scott, reverseengineer and many others whose opinions and insights and knowledge sharing has definitely enlightened me over these last two weeks. Although I have long envisioned a time when the ?world as we know it? will come to an end, I always believed that ?the end? would come at some point rather too distant in the future for me to concern myself with. But that all changed approximately one month ago. I?m a regular and voracious consumer of news articles and political blogs on the internet. I?m not sure what the trigger was ? maybe the Snowden revelations ? but about one month ago I suddenly felt the hair on my back raising ? so to speak ? and I fell into a state of near-constant obsession with my sudden instinctive feeling that hey, this world as we know it is on the brink of collapse. I began seeking answers. My efforts led me to ?The Death of Peak Oil? on the Oil Drum. And it was from that blog that I clicked a link and found my way here. In the last two weeks, I have read nearly all of the articles on this blog and the comments, digesting them as fast as possible. Everything I read confirms my instinctive feeling that we are very, very close to a dramatic turn of events. For what it is worth, I would like to present a few of my thoughts. I only hope to contribute in some small way to the wealth of information and insight presented on this blog, and to perhaps cause others to consider ideas that might somehow be of benefit. The first concept is this: The vast majority of people on this planet are living either in a state of absolute denial about the impending collapse, or in a state of total ignorance, or both. One of my co-workers is an extremely bright guy about 30 years old. I have shared articles and YouTube videos with him that clearly explain the coming crisis ? rather, the crisis that is developing even now. His reaction is to smile slightly, turn away and resume his normal routine. He doesn?t ?get? it, and in fact I can tell by his reactions that he?s thinking I might be a little loopy on this one topic, despite the fact that he and others in this company depend on me daily to make logical and insightful decisions that determine all of our daily schedules to a certain extent. Even my partner of almost ten years just kind of shakes her head and smiles politely when I try to explain these things to here in any detail. She patiently tolerates my sudden rush to accumulate items that I believe will be necessary for survival in the future ? things like grain mills, food storage containers, seed, etc? The point is, unless Obama himself were to stand up in an official capacity and announce dramatically that the world we all know is about to crash down upon us, something like 99 percent of the people on this plant just won?t ever see the light. Some, including on this blog, assert that the mainstream media is doing a very poor job of alerting the population to the impending upheavals. I?m going to disagree with that point, and here is why. Sure, the MSM is not stating point-blank that the world as we know it is about to end ? that, as we know, would result in chaos, total destruction of consumer confidence, riots and mass hysteria that would effectively shut the economy down in a matter of days. Instead, what the MSM does is continually publish articles interspersed with news about the Royal Baby and other ?news? which alerts those of us who ?get it?, and gives us insight and facts that help us to make our preparations. I hope we can all agree that there is a ?ruling elite? in this world ? the ?corporatocracy? is a good enough term ? which is well aware of the impending upheavals and are making plans to not only survive the collapse, but to remain in power and to remain in control of the bare-bones military and communications structures needed to maintain their supremacy. I don?t blame them for this, and indeed, I suspect that they are motivated in great part by an ideology that is humanistic and realistic at the same time. Our planet is being destroyed by over-population. Do we stretch out whatever remaining resources oil, coal, gas, rare earth minerals, etc? to maintain the 7 billion lives for as long as possible until finally there is no more left? Or, knowing that it is impossible to maintain 7 billion lives for any significant length of time without destroying their own ability to wield power and law and order along with everything else, do they determine that at a certain strategic point they will simply ?flip the switch? ? halt deliveries of oil and gas, bring industry and international trade to a grinding halt ? in effect, bring on the collapse in a single day or two and let the chips fall where they may? I believe that the powers that be in the world are colluding, planning and preparing. I believe that they are consolidating industrial capability, top scientists and engineers, developing plans to carry our scientific capabilities and industrial capabilities into the ?new age? ? but on a much smaller and more efficient scale. I even believe that they are maintaining plans to further develop our space program with the goals being to protect the world from destruction by asteroids/comets, and to ultimately reach a point where we can send humans to live on another planet. If I were one of the elites, that?s what I would be doing. But they are going to need a lot of gas and oil to continue that research/development, and to maintain military and law and order. Letting BAU continue until we eventually run out of resources is not an option. I believe that the elite powers that be will keep the economy propped up and maintain BAU up until the point that they are ready to ?flick the switch? ? or perhaps more aptly ? ?pull the plug?. That could be tomorrow, next month or any time. But I suspect that the timing will closely coincide with the return of our troops from Afghanistan. Pure speculation on my part, of course. But when you know that your government and elites are purposely keeping information from you, speculation is a natural and worthwhile response. I too have the family and friends not ?getting it?. At first it troubled me, but I just try to maintain my learning about these issues, and at the very least preserve some semblance of psychological resilience. You feel at times that you are living a dual life, but that seems to go with the territory of awareness. I know, personally, a few very wealthy financiers, and judging by their conversation and ? above all ? their actions, they are, like everyone else, still more preoccupied with finding good investments than building Doomsday Bunkers although one did buy a lot of canned baked beans at one stage in 2008! His poor son is now having to finish them up,- waste not want not . xabier, great response! If I gave the impression that I was ?against? or ?afraid of? the possible centralization of command/control by ?the elites? after the flicking of that switch, please allow me to clarify. I find myself hoping that some group of elites will manage to consolidate the best of human technology and scientific capability into a safe location, and to wield enough military power to control the mobs and enforce some sort of order after all the dust settles. But that hope is probably just derived from my overall need for order and discipline ? I?m projecting, no doubt? Agree with you totally on all the failed attempts to control events in WWII, Iraq, Japan and elsewhere ? BUT a group of elites and their selected minions might just retire to a safe location after having secured vital strategic assets nuclear facilities, dams, gas/oil production facilities, etc? and let the whole de-population thing play out on its own without trying to control events other than to protect selected assets , then reemerge at some point to take control of whatever is left. That, to me, doesn?t seem especially difficult to accomplish. One time, quite a few years ago, I met with staffers who were at that time working on the Savings and Loan crisis. They were trying to get help from actuaries on the problem of savings and loans being insured in such a way that the riskier the investment the S&L made, the better off it was, because 1 in the case of winnings, the S&L came out ahead, and 2 in the case of loss, the insurance coverage protected the depositor from loss. The impression I got at that time was that very young people were being given a lot of responsibility. Also, in the case of the S&L problem that we talked to them about, it really never has been fixed. S&Ls are now merged into banks in general, but it is still a situation of ?head the banks win, tails the FDIC picks up the tab.? I am not really convinced that the federal government can really do all that much. Even when they want to, they can?t do that much. I know that various ones have been quoted as talking about ?peak oil,? so they no doubt are generally aware of the problem. But even when they are trying to fix problems, they are not very successful. Although that doesn?t stop them thinking that they do, or convincing gullible electorates that they can. I am both certain that they are making plans, lots of plans, which include their own survival as the top priority. I am equally sure that their plans will, in the end, be ineffective. Cursory systems analysis on energy flows, such as you have preformed, show that in the end, having money on paper, is only as good as some serfs willingness to take that paper. A bar of gold in a vault in Switzerland is useless if you cant get to Switzerland and get it, or when you do people are more interested in a gallon of gasoline than gold. What use money in a bank, when there is no electricity to run the ATM, or verify your credit card? There is a model in which a small cadre of deeply intelligent technocrats could essentially create a society in which the work is all done by machines, and they live in luxury surrounded by a technologically sophisticated military whose job it is to keep the peasants out, or simply kill them off. But there are zero signs that the people capable of building such a society are either interested on doing so, or indeed in control of the existing political and corporate structures. Far more likley is descent into neo-communism, as a political elite with military backing fumble and destroy rather than create. Or a simple banana republic type dictatorship, where a man with no intelligence beyond the simple crude peasant cunning of a Stalin or Mugabe, browbeats a population into economic destruction, whilst temporarily enjoying the fruits of being top dog. NO, we muddle along, and the world itself is too complex a beast to control by and large, and has powers and realities far beyond the imaginings of a slightly more sophisticated ape. Far better to examine the world than what is going on in the minds of men. In the and nature rules, and always has done. And we are of no concern at all. We are simply froth temporarily riding an entropy wave, that will one day peter out, living on a planet composed entirely of nuclear waste, engendered by some long forgotten supernova fusion blast, orbiting a rather ordinary nuclear fusion reactor. And that is the problem with being a sophisticated technocrat. By the time you understand what it takes to rule the world of men, it all seems rather a stupid and pointless aim to have. Gail, desperate attempts by politicians and elites to keep BAU going until the bitter end seems to me to be the worst possible scenario ? excessively wasteful, reeking of cowardice and desparation. I prefer to believe otherwise, while acknowledging that I?m probably wrong. Dimitri Orlov, in one of his YouTube presentations, reflects on his belief that the super-wealthy and powerful elites are living in denial, and that they of all people will fall the hardest once reality comes home to roost. He?s probably right, and so are you. The complex machine that is our economy seems to be steamrolling toward a cliff of no return, impossible to control, consuming and excreting with every lurch forward, unstoppable, totally indifferent to life or nature. It is the creation of human greed and lust for power, a terrifying monster of our worst nightmares. The only hope remaining, I suppose, is that good and intelligent people will prepare themselves to weather the storms, and raise their children to be both wiser and more in tune with nature than those who have collectively brought us to this sorry point in history. I am now going with the working assumption that when someone has that Eureka moment with regard to our energy, resources and overpopulation quandary, that he/she will likely exhibit many symptoms of a clinically depressed person, if not undergoing a full blown one. Otherwise, even the brightest person will not get ?it?. Tbh, I got quite depressed when I reached that moment, realizing that there is very little I/we can do to prevent it from happening. The ability to follow this particular reasoning to its logical endpoint is, perhaps, possible for a lot of people. Accepting its consequences, however, is something else entirely. The combined pressures of hope and cultural beliefs bar many people from accepting that the way they live is not sustainable. If people are sufficiently healthy and happy, they may grasp the implications for a couple of moments to then retreat in that cloud of blissful denial. Even on this site, despite many of Gail?s posts indicating otherwise, Leo Smith offers the opinion that we still have decades to invest in the building of a sufficient amount of nuclear power plants to save fundamental aspects of our current society. I am not even going to discuss whether a financial system based on interest and compound interest is conducive to anything else other than condemning us to repeat the cycle of boom, bust and collapse until kingdom come. While I do believe that current western governments are preparing for riots, upheavals and, possibly, hunger, I am not convinced that they are willingly and forcefully pushing us over the edge. First, because there is no need as we are teetering already and second, because they enjoy that lifestyle just as much as we do. What is life worth living if you can?t drive your Ferrari/Range Rover in Monaco, to then have your apres-ski in Gstaad? Personally, I think that current corporatist elites have just as much a stake in keeping the system going as long as possible to enjoy it as long as they can. This is also due to the fact that all bets are off the further our collapse progresses, whether it is of the slow type John Michael Greer or the fast one Korowicz . There is simply no guarantee that you and your family might not be affected by that very likely epidemic/pandemic due to deteriorating sanitary standards, or that a very desperate country goes ?all in? to grab the dwindling resources of their neighbors, and your country is being sucked in. I think that we all have far too much to lose to not let this world fall apart if there is any way to prevent that. Either way, individual freedoms will get curtailed PRISM, habeas corpus, etc. and are going to be curtailed even more in the future. Many state actors will probably try everything they can to increase control, becoming effectively dictatorial or oligarchic in nature. This is what I see for us. Unless we find a new source of cheap, accessible and abundant energy we can tap into immediately. That would allow us to kick the can down the road for another 50 to 100 years or so. However, based on the premise that the current system WILL fall apart and that nothing can prevent that: Given the number one priority ? survival of the human race ? is it better to drag out the inevitable for as long as possible, resulting in further wastage of precious oil/gas and other resources and the mountains of pollution that wastage creates ? do we all just hang on to the wild ride for as long as possible, getting our last few whoops and ye-haws in before the whole thing goes down in flames? Or is it better to cut bait, end the wastage, end the pollution, take the hit and hope that a better version of humanity emerges from the ashes? Is it even realistic to ?hope? for a better version of humanity. Patrick, when I reached that Eureka moment just a month or so ago, my initial emotion was sadness, quickly followed by fear, then steadily replaced by grim determination and still building on that. I believe you are absolutely correct when you write that it is the ?combined pressures of hope and cultural beliefs? a person might be so invested in that recognition of the obvious is not possible. That is human nature, and only unique individuals or individuals in unique circumstances can break that barrier, it seems. I feel compelled to ?warn? people of what I view as a rapidly approaching disaster of epic proportions, but realize that I will be viewed as a ?sky-is-falling-chicken-little? if I do so. And therefore, I take the approach that I believe the MSM and others are taking ? I leave a trail of clues and breadcrumbs across the internet and in my conversations with people which, if followed, will lead to this blog and to other sources of information that are relevant to the issue. It is the best that we can do ? ?seek and ye shall find? could never be a truer statement in this case. I have sometimes forgotten how that ?eureka? moment felt, but your email brought back memories of the same feelings you described in your post. My moment came when I watched the video ?Crude Awakening?, very aptly named. Soon after that I read Dimitry Orlov?s book ?Reinventing Collapse?. These two sources of information motivated me to grab a notebook and began an honest inventory of my life. What did I need? What were my skills? What did I need to do to become prepared? How much time would I have? I think everyone who reaches this point should start with an assessment of their life. My husband was a bit slower to accept the ramifications of peak oil, but eventually he did, and together we have forged ahead doing what we can to move towards our vision of sustainable living. Whether our vision is right or not, we won?t know until the future arrives. This is the difficult part?.doing something but not knowing what will be needed. PatrickCN was right about depression, it is a natural consequence of realizing that our civilization life as we know it is coming to its ending. The possibility that many will suffer and die. Depression is one of the five stages of grief and if you don?t know about this theory of how people deal with grief you might check it out. It explains so much about how humans deal with the grief of difficult changes in their life. If you haven?t read Gail?s post ?Energy Limits: is there anything we can do? posted May 30, 2013 you might read that as well. Gail recommends 7 things we can do which I think are excellent advice and I will summarize them here apologies Gail if I?m being presumptuous : 4. Learn to appreciate nature, family, and simple joys. 6. Learn new skills think about what will be needed in a low energy world . Don, I?m enjoying Sara?s book The Hormone Cure . Very astute woman! Much of what she talks about I?ve learned from other areas of study on diet, nutrition, and human physiology. Some of her advice seemed to apply to the content of this message so I will include it: p. xxi ?For most of us, change is hard, and the path isn?t always well-defined. We make changes when the pain of staying the same is greater than the perceived pain of change. Why not create lasting change now?? p. 13 ?Conventional medicine tends to focus on what?s not working?if we widen our lens to see what is working, we can understand how to best nurture the good, and thereby amplify the beneficial effect.? She goes on to discuss ?Pareto?s Principle the 80/20 rule that says 20% of our effort is responsible for 80% of the results.? It seems to me that if we apply the time we have now, when the world?s economy is still functioning, 20% of effort, if focused on what we can do well, may yield surprising results. Focus on what you can do and don?t worry about what you can?t do. Worrying about what we can?t control is pointless. Don, maybe that should be the Tishmack Law #2 but I?m not saying anything original! Gail, your comment in a post somewhere below: ?The issue isn?t hormonally rewarding lives; it is keeping the current system together.? isn?t all together true. I?m beginning to see just how important our hormone status is with respect to feelings of healthy and well being, i.e. our sense of ?happiness? in life. And isn?t this what you were trying to get at with recommendations 4 and 5 above? More and more economists, especially in Europe, are discussing the inadequacy of using GDP as a measure of a populations well-being. There has been an effort to measure something more meaningful, to formulate a ?happiness quotient?. There has been plenty of research that shows once we have basic food, water, clothing, and shelter, additional ?wealth? doesn?t make us happier. I think Sara Gottried?s point one that Don and I both agree with is that our sense of well being is directly related to our hormones, which are largely affected by our diet and lifestyle particularly levels of stress , as well as our connections with loved ones, family, and community. Yes, I know, lack of food and water, or excessive stress due to a collapsing economy, will seem more important than wondering how our hormones are doing. But, if we understand how cortisol the fight or flight hormone affects us, and we take steps now to learn to control it, we will be that much healthier and better prepared when things to fall apart. And even in our normal life, our ability to deal with others, with stress on the job, with hunger will be beneficial for us. Joe Clarkson said ?A much harder task is learning how to be happy when one?s stomach is growling and there is little to fill it.? Actually we can prepare for hunger; by practicing regular fasting, which is also very healthful for us now. If the things we do today benefit us today or tomorrow, than no matter what happens in the future we are taking steps to improve our well being. Regarding hormones. Please look at page 242 in Orlov?s Five Stages of Collapse. He describes Wilfred Bion?s explanation of what happens when a dominant culture fails to produce a sense of belonging. While he doesn?t cast it in terms of hormones, that is really what is happening. Bion identifies three main groups of people: 1. Aggressive young men think testosterone experience ?a heightened sense of insecurity and anxiety, which directly affects the sympathetic nervous system. This may cause an animal to behave more aggressively, or, in the case of the human animal, to gather rocks and to find and sharpen sticks, or, technology and finances allowing, to purchase semiautomatic assault weapons and lots of ammunition?. 2. Another subconscious impulse takes over the minds of those who feel themselves to be weak and vulnerable. Here the subconscious urge is an infantile desire to find and cling to a strong, lord-like father figure. In the United States, this impulse finds its expression in widespread adherence to organized religion with its invisible yet omnipotent leader?. 3. Lastly, there is a third subconscious impulse that has its roots in primate psychology, one that predominately affects women: the impulse to ingratiate oneself into an imaginary group of superior individuals as a beta-female?.It manifests itself in the expectation of the emergence of something wonderful yet unborn, that will be the result of a successful mating between an alpha-male and an alpha-female. It finds its expression in the celebrity cult? As regards point number 3, consider the number of magazines sold at supermarket checkout stations about the magical baby born to the British aristocracy a week or two ago. Why this would have any interest to Americans who successfully rebelled against that nonsense 250 years ago is utterly inexplicable except in terms of hormones. In thinking about hormones, I come to the conclusion that human lives turn on the desire to get certain hormones circulating in our blood. We have blunt instruments to do that warfare to stir up stress hormones, burning fossil fuels to change the world to what we think we want in an attempt to release more feel-good hormones, nuclear weapons and rape to demonstrate our power and release a complex mixture of hormones, fantasies to release feel-good hormones, etc. and we have very subtle methods which work directly on our physiology and mind such as meditation and sometimes Mother Nature takes charge falling in love . Looked at from a visiting space ship, it all seems ridiculous. In order to release a teaspoon of some hormone, humans are willing to destroy the world by burning fossil fuels. Furthermore, they think that if the fossil fuels go away, life will not be worth living. Life may not be worth living, but it will be because humans are making the world hell for each other?not because Nature was remiss in failing to make enough fossil fuels. I agree it is a paradox, the more we try to be self-sufficient and less dependent on the global economy, the faster it may come to an end. On the other hand, current fossil fuel use will cause catastrophic climate change. Until you brought up the idea that owners of solar powered equipment were taking needed profits away from electric companies, I had never looked at it this way. Yet, if we know our system currently consumes too much energy, which isn?t sustainable, aren?t we acting against our self interest to continue being dependent on this system? It?s a rock and a hard place. In retrospect though, I still would still do what we did and invest in solar panels and geothermal. I think of my family?s influence on the economy as a function of how we spend our money. I want to support those businesses and service providers that make the best quality products ones that will last the longest and be repairable made close to home if possible. Sometimes it isn?t possible to buy high quality goods made in the U.S. In that case I try to support Europe, or Japan, and if all else fails, oh well, China. When we replaced flooring with ceramic tile which will last longer and won?t require electricity to clean we chose some from Spain. I think you made the point Gail, that holding onto money wasn?t going to be of much value. I agree, but I also see no reason to waste it. We have spent it on things like hand tools, books, animal housing, and home improvements that make our home more efficient and easier to maintain. I really would love to put metal shutter on the windows, but that might be a little too obvious! We continue to pay down our mortgage debt and pay credit cards off each month. What money we are saving is in the same credit union that holds our mortgage. If worse comes to worse we can transfer the money to pay off the mortgage, in the mean time, we continue to save if we lost jobs and need liquidity. We have continued saving for college for our sons 15 and 17 . I?m not convinced a college education will be worth as much in terms of finding a job, but an education can still be valuable. Our boys want to study mechanical and electrical engineering technology. They like to take apart stuff and make other stuff, a skill I believe will have some value in the future. Discontinuities are things changing very dramatically in a short time: going from having a job, to not having a job; the Federal Government simply disappearing as with the Former Soviet Union; money in the bank not being available to be withdrawn; electricity service that never comes back on. Theoretically, we should be able to keep on after such discontinuities, but it is very difficult to, especially if we have not had practice in the past. It is not just our own actions that make a difference; it is the action of others. If others are rioting, it makes our adaptation more difficult. We currently have a system of finance, food, and energy that has been built up over many years. Our problem is that there is really no ?Plan B?. Where people have tried to put in ?Plan B?s,? they have tended to assume that far more of our current system will stay in place than is likely to be the case. Given the lack of a Plan B, it is hard to blame people for trying to stick with our current system. It is all we know, and it is hard to think in any other terms. If gold worked before, perhaps it will work again in times of crisis. About all a person can do is try various things, and hope something will be helpful. Lindon, it is not about saving food supplies, it is about making connections with people like family, friends, etc. because when things get worse we will survive through these connections. Also, it?s probably a good thing that the vast majority of people are not aware that the system cannot continue with Business As Usual. The system will run itself for a while, as long as people believe in it. Once everyone stops believing ? that?s basically the essence of collapse. Before we get to that point we must build networks and share info, and ideas on how to live in a de-industrialized system. A really good book to read by somebody who has actually seen his own society survive a collapse is The Five Stages of Collapse by Dmitry Orlov. What I like about Orlov is his calmness and his sense of humour. The breadth and depth of his knowledge is very impressive. Anyways, calmness and humour are two things we really need right now. I went through a lot of similar feelings etc. when I started putting the dots together. My wife is not happy with me for stirring up anxiety about the future. My philosophy is ?share the anxiety? but also ? let?s inform ourselves as much as possible about what?s to come and how we can survive it. Learning more about human nature, human society and economics as well as the natural limits of Earth as Gail is helping us to do just what is needed right now. This is a reply to Christopher Johnson below since there was no ?Reply? link below his post. My wife and I joined the Peace Corps right after graduating from college in 1970. We served for two years on Ailinglaplap, a remote atoll in the Marshall Islands. We were both assigned to be school teachers. We taught grade school age children a variety of subjects, concentrating on English. At the time it was expected that English would be the common language of all of the various language groups in Micronesia, hence our assignment. In reality, there was not much real benefit to much of what we did. I often thought that what the young really needed was training in traditional skills and crafts so as to enable them to live without needing to participate in a cash economy or go to more urban centers to make a living. My wife did introduce the concept of birth control through oral contraception to the women of the village and I did help jump-start a modest canoe building revival by building several boats during our time there, but mostly we learned far more from them than they did from us. We did have many adventures and have very many fond memories of our experiences there. Probably the most profound result of our experience was that we both realized that we really liked living in a very small, rural community even though we both grew up in urban environments. We have happily lived all of the intervening years since then except for two years in Beruit in very rural surroundings. May I suggest a couple of things which may help formulate thoughts about the future. As Exhibit One, see Chris Martenson?s subscriber letter yesterday on the rise of financial institutions and their current absolute dominance of global economic activity. Of the top 50 companies, 48 are financial institutions. One point he makes is that these financial institutions don?t actually produce anything. Yet these financial institutions have conquered national governments and the imaginations of most people. A financial institution is about as isolated from physical energy as any company I can imagine. ?They do not toil, neither do they spin?. As Exhibit Two, see Charles Hugh Smith talking about smart phones. They are no longer worth stealing, unless the phone has a prestige label on it. Smart phones are a good example of the Constructal Law?evolution works to make them cheaper. As Exhibit Three, go back to the Chris Martenson article and look at the physical inflation since 2008?50 percent in the US. So we have smart phones dropping asymptotically toward zero while the cost of beef is increasing dramatically. We have experienced inflation with falling economic activity. As Exhibit Four, go to Charles Hugh Smith?s post a couple of days ago about some medical bills they had when their first child was born. Look at the modest bills relative to his income at the time. Compare to the astronomical bills in a hospital now. As Exhibit Five, observe Chris Martenson?s comment that the Multinationals are actually running the world. Comparing Germany to the US has less and less significance. I don?t mean this snidely? Traveling widely in Concord now means seeking out people who are living outside the webs of the Banks and the Multinationals?not visiting people on the other side of the world who are also ensnared by the Banks and the Multinationals. 1. ?Inflation? as it is defined by the US government is virtually meaningless. It is a conflation of the cost of physical things such as beef with ?qualitative? things such as the sophistication of one?s phone. BUT the US government has lots of reasons to understate inflation. First, it minimizes the cost to the government of indexed benefits such as Social Security, and, second, an understated inflation rate boosts the ?real? GDP. Physically based inflation measures such as provided by Shadow Stats show that our economy is shrinking and inflation is rising rapidly as noted by Chris . But any bureaucrat worth his salt can come up with lots of ?quality improvements? to support the claim that ?inflation is low?. 2. Given the size of debts in the global economy, one focus of attention should be on the ability of borrowers to earn the money to repay the loans. For example, if you study Smith?s description of the smart phone market, you can see that staying ahead of the curve and actually earning any money in that market is very tricky indeed. When you improve the features on your phone, the customers say ?ho-hum? and decide that you are now less attractive than some competitor. And, usually, you don?t get a second chance. This has actually been the environment in the computer business since the beginning. Lots of big companies have lost lots of money in computers simply because the technology was moving faster than they could move. So?if we compare the credit worthiness of a small scale beef farmer with the credit worthiness of a new entrant into the smart phone business, what can we say? Probably the best statement is that neither is a particularly good bet?and maybe that is why the banks aren?t loaning out all the money that Bernanke is shoveling at them. 3. But since the assets of financial institutions are basically someone?s debt, what can we say about the stability of the financial institutions? Detroit has a lot of debts, but few people credit it with any real assets. And if the 48 banks in the top 50 companies go down, will they take down the non-financial institutions? 4. Smith shows that medical costs have risen out of reason. Smith labels it a ?government/industry? cartel. If we had a truly free market for medical care, the current system would instantly collapse. And the shrinkage would result in defaults on debt for all those hospitals and equipment , massive unemployment, anguish among the population, loss of contributions to politicians, and so on and so forth. The Constructal Law would quickly demolish the system that has been built brick by brick over the last 50 years. Would this be a good thing? Or a bad thing? 5. Are there innovations think the Constructal Law which may actually subvert large sections of the economy, and lead to both lower costs and the realization that debts have gone sour? I?m not sure. Two candidates are internet education and desktop fabrication. Boosters think internet education can subvert the educational system and FabLabs can subvert the global supply chains. Education, especially, is protected by a web of laws?if you home school your child, you must nevertheless pay school taxes. I have previously remarked about the local building codes which prevent people from building affordable housing. Charles Hugh Smith has given this matter more thought than anyone else I know?and he thinks ?careers? are just about over, to be replaced by a series of part time jobs and more self-reliance. The answer to the first is No. the answer to the second is Yes. Consequently, financial collapse is almost certain, followed by physical collapse. Suppose that almost all industry and all but essential transportation around the world shut down simultaneously. The major and some minor governments around the world would still have ready access and availability to oil/gas, which they might use to keep power plants and emergency/law enforcement services operational in the areas that matter most. Internet and television stations/cable stay live, and are used to broadcast government information along with typical entertainment. Communities are taught how to reorganize for local production and local economies, how to grow and store their own food, while being fed by a constant stream of government-run trucks until self-sufficiency is achieved. Just think how much oil/gas would be saved by shutting down all those widget factories and the hundreds of millions of vehicles that are burning millions of barrels of oil daily. Any chance something like this might work? 1. We don?t have more cheap oil supplies coming online. We have more expensive-to-extract oil supplies coming online. This means the problem is more of a permanent one, rather than a temporary one. 2. We have already picked the ?low hanging fruit,? in terms of home heating and electricity use, and even some of the efficiency in automobiles. You get more impact in raising MPG from 8 to 16, than from 16 to 24, for example. Higher cost means that businesses have been making their vehicles more fuel efficient for years. There has been switching from oil to electric for years, if this is possible. 3. We now have competition from China, India, and other nations, that use more coal and less oil, and have lower wages levels. If oil prices rise, it tends to make countries that use a high proportion of oil in their energy mix competitive relative to countries that use other cheaper energy sources. This tends to reduce US employment, just as high oil prices reduces employment. This magnifies the impact of high oil prices. 4. Debt plays a big role in our problems. As we add more and more fossil fuel use, we also add more and more debt. In a way, debt is a Ponzi scheme, if we don?t have continual growth. It is harder and harder for developed countries to grow, with high oil prices, and competition from countries that used cheaper energy sources. This means that governments need to keep interest rates artificially low, so things don?t completely fall apart. This in turn puts pressure on pension plans. 5. Governments end up getting squeezed more and more, just as they were in previous collapses. Part of the problem is a drop in the wages of the common worker. Governments find that they have to pay more benefits, but cannot collect enough taxes. 6. It looks at this point as if we are getting caught in a cycle of contraction, instead of expansion. Such contraction cycles have happened before, when wages of the common worker are low relative to the cost of goods. The government has been trying with little success to get us out of this contraction mode. If interest rates go up, it looks like ?game over?. If we start with the premise that we cannot keep our current system together, the logical next step is to decide what from the current system we can live without. We can produce more food at home, eat less meat. We can plant more gardens, add season extension, orchards, and maybe animals chickens and dairy goats . Or we can shop at farmer?s markets, eat organic foods and thus disconnect from our industrial agricultural system. We can reduce the amount of energy we use to heat and cool our homes by adding insulation, programmable thermostats, high efficiency windows and doors. We can buy or build smaller homes that use less energy and resources. We can add renewable energy, solar water heaters, wood stoves, solar PV systems to our homes. We can share housing with extended family or friends, finding new living arrangements that allow us to reduce the need to pay excessive rent or obtain a mortgage. Eventually children take over the head of household caring for their parents and removing the insecurity of old age or the need for government funds. We can get out of debt, live more simple, less stressful lives, walk with our dog, talk with our neighbor and feel better and be healthier, thus reducing chronic disease and age related decline. This reduces our dependance on the financial system, the current health care industry and the government medicare system. We can shop for clothes and household items at garage sales, Good Will, Salvation Army, or trade with family and friends, thus eliminating the need for importing so much new goods. This reduces our need for retail stores and shopping malls, but it establishes thriving new businesses in second hand stuff. The less we buy, the smaller our needs, the less money we require. Eventually we will not need a high paying job or even a full time job, or two incomes, and we can look for work we find meaningful, a parent can afford to stay home and raise their children, cook their food, clean their home. Step by step we climb back down the energy ladder, reducing our consumption of energy and goods, and hopefully, slowly dismantling our modern economic system. As we become less dependent on the existing system we become more resilient to shocks and economic decline. As more and more people follow this path to a lower energy lifestyle, our economy will change and shrink. Eventually some parts of it will cease to exist. Whatever requires large amounts of energy or debt will end unless we as a society choose to support it. Personal automobiles, large numbers of roads and bridges, will probably not be supportable. Industrial agricultural also not supportable. American Health care system also not. Electric grid, trains and rail transportation, the internet, community health care, schools, libraries, museums?these things have value but will probably change shape to reflect our lower ability to pay for them. We will get to know more of the people in our community and support each other in times of need. Churches will become an important part of this networking, community building. I am a member of the Unitarian church because of its inclusiveness of all the worlds religions. There will certainly be discontinuities; damaging weather patterns, disasters, civil unrest, oil price spikes and other commodities , painful recession, maybe even depression. But our civilization still has a tremendous amount of embedded energy, there is still much that works, and resources available for us to continue using. But we can?t continue to live the American lifestyle because it is not supportable. The sooner we get on with living a lifestyle that requires more of our own energy to provide what we need, and less from fossil fuels and the global market place the better off we will be. I don?t deny that one can think of scenarios where mechanical equipment of all kinds won?t work. Old tractors are the least subject to the kinds of problems you describe. Small farmers don?t need computerized tractors. But, as I said, it is also quite possible to grow cover crops which put less organic matter into the soil, but which can be killed with a scythe. An alternative, which occurred to me after I wrote on the subject, is the crimper designed by the Rodale Institute. It is a hollow metal drum which has ridges on it which are in a chevron shape. The drum is filled with water to make it heavy, and then it is pulled across the cover crop with a tractor. But, of course, it could also be pulled by oxen. The ridges crimp the cover crop and kill it. One can buy simple manual crimpers for garden sized plots. My point is that the broad statement that ?our systems can?t operate in reverse? may be wrong. I agree that it is hard to see how a highly leveraged, computerized, entirely fossil fuel dependent system can go into reverse. But if you look at what Alex Hitt is doing, and what the class can teach any farmer or gardener to do, it is quite possible to visualize them running in reverse. That is, starting out with an old tractor pulling a crimper and progressing toward oxen pulling the crimper.; The crimper should last a hundred years. It is even possible to imagine the skill of cooperage being reborn as blacksmithing has been reborn and wooden crimpers being made. The difference now is that we have a lot of scientific knowledge about nitrogen fixation, crop requirements, and the optimum time to kill the cover crop. Unless we hit a truly Dark Age where that knowledge is forgotten, then clever people can figure out how to go in reverse in terms of electronics and fossil fuels. As for the financial aspects, if there is a collapse such that debts disappear?then that probably takes care of the financial problems. As for the high wages of the mechanic. First, high wages relative to food will likely be a thing of the past. In Amish communities it is common to see someone in the community who has a special skill. The Amish don?t uses tractors for farming, but there are other things that they need which are best done by skilled craftspeople. So a person may farm half-time and work his craft half-time. The mechanic might also keep a graveyard of old tractors to supply parts. In short, I wouldn?t just assume that there is simply no reverse gear for a small farmer in 2013. The issue I see is that the mechanical equipment we have is precisely what has been made, that hasn?t already been recycled. If we want a much larger inventory of, for example, scythes, or of old tractors that are easy to repair, we need to build those now. If we want more plows that are optimized for pulling behind horses or oxen, we also need to build those now. There are many other things that we theoretically could make now, to stockpile, such as replacement parts for electrical transmission systems. There are so many of these, of so many different types, it would be very hard to get enough in the right locations of the country. Clearly, whatever extra we make now of ?retro equipment? has to compete for funding and for resources steel, oil consumption, factory space with modern equipment that is being made now. Somehow, factories for this equipment must be made again, warehouses for this equipment must be built, and someone must have the job and be paid for overseeing this new extra equipment. This new equipment must be widely distributed, so it is available for use in the parts of the country where it is needed. In theory, we can make more retro equipment from recycling, but I expect this is much harder to do in practice than it looks. I understand that it is very hard to make a good sharp edge, such as in a knife, from recycled metals?at least one that will hold its edge for very long. I also understand that there was a big improvement in productivity when we could go from iron plows to steel plows, because of improvements that could be made in the plows. It is possible to bang on the hood of a car with a hammer, and reshape it into a different shape but making high-tech goods from it is likely not possible. We have had a lot of experience using charcoal for making metals and glass, but we know that this approach quickly leads to deforestation. The point about high wages of the mechanic relates to the fact that the mechanic would need to be fed, clothed, and housed on what he earned. If there is much less fossil fuels to run society, farmers would be earning much less, so would be able to support only a small number of non-farmers of various types. I expect that in practice, the only way such a mechanic could make a living is as being a farmer most of the time, and as a part-time mechanic hobbyist the rest of the time. There would need to be a lot of these people, who could help their immediate neighbors in time of need. In fact, most people who have tractors might need to be knowledgable about what is going wrong with them, so that they can inquire of junk yards whether spare parts of the right type might be available without the extra step and cost of calling a mechanic in . I want to elaborate on the ?story telling? angle. One of the places he and a friend visit is The Burren, on the west coast of Ireland. Here is a passage page 166 : Limestone, I found during my time in the Burren, demands of the walker a new type of movement: the impulse to be diverted, to wander and allow the logic of one?s motion to be determined by happenstance and sudden disclosure. We learned, or were taught by the ground, how to walk without premeditation: turning corners when they came, following bends in valleys, our paths set by the ancient contingencies of geology and the immediate contingencies of footfall, our expectation quickened?ready for surprise when it happened?.It happened often? On page 182 he describes his wading out to a small island in the Atlantic and spending the night: I felt a calm descending into me; there was no way of leaving the island now, and no easy way onto it, and the impossibility of either escape or disturbance had a tranquilizing effect, quite different to the alarm I had felt on the summit of Ben Hope. This was a happy marooning. Find beauty, be still. 1. When confronting a long term trend pointing to the end of debt as a way of life and ever greater energy availability and careless exploitation of natural resources, we have to think as if we are traversing a limestone formation. Limestone is dissolved by the acids in rainwater, and thus we experience the patterns that Macfarlane describes on page 166. Rather than just calling up Google Maps and having it connect the dots for us, we will have to be exquisitely attuned to the world as it actually is. Pontification doesn?t get you nearly as far as feeling your way. And the whole current obsession with efficient supply lines will be forgotten. 3. Humans are most content when they don?t have to decide between too many choices. Once we have decided to wade out to the island, and the tide comes in, we don?t have to decide whether to wade back to the mainland and find an inn for the night. Market researchers have determined that too many choices just irritate potential customers. I have always enjoyed canoeing down rivers because the river tells you what to do. I think we will find our choices restricted by the evolution or collapse in front of us, but that the unexpected result may be tranquillity; Finally, if you are really interested in how starving people behave, I suggest reading his account of the Irish famine beginning on page 163.