Images taken on June 13 by NASA's infrared Spitzer Space Telescope reveal that dust and carbon dioxide gas are streaming off Comet ISON, forming a tail about 186,400 miles 300,000 kilometers long, researchers said. We estimate ISON is emitting about 2.2 million pounds 1 million kilograms of what is most likely carbon dioxide gas and about 120 million pounds 54.4 million kg of dust every day, Carey Lisse, leader of NASA's Comet ISON Observation Campaign and a senior research scientist at the Johns Hopkins University Applied Physics Laboratory in Laurel, Md., said in a statement. Previous observations made by NASA's Hubble Space Telescope and the Swift Gamma-Ray Burst Mission and Deep Impact spacecraft gave us only upper limits for any gas emission from ISON, Lisse added. Thanks to Spitzer, we now know for sure the comet's distant activity has been powered by gas. WATCH: Comet ISON's perilous journey around the Sun explained. Comet ISON was 312 million miles 502 million km from the sun ? 3.35 times farther than the Earth-sun distance ? when Spitzer made the new observations, NASA officials said. The comet, which is about 3 miles 5 km wide, is cruising toward a close encounter with the sun on Nov. 28, when it will skim just 724,000 miles 1.16 million km above the solar surface. ISON could blaze up dramatically around this time, perhaps shining as brightly as the full moon in the sky, researchers say. But there's no guarantee that ISON will live up to the hype. For example, it could break apart as it approaches the sun, fizzling out as some other comet of the century candidates have done over the years. While it's tough to predict the behavior of any comet, forecasting ISON's sky show is particularly difficult. Scientists think ISON is making its first-ever trip to the inner solar system from the distant and frigid Oort Cloud, a huge repository of comets that lies between roughly 600 billion and 6 trillion miles 965 billion and 9.65 trillion km from the sun. WATCH: Comet ISON fireworks - Hubble Space Telescope and the Comet of the Century . Comet ISON is becoming more active as it warms up during this epic journey. Researchers expect to get an increasingly detailed look at ISON's composition over time, because different materials boil off at different distances from the sun. Much of the carbon in the comet appears to be locked up in carbon dioxide ice, Lisse said. We will know even more in late July and August, when the comet begins to warm up near the water-ice line outside of the orbit of Mars, and we can detect the most abundant frozen gas, which is water, as it boils away from the comet. ISON's solar flyby promises to be more than just a skywatching spectacle. Comets are primordial bodies composed of water, ammonia, methane, carbon dioxide and other materials ? the same fundamental building blocks that gave rise to the planets 4.5 billion years ago. ISON is very exciting, Jim Green, NASA's director of planetary science in Washington, D.C., said in a statement. We believe that data collected from this comet can help explain how and when the solar system first formed. July 23, 2013 - JAPAN - A Japanese utility said its crippled Fukushima nuclear plant is likely leaking contaminated water into sea, acknowledging for the first time a problem long suspected by experts. Tokyo Electric Power Co., which operates the Fukushima Dai-ichi plant, also came under fire for not disclosing earlier that the number of plant workers with thyroid radiation exposures exceeding threshold levels for increased cancer risks was 10 times what it said released earlier. The delayed announcements underscored the criticisms the company has faced over the Fukushima crisis. TEPCO has been repeatedly blamed for overlooking early signs, and covering up or delaying the disclosure of problems and mishaps. Japan's nuclear watchdog said two weeks ago a leak was highly suspected and ordered TEPCO to examine the problem. TEPCO had persistently denied contaminated water reached the sea, despite spikes in radiation levels in underground and sea water samples taken at the plant. The utility first acknowledged an abnormal increase in radioactive cesium levels in an observation well near the coast in May and has since monitored water samples. We are very sorry for causing concerns. We have made efforts not to cause any leak to the outside, but we might have failed to do so, he said. Ono said the radioactive elements detected in water samples are believed to largely come from initial leaks that have remained since earlier in the crisis. He said the leak has stayed near the plant inside the bay, and officials believe very little has spread further into the Pacific Ocean. Many things have fallen a step behind. You should be ahead of the curve to foresee risks and take measures, said deputy industry minister Kazuyoshi Akaba, who inspected the operation, Kyodo News agency reported. Marine biologists have warned that the radioactive water may be leaking continuously into the sea from the underground, citing high radioactivity in fish samples taken near the plant. July 23, 2013 - UNITED STATES - The United States highest-ranking military officer, Chairman of the Joint Chiefs of Staff, General Martin Dempsey, has said that the USA is deliberating whether it should or should not use military force in Syria, and that various scenarios, including ?kinetic strikes? are being prepared. The information correlates with recent intelligence, according to which US Special Forces in Jordan are training ?rebels? for ground assistance during U.S. air raids against high profile military and political targets in Syria. A major, internationally backed, political and military campaign against Syria is expected in August and September. During a hearing at the U.S. Senate?s Armed Services Committee on Thursday, the U.S. Chairman of the Joint Chiefs of Staff, Gen. Martin Dempsey, said that the Obama administration is preparing various scenarios for a possible U.S. military intervention in Syria, and considering whether the USA should use ?the brute of the U.S. military, and kinetic strikes?. ??The issue?, said Gen. Dempsey, ?is under deliberation inside of our agencies of government?. Preparations for a possible attack against Syria reportedly began after the use of chemical weapons in the Khan al-Assal district of Aleppo on 5 March 2013, killed at least 25 and injured more than 100. Despite overwhelming evidence to the contrary, and despite having received an 800 pages, official report from a Russian expert commission who investigated at the scene, and who had samples analyzed in internationally recognized laboratories, the Obama administration continues issuing blanketing accusations against the Syrian government. Another PR strategy used by the U.S. Administration as well as by British and French officials, who state that the only way to bring about ?regime change in Syria is a military intervention?, is to merely report the number of killed and injured, without addressing that there is an overwhelming amount of evidence that substantiates the Russian and Syrian statements, that is, that it were the foreign-backed insurgents who had used chemical weapons. The Obama administration has previously stated, that the use of chemical weapons would be a ?red line? and trigger an intervention. Other U.S. officials have recently reiterated, that it is not unlikely, that the U.S.A. would implement a no-fly-zone above Syria, using Jordanian air bases. Officially, the United States has deployed 800 troops in Jordan. Jordanian Members of Parliament however, have complained that the number of U.S. troops in Jordan is significantly higher than 1000. On 29 June, nsnbc international published information from a Palestinian intelligence source, according to which 300 of the U.S. troops, which are stationed in and near the Jordanian ? Syrian border city of al-Mafraq are special forces, who are training foreign insurgents in special operations. Special operations are reportedly being prepared with the intention to target high-profile political and military targets in Syria, in support of a major military push against Syria in August and September. The Palestinian intelligence source also reported to nsnbc, that the foreign-backed insurgents in Syria were preparing arms caches throughout Syria , in preparation of a major military campaign in August and September. The source stated, that large-scale chemical weapons attacks should be used as a pretext for calls for the implementation of a no-fly-zone, the establishment of humanitarian corridors, and ultimately, a foreign military intervention. The intelligence was corroborated in an nsnbc report published on 10 July, after the Syrian Armed Forces seized 208 barrels with chemicals from foreign-backed insurgents on a farm in Banias, near the Syrian city of Tartus at the Eastern Mediterranean coast. Official Syrian government sources reported that the Armed Forces had seized 79 barrels of Polyethylene Glycol, 67 barrels of Monoethylene Glocol, 25 barrels of Monoethanolamine, 68 barrels of Diethanolamine, and 42 barrels of Triethanolamine at the farm in Banias. Only days later, on 14 July, nsnbc published a report, after another depot with chemicals was seized from insurgents in a Damascus suburb. Some of the chemicals were from Saudi-Arabia. On 16 July, nsnbc published a report that implicates the United States in the trafficking of the internationally banned nerve agent Sarin from Libya. The Sarin, which was originally manufactured in Germany, had first been sold to Iraq, where after it was sold to Libya. In Libya it?had fallen into the hands of U.S. backed insurgents during the war on Libya in 2011. The statement by the United States Chairman of the Joint Chiefs of Staff, Gen. Martin Dempsey, at the U.S. Senate?s Armed Services Committee on Thursday, that the U.S. is ?preparing kinetic strikes against Syria? strongly corroborates the intelligence nsnbc received, according to which the large scale use of chemical weapons by the insurgents in August and September is being prepared with the explicit purpose to justify calls for a military intervention, which is a euphemism for open war against Syria. Moreover, the information that U.S. special forces are training insurgents in ground operations in support of air raids against high profile military and political targets in Syria indicates, that the U.S.A. is actively preparing the attempt to decapitate the Syrian military and political leadership in August or September, after which an invasion with ground troops would be justified by claiming, that chemical weapons had fallen into the hands of ?terrorists?. - NSNBC. These spectacles are relatively new to science. Pilots had reported enigmatic bright flashes throughout the 20th century, but their anecdotal evidence didn't amount to proof. The first image of a TLE was captured accidentally in 1989 when a University of Minnesota professor aimed a low-light TV camera at the sky to film a rocket launch. Replaying the tape later on, Professor John R. Winckler saw brilliant columns of light extending from the tops of storm clouds. Hearing of the finding, NASA officials immediately ordered a review of video tapes taken from the space shuttle that looked at lightning events on Earth. They found dozens more examples of TLEs, and later scientists have been recording them ever since. At the very highest frequency, it would just be barely perceptible as a low-bass hum, explained Alicia Hotovec-Ellis, a geophysicist at the University of Washington. The frequency of Redoubt's harmonic tremor is so high, in fact, that it can't easily be explained by many of the accepted theories. The pitch that Redoubt got up to was so much higher than any other volcano that we've recorded, and that's kind of pushed the limits of all the models that were out there, Hotovec-Ellis said in an interview Monday. Some volcanoes emit sound as a result of magma bubbles vibrating as they're pushed up through cracks in the Earth's crust. But in Redoubt's case, scientists think the earthquake and harmonic tremor happen as magma is forced through a narrow opening under great pressure into the heart of the mountain. The thick magma sticks to the rock surface inside the conduit until the building pressure causes it to move higher, where it sticks until the pressure moves it again. Each of these sudden movements results in a small earthquake. As the pressure builds, the quakes get smaller and happen so quickly one after another that the sounds they generate blend into a continuous and ever increasing noise. The team's new model could allow scientists to better understand what happens during eruptive cycles in volcanoes like Redoubt. For Redoubt, by the time it started to scream like this it had already been erupting for a few days, she explained. So at most it could give a few minutes or a few hours of warning before the next explosion. At Redoubt, the harmonic tremor reaches an extremely high frequency but then goes eerily quiet. Shortly after, the volcano erupts again. We think the pause is when even the earthquakes can't keep up anymore and the two sides of the fault slide smoothly against each other, Hotovec-Ellis said in a statement. His idea is trying to figure out why the pressure is concentrated in one spot, Hotovec-Ellis said. We haven't quite figured out why it's just one spot in the volcano that keeps popping off.