Angry protesters have taken to the streets across the United States after a court ruled murder suspect George Zimmerman had acted justifiably and in self defence when he shot dead the unarmed black teenager Trayvon Martin in Florida last year. Supporters of Trayvon Martin, 17, joined his family in Sandford, Florida, denouncing the verdict and chanting the system has failed , in scenes that were repeated across the US on Sunday 14 July. Protesters rallied in Boston, New York City, Chicago and San Francisco. In Florida, about 200 demonstrators marched in Tallahassee carrying signs that said Racism is Not Dead and Who's Next? Angry crowds in Oakland, California, broke windows, burned flags and started fires in the street. A police squad car was vandalised as police formed a line to block the protesters' path. Protesters also reportedly burned flags and sprayed graffiti on a courthouse. In San Francisco, demonstrators marched on the city's Mission District, while in Los Angeles, 200 demonstrators gathered in Leimert Park, a historically black neighbourhood, for a largely peaceful vigil. Lt Andy Neiman of the LAPD said a group of 50 to 100 demonstrators had marched at midnight. There was a period where crowds were running among vehicles, but police dissuaded them, he said. Further demonstrations are planned across the US for later on Sunday, and Monday. Civil rights leaders including the Revs Jesse Jackson and Al Sharpton called for peace. Jackson says the legal system failed justice, but violence isn't the answer. The case has polarised the country, bringing the uncomfortable issues of race and gun law into sharp relief, and prompting heated debate over racial profiling and self-defence. Florida police did not arrest Zimmerman for six weeks after the shooting, citing the state's controversial stand your ground law, which allows citizens to use lethal force in cases of imminent danger. Zimmerman, a nightwatchman, had phoned the police and reported witnessing Martin acting suspiciously. Before police arrived, Martin was dead. Prosecutors accused Zimmerman of assuming the teenager was up to no good. The defence alleged Martin punched their client, slammed his head into the pavement and reached for Zimmerman's gun. Zimmerman's lawyer Mark O'Mara said his client would now have to be very cautious and protective of his safety because there is still a fringe element who have said that they would revenge - that they would not listen to - a verdict of not guilty . Benjamin Crump, the Martin family lawyer, said: Trayvon Martin will forever remain in the annals of history... as a symbol for the fight for equal justice for all. President Obama commented on the case last March following calls for Zimmerman's arrest. If I had a son, he would look like Trayvon, Obama said at the time, adding that Martin's death should be a matter for national soul-searching.