US neighbourhood watch volunteer George Zimmerman who shot dead unarmed black teenager Trayvon Martin, is now a free man. Protesters have taken to the streets in the US as black community leaders demanded that the authorities pursue a federal civil rights case against Zimmerman. In Los Angeles, police fired non-lethal beanbag baton rounds after demonstrators threw rocks and batteries at officers. One person was arrested but police emphasised that most of the protesters were peaceful. Streets were closed off in the city, as well as in San Francisco, where people marched to condemn Zimmerman?s acquittal. George Zimmerman had been charged with second-degree murder, however the jurors were given the option of convicting him on the lesser charge of manslaughter. They chose to set him free. Judge Debra Nelson warned the crowded courtroom that there should be ?no outbursts upon the reading of the verdict or afterwards?. Zimmerman smiled as Judge Nelson informed him that he was free to go. Race was a factor The Guardian reports that Benjamin Jealous, president of the National Association for the Advancement of Coloured People NAACP ? the largest black advocacy group in the US ? said the case in which Zimmerman, who is of mixed white-Hispanic parentage, followed then shot Trayvon dead met the benchmark for an inquiry by the department of justice. Although the jury in Sanford, Florida, accepted Zimmerman?s argument that he acted in self-defence when he killed Trayvon on 26 February last year, he was caught on a recording of a call to police using the words ?fucking punks? and ?these assholes, they always get away?. Jealous said: ?When you look at his comments and when you look at comments made by young black men who lived in that neighbourhood about how they felt especially targeted by him, there is reason to be concerned that race was a factor in why he targeted young Trayvon.? Jealous released a statement immediately after Saturday night?s not guilty verdict, which followed more than 16 hours of deliberations by the six-strong jury. ?We are outraged and heartbroken over today?s verdict. We will pursue civil rights charges with the department of justice, we will continue to fight for the removal of stand-your-ground laws in every state, and we will not rest until racial profiling in all its forms is outlawed,? the statement said, referring to Florida?s self-defence legislation used in Zimmerman?s case. NAACP Florida State Conference President Adora Obi Nweze said: ?We lost a young man due to senseless violence, but justice did not prevail. Last year we pushed for the arrest of George Zimmerman and a thorough investigation and trial. Today, we are still called to act. No one should be allowed to use this law to commit a senseless crime again.? Benjamin Jealous added: ?We?re upset with a situation in this country where as black people, as black parents, it feels so off that our young people have to fear the bad guys and the good guys, the robbers and the cops and the self-appointed community watch volunteers who think they?re keeping folks safer,? he said. Obama says the jury has spoken President Barack Obama on Sunday described the death of Trayvon as ?a tragedy?, but as protests began across the US, the President called on Americans to accept the acquittal of the teenager?s killer. In a statement issued by the White House, the President acknowledged that passions were running high in the wake of the not guilty verdict. ?But we are a nation of laws, and a jury has spoken,? he said. The not guilty verdict implies that Zimmerman acted in self-defence, and was justified under Florida law in using deadly force ?to prevent imminent death or great bodily harm? to himself. I can?t help wondering if Trayvon had shot Zimmerman with his own gun, would a not guilty verdict have been returned on the black teen. Despite being told by his despatcher not to pursue Trayvon, Zimmerman set off in armed pursuit. If Zimmerman were unarmed would he have been that determined to harass a black teenager who was doing nothing more suspicious than walking back to the house where he was staying? Had the roles been reversed Trayvon would no doubt be given a life sentence. To it?s credit the Justice Department said it is looking into Trayvon Martin?s death to determine whether federal prosecutors will file criminal civil rights charges against Zimmerman. I won?t hold my breath.